{"author":"Gimly","content":"For something so far out of my wheelhouse, I do have a certain level of appreciation for _Cloudy with a Chance of Meatballs_.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5cb07983c3a3681e7aab587f","url":"https:\/\/www.themoviedb.org\/review\/5cb07983c3a3681e7aab587f","movie_id":22794}
{"author":"ProudPittieMom","content":"Nothing to see here; this is not the movie\/documentary you want . . . \r\n\r\nMark Olly, narrator, wants this UFO story to be different and starts out by saying that the story runs backward, beginning with the evidence of a UFO crash and mentioning that there was a death involved. Then we discover that the \"UFO crash\" occurred during the night while the farmer slept. After he found debris he couldn't identify, he began contacting people to come and have a look. Not only was some UFO type group there to collect the evidence they wanted, but the RAF eventually showed up and took everything else they could find. Same story that's been told and re-told for years - yawn!  Yet the narrator tells you it just has to be, it MUST be that we are not the only intelligent life in the universe. Show me the proof!\r\n\r\nThere are some beautiful shots of mid-Wales; extraordinary beauty.  Other than that, it appears that Mark Olly enjoyed a unique wardrobe and a bit of travel to the site.\r\n\r\nIt has been years since I've been intrigued enough to watch one of these stories, but even though I'd love to be convinced, I was just let down, again.","id":"5d72e6ea127778001227b734","url":"https:\/\/www.themoviedb.org\/review\/5d72e6ea127778001227b734","movie_id":302670}
{"author":"Andres Gomez","content":"Good story about the drama after the terrorist attach in London.\r\n\r\nSpecially good Blethyn's performance and the prejudices of his character.\r\n\r\nKouyaté's presence could be hypnotic but I really failed on appreciating it.\r\n\r\nThe script could have had a better development during the search in London since it seems like they are looking everywhere but in the most obvious places: their own home and their working\/studing places ...","id":"5465270f0e0a26293b002809","url":"https:\/\/www.themoviedb.org\/review\/5465270f0e0a26293b002809","movie_id":39358}
{"author":"John Chard","content":"You can’t fight fate. Right?\r\n\r\nGerard Butler stars as Clyde Shelton, a man forced to not only watch his wife and daughter be raped and murdered in his own home, but to also have to sit there and watch the justice system fail him. So he wages a one man war against pretty much everyone involved. \r\n\r\nHoo-Hah! The big hitting critics hated it, with comments ranging from it being sub-normal, preposterous, ugly and morally corrupt, to it being a comic book film of moral hectoring! Naturally, as the critics were at pains to point out that it would, it made a pot load at the box office and is generally well liked by a good portion of the action\/revenge\/thriller loving populace.\r\n\r\nThere’s always a big grey area with revenge\/vigilante movies that really brings out the debate crowd, but what rarely gets said is that through the actions of these cinematic waste layers is the chance for many, many, folk to live vicariously. Yes! 99% of the common man and woman do indeed sit back and trust our respective legal systems to do what’s right and just, but oh how we feel that given similar circumstances we would want to vent spleen with furious anger.\r\n\r\nLaw Abiding Citizen is a riot, at its heart it does have something to say, even asking some pertinent questions. Do these social smarts come bursting through the bloody haze to make a point? No, they get submerged in a whirl of kinetic fury and socko violence, but they are there, caustically so. But hey! For shocks, twists and outrageous set-pieces, this picture rocks the big one. Vicarious living through cinema – wonderful. 8\/10","id":"539135aac3a36864910009b5","url":"https:\/\/www.themoviedb.org\/review\/539135aac3a36864910009b5","movie_id":22803}
{"author":"Dan_Tebasco","content":"Not that great. The acting is mostly awful, all the characters are idiots but then it's a slasher so it comes with the territory I suppose.\r\n\r\nIt's not completely without it's redeeming qualities though, the gore is neat and the set ups to many of the kills are well put together and the last 20 minutes or so were fairly good. But overall more reasons not to watch it than to watch it.","id":"591edfbb92514149f3031d92","url":"https:\/\/www.themoviedb.org\/review\/591edfbb92514149f3031d92","movie_id":17618}
{"author":"Killa-What?","content":"> Definitely don't judge this movie by it's cover. Cool cover...and that's about where it ends. \r\nShot around what looks like Wellington NZ, it's supposed to be a post apocalyptic zombie smashing movie. In essence, 3 slackers basically go on shopping runs and switch houses when they get bored (which I very much did). They save a girl in a church and accidentally break a vile of zombie blood and so begins the search for a replacement.\r\nWhich could be OK if most of the film wasn't just watching TV adds or these imbeciles strolling though malls. Probably the movies they were watching were more interesting than this. With shoddy camera work and overly long \"filler\" scenes with no real point to it.\r\nI could only get through about 30min before I called Bulls***. Even when the cortina with a spiked bull-bar came out I though cool, it might be starting. \r\nSave yourself 90min and use it more productively for sleep, which this movie will invariably do.","id":"57b8fba892514141ae001721","url":"https:\/\/www.themoviedb.org\/review\/57b8fba892514141ae001721","movie_id":22573}
{"author":"Andres Gomez","content":"The performances are really good and the staging is quite believable and impressive.\r\n\r\nThe plot is really well done ... the only problem is that it is really far from the actual facts.","id":"5260d8db19c2954af713ec24","url":"https:\/\/www.themoviedb.org\/review\/5260d8db19c2954af713ec24","movie_id":33996}
{"author":"Gimly","content":"If, like the titular characters, you are a Star Wars super nerd, definitely give Fanboys a crack, otherwise, don't bother.\r\n\r\nFinal rating:★★½ - Not quite for me, but I definitely get the appeal.","id":"589855cb9251417a8e00826d","url":"https:\/\/www.themoviedb.org\/review\/589855cb9251417a8e00826d","movie_id":13532}
{"author":"Screwamazon","content":"Isabelle Fuhrman gives an epic performance. I can't really say too much without giving away spoilers, but I can see why she ended up being Clove!","id":"56c7cbeec3a3684089001020","url":"https:\/\/www.themoviedb.org\/review\/56c7cbeec3a3684089001020","movie_id":21208}
{"author":"Wuchak","content":"***Scarier and with a more dangerous Jason, but not as fun***\r\n\r\nI became a fan of the \"Friday the 13th\" series after seeing \"Part V: A New Beginning\" (1985) on TV in the late 90s and have subsequently digested all of the films in the series. This '09 reboot takes elements of the first four films, drops all campy elements seen in Part III (and V, VI, IX & X) and provides better scares with a more dangerous Jason, who runs, shoots arrows, uses traps and schemes. In the original series Jason was comparable to an unstoppable zombie-like force, particularly as the series progressed where Jason became more & more infernal and monstrous. Here he's more human, which makes sense since it's early in the timeline and Jason hasn't yet morphed into the hellish zombie he became in later segments.\r\n\r\nThe appeal of the series for is not the gore or kills but rather the plot of a group of youths gathering in the wilderness; the inclusion of a psycho killer on the loose adds a necessary element of threat & suspense, and Jason's a quality nemesis\/monster. Simply put, \"Friday the 13th\" is an entertaining series with creepy elements, but I never found the flicks all that scary, not even the first two films, which are the most serious in tone, along with IV, VII, VIII and XI. Of course there are jump-scares galore, but that's not what I'm talking about. With the third installment, campiness was added, which made several of the installments even less scary. The good thing about this '09 reboot is that it throws out the campy aspects and opts for a more serious approach. In addition, it has a couple of sequences that produce actual frights, something I never experienced with the rest of the series, as well as scenes with genuine suspense, like when Jason chases the three protagonists through the tunnels, etc.\r\n\r\nSpeaking of the three protagonists, the cast is filled with youthful no-names, but the three main protagonists, a brother & sister and a brunette who takes a liking to the brother, are good and likable. It's always nice to have some people you can root for. Really, there are only two characters who are unlikable, a creepy redneck hick (and his \"hot\" mannequin, lol) and the arrogant alpha-male whose father owns the vacation house.\r\n\r\nI found one aspect of the film highly unusual and unique. I'm referring to the 24-minute prologue before the opening credits. This has to be one of the longest prologues in film history. I have to give credit to the filmmakers for being creative and trying something different.\r\n\r\nThis reboot also just plain LOOKS better than all those older films; I'm referring mostly to the creepy woods at night. This is to be expected, of course, with the advancements in filming technology since 1980, not to mention the bigger budget.\r\n\r\nThe series is known for its excellent assortment of women in every entry, but this one's not quite as good as most of the films in the franchise. There's the excellent Amanda (America Olivo) in the first act and also Whitney (Amanda Righetti) and Jenna (Danielle Panabaker) as the two female protagonists. They're solid, but not in the same league as Pam in Part V, Agent Marcus in Part IX and Heather in Part XI (FvJ). I suppose it's all a matter of taste though. \r\n\r\nThe film was shot in the heart of Texas, mainly in regions relatively near Austin.\r\n\r\nFINAL WORD: My biggest criteria for judging the worth of a film is whether or not it pulls me in and makes me forget about the passing of time. This '09 reboot succeeds in this respect. Although nothing can replace the initial 1980 film and its immediate sequel, this reboot should be given credit for generating a few genuine scares, which I rarely if ever experienced with the rest of the series; not to mention providing a worthy trio of protagonists, as well as scenes with genuine momentum. \r\n\r\nOther than these factors, the reboot is just more of the same, but it's at least as good as the better sequels, although it's not as fun as several of them because it shoots for serious horror. This is good, but the first half is more effective than the second. And it fails to approach the greatness of the '09 remake of \"The Last House on the Left,\" a veritable masterpiece that transcends the usual one-dimensional nature of most slasher flicks, not that I would expect (or necessarily want) that for \"Friday the 13th.\" \r\n\r\nI have the \"Killer Cut\" that runs 105 minutes, while the theatrical version runs 97 minutes. Needless to say, this is a heavy R-rated picture.\r\n\r\nGRADE: B","id":"5d33e8422f8d095259dd2ef3","url":"https:\/\/www.themoviedb.org\/review\/5d33e8422f8d095259dd2ef3","movie_id":13207}
{"author":"Milo_Jeeder","content":"'Friday the 13th' turned out to be one of the biggest disappointments when it comes to horror classics remakes. After watching the trailers, I got the wrong idea that this film was going to be more serious. The previews gave me the false impression that this remake was going to go deeper into Jason's background story or maybe even offer extremely gory murders, when in reality, it is exactly the opposite. I'm not one of those horror lovers who want to know everything related to the villains, their origins and such, but in this case, it would have been acceptable to throw in some flashbacks regarding Jason Voorhees' past. Unfortunately, this remake wastes all the opportunities to make this interesting and instead, it offers an exaggerated and ineffective amount of comedy situations that are badly placed and ruin the possibility of creating a genuine horror feeling. Comedy situations in slasher films are no surprise, but in this remake, the attempted comedy is badly placed and seems like it was forced by the producers to make the film more marketable. I will give an example: after a really tense and dramatic persecution, the film cuts to a scene involving a horny stereotyped hillbilly lusting over a mannequin, while Jason silently walking up to him from behind, with the obvious intention of slashing him. How can they mix cheap humor and tension in one scene? The results obviously cannot be good. It was a murder scene, but instead of causing uneasiness, tension or shock, everyone at the movie theater was laughing at the guy talking about how he lost his virginity to a mannequin. The worst part is that the so-called humor is extremely 15-years-ago and even back then, it wouldn't have been funny.\r\n\r\nThe gore is very unsatisfying also. Nowadays, slasher films usually offer creative and really brutal murders and even if the plot is not so good, you can always at least settle for that. When I found out that Marcus Nispel was directing this, I thought it was good news, because he directed \"The Texas Chain Saw Massacre\" remake, which is a fine example of a movie that may not be as good as the original, but at least it offers something more serious, gory and overall fulfilling. Naturally, since Marcus Nispel also directed 'Friday the 13th' remake, I expected something in the same vein as 'The Texas Chainsaw Massacre' remake. Sadly, that was a very inaccurate assumption. In this film, the gore is completely unsatisfactory and in some cases, the murders are even funny. The entire movie theater burst into a maniacal laughter during some of the murders and I must say that in those cases, I had to agree with them.\r\n\r\nAnother thing that bothered me about this film, is the fact that they could have showed a little bit more about the character of Mrs. Voorhees. Unfortunately, she only appears during the first seconds of the film and they cut her scenes with the opening credits, which is a disgrace. The confrontation between Mrs. Voorhees and the counselor girl is perhaps one of the finest points of the entire 'Friday the 13th' series, and it should have been remade in an equally tense way. Cutting the scene with the opening credits is, in my opinion, a self-sabotage. I think it's safe to say that many fans of the original film were eager to learn some more about Jason's beloved mother and see her more time on the screen. But no... apparently, they didn't even take advantage of that opportunity to make this movie more interesting. True, we see a little bit about Jason's environment, since the characters get to take a tour inside his house and it was a good idea to show his bedroom and evidence the fact that once upon a time, the killing machine was an innocent boy with a normal life. However, that doesn't make up for the lack of space that Mrs. Voorhees had on the story.\r\n\r\n'Friday the 13th' turned out to be a teen comedy with lousy humor and some badly placed murders from the beginning until the end. Watch it if you're curious, but unless you're a silly teenager who thinks everything is funny, don't expect anything even remotely good, because you'll be devastated.","id":"58a24e15c3a36829620004ed","url":"https:\/\/www.themoviedb.org\/review\/58a24e15c3a36829620004ed","movie_id":13207}
{"author":"Gimly","content":"I've never seen anything exactly like _FAQ About Time Travel_ before, but I've seen most of its elements either done before its release, or done better since. I wouldn't go so far as to say that I'm a fan of Chris O'Dowd or Anna Farris, but I certainly don't mind them, (the other players in this I'm not too familiar with), but nobody was particularly good. The story is mixed. The visual quality is pretty low. All in all, _Frequently Asked Questions About Time Travel_ is just barely fine.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole_.","id":"5b9e0d4b0e0a2675570146a7","url":"https:\/\/www.themoviedb.org\/review\/5b9e0d4b0e0a2675570146a7","movie_id":22494}
{"author":"narrator56","content":"I have found that movies with Timothy Spall or Maggie Smith in them are worth watching, and this movie has both of them. I also like Pauline Collins since her role way back in the Jurassic era playing in No Honestly.\r\n\r\nI am not into the supernatural or ghost movies, so I don't know what is normal, but it seems like this script takes a few liberties by having the ghosts visible or not visible inconsistently as the story moves on, but the writers seems to realize that as one of the characters even comments on it. And overall it works so I overlooked it with ease.\r\n\r\nOh and did I mention Hugh Bonneville is in it, and very good, as you'd expect. The ending was rather predictable to me, but I write novels so perhaps that was why I foresaw the plot twists. I like that Tolly, the teenage the lad who is main character, shows some growth as a person due to his experiences. I don't expect to feel the urge to watch the movie again, but neither do I regret my time spent watching it.","id":"5e872ff066e4690012a75c03","url":"https:\/\/www.themoviedb.org\/review\/5e872ff066e4690012a75c03","movie_id":49391}
{"author":"tmdb47633491","content":"JUDD'S BEST MOVIE DON'T @ ME\r\n\r\nBETTER THAN LA DOLCE VITA DON'T @ ME","id":"5aecc1e19251411d3e00124a","url":"https:\/\/www.themoviedb.org\/review\/5aecc1e19251411d3e00124a","movie_id":20829}
{"author":"Dan_Tebasco","content":"**The most shocking about this film is that Jack Ketchum wrote this film... **\r\n\r\nBut in the end I suppose a really bad director can manage to screw up a good script (not that I would say that this one has many tells of being a good script but that's beyond the point).\r\n\r\nIt's overall just very amateurishly made and it only gets remotely interesting when Polyanna McKintosh comes into the picture at 30 minutes in but even then it's not all that much.\r\n\r\n'Offspring (2009)' is a predecessor to the far more known (and far more better) 'The Woman (2011)' where Polyanna McKintosh plays the title-role.\r\n\r\nSaying this I know that it will probably attract some people who've seen and liked 'The Woman (2011)' to want to see it now not knowing that it was a sequel, just as I was. But you should then know that you get no deeper look into the character and where she comes from or anything so don't fall into that 'trap' cause it truly and literally is not even half as good as 'The Woman (2011)' so you're not missing out on anything.\r\n\r\nIf it wasn't for some shock value scenes and the extremely loud chime bell sounds that randomly shows up chances are I'd fallen asleep watching it, avoid.","id":"58d17cc8c3a36838f100d234","url":"https:\/\/www.themoviedb.org\/review\/58d17cc8c3a36838f100d234","movie_id":24868}
{"author":"Gimly","content":"Has some interesting things to say, and some fresh ideas to try out, but ultimately is an underwhelming gore-fest that's poorly acted and poorly filmed.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"57caa20f9251413514001842","url":"https:\/\/www.themoviedb.org\/review\/57caa20f9251413514001842","movie_id":24868}
{"author":"stackkorora","content":"Its a pretty basic story but it is still a lot of fun. I didn't like the ending and the shaky cam and terrible cut sequences during the fights was awful. Both the cameraman and the editor should have been fired.","id":"5b8753119251412d49004742","url":"https:\/\/www.themoviedb.org\/review\/5b8753119251412d49004742","movie_id":30305}
{"author":"John Chard","content":"PMS isn't real Needy, it was invented by the boy-run media to make us seem like we're crazy. \r\n\r\nJennifer's Body is directed by Karyn Kusama and written by Diablo Cody. It stars Megan Fox, Amanda Seyfried, Johnny Simmons, J.K. Simmons, Andy Sedaris and Adam Brody. Music is by Stephen Barton and Thodore Shapiro and cinematography by M. David Mullen. Plot finds Fox as a High School cheerleader who gets possessed by a demon and starts eating the boys from school. Seyfried is the homely best friend who tries to stop her.\r\n\r\nWomen impacting on the horror genre from the directing or writing chairs is in short supply, sadly the team-up of Diablo Cody and Karyn Kusama has barely made a stain on this issue. The intentions, you feel, were honourable from the outset, an attempt to blend hip pop culture comedy with demonic horror, wrapped around the perils of High School sexual learnings, unfortunately the final product is decidedly tepid. Neither funny, bloody or scary, and with weak CGI into the bargain, film feels confused in trying to cover so many bases. The High School setting is lazy, Kusama isn't able to build suspense and Cody's writing misses the required emotional beats. Cast are fine, the odd gag scores some giggles and the film is often sexy, while the score literally does rock, but all told it's just too messy, too studio safe for its own good. 5\/10","id":"5d34083d2f8d090388d213cf","url":"https:\/\/www.themoviedb.org\/review\/5d34083d2f8d090388d213cf","movie_id":19994}
{"author":"Dali Parton","content":"(spoiler free) I've watched a lot of Korean movies over the years - from the silly (Sex is Zero) to the sublime (Oasis) and enjoyed most of them, even some of the more marginal titles like Spygirl and A.F.R.I.K.A. But for me, and the group of people watching it with me, Jeon Woochi was a big bust.\r\n\r\nThe biggest problem I had with this movie was the terrible pacing, especially in the first 30 minutes of the movie where the timeline was not linear and the director did practically nothing to inform the audience that he had made a jump in time until wrapping up the scene and rejoining the main timeline.\r\n\r\nOther problems included a major lack of funny - there was so much opportunity for \"fish out of water\" jokes, but the writers barely even tried. And it wasn't like the comedy was too subtle either, much of the humor in the movie was just too ham-fisted to laugh at.\r\n\r\nThere were also way too many fast cuts during action sequences - it made it difficult to enjoy the biggest feature of the movie: the excellent CGI. The director barely gives the audience a chance to focus on the contents of a shot before cutting to a new camera angle. I recognize these fast cuts are a modern Hollywood style, but it is still a terrible one to emulate.\r\n\r\nThe story itself was, as expected, fairly simple. But even then, the telling of it was too convoluted - due mainly to the confusing timeline.\r\n\r\nI haven't given any examples to illustrate my criticism because I wanted to avoid spoilers as much as possible but still provide a counter-point to the misleadingly high rating (7.0 as I write this) and the other 5 or so reviews which all gave the movie exceptional scores. It was on the basis of that rating and the other reviews that I purchased the korean blu-ray and would strongly recommend that no one else waste their time or money the way I did. I suggest watching the older Arahan which has a similar \"wizardry in the modern city\" plot. I had a lot more fun watching Arahan despite its flaws.\r\n\r\nAlso, watch out for the korean blu-ray. It is poorly mastered - the black levels are elevated making the picture look washed out and hazy unless you have a fancy display that can correct the problem.","id":"589c4c309251412604007f9e","url":"https:\/\/www.themoviedb.org\/review\/589c4c309251412604007f9e","movie_id":40171}
{"author":"John Chard","content":"The comic book geek blockbuster for adults only.\r\n\r\nWatchmen is directed by Zack Snyder and adapted to screenplay by David Hayter and Alex Tse from the Alan Moore\/David Gibbons graphic novel. It stars Patrick Wilson, Malin Ackerman, Billy Crudup, Jackie Earle Haley, Jeffrey Dean Morgan, Carla Gugino and Matt Frewer. Music is by Tyler Bates and cinematography by Larry Fong.\r\n\r\n1985 and someone is killing all our superheroes. Time for the remaining super heroes to band together - but what they find as they fight the good fight is potential annihilation for everyone.\r\n\r\nIt was quite a battle getting Watchmen onto the screen, over twenty years of legal wrangling and controversies, it got to the point where fans of the source material doubted it would ever happen - and even if it did it was sure to be a monstrous failure. How pleasing to find that not only did it make it to the screen, but it is also a genre bending winner - well to some of us of course...\r\n\r\nOne has to take into context just how potent and original the graphic novel was back in 1986\/7, we are dealing with very mature themes, superheroes with serious psychological baggage. Alan Moore lit the touch paper in the comic book kingdom that the rest have since followed to keep the torch burning well into the new millennium. Snyder has achieved top line results in getting both the feel and look of the source, even if some of Moore's cunning cynicism has been lost in translation.\r\n\r\nStory is set right in the middle of nuclear paranoia and the fear of the Soviets in 85, the America we view is dank and depressing, noirish in vibe (aided by Rorschach's clobber and detective inclinations), it's a world on the road to nowhere. We are also at a time in the alternate world where superheroes are banned from operating, forcing The Watchmen to become vigilantes - that is if they can get along and shunt their psycho discord to one side. The back stories of the main protagonists are fully formed, and these are not jolly characters, so much so you worry the fate of mankind is doomed if these are who we rely on to save us.\r\n\r\nThere was in no way that Snyder would be able to produce a comic book filmic adaptation that would be as worshipped in that sphere, to rival that of the worship the novel has in its own. However, coming at it as someone who only sought out the source material after seeing the film, it shines bright for newcomers who are ironically seeking darker tints in superhero tales. Oh it has the requisite nifty twists (a clinical mystery to be unearthed), booming visuals, excellent effects work and smartly constructed action set-pieces, but narratively it's moody and calls for the utmost attention on dialogue passages (I have found it gets better on repeat viewings).\r\n\r\nSnyder clearly cared about the project and that love is evident in the movie. It was never going to appease all and sundry, but at worst to hardcore Moore fans it's at least an honourable failure, to many others it's a smart and stylishly refreshing genre booster. 8\/10","id":"5d0f39529251413945be3d4a","url":"https:\/\/www.themoviedb.org\/review\/5d0f39529251413945be3d4a","movie_id":13183}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nFirst of all, this review is based on the theatrical version of Watchmen. Usually, Director's Cuts or Ultimate Editions are not preferred over the original release. Few films benefit from them, and most are simply an extended cut with a bunch of deleted scenes. It's only fair and rational that a reviewer watches the version which the whole world saw at the theaters at the respective time. With that said, despite knowing the story of the source material, I never indeed read it. Having in mind that most of the \"hate\" that this Zack Snyder's movie received is from comic-book purists (basically, every book\/comic\/game\/whatever-lover who defends that any cinematic adaptations of any of these sources MUST be 100% the same, with no modifications whatsoever), I'm certain an unbiased perspective is the way to go.\r\n\r\nAnd overall, this is a good feature. Watchmen isn't just another CBM (comic-book movie). It doesn't just follow one hero vs. one villain. It's a whole world (in today's standards, it's really a cinematic universe) of \"superheroes\" meant to be explored in fine detail (hence the release of a TV show today... reviewing that later). It's an extremely complex world that needs to be thoroughly explained in order to deeply understand how it works, and what's everyone's role in it. This is the film's main problem: it struggles to juggle all of its different storylines and distinct characters. Even with 163min of runtime, it's impossible to squeeze in all of the necessary information.\r\n\r\nSo, as expected, Snyder and his team of screenwriters had to simplify, shorten, or even wholly dismiss some story elements that would only stretch the runtime to an unfathomable length. Some of the adaptations work brilliantly, but some fail to give a character its importance or offer no interest to a subplot. However, it's still easy to understand everything, and how the ending is going to unravel, which leads me to my second issue with the movie: its final act's heavy exposition.\r\n\r\nLike I wrote above, there is a lot of information to deliver. What Snyder did very well was to tell most of it through flashbacks or captivating conversations, but in the final act, where everything was self-explanatory and in no need of more exposition, there is an excess of redundant dialogue that doesn't really add anything relevant. What the characters are saying is significant, yes, but we, as the audience, already know all of that way before the film's climax. It's ironic how they make a joke about villains telling their masterplan to the hero and how this villain isn't dumb enough to do it, but then proceed to carefully explain everything (that we know already) through exposition.\r\n\r\nSincerely, these are the major problems that I have with the movie. However, I love so much about everything else. From the appropriated and fun soundtracks to the beautiful production design, Zack Snyder and his crew really do a fantastic work technically. Snyder's style captures Watchmen's world perfectly. It's one of those films that carry a \"feel\" due to its stylish cinematography. I love how little CGI is actually applied (I'm obviously ignoring the big blue guy), and the abundance of practical effects and real sets that are used. The action sequences look spectacular, way better than a lot of blockbusters nowadays (10 years later!).\r\n\r\nDespite the terrific technical achievements, my main compliment is actually connected to my number one problem. Even though the storylines are incredibly hard to balance, characters like Rorschach, Nite Owl, Silk Spectre, and The Comedian (Jeffrey Dean Morgan) have extraordinarily captivating and entertaining stories. There might be a few missteps here and there, but Snyder made ONE movie from a material that's worth a whole TV show or at least two films. And he delivered a GOOD one! Probably a better job than 80% of the directors working today could ever achieve. Finally, the social commentary is still quite relevant for this new generation, and if the so-called \"source-material-purists\" didn't exist, this movie would be a lot more appreciated.\r\n\r\nAll in all, Watchmen is as good as it could be, having in mind it's just one film with already a long runtime. Its narrative was always going to be extremely difficult to tell in a solid yet compelling manner, and Zack Snyder does struggle with balancing all of the storylines and its characters. However, he and his phenomenal team still delivered a good flick. Technically sublime, with a distinct style, brilliant production design, and gorgeous cinematography. Characters like Rorschach and Nite Owl have amazing moments, filled with excellent action sequences, but also with emotionally powerful scenes. If it could be better? Maybe. If it could be split into two or three movies. As it stands, as one and only film, it's really impressive even with its flaws.\r\n\r\nRating: B","id":"5db71ff70792e1001343a0a9","url":"https:\/\/www.themoviedb.org\/review\/5db71ff70792e1001343a0a9","movie_id":13183}
{"author":"David","content":"As humans, we are drawn to what inspires us, interests us, and tickles our fancy. Human opinion can be a fickle thing, especially when it comes to film, books, and music, due to this the message that is interwoven through these mediums are missed by all of us simply because we won't take the time to watch, read or listen to what is being said to us.\r\n\r\nThe message throughout Watchman and Tales of The Black Freighter in film and more importantly in graphic novel form is that we as humans try so hard to make the world a better place, but being pushed so far while trying to rid the world of evil we become the very thing we're fighting against, sometimes this a fact we do not see, or we do when it's too late. When Alan Moore wrote the story for the graphic novel, he did so at the height of this planet's greatest threat of nuclear annihilation; The Cold War, The U.S. and Russia at a stalemate over nuclear arms, and Russia's invasion of Afghanistan, had meant that at any moment millions of people on this planet could have met a brutal end.\r\n\r\nAs far as the story goes, this is a concept that has been warped, and manipulated into a alternate universe where in 1985 Richard Nixon has changed the constitution of the USA and made it allowable for him to serve more than 2 terms of Presidency, it's also a universe where in the times after WWII ordinary citizens decided that crime and corruption throughout America, and especially New York had gotten to levels beyond the control of authorities that they would suit up as masked vigilantes, and fight crime head on. By 1985 masked heroes are outlawed, and former \"heroes\" were forced to reveal themselves, or stay hidden, but give up their lifestyle.\r\n\r\nThe story of the most part is told through the eyes of one character Rorschach (Haley) as he investigates the murder of a fellow vigilante, The Comedian (Morgan). Rorschach is the only vigilante who has not given up the lifestyle, and is wanted by the F.B.I. Rorschach tries to re-engage the remaining \"heroes\" to help him find the murderer, and get to the heart of why he was murdered. The other \"heroes\" are Night Owl II (Wilson); an aging recluse who inherited a fortune from his father and used it to engage in vigilante activities, Silk Spectre II (Ackerman); daughter of an original Minutewoman (Cugino), Ozymandias (Goode), a self made millionaire who has modeled himself and his life on Alexander the Great, and Dr. Manhattan (Crudup), the only real superhero due an accident in a atomic chamber in a lab when he was a physicist.\r\n\r\nThe film follows pretty closely the themes and tone of the book, much more than any comic related movie before it, thanks mostly to the dedication of director Zack Snyder. The look and feel of the film to date it in 1985 was very well handled, and can certainly be called a period piece due to the level of exact detail through-out. Performances are in general pretty well done, and reflect the emotions of the characters in the book, as this is the Ultimate Cut, the extended scenes, plus the interwoven story of the comic book within a comic book; \"Tales of The Black Freighter\" make for a film that is worthy of its 215 minute length. Having said that they leave well and truly enough of the story in the theatrical cut where the message still shines through.\r\n\r\nThe credits for this film are the best I have ever seen, using the Bob Dylan song \"The Times They Are A-Changing\", and features snapshots of the highs and lows of the Minutemen and Watchmen from the 1940's through to the 1980's against the backdrop of important cultural and political icons and events.\r\n\r\nThis movie is easily one of my favourites of the modern age of film, because of the well delivered message, and the uncompromised approach to bring the graphic novel to life.","id":"5e3fd66c9603310017ed0b20","url":"https:\/\/www.themoviedb.org\/review\/5e3fd66c9603310017ed0b20","movie_id":13183}
{"author":"Wuchak","content":"Great documentary on The Doors.\r\n\r\nRELEASED IN 2009 and written & directed by Tom DiCillo, \"The Doors: When You're Strange\" documents the rise and fall of The Doors from 1966-1971, narrated by Johnny Depp. From beginning to end, archival footage and photos of the band are featured focusing on the members: Ray Manzarek (keyboardist), Robby Krieger (guitarist), John Densmore (percussionist) and, especially (of course), Jim Morrison (singer\/lyricist).    \r\n\r\nI’ve only seen two documentaries on The Doors, the one featured on Oliver Stone’s “The Doors” (1991) DVD, which features modern interviews with the band members & linking people (like Morrison’s witchy former babe, who loathed the movie), and this one. Both documentaries are great, but “The Doors: When You’re Strange” doesn’t focus on modern interviews, although some of the luminaries are asked questions in the archival footage.\r\n\r\nThe documentary is just transfixing from beginning to end and features 37 songs by the iconic band. Depp is, surprisingly, an excellent narrator and not goofy at all. Even if you’re familiar with the band you’ll probably gain some new tidbits. For instance, the band curiously never had a bass player, although Elvis’ bass player performed on their last album; as such, keyboardist Manzarek made up for it by essentially playing bass on one hand. Manzarek, by the way, passed away in May, 2013, at the age of 74.                             \r\n\r\nTHE MOVIE RUNS 1 hour 25 minutes.  \r\n\r\nGRADE: A","id":"5aad6d38c3a36846c9017a06","url":"https:\/\/www.themoviedb.org\/review\/5aad6d38c3a36846c9017a06","movie_id":37659}
{"author":"markuspm","content":"It is an instant classic. One of my favorite movies for the holiday season.","id":"52b7d4d2760ee330850373c7","url":"https:\/\/www.themoviedb.org\/review\/52b7d4d2760ee330850373c7","movie_id":19265}
{"author":"Andres Gomez","content":"Simple, fresh and enjoying girls teenager movie.\r\n\r\nPerfect for not thinking much and enjoying, without having to suffer all the stereotypes.","id":"50f912b4760ee35bafae8e41","url":"https:\/\/www.themoviedb.org\/review\/50f912b4760ee35bafae8e41","movie_id":22798}
{"author":"Ultimatemoviereview","content":"The Ultimate Movie Review! - http:\/\/tss5078.blogspot.com - @tss5078 - When I first saw the previews for Whiteout, I didn't think it would be anything special. It wasn't until Netflix recommended it for me and I read the description, that I thought there might be something there. While the previews made it look like some arctic nightmare, the truth is that it was a pretty great film. The story is centered around a U.S. Marshall, stationed at the base in Antarctica. For more than 3 years, she didn't really have much to do, but that all changed when two base members are found murdered. It then becomes Carrie Stetko's job to solve the first murders in the continents history. Despite a lack of other people and places to go, the writers of this film did an excellent job at keeping this movie intriguing. I didn't think in a million years that a film like this would work, but actually it works out really well, and unlike a similar story, Fargo, the producers of Whiteout hold nothing back. Kate Beckinsale stars and really does a fantastic job. I've always like her abilities, not to mention the way she looks, but this film is the first time her performance really stood out to me as something special, maybe she should consider playing a cop more often. As someone who's seen thousands of films, it always amazes me how the films I expect the least from, always deliver the biggest surprises. Whiteout is pure intensity, not to mention, a great mystery, that is absolutely worth seeing.","id":"52958725760ee34ab90a6def","url":"https:\/\/www.themoviedb.org\/review\/52958725760ee34ab90a6def","movie_id":22787}
{"author":"John Chard","content":"Be your own hero! Go Babe Ruthless!\r\n\r\nWhip It is directed by Drew Barrymore and adapted for the screen by Shauna Cross from her own novel, Derby Girl. Barrymore also co-stars alongside Ellen Page, Alia Shawkat, Marcia Gay Harden, Kristen Wiig, Juliette Lewis, Jimmy Fallon, Daniel Stern and Landon Pigg.\r\n\r\nBliss Cavendar (Page) is a bored teenage girl stuck in a rut in Bodeen, Texas. Her life consists of working at the \"Oink Joint\" restaurant and entering beauty contests to please her mother (Harden). Along with her friend Pash (Shawkat), she dreams of escaping to a better life. Then one day during a trip out to Austin, the girls get wind of Roller Derby, a sport for girls played on roller-skates. Intrigued they go and take in a match and Bliss is hooked straight away, it's tough, competitive and even edgy. Telling a lie about her age, Bliss decides to try out for the \"Hurl Scouts\" and gets a place on the team as \"Babe Ruthless\". Thanks to her ability the \"Scouts\" start to turn around their season, however, with a new boyfriend on the scene and her parents unaware of her secret life, Bliss' new found happiness could come crashing down around her.\r\n\r\nIn spite of some favourable critical assessments, Drew Barrymore's directing debut barely made a dent at the box office. Just about making its money back on World gross, the figures would lend you to believe that the film simply isn't very good. Plot synopsis doesn't suggest anything out of the ordinary - yet another coming-of-age teenager picture, and one that is sports based, and even more formulaic than that, the sports team at the centre of proceedings is an underdog too! Throw into the equation that it's a female based movie and it's not really a film crying out for all demographics - or is it? Barrymore herself was very disappointed with the marketing for her movie, the general feeling being that it was sold as a girls sports love story type picture. She's absolutely right, it was marketed badly, and it barely had a run on the big screen in most countries. Which is a shame because Whip It is a smashing film, a picture that's vibrant, funny and not without dramatic worth - and yes! it's accessible for any age, sex or gender persuasion. Cross' script is fresh and free of filler and the cast all turn in jolly good shows, ranging from the excellent (Page\/Gay Harden) to the engaging (Shawkat\/Lewis\/Wiig) and the funny (Stern\/Fallon). OK, so it's not perfect, Barrymore is no Tony Scott when it comes to shooting action (some of the actual derby matches are confusing and not flowing), and maybe a bit more back story flesh for the other \"Hurl Scouts\" wouldn't have gone amiss? But these are minor itches at the beginning of what is hoped to be a long career in directing for Madame Barrymore.\r\n\r\nWith names like Jabba the Slut, Smashley Simpson and Iron Maven, it's evidently a film full of fun vim and vigour. But as great as that is (girls in skirts on skates belting each other around a track), the coming-of-age drama at its core should not be understated either. 8\/10","id":"5ceba3b79251415450c14eff","url":"https:\/\/www.themoviedb.org\/review\/5ceba3b79251415450c14eff","movie_id":22798}
{"author":"John Chard","content":"Loopy Looper!\r\n\r\nTriangle is written and directed by Christopher Smith. It stars Melissa George, Liam Hemsworth, Michael Dorman, Jack Taylor, Joshua McIvor, Henry Nixon, Emma Lung and Rachael Carpani. Music is by Christian Henson and cinematrography by Robert Humphreys.\r\n\r\nAfter their boat is damaged during a weird storm, a group of friends board a drifting ocean liner to find it seemingly deserted. One of the group, Jess (George), has the distinct feeling she has been on the ship before...\r\n\r\nIt at first glance seems to be a standard ghost ship type of film, where a group of pretty people are in serious peril, but this is much more. It proves to be complex piece, one in fact that kind of demands a second viewing to fully appreciate the twisty nuances within. Beautiful photography highlights some of the teasing imagery, which ascentuates the etheral tone to proceedings. Then once the story starts to reveal itself, your undivided attention is sought to fully grasp the deep psychological barbs at work. 8\/10","id":"5db5e60bd40d4c0018fe2131","url":"https:\/\/www.themoviedb.org\/review\/5db5e60bd40d4c0018fe2131","movie_id":26466}
{"author":"antimony","content":"**Fantastic Psychological Thriller!**\r\n\r\nIf you're browsing for movies to watch, go into this movie cold; without watching the trailers or any other reviews. A skillfully made thriller that reveals more details upon rewatching. If you enjoy mindf**k movies or science-fiction\/psychological thrillers, you will love this film.","id":"5b989f480e0a263dbe0051c8","url":"https:\/\/www.themoviedb.org\/review\/5b989f480e0a263dbe0051c8","movie_id":26466}
{"author":"hankiro","content":"Visually and sonically, a poetic masterpiece. Although there are lingering nature shots, it's far more similar (visually) to **Tarkovsky** or **Lopushansky** than **Malick**. A very basic human story about family, survival and jealousy. An incredibly solid debut, and a bar set high for independent filmmakers looking to have their voice heard.","id":"555e05de9251417e5100011f","url":"https:\/\/www.themoviedb.org\/review\/555e05de9251417e5100011f","movie_id":246415}
{"author":"Andres Gomez","content":"Baaaad ... oh, baaaaaad.\r\n\r\nHugh Jackman is always great as the Wolverine but this story doesn't have any sense nor excuse.","id":"53f11ceec3a3685add002fbc","url":"https:\/\/www.themoviedb.org\/review\/53f11ceec3a3685add002fbc","movie_id":2080}
{"author":"tmdb44006625","content":"I watched this film and felt like they shot it without an actual script, filming whatever came to mind. And what do you know, I found out later that they really didn't have a script to follow.\r\n\r\nMakes sense now why many scenes feel rushed or incomplete, most of the effects look half rendered, and \"Deadpool\" looked like an absolute disaster.\r\n\r\nAnd yet, oddly enough, it's not the worse film in the X-Men franchise. It just sets the bar exceedingly low.","id":"5c842909c3a36839d4d28726","url":"https:\/\/www.themoviedb.org\/review\/5c842909c3a36839d4d28726","movie_id":2080}
{"author":"iluvdvds","content":"Despite its modest budget, this film proves to be a very welcome addition to the horror genre. As its title suggests, AVOID THE SHORTCUT avoids being a dull rehash of tired cliches and insteads plays with these loved horror conventions to create an exciting and very well made horror film. If you want to take a break from the constant flurry of torture porn flicks, then take a look at this creepy chiller. A great story, interesting characters and a very twisted villian make this a surprisingly fun and enjoyable movie!","id":"4ffef167760ee34ceb001489","url":"https:\/\/www.themoviedb.org\/review\/4ffef167760ee34ceb001489","movie_id":22175}
{"author":"John Chard","content":"It's not actually final...\r\n\r\nYou can just imagine the suits sitting around their big round table discussing how to churn out another financially beneficial Final Destination movie and get away with it. Big suit number one puts forward that they obviously need more inventive mouse trap like deaths. Big suit number two has the genius notion that 3D is again taking off so why not utilise that option too. And that's pretty much all that it took, with the end result being a movie that is very self aware of its roots, but still plays out as the runt of the Final Destination litter.\r\n\r\nJust as the director of the first one, James Wong, was brought back to direct part 3, the makers here bring back the director of part 2, David R. Ellis, to direct part 4! Which ultimately proves to be nothing more than some sort of nepotism like factor because The Final Destination is basically just over 82 minutes of poor acting, bad writing and a series of kills weaved together by the odd 5 minutes of barely relevant characterisations (the exposition as painful as the gory deaths!). \r\n\r\nThe kills entertain as they pretty much always have throughout the franchise, with the opening disaster sequences (here set at a speedway stadium) continuing one of the series' great traditions. While the opening and closing X-Ray\/Skeletal credit sequences are superb and a credit to those involved. Yet it all feels so tired, where in spite of the willingness to upgrade the technology, it's still lazy and has nothing to really justify its very being other than that to make easy money. \r\n\r\nThe makers of part 5 would have to come up with something special to not turn this franchise from being one that was once bright and inventive, into that of a money train joke. 4\/10","id":"55bdad5ac3a3686534004584","url":"https:\/\/www.themoviedb.org\/review\/55bdad5ac3a3686534004584","movie_id":19912}
{"author":"Gimly","content":"I have some questions, I have some comments, both of which may come across as moderately hostile, but I still enjoyed _The Princess and the Frog_. I'm not too sure why though. I won't be coming back for the soundtrack, which is generally one of the biggest appeals of these Princess deals, and certain things are so *yawn* Disney that you can call them before you press play, but at least it's a little different.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5cfe30090e0a261fbbca2525","url":"https:\/\/www.themoviedb.org\/review\/5cfe30090e0a261fbbca2525","movie_id":10198}
{"author":"John Chard","content":"This one night changes everything for me.\r\n\r\nTi West seems destined to be one of those horror film directors who forever will polarise opinions. For those of us who love the slow burn approach and admire his evident adoration of retro horror, then he hits the mark. Reference The House of the Devil and latterly The Innkeepers. If those two things don't strike a chord with you then it's very likely that The House of the Devil will drive you nuts -  but not in a good way.\r\n\r\nPlot is simple, Jocelin Donahue plays student Samantha Hughes, who has found the ideal apartment to live in, but needs funds to pay the deposit. Sooooo, answering a flyer advertising for a babysitter, she winds up at some spooky house out in the sticks, where the job isn't exactly what was as expected, and, well the night isn't as expected either...\r\n\r\nIt's her own fault really, if you ring the bell at a spooky isolated house and Tom Noonan answers the door, well then you should know better than not to run away! But I digress. West's film taps into the satanic panic that gripped certain parts of the states in the 70s and 80s, set in the early 80s the film is a vibrant homage to that era, with a real sense of time and place pulsing away as Samantha is set up for a night of god knows what.\r\n\r\nThe house is a splendid old creaker and within it Samantha always looks to be one cat's whisker away from being in peril. West doesn't go for continuous boo-jump scares, he lets us and Samantha use our imaginations to unnerve all parties. The screw is slowly turned until hell comes to the party, moving things swiftly to a frenetic finale that closes with a final denouement that old nick himself would approve of.\r\n\r\nDee Wallace Stone does a cameo to add more to the retro flavours, while Noonan and Donahue are superb. It's a film that is patient and asks you for your patience, so those of that ilk, and retro horror hounds too, will love it. Others, not so! 7\/10","id":"562e4b58c3a3681b5900acbc","url":"https:\/\/www.themoviedb.org\/review\/562e4b58c3a3681b5900acbc","movie_id":25983}
{"author":"Reno","content":"**A guilt for losing the own baby and being labelled as a bad step-mother.**\r\n\r\nIt is also known as 'Love and Other Impossible Pursuits', which is the name of the book the film was adapted. According to me this is a very underrated film. Especially Natalie Portman was never seen before. This film was beautiful because of her. Might have been the same if any other actress who had played that role, but the thing is the character Emilia makes this story great. I would have given any top award the available around the globe for that incredible character display. It should have been recognised, sadly that did not happen because of the filthy film critics.\r\n\r\nFeels good watching it. This might not be a biographical film, but surely this is happening around us. The writing was so impressive. How the character Emilia was portrayed is the film's highlight. It was a simple character, that does not mean the life has to be simple as well. She falls in love with a married man and later she get married to him to become a step-mother to his child. That's where the problem arises when her baby dies in her arm, everybody points her for not being cautious with her step-son. This is a big task and how she comes out of it was revealed with lots of small twists and turns in the tale.\r\n\r\nNot just Natalie, but all the supporting cast was brilliant, including the husband, the kid and the ex. The story of loss, marriage, taking care a child and other struggles in life. Initially it did not look good with those affairs, but when it got past the half way mark, the rest of the film rebalanced the entire film. I liked how it ended. That final scene was very good. Even if you are an atheist, that end dialogues makes the major difference to favour the film. I haven't read the book, but seems the film was better than the book. Being a film fanatic and failing to recommending it to you would be a mistake. So I recommend it to particularly the grown-ups.\r\n\r\n_8\/10_","id":"58a37804c3a3683f6e001163","url":"https:\/\/www.themoviedb.org\/review\/58a37804c3a3683f6e001163","movie_id":52505}
{"author":"Andres Gomez","content":"Entertaining but not too scary and getting most of the inspiration borrowed from other movies.\r\n\r\nBest is Chis Massoglia and Haley Bennett as main characters","id":"50c3e32319c2950685000384","url":"https:\/\/www.themoviedb.org\/review\/50c3e32319c2950685000384","movie_id":45650}
{"author":"pancine","content":"Stunning imagery. Whether interpreted as allegory or Kafkaesque nightmare, this is a prime example of the upper tier in art film. The end seemed somewhat out of place after the mesmerizing journeys through Lake Urmia in northwestern Iran. The director and others were jailed for making it. This film warrants multiple viewings.","id":"5c6095b2c3a3684f97d4aae1","url":"https:\/\/www.themoviedb.org\/review\/5c6095b2c3a3684f97d4aae1","movie_id":98238}
{"author":"Gimly","content":"My best friend and I are always on the look out for the next great \"Army vs. Creepy Thing(s)\" movie, and I've been holding on to this one for us with exactly that in mind, ever since I picked it up ex-rental in 2009. Now here we finally are, New Year's Day a full **decade** later, and we **actually** got around to watching it.\r\n\r\nToo bad it sucked a lot. Especially given the cast. Kind of a let down after all that.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5c441600c3a3681a0023f4bb","url":"https:\/\/www.themoviedb.org\/review\/5c441600c3a3681a0023f4bb","movie_id":17577}
{"author":"Andres Gomez","content":"This is quite close a B series movie. Nothing unexpected, the creatures a laughable and the FX virtually non-existent.\r\n\r\nMaybe you can save the performance from both children, Baquero and Griffith, but that's it.","id":"5544ecd2c3a3680ce8004553","url":"https:\/\/www.themoviedb.org\/review\/5544ecd2c3a3680ce8004553","movie_id":37534}
{"author":"narrator56","content":"Considering the star power here (Clooney, Jeff Bridges, Kevin Spacey) I can understand why people might feel somewhat disappointed when they watch it. I mean, the description even mentions the Coen brothers as a basis for comparison. With Jeff Bridges' role, it was difficult not to think of The Big Lebowski, but this film isn't of that caliber.\r\n\r\nStill, I thought it was entertaining most of the time. There were slow interludes that could have been removed to improve the pacing without harming the story. But if you understand that they aren't going for laugh out loud gags or one-liners, but rather they work for their punch lines or leave you to figure out where the joke is, maybe you can appreciate it more.\r\n\r\nI will say that the plot seemed a bit disjointed to me. The flashbacks weren't confusing, but in a slower paced film like this one, I think they were sometimes more of a distraction than plot-enhancers. The ending also had an air of an anticlimax to it, like - oh, okay. I guess it fit the laid back mood of the rest of the movie, but they might have done more with it.\r\n\r\nStill, I liked it. Enough said.","id":"5e89b6d26c74b9001597424b","url":"https:\/\/www.themoviedb.org\/review\/5e89b6d26c74b9001597424b","movie_id":10313}
{"author":"Bazzjazz","content":"Please, I emplore you.\r\nThis is the original ‘The secret in their eyes’ without the Hollywood gloss and Pseudo ‘Top Actors\/Actresses’\r\nThe Agentinian original film that won best foreign film at the Oscars.\r\n\r\nDeservedly so.\r\n\r\nDon’t sell yourself short and see the Hollywood redo.\r\n\r\nIt’s got a ending I wish I could tell you about.\r\n\r\nSee This show!","id":"5ae1972a0e0a262a6100b01b","url":"https:\/\/www.themoviedb.org\/review\/5ae1972a0e0a262a6100b01b","movie_id":25376}
{"author":"Gimly","content":"Solid pun on the name but WOW was this bad. Utter nonsense.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5e0750ea4c1d9a0013e19815","url":"https:\/\/www.themoviedb.org\/review\/5e0750ea4c1d9a0013e19815","movie_id":21166}
{"author":"Kenneth Axel Carlsson","content":"In Japan, there is a small town called Taiji. In Taiji, there is a place called the Cove. It is a secret place, a place where 23,000 dolphins are killed every year. The dolphins are not just killed, they are in fact slaughtered in the most brutal way imaginable. And all this without anyone really knowing that it goes on.\r\n\r\nI've heard of dolphins being killed in the nets when they catch tuna, but I've never thought that people actually hunted down dolphins as a source of food. Dolphins, like any whale really, seem a bit too majestic and mysterious to just slaughter like pigs and cows, at least to me. And if this movie is to be believed, they can also be quite dangerous to eat, as they contain a high amount of mercury.\r\n\r\nThis movie is a documentary, focused around a signle event, where we actually see the slaughter of the dolphins. We see how the crew set up the cameras in the middle of the night, as well as how they scout out the area and plan the entire event. But more interesting than all that, we also meet Ric O'berry, one of the original actors and trainers from the tv show Flipper, who has now devoted his life to stopping the killing and abuse of dolphins. Being part of Flipper, and the one who actually caught the dolphins to appear on that show, he feels personal responsible for starting this whole mess. Of course, it would most likely have happened anyways, but we feel his pain.\r\n\r\nAs a documentary, this is really well made. It is constructed much like a movie, but doesn't become too emotional, except at the very end, where we see Ric telling his story to the world, silently and with a screen on his belly.\r\n\r\n_Last words... I am not a big dolphin lover or anything, but this movie still got to me by the end, because... this seems so pointless. I dont think the dolphins are in any danger of being extinct anytime soon, but still, these creatures are mysterious and might have something to teach us, and for that, they deserve to be treated differently._","id":"549efe3e9251413129008f9b","url":"https:\/\/www.themoviedb.org\/review\/549efe3e9251413129008f9b","movie_id":23128}
{"author":"John Chard","content":"The clocks stopped at 1:17\r\n\r\nThe Road is directed by John Hillcoat (The Proposition) and written by Joe Penhall (Enduring Love). Based on the 2006 novel of the same name by American author Cormac McCarthy (No Country For Old Men), the film stars Viggo Mortensen and Kodi Smit-McPhee as a father and his son trying to survive in a post-apocalyptic world.\r\n\r\nHow do you sell such a sombre piece to the film loving public? I'm not sure I personally can, such is the whirly like emotions dominating my thoughts. OK, it's a grim and bleak film, of that there's no doubt. Director Hillcoat is not out to make a thrilling end of the world actioner. Staying faithful to McCarthy's novel, this is now a world where animal & plant life is practically extinct, where this particular part of America is lawless and populated by cannibal types. Humanity has long since left the arena. How we arrived at such desolation is not clear - intentionally so. We are now just witnessing the after effects of something world changing, the fall out personally involving us as we hit the road with man & boy.\r\n\r\nHillcoat and his cinematographer Javier Aguirresarobe have painted a clinically dead world from which to tell the story. Scorched soil is home to threadbare trees, the skyline punctured by the wreckage of man's progress passed, storms come and go as if to taunt the characters. It's a living hell that begs the question on why would anyone want to survive in it? So here's the thing that finally hit me like a sledgehammer some five days after watching the film, it's not just the bleakness of the apocalypse that gnaws away at you, it's also the expertly portrayed study of parenting. So emotively played by Mortensen, with Smit-McPhee essaying incredible vulnerability, it sinks the heart the longer the movie goes on. All of which is leading up to the ending, where we get something absorbing, revealing and utterly smart.\r\n\r\nTough viewing for sure, but compelling and thought provoking throughout. 8\/10","id":"5da02890e54d5d0029823434","url":"https:\/\/www.themoviedb.org\/review\/5da02890e54d5d0029823434","movie_id":20766}
{"author":"Kewl Kat","content":"Most people have probably seen The Lovely Bones by now but I will keep the spoilers to a minimum. This film will always be remembered as the breakout role for the incredible Saoirse Ronan. It will also be remembered as one of the most controversial films ever made. People tend to break off into two camps: Team Salmon or Team Harvey.\r\n\r\nIt starts off innocently enough: a boy-crazy teenage girl in the 1970s is crushing on a man at school. It seems that he is interested in Susie too and despite the disparity in age, she falls for his charms, mostly due to his exchange student allure and suave accent. As the film progresses, it becomes clear that another gentleman is also interested in the nubile teen. His name is Mr. Harvey and he lives in Susie's neighborhood. Unlike the man from school, Mr. Harvey puts in a tremendous amount of effort in an attempt to win the love of Susie Salmon. He builds her an amazing underground clubhouse, complete with all the stuff young people from that era loved. He had beverages such as Coca Cola that he selflessly shared with Susie as they hung out. It became clear that Mr. Harvey, while having great taste in females, was a bit awkward around them. His nervousness around Susie Salmon was evident and she picked up on that. Girls prefer a man with confidence. I also feel that maybe she was turned off because the Coke that Mr. Harvey gave her was warm. I didn't see an ice-filled cooler in the clubhouse anywhere. So I think these factors all led to Susie Salmon losing her patience, which erupted in an unfortunate display of rudeness. Mr. Harvey only had one rule in the clubhouse: Be polite. Susie Salmon broke that rule and the series of events that followed spiraled into one great, big, unfortunate chain reaction. \r\n\r\nThere are no bad people in The Lovely Bones. True, Susie Salmon came off as being a little narcissistic and immature but she was only 14 years old. Mr. Harvey was socially awkward and made some unfortunate choices in life but he had a deep desire to be loved and respected. Despite his talents and generosity, it seemed nobody opened up their heart to him. \r\n\r\nThe Lovely Bones is a film that will force you to take sides. Whether you end up on Team Harvey or Team Salmon, be prepared for an emotional ride. There are great performances all around. 8\/10.","id":"5a3d34280e0a265f7703f852","url":"https:\/\/www.themoviedb.org\/review\/5a3d34280e0a265f7703f852","movie_id":7980}
{"author":"Gimly","content":"Though not outright bad, _The Slammin’ Salmon_ is possessed of much less of their trademark timeless (and brainless) humour than the majority of Broken Lizards work. Instead, here they opt for gross out and cliche laughs, very few of which land. Even the the amazing cast additions of Michael Clarke Duncan, Lance Henriksen, Cobie Smulders, Will Forte and Sendhil Ramamurthy couldn’t elevate this film above merely “watchable”. For the same thing, only better, watch 2005’s “_Waiting…_”.\r\n\r\n_Final rating: ★★ - Had some things that appeal to me, but a poor finished product._","id":"5a6960e10e0a260d5e00afff","url":"https:\/\/www.themoviedb.org\/review\/5a6960e10e0a260d5e00afff","movie_id":34423}
{"author":"Andres Gomez","content":"Viggo Mortensen and Smit-McPhee deliver great performances but it doesn't really hook you up.","id":"53184e5192514177c2000dc6","url":"https:\/\/www.themoviedb.org\/review\/53184e5192514177c2000dc6","movie_id":20766}
{"author":"tiailds","content":"After the third attempt to watch this film, I finally got through the first 15 minutes and am glad I did. There always seemed to be something to stop me from getting too far in. So, what did I think?\r\n\r\n\"Is it entertaining?\" Yes. For the most part, the songs were enjoyable and the animation was fine. The pacing could be improved somewhat, mostly by eliminated 2-3 songs. 2 out of 3\r\n\r\n\"Is it interesting?\" Yes. The character backgrounds and the story development were easily above the average kids movie. The plot was a tad predictable and the moral seemed to meander some. 2 out of 3\r\n\r\n\"Is it memorable?\" Somewhat. The most unique thing were the character types. While the animation was fine, some of the human facial expressions were just off enough to be slightly creepy. I am glad most of the movie had some of the main characters as animals. 1.5 out of 3\r\n\r\nStart with 1.\r\n1+2+2+1.5=6.5\r\nI will round up for the overall enjoyment of the time spent.\r\n7 stars.","id":"5699f4c3c3a3686f9f0007a7","url":"https:\/\/www.themoviedb.org\/review\/5699f4c3c3a3686f9f0007a7","movie_id":10198}
{"author":"Kewl Kat","content":"**SOME SPOILERS** This movie was mildly entertaining but incredibly maddening. Kevin Costner's character was a failure as a parent and as a human being. The instant he discovered that his little girl was going to be made into a sex queen for the mound folk, he should have set up a sting. The daughter was what, 13? It doesn't matter what state in America they were in, this is illegal everywhere. Middle school kids cannot legally be involved in orgy situations in the Unites States. Yes, he was searching key words on the internet like \"puberty\" and \"raising a teen daughter\", so I know he put in some effort. Sadly, it was not nearly enough and he should have known that. Why wasn't he Googling \"Mound sex and underage girls\" or \"The ethics of engaging in multi-partner mound coitus with a child\"? He would have seen it was totally illegal and he could have contacted the authorities. He was too worried about coming off as an unkewl, preachy, helicopter dad.","id":"5a43f999c3a3685916059d07","url":"https:\/\/www.themoviedb.org\/review\/5a43f999c3a3685916059d07","movie_id":37534}
{"author":"John Chard","content":"We survive by remembering. But sometimes we survive by forgetting. \r\n\r\nThe Uninvited is directed by The Guard Brothers and written by Craig Rosenberg, Doug Miro and Carlo Bernard. It stars Emily Browning, Elizabeth Banks, Arielle Kebbel and David Strathairn. Music is by Christopher Young and cinematography by Daniel Landin.\r\n\r\nA remake of Korean film \"A Tale of Two Sisters\", plot finds Anna (Browning) released from a psychiatric institution, she was placed in there following a suicide attempt when her terminally mother died in a boathouse fire. Once home she begins to encounter bad dreams and supernatural visions...\r\n\r\nIt was yet another American remake of an Asian horror film, at a time when doing so was in vogue, unfortunately this is one of the weakest of the bunch. Not exactly terrible, it's just so unoriginal and devoid of any suspense or chiiling atmosphere. In fact it feels more like a murder mystery piece but with a couple of spook scenes inserted into the narrative. Pic is predominantly saved by the finale, where the story unravels with some genuine surprises. Cast are all fine in perfs, even if Strathairn is utterly wasted in his under written role. 5\/10","id":"5da61272a242320012774f47","url":"https:\/\/www.themoviedb.org\/review\/5da61272a242320012774f47","movie_id":14254}
{"author":"Andres Gomez","content":"An interesting story, with tons of questions and few answers. Well told but nothing exceptional.","id":"5204e965760ee335c2041618","url":"https:\/\/www.themoviedb.org\/review\/5204e965760ee335c2041618","movie_id":41248}
{"author":"John Chard","content":"Pan's Pulsing Peril.\r\n\r\nI expected the worse, where given some of the outright scorn poured on Gabriel Bologna's independently produced TV style movie, has been quite scary in itself! Truth is, is that it is very much same old same old as regards genre tropes, but it at least does it well enough to not make this a complete waste of time.\r\n\r\nSet-up is via a prologue that establishes something murky and menacing happened back in Turkey 1927. Forward to the present day and a bunch of horny young adults converge on a cabin and find a mysterious board game that might relieve the tensions. Said game is of course a left over from that Turkey curse thing, a game which brings out all the pent up bile and fantasies that were previously lying dormant in this so called bunch of friends.\r\n\r\nWhat transpires is hardly surprising, the group turn on each other - and turn each other on as it happens - where Bologna throws all the \"cabin in the woods\" staples into the pot. Blood does flow, shrieks do feature, as does ink streaming out of the protagonist's eyes. Robert Patrick is under used as the creepy vodka swigging guardian of \"his\" island, and much of the youthful cast struggle to impact with conviction.\r\n\r\nYet as the thongs and boobs cater for the like minded under sexed, and as the gore (refreshingly not over killed by CGI) keeps on a coming, The Black Waters of Echo's Pond still fills out its run-time with honest horror movie intent. Not one to rush out and grasp with bloody hands, but as late night cable time fillers go it passes muster. 6\/10","id":"536f31d9c3a368122600dbf4","url":"https:\/\/www.themoviedb.org\/review\/536f31d9c3a368122600dbf4","movie_id":116983}
{"author":"Leigh Bowden","content":"I had low expectations when I entered the theater to see the 5th installment of the FD series, because the 4th movie was such a disappointment. But after watching it, I was surprised. First off,this movie was way,( and I mean), way better then the last two movies were. It was darker and had a lot of elements from the first movie, which I loved. I don't want to give away too much, but I do want to say that the last scene of the movie will leave you speechless. It had me thinking, \"OMG, that was AMAZING how they came up with that twist.\" One last thing I loved about this movie was that it was well planned out and thought of, unlike the forth movie which was a joke and in my opinion, shouldn't have never been made. The deaths weren't rushed as opposed to the deaths in the forth movie, and it gave more screen time to introduce us to the characters. Note: I will say that there is one death scene in the movie that I didn't see coming, besides the ending. I recommend you see this movie. It might have the same theme as the first four movies, but unlike the first four, it's on a much higher scale.","id":"5015b1e919c2955653005fa2","url":"https:\/\/www.themoviedb.org\/review\/5015b1e919c2955653005fa2","movie_id":19912}
{"author":"Wuchak","content":"***More of the same, but with one of the better ‘final girls’ and superior music***  \r\n\r\nThe first \"Final Destination\" movie in 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, an invisible spirit. A group of people, mostly teens, escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying the kids who cheated Death in various creative ways, usually an unlikely chain of events. The opening tragedy in the first film was a plane crash, in the second it's a highway pile-up, in the third it's a rollercoaster mishap while in this fourth entry it’s a tragedy at a racetrack. The fifth film (2011) features a bridge collapse.\r\n\r\nAll of the movies in the five-film franchise tell the same basic story with different characters and minor nuances; all of them are of the same high quality of technical filmmaking. Whether you prefer one or another depends on your preference for cast members and the death sequences (and the locations). Other than these factors they're all basically the same.\r\n\r\nReleased in 2009, \"The Final Destination\" (aka “Final Destination 4”) has a quality redhead heroine in Shantel VanSanten. The director wisely showcases her beauty in a tasteful scene, which none of the previous movies managed to accomplish. Haley Webb and Krista Allen are also on hand in the feminine department. The previous film arguably has the best assortment of women in the series.\r\n\r\nWhile it’s true that you know exactly how this film plays out if you've seen the first three installments, or any of them, there are some highlights beyond the females.  For one, this movie has the best music yet, whether score or soundtrack. The opening tragedy is thrilling as usual and there are several creative death or near-death scenes involving a tow truck, a pool, a car wash, a cinema and an escalator.\r\n\r\nThe film runs 93 minutes and is the only installment that wasn’t filmed in the Vancouver area. The entire movie was shot in the East as follows: The speedway sequences were filmed in Mobile, Alabama; the closing mall scenes in McKinley, Pennsylvania; other scenes & studio work in New Orleans\/Harahan, Louisiana; and reshoots in Orlando, Florida.\r\n\r\nGRADE: B-","id":"5bdc8d950e0a26283e00265d","url":"https:\/\/www.themoviedb.org\/review\/5bdc8d950e0a26283e00265d","movie_id":19912}
{"author":"Franky","content":"Brian Cox is excellent! As the characters transition and grow during the movie, you will laugh and cry.","id":"569aa1219251410cd600096b","url":"https:\/\/www.themoviedb.org\/review\/569aa1219251410cd600096b","movie_id":5178}
{"author":"John Chard","content":"The Connecticut Horror.\r\n\r\nSupposedly grounded in truth, The Haunting in Connecticut is a decent little spooker, yet still a pic that has all the pitfalls of other notable films of its ilk. Plot for what it's worth has a family move into a new home, only to find that it has ghosts and ghoulies residing within. But why?\r\n\r\nThere's good strength in the family dynamic at work here, the eldest son has cancer and is undergoing treatment. Thus he becomes the conduit for the strange happenings, and this as his parents fight impending grief and personal worries. The scares toddle along effectively, atmosphere via camera work and sound effects is perfectly efficient, and the story has enough mystery about it to carry you through to the end.\r\n\r\nUnfortunately there's a lot of daft stuff as well, I mean who in their right mind would sleep in a basement room and not force open an adjoining door to see what is in there? It's these ridiculous leaps of faith required that if you are not willing? Then they kill the movie for you. The ending also takes some believing, such is the rampant stench of Hollywood of it all.\r\n\r\nWell performed in the main (Virginia Madsen solid as a rock\/Elias Koteas shining in spite of being under used), this deserves to be rated above average. But ultimately it rings hollow at times and quickly runs out of scares in the last third. 6\/10","id":"5626e4afc3a368278300089a","url":"https:\/\/www.themoviedb.org\/review\/5626e4afc3a368278300089a","movie_id":18781}
{"author":"Per Gunnar Jonsson","content":"For some reason this one is named The Final Destination instead of Final Destination 4. Almost looks like they expected this installment to be the final in the series but since the 5th one is about to come out on Blu-ray that was obviously a wrong assumption in that case.\n\nA positive surprise. Most people have said that the second third and fourth film slipped compared to the first one and it wasn’t until the fifth film that the series took off again. Well they’re wrong in my opinion.\n\nThis installment was a lot better than the third one. Sure if you do not like gory horror movies then you wont like this film but then why did you even bother with it? Me, I like these kind of films so I was quite happy to see it.\n\nThe special effects was much better than the previous film and not so silly and stupid as they sometimes where in the third one. I liked the ending as well. Classical horror movie style ending and really cool touch with those x-ray shots.","id":"5aa229910e0a262c71005960","url":"https:\/\/www.themoviedb.org\/review\/5aa229910e0a262c71005960","movie_id":19912}
{"author":"John Chard","content":"Lake Ends In The Road.\r\n\r\n \r\n\r\nThe Last House on the Left is directed by Dennis Iliadis and adapted to screenplay by Adam Alleca and Carl Ellsworth from the story by Wes Craven (co-producer here). A remake of Craven’s 1972 film of the same name (itself influenced by Ingmar Bergman’s The Virgin Spring), it stars Tony Goldwyn, Monica Potter, Garret Dillahunt, Sara Paxton, Spencer Treat Clark and Martha MacIsaac. Music is by John Murphy and cinematography by Sharone Meir.\r\n\r\n \r\n\r\nDuring a family vacation, teenagers Mari (Paxton) and Paige (MacIsaac) are viciously set about by a gang led by recent prison escapee Krug (Dillahunt). When bad weather forces Krug’s car to career off the road, the gang, unbeknownst to them, seek refuge in the vacation home of Mari’s parents. When the parents realise what their new lodgers have done, they begin to enact bloody retribution.\r\n\r\n \r\n\r\nIt’s pointless going on about remakes of old horror films, they are here to stay and we continue to watch them in the hope that they will strike a chord with us. With The Last House on the Left, remaking it, to me at least, is understandable given the 72 film is not exactly a great classic itself. True enough to say it has that grainy grunginess that was so befitting the decade’s horror movies, marking it out as an unsettling experience without really living up to its “terrifying” reputation. In fact if you put both movies together they still wouldn’t have enough class in them to give Bergman’s movie a run for its money.\r\n\r\n \r\n\r\nSo the remake then, all glossy and big budgeted, with name actors in the principal roles, it is by definition routinely packaged for the modern day audience. However, that doesn’t take away from the fact that what unfolds on that screen is challenging us, it really does do its job. The pertinent question exists, are you capable of such violence having had violence inflicted on your loved ones previously? What would you do in the same situation that Mari’s parents find themselves in?\r\n\r\n \r\n\r\nWe have been privy to what was meted out to poor Mari and Paige, and the impact is most distressing. There is good cause to argue that Iliadis and his production team go too far in grabbing our attention in readiness for the “revenge” factor later on. Certainly I myself was uncomfortable watching it, as I was with the I Spit on Your Grave remake, but it’s about getting a prescribed response, however close to the knuckle it is.\r\n\r\n \r\n\r\nIt’s not a film anyone can feel comfortable about recommending, surely? But I know it put me through a gamut of emotions, even making me feel bad about myself the next day. That is quite often the power of cinema, and clearly the banner that Craven and Iliadis held aloft during the publicity tours for The Last House on the Left. Today I give the film an uneasy 7\/10, it’s uncompromising and unapologetically violent, but also laced with flaws. On another day I may find myself rating it considerably lower…","id":"52780c5d19c29551451ea171","url":"https:\/\/www.themoviedb.org\/review\/52780c5d19c29551451ea171","movie_id":18405}
{"author":"Adam CJ","content":"By far, the SLOWEST horror film I've ever watched! Really don't waste the 95 mins it'll take to watch and be stupidly disappointed (stupidly, because you'll feel like an idiot for getting to the end of the film and realising you were being taken for one the whole time!). This film's writer\/Director\/producer(s) were clearly so besotted with false nostalgia for horror films of the 80s, that they misguidedly picked the worst flaws of the worst films of that era and replicated them here, believing themselves to be making something 'authentic' and true to that time. What they actually made would've been called crap then as much as it should be now! 90 mins of creeping around with no plausible characters, situations or even anything resembling actual *suspense*; then 5 mins of \"whooaaah, look: blood and satanic ritual! Isn't that scary?!\" Answer: NO, IT BLOODY WELL ISN'T! Now give me back the last 95 mins, you fools!","id":"51c71cd619c29575b00175dc","url":"https:\/\/www.themoviedb.org\/review\/51c71cd619c29575b00175dc","movie_id":25983}
{"author":"John Chard","content":"If you push the button, two things will happen.\r\n\r\nThe best quote I ever saw as regards Richard Kelly's The Box, was that it is a Marmite movie. Marmite is a food substance that people either love or hate, The Box is a Marmite movie. \r\n\r\nCameron Diaz and James Marsden star as a couple who are visited by a mysterious stranger (Frank Langella) who has a bizarre offer. The Box now in the couple's possession has a button (Langella's mysterious Arlington Steward informs them it's called the Button Unit), they are told that if they push the button then a complete stranger will die, they will then receive a life changing amount of money. What to do?. \r\n\r\nBased on a Richard Matheson short story titled \"Button, Button\", The Box is an ethereal mind meld of a piece. Morals and ethics are married up to a whole bunch of twists and other worldly ideas, which goes some way to explaining that where once there was a more than adequate half hour \"Twilight Zone\" episode (Profile in Silver\/Button, Button 1986), there is now a near two hour movie crammed to the brim. It's this that hurts an otherwise stylishly produced and potentially thoughtful picture. \r\n\r\nAfter the raves and craves for his \"Donnie Darko (2001)\", Richard Kelly appeared to believe the press praise, that here was a new surreal director on the block. Where \"M. Night Shyamalan\" had success with the twist gimmick and couldn't let it go until his career went in the swamp, so to Kelly who kept straining to make movies that were needlessly over complex, trying to be smart when it isn't needed (\"Southland Tales (2006)\" is a car wreck of a movie). The Box does have intelligence and lots of good ideas, but a two hour film it does not make, with the attempts at weaving all the threads together proving to be too problematic come the finale. Incredulity a most appropriate word, plausibility is not. \r\n\r\nThe Box, an intriguing - attractive - failure, but some do and will love it. If you haven't seen it then roll the dice and good luck. 6\/10\r\n\r\nFootnote: We have yet to actually get an adaptation to screen that contains Matheson's original literary ending!","id":"556b0561925141540800253f","url":"https:\/\/www.themoviedb.org\/review\/556b0561925141540800253f","movie_id":22825}
{"author":"CRCulver","content":"Jim Jarmusch's 2008 film <i>The Limits of Control<\/i> concerns a nameless hitman (Isaach De Bankole) as he prepares to carry out an assassination in Spain. It is not overtly stated that he is a professional, but his uncompromising posture, his unchanging expression and the omnipresent suitcase make it clear from the very first minutes of the film. Isaach De Bankole is perfect in this role, as he has a face that seems carved out of granite. The hitman's few intimations of humanity are thus all the more shocking.\r\n\r\nAs the film proceeds, the hitman meets a series of individuals who send him onwards in his journey to pick up necessary equipment and finally confront his victim. These employees of his mysterious employer are left nameless, though often referred to by items they carry or other qualities: \"Guitar\" (John Hurt), \"Blond\" (Tilda Swinton), \"Violin\" (Luis Tosar), \"Mexican\" (Gael García Bernal), and \"Molecules\" (Youki Kudoh). In engaging the assassin in conversation to subtly convey their messages, they end up delivering eccentric monologues. Many critics lambasted these lines as so much metaphysical babble. In fact, everything said relates very directly to the plot, but this is the sort of film that demands a second viewing to really tie everything together, and those who fail to be intrigued enough on the first viewing to go on to a second may find this film a failure.\r\n\r\nThough Jarmusch alludes to America under the Bush administration at points, this is ultimately a psychological drama: the hitman's task and contacts represent only parts of his own psyche. While some have tried to view this as a simple Freudian struggle between the id, ego, and superego, I feel that Jarmusch is aiming for something more subtle, something that he has great difficult putting into words and, even with his best efforts, this film can only hint at. THE LIMITS OF CONTROL feels like a cinematic analogue to the late albums of Scott Walker, where the songs' characters, cultural references and \"plot\" only serve to express some burning flame in the artist's own psyche.\r\n\r\nJim Jarmusch has always stated that his aesthetic is to absorb everything he can from prior films (and books, music, etc.) and let those inspirations reflect in his own films.<i>The Limits of Control<\/i> abounds with references to the film canon: Jean-Pierre Melville (namely \"Le Samouraï\"), Orson Welles (\"The Lady from Shanghai\"), Alfred Hitchcock, Aki Kaurismäki (\"Le Vie de Bohème\"), Alejandro Jodorowsky (that auteur's entire trippy aesthetic), and probably more that I just didn't recognize.\r\n\r\nThe film's lack of conventional interaction between characters and the compilation of references ultimately makes THE LIMITS OF CONTROL feel relatively cold and lifeless compared to Jarmusch's many other films. Still, the visuals of the film make it a worthwhile experience in spite of its flaws. With Christopher Doyle, funny enough, working the camera, we get a number of beautifully composed shots that will prove memorable.","id":"5b936113925141432800304a","url":"https:\/\/www.themoviedb.org\/review\/5b936113925141432800304a","movie_id":8284}
{"author":"portnoyz","content":"Formula flick + a bit preachy at times,","id":"5cdb66920e0a262d10cac156","url":"https:\/\/www.themoviedb.org\/review\/5cdb66920e0a262d10cac156","movie_id":23410}
{"author":"Wuchak","content":"***What if your stepfather is a psycho?***\r\n\r\nAfter an amiable man (Dylan Walsh) slays his family he starts a new one under a different identity in Portland, Oregon, but his discerning stepson (Penn Badgley) picks up on his dark side. Sela Ward plays the psycho’s new fiancé while Amber Heard is on hand as the stepson’s girlfriend.\r\n\r\n\"The Stepfather\" (2009) is a solid crime drama\/thriller with a bit o' slasher horror, a combination of the original film (1987) and its sequel (1989). All of the Stepfather flicks are loosely based on mass murderer John List. They contain elements of movies like \"Psycho\" (1960\/1998) mixed with coming-of-age drama, like “Fright Night” (1985) and “Disturbia” (2007). \r\n\r\nWalsh effectively portrays the delusional titular character while Badgley is competent as the teen protagonist. Meanwhile the director takes every opportunity to show Heard in a bikini or underwear, but she’s way too thin to stir much interest despite her obvious attractiveness. She’s more appealing after she acquired some curves, e.g. as Mera in “Aquaman” (2018).\r\n\r\nAt the end of the day this is an updated, slightly more compelling version of the first film and its sequel. There are just enough changes to make it worthwhile if you’re familiar with the prior flicks. On the downside, it’s a little predictable, but what else is new? \r\n\r\nThe film runs 1 hour, 40 minutes, and was shot in Los Angeles & Santa Clarita, California (with studio work done in Culver City).\r\n\r\nGRADE: B+","id":"5da8b19db2681f00148de98c","url":"https:\/\/www.themoviedb.org\/review\/5da8b19db2681f00148de98c","movie_id":19904}
{"author":"Wuchak","content":"***Haunting mysteries on the coast of Maine with Emily Browning and Elizabeth Banks***\r\n\r\nAfter her mother dies in a tragedy, a teen girl (Emily Browning) is sent to a mental hospital. Upon returning to her father’s mansion on the coast of Maine, she reunites with her older sister (Arielle Kebbel) and tries to get along with her dad’s new girlfriend (Elizabeth Banks), her mother’s former nurse, who appears to be taking over. David Strathairn plays the father, a successful author.\r\n\r\n“The Uninvited” (2009) is a mystery\/horror that combines elements of “The Sixth Sense” (1999), “Half Light” (2006) and “The Ring” (2002), although it’s a little more subdued than the latter. If you like the haunting tone of those movies and the spectacular locations of the latter two, you’ll appreciate it. Browning with her ultra-cute face was 20 during filming, but looks 14. Meanwhile Banks is effective as the biyatch gold-digger and Strathairn is convincing as the clueless father.\r\n\r\nThe story plays out in a too-predicable manner. If you saw the trailer beforehand it basically tells you everything you need to know. But not really: The last 15 minutes pulls the rug out with some surprising revelations. I heard there was a twist before viewing and went over various possibilities in my mind while watching, but the movie fooled me. Great job on this front. Not everything is as it appears. I’d say more, but I don’t want to spoil it.\r\n\r\nMy relatively high rating is due to the lingering power of the film's message on individual perception. It's potent and applicable stuff, expertly executed.\r\n\r\nThe film doesn’t overstay its welcome at a mere 1 hour, 27 minutes. It wasn’t shot in the Northeast, however, but obviously British Columbia (Bowen Island). It’s an American remake of the Korean film “A Tale of Two Sisters” (2003).\r\n\r\nGRADE: B+\/A-","id":"5d3600fbbefb090c06b7f087","url":"https:\/\/www.themoviedb.org\/review\/5d3600fbbefb090c06b7f087","movie_id":14254}
{"author":"Andres Gomez","content":"Disturbing and sometimes really disgusting. Not to be watched while eating.","id":"53f11b23c3a3685ae2003037","url":"https:\/\/www.themoviedb.org\/review\/53f11b23c3a3685ae2003037","movie_id":22536}
{"author":"flabob257","content":"This was a very good movie.  I never heard of this movie so i was watching my tv,lazy day so i left this on  my tv and i was really interesting movie.   I will give a 9 out of 10","id":"5af72529c3a3682ac800074c","url":"https:\/\/www.themoviedb.org\/review\/5af72529c3a3682ac800074c","movie_id":7980}
{"author":"uNiversal","content":"TODAY’S SPECIAL is a heartwarming comedy with a culinary flavor, co-written by Aasif Mandvi, Jonathan Bines, and directed by David Kaplan (Year of the Fish).\r\n\r\nIt tells the story of Samir (Aasif Mandvi, The Daily Show with Jon Stewart, THE LAST AIRBENDER) who is a sous chef who dreams of becoming the head chef at an upscale Manhattan restaurant. When he is passed over for a promotion he impulsively quits and lets his co-worker Carrie (Jess Weixler, TEETH) know that he intends to go to Paris and apprentice under a master French chef. Dreams must be put aside though after his father Hakim (Harish Patel, RUN FAT BOY RUN) has a heart attack and Samir is forced to take over Tandoori Palace, the nearly bankrupt family restaurant in Jackson Heights.\r\n\r\nSamir’s relationship with his parents and his heritage is immediately put to the test. He has been estranged from his father since the death of his older brother, and his mother Farrida, (played by legendary cookbook writer and actor, Madhur Jaffrey), is consumed with finding a wife for her remaining son. While Samir is being forced to forsake his dreams, he is desperately trying to master Indian cooking to salvage the family business.\r\n\r\nLuckily, he crosses paths with Akbar, a taxi driver, passionate chef, and worldly raconteur (portrayed by the icon of Indian cinema, Naseeruddin Shah, MONSOON WEDDING). Akbar inspires Samir and teaches him to trust his senses more than recipes; to stop measuring his life, and to start truly living it. With Akbar’s guidance, Samir has a chance to rediscover his heritage and his passion for life through the enchanting art of cooking Indian food.\r\n\r\nToday’s Special was inspired by the Obie Award winning play, Sakina’s Restaurant, a one man show written and performed by Aasif Mandvi, developed and directed by Kimberley Hughes.","id":"51371c7f19c2957a722cda92","url":"https:\/\/www.themoviedb.org\/review\/51371c7f19c2957a722cda92","movie_id":46641}
{"author":"Dan_Tebasco","content":"**I liked it better when it had Keanu Reeves, Sandra Bullock and Dennis Hopper in it**\r\n\r\nNeedless to say SPEED (1994) was definitely an inspiration for this movie, to the point that if they'd switch things around just a little bit it could have been a sequel to it.\r\n\r\nAnd even though John Cena is better than he usually is in movies, he's just no Keanu (did I say that? Oh yes I did).\r\n\r\nAnd Ashley Scott is definitely no Sandra Bullock and furthermore Aidan Gillen no Dennis Hopper.\r\n\r\nThat said, it's not terrible, SPEED (1994) to me is just one of the best blockbuster action movies of the 90's so the chance that it would match up to it would really be second to none.\r\n\r\nAnyway back to this movie, it's okay fairly mindless popcorn entertainment, Renny Harlin is good when it comes to action-sequences and yet again he delivers on those aspects.\r\n\r\nI'm usually not bothered to much over shaky cams but this movie contains a overabundance of that and occasionally you wish they would just use steady cam but what can you do? not much.\r\n\r\nThere's really not that much more to talk about the movie, it's not a bad movie we've just seen it before.\r\n\r\nIt's the best movie I've seen with John Cena at least, there is always that.","id":"591edbc8c3a3687a64031f0e","url":"https:\/\/www.themoviedb.org\/review\/591edbc8c3a3687a64031f0e","movie_id":17134}
{"author":"Andres Gomez","content":"Master piece of how to tell a simple but deep story in the best and more realistic way.\r\n\r\nWell chosen cast, really good staging, dialogues and performance.\r\n\r\nA really good movie.","id":"532aee89925141083c001517","url":"https:\/\/www.themoviedb.org\/review\/532aee89925141083c001517","movie_id":32511}
{"author":"Wuchak","content":"Blundering, but well-meaning mall cop tries to be John McClane (“Die Hard”)\r\n\r\nAn affable mall officer in New Jersey (Kevin James) takes his job seriously while taking care of his daughter and pursuing a cute kiosk attendant (Jayma Mays). When the mall is taken over by a gang of organized thugs, can Paul Blart rise to the challenge?\r\n\r\nWhether or not you’ll like “Paul Blart: Mall Cop” (2009) will depend on if you appreciate Kevin James and his goofy, unprofane brand of humor, as depicted in The King of Queens, “Zookeeper” (2011) and “True Memoirs of an International Assassin” (2016). While it’s not as good as “Zookeeper,” it’s not far off. After the first 25 minutes or so you’ll find yourself engrossed in Paul’s life; you understand him and like him. You feel for the man as he gazes longingly at a receipt with the handwritten name of his romantic interest. And you’ll root for him and laugh when a serious threat engulfs the mall.\r\n\r\nKeir O'Donnell plays Paul’s greenhorn partner, Veck. He’s reminiscent of a young Tim Roth. In other news, Mays has the cutest wide-eyed face.\r\n\r\nThe film runs 1 hour, 31 minutes and was shot entirely in Massachusetts (Burlington, Braintree, Peabody, West Roxbury and Bedford).\r\n\r\nGRADE: B","id":"5b7dca7bc3a368340f006370","url":"https:\/\/www.themoviedb.org\/review\/5b7dca7bc3a368340f006370","movie_id":14560}
{"author":"ohlalipop","content":"I don’t really get why this movie got an Oscar nomination. I mean it’s watchable but I don’t think it’s Oscar-worthy. I think this movie is too simple to be nominated. There were some funny parts but it’s more of a “LOL” than “LMAO”. Script wise, it’s nice. It’s kind of real in a way since a lot of people are losing their jobs because of recession. I think that’s one of the reasons why people liked this movie because it is what’s happening right now in the USA.","id":"589c5a2592514126040089e4","url":"https:\/\/www.themoviedb.org\/review\/589c5a2592514126040089e4","movie_id":22947}
{"author":"John Chard","content":"Surrogacy is a perversion. It's an addiction. And you have to kill the addict to kill the addiction. \r\n\r\nI first viewed Surrogates upon its home format release and positively found it very ordinary. Viewing it again, with focus and in solitude, it proved to be a far better experience.\r\n\r\nThe action scenes are what you would expect for a multi-plex appeasing popcorner, loud, colourful and owing great debt to modern technology. Yet to dismiss this totally as one of those easy money making blockbuster movies is most unfair.\r\n\r\nSurrogates oozes intrigue, even if it doesn't quite deliver on the smartness written on the page. The idea that in the future robotic alter egos can carry out our everyday mundane functions is cracker-jack, and it opens up a whole can of berserker worms. \r\n\r\nThis is not merely an excuse to have Bruce Willis running around exploding surrogate robots, as much fun as that is of course, there's a deeper emotional core pulsing away as Willis fights the good fight to make sure being human is not cast aside like a thing of the past, that as flawed as we are, hiding away in a surrogate is not the answer.\r\n\r\nThis axis of the story is beautifully realised by the plot strand involving Willis and Rosamund Pike as his wife, with both actors doing fine work to give it the required emotional heft. It may ultimately lose itself to a standard conspiracy plot, but there's intelligence within to make Surrogates a better film than it first appears. 7\/10","id":"5da91a96ce6c4c0012b66200","url":"https:\/\/www.themoviedb.org\/review\/5da91a96ce6c4c0012b66200","movie_id":19959}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI haven't seen Zombieland in quite a few years, but with its sequel being released this week, now it's the perfect moment to go back to the hilarious world of zombies. It still holds up incredibly well. In a time where zombie films and TV shows were starting to come up (The Walking Dead premiered one year later), this post-apocalyptic zombie comedy flick still remains as one of the best zombie movies of the century. Their use quickly became something cliche, and neither funny or scary. Nowadays, people are used to seeing the living dead on the screen all the time, so why does a 2009's film like this still work?\r\n\r\nWell, first of all, the outstanding cast is halfway through success. In 2009, only Woody Harrelson was already a renowned adult actor. Emma Stone and Jesse Eisenberg didn't star in anything truly remarkable yet, so much that Abigail Breslin was more recognizable than them. Even with only 13-years-old, she already had an Oscar nomination in a supporting role (Little Miss Sunshine). However, everyone delivers fantastic performances, which carry the simplistic yet entertaining story to such a success that it became a zombie classic.\r\n\r\nHarrelson portraying Tallahassee, the guy who's not scared of anything and likes to \"enjoy the little things\", is one of his career's coolest roles. Eisenberg is not exactly the type of actor I like since he can only do so much with his acting abilities. He always offers the same type of character: a quirky, twitch-full, idiosyncratic personality, which most of the times doesn't work. Contrary to this tendency, Columbus is a character that logically and hilariously fits this model, hence Eisenberg is the movie's primary source of comedy. From his list of rules to his weird behavior, everything feels natural since the character's background justifies his awkward self.\r\n\r\nStone and Breslin share great moments together, as well as Harrelson and Eisenberg, but the former duo has less exciting sequences. Nevertheless, even though the girls could have received more character development, their relationship gives them a compelling reason for us to care about. Wichita might just look like the cliche hot girl who falls for the good guy, but she would do anything to protect her sister, and her love for Little Rock does give her some gravitas. The cast's chemistry is undeniably astonishing. It's visually palpable that they had tons of fun doing this film, and that elevates every single conversation or action scene.\r\n\r\nThe short runtime allows for a fast-paced story, packed with fun moments, and a lot of bloody zombie killings. The production design is remarkable. Excellent use of practical effects and real sets, plus a perfect soundtrack. Ruben Fleischer knew precisely what he wanted the movie to be, and he never tried to make it something more. Yes, it still involves a romance of sorts, and some backstories might not be funny or joyful. However, it never feels forced or fabricated. It never overextends its stay because Zombieland is neither a romance or a drama. It's purposefully campy, plays with stereotypes creatively, and it's merely 88 minutes of good fun. We are in 2019, and studios forgot how to make films like this!\r\n\r\nEvery year, there are dozens of blockbusters that would be extremely entertaining if studios would just let them be what they are meant to, but no. They need to have some relevant story that carries a political tone or a social message. Zombieland has all the attributes of a pure blockbuster: a phenomenal cast, a straightforward narrative packed with thrilling sequences, a short runtime with fast pacing, compelling characters, and thousands of zombies. Put together a funny screenplay filled with chuckle-worthy jokes, and you have yourself one of the best zombie movies of the century. It's one of those films which don't exactly have what people address as \"flaws\". Zombieland has its cliches and lazy exposition, but it heavily compensates them with 80 minutes or so of spectacular entertainment. It's a zombie cult classic. Nut up or shut up, but watch the goddamn movie!\r\n\r\nRating: A-","id":"5db4385625a5360018e33363","url":"https:\/\/www.themoviedb.org\/review\/5db4385625a5360018e33363","movie_id":19908}
{"author":"Andres Gomez","content":"Fun, not that fun to have a higher mark than a 5\/10.","id":"52945afd760ee305d8027f7a","url":"https:\/\/www.themoviedb.org\/review\/52945afd760ee305d8027f7a","movie_id":19908}
{"author":"Andres Gomez","content":"Really good movie.\r\n\r\nGood script, well told and well directed. The cast makes a great performance, both, grandmother and son.\r\n\r\nMaybe, the weakest point is an inconclusive ending which, actually, fits perfectly but leaves too many open questions. Fits, because the whole movie is open, from the beginning to the end, since the point is bringing us to the reality of a devastated Iraq and how the population survives under a mountain of pain.","id":"56c31a17c3a36825fb002486","url":"https:\/\/www.themoviedb.org\/review\/56c31a17c3a36825fb002486","movie_id":56807}
{"author":"Reno","content":"**In the 17th England, a ruthless warrior set to rediscover his path.**\r\n\r\nThere's no reason, but after a long due I saw this. I'm pretty impressed with the film's production, but in the end it was an average film for me. James Purefoy was good, but the story needed someone very husky looking actor to play the Solomon. That's what spoiled my watch, other than that I enjoyed most of the film. Because the tone and the pace were excellent, but it was a predictable story.\r\n\r\nA savage warrior leading his men somewhere in the Northern Africa, when he's sensing he almost defeated them, comes to know his soul is damned. He escapes there, leaves his all that life behind and looks for a peaceful future. He was born to be a warrior, that's why he left his own kingdom. So in his second chance to rediscover his path, he must achieve the impossible to defeat his opponent.\r\n\r\nFull of dark and wet atmosphere really gives that required medieval look. The locations were well used and also the costumes, so if you like films that sets in this era, particularly stunts, then you might enjoy it. But if you ask me, I would say it is just a one time watchable film. Entertainment is guaranteed, but because of something, the film does not not look complete. So recommended for the selected viewers.\r\n\r\n_6\/10_","id":"57f412979251417fe3001881","url":"https:\/\/www.themoviedb.org\/review\/57f412979251417fe3001881","movie_id":32985}
{"author":"Wuchak","content":"***Wannabe edgy slasher “remake” with distasteful characters and shaky cam***\r\n\r\nDuring a sorority party in the Pittsburgh area a student accidently dies. Those involved in the prank-gone-wrong make a pact to cover it up, but during graduation eight months later members of the agreement start showing up dead and it becomes clear that the killer knows their macabre secret.   \r\n\r\n“Sorority Row” (2009) has the same plot as “The House on Sorority Row” (1982), but the story & characters are totally different. I heard good things about this slasher, but was disappointed. Don’t expect the worthwhile ‘remakes’ of “My Bloody Valentine” (2009), “Black Christmas” (2006), “The Fog” (2005), “Fright Night” (2011), “House of Wax” (2005) or “Friday the 13th” (2009). \r\n\r\nWhat’s wrong with “Sorority Row”? There’s too much faddish shaky cam, which gets annoying; and the outdoor colors are faded, which is also annoying. The cast of females is decent, with Rumer Willis (Ellie), Briana Evigan (Cassidy) and Caroline D'Amore (Maggie) standing out (Audrina Patridge’s role is too small to note), but the wannabe edgy tone makes it hard to warm up to any of them. It doesn’t help that the directors don’t know how to photograph women. \r\n\r\nIn addition, the ending “reveal” is unconvincing and unsatisfying. There are other eye-rolling problems, like why Maggie would stand in front of car and risk death for no ostensible reason.   \r\n\r\nThe movie runs 1 hour, 41 minutes, and was shot in the Pittsburgh area as follows: Homestead, Crafton (interiors), Washington (aerial views) and Soldiers and Sailors Museum and Memorial (graduation scenes).\r\n\r\nGRADE: C-","id":"5e668a998d52c9001d3f6d6a","url":"https:\/\/www.themoviedb.org\/review\/5e668a998d52c9001d3f6d6a","movie_id":26688}
{"author":"John Chard","content":"If I kill you I am bound for hell. It's a price I shall gladly pay.\r\n\r\nSolomon Kane is directed by Michael J. Bassett and Bassett adapts the character of Kane from the magazine character created by Robert E. Howard. It stars James Purefoy, Rachael Hurd-Wood, Pete Postlethwaite and Anthony Wilks. Music is by Klaus Badelt and cinematography by Dan Laustsen.\r\n​\r\nIt's early 1600 and English mercenary Solomon Kane (Purefoy) is informed by the Devils Reaper that his wicked ways have damned his soul for eternity. Not wanting to spend eternity with old Nick and all his hellish instruments of torture, Kane escapes and renounces violence and converts to Puritanism - that is until a wicked turn of events in his life sends him on the violent road to redemption.\r\n\r\nSolomon Kane was created by pulp writer Robert E. Howard, who would a few years later also create Conan The Barbarian, safe to say then that swords and sorcery was at the time of his life in the 1920s\/30s on his mind. It's also safe to say here that if this type of genre swish and swash is not your thing then this will definitely not convert you into being someone who suddenly does. However, fans of such fare are in for a treat, where not for the first time a picture that bombed at the box office - and got a delayed release in The States - has broken free of supposed stinker damnation to become a firm cult favourite to like minded souls.\r\n\r\nKane is our anti-hero, a real hard dude who ends up living by the fight evil with evil mantra. In the hands of Purefoy and his director, Kane is moody personified, the whole film dishing out ladles of brood and dark thematics as religion and dark arts come under the microscope. The action is well choreographed, plenty of blood letting and head loping, accompanied by swivels and lurches. Imagery is potent - such as graveyards and reaper lairs, while Bassett firmly believes in soaking his cast in mud and rags, all for realistic payment.\r\n\r\nSome popular actors slot in for some support work, which is a bonus, and although the finale is not without problems (main baddie all to brief, the big showdown likewise), this rounds out as an imaginatively and thrillingly mounted period genre piece. 8\/10","id":"5c742312c3a3685a4019abae","url":"https:\/\/www.themoviedb.org\/review\/5c742312c3a3685a4019abae","movie_id":32985}
{"author":"John Chard","content":"The Salvage Savage.\r\n \r\nSalvage is directed by Lawrence Gough and written by Colin O’Donnell and Alan Patterson. It stars Neve McIntosh, Shaun Dooley and Linzey Cocker.  \r\n \r\nIt’s Christmas Eve, The Wirral, Merseyside, and 14 year old Jodie is reluctantly spending Christmas with her estranged mother, Beth. But family strife is to be the last of their worries, for soon this small cul-de-sac in the North West of England will become a battle for survival as something is loose and on the kill, and the army has got itchy trigger fingers…\r\n \r\nIt’s perfectly understandable that some horror lovers come out of watching Salvage immensely disappointed at getting yet another spin on the “creature\/infected human\/zombie on the loose” formula. There’s nothing exactly fresh here in terms of plotting, but considering the minimalist budget and sparsity of production aids, first time director Lawrence Gough has done a bang up job with this picture. The suspense factor is high, where McIntosh’s (excellent) frantic mother tries to stay alive long enough to rescue her daughter from a house just across the road. Something which sounds simple in premise, but as the film unfolds, this proves to be a tense, fraught and nail biting mission. While the fact that the two main characters have been humanised, deep flaws and all, puts added spice to the survivalist horror.\r\n \r\nAs Mcintosh and Dooley (very good), the latter a one night stand liaison forced into the battle for survival along with some self examination, prowl around with fear and stoic bravado, themes of paranoia, prejudice and military over-kill slide easily alongside the jolts and blood. Nothing is crowbarred in here, the gore is kept in check and the politico rumblings remain just that, rumblings and not vociferous lectures over the loud speakers. The mystery element remains strong as well, where it’s so nice to see a fledgling director not playing the hand too early. Once the “reveal” comes we are in frantic territory as we literally hurtle through stalk the prey land and finish with a finale that is bleak and deserves credit for having the audacity.\r\n \r\nIt’s badly under valued on the big internet movie sites, which is a crying shame, because it is damned by familiarity of other genre pieces, where the low budget skill in the film making process doesn’t appear to be taken into consideration. No this is not a terrifying and breakneck paced picture, but it has its moments without doubt and certainly deserves better appraisal notices than those afforded the likes of Creep and the recently awful Storage 24. 7\/10","id":"52780dea19c295601106fe27","url":"https:\/\/www.themoviedb.org\/review\/52780dea19c295601106fe27","movie_id":39814}
{"author":"John Chard","content":"The Jigsaw Killer may be dead but the murders still continue...\r\n\r\nSo where were we at now then? Detective Hoffman (Costas Mandylor) is still continuing to do the bloody work of the dead John Kramer\/Jigsaw (Tobin Bell). In his sights is William Easton (Peter Outerbridge), an unfeeling insurance head who turned down claims by Kramer and a myriad of others on pathetic technicalities. Cue more elaborate traps, painful decisions and some twisty devilment. Yep! It's another Saw movie.\r\n\r\nSomewhat surprisingly, part 6 is a step up in quality of writing and ingenuity of gore\/trap factors from the previous two installments. It's still very much old hat as a formula, and once again the sequences of Bell used in flashback show him to be the franchise's strength. However, the makers put at the core an insurance issue that everyone can identify with, whilst piling on mystery and suspense by way of Jigsaw's left envelopes and the FBI closing in on an increasingly overt confident Hoffman. 7\/10","id":"5619d0c59251411ada000a14","url":"https:\/\/www.themoviedb.org\/review\/5619d0c59251411ada000a14","movie_id":22804}
{"author":"John Chard","content":"A franchise re-energised-big time! \r\n \r\nIt's not an understatement to say that the news of a new Star Trek movie was met in equal measure by suspicion and pretty low expectations. Step forward J.J. Abrams to direct it, and many wondered while the guy behind TV series \"Lost\" and \"Mission Impossible III\" would want to dabble on hallowed sci-fi turf?. Things were further eyebrow raising when Abrams openly admitted to not having been a fan of the original show so cherished by a legion of Trekkies. Then news came of the film being a prequel, based around the Starfleet Academy and the coming together of what we know as the U.S.S. Enterprise crew. \"Ooh that will be a tough one to carry off\" said many, \"Kirk & Spock as young spunkers - surely not\" they said. Well not only did Abrams pull it off as it were, he simultaneously appeased most Trekkies whilst garnering a whole new generation of sci-fi observers. Budgeted at $140,000,000, Abrams Star Trek went on to gross Worldwide $384,953,778. Figures that, even allowing for the huge fan-base that the franchise has, show that many first timers not only went to see it - but also that they enjoyed it so much they went back for second helpings. I know I did.\r\n\r\nThe success of the film isn't hard to fathom, because although Abrams upped the action quota (with a number of breath taking and eye appealing sequences) he also dispensed with much of the sci-fi psycho babble that has blighted some of the previous filmic instalments in this most up and down of franchise's. Sure there's stuff in there for the discerning fan, with a time travelling revenge plot at its axis, how could there not be?, But Abrams and his writers (Roberto Orci \/Alex Kurtzman) keep it simple, savvy and sexy. They smartly link to Trek lore with a crucial plot and character development featuring the Kobayashi Maru, while pain, emotional conflict and personal crisis all feature heavily. This is, one can \"logically\" say, a spiky post 9\/11 Trek movie. There's even room for a romantic strand, a strand that is tender and fits the whole make-up of the piece perfectly. All of which only works because the cast are, in the main, producing great work.\r\n\r\nGetting Leonard Nimoy to appear in a small, but crucial role, is nothing short of being a master-stroke. His presence keeps the all important essence of Star Trek within what is ultimately a reboot. It's like a father figure watching over proceedings, making not only the cast feel safe, but also us the viewers. The youngsters in the cast are impressive, Chris Pine (Kirk), Zachary Quinto (Spock) and Zoe Saldaña (Uhura) lead from the fresh faced front. While Karl Urban (Bones McCoy) and Simon Pegg (Scotty) impact with comic relief that aids instead of hinders the plot developments. Villain duties falls to Eric Bana as Romulan Captain Nero, he's a touch miffed is Nero, and Bana brings the character's vengeful pain vividly to life. While Bruce Greenwood as Captain Christopher Pike adds a touch of class that he almost always seems to do.\r\n\r\nThis U.S.S. Enterprise has launched itself in another direction, and yes, it's boldly going where no-one has boldly gone before. It is, all told, a bona fide blockbuster with brains and balls. The like of which has sadly been missing from many a modern era summer release. Yes it's not all perfect, the odd scene could quite easily have been jettisoned, and some accents need a bit of fine tuning, but they are very minor complaints. A triumph from Abrams and his team - note the Stardate in the ships log, for this is a noteworthy moment in modern sci-fi cinema. Now comes perhaps a bigger challenge, the notoriously difficult second film...  10\/10","id":"5e80b0f276484100153e1997","url":"https:\/\/www.themoviedb.org\/review\/5e80b0f276484100153e1997","movie_id":13475}
{"author":"Dan_Tebasco","content":"**_I'd rather watch this than any of the Iron Man films__**\r\n\r\nNo, it's not amazing and no the story is not an emotional journey that makes you both laugh and cry... but.\r\n\r\nIt's a video-game adaption, and you really can't go in to them thinking they are gonna blow your socks off because really, most of them aren't that great.\r\n\r\nThe 1994 Jean Claude Van Damme adaption was genuinely awful and that was pretty true to the (no) plot of the video-game so of course they had to do something different here, which I am glad they did, not just fighting all the time but an actual story.\r\n\r\nNow of course the story does have a bunch of plot holes (but honestly what video-game adaption that doesn't?) and Chris Klein's acting in particular is pretty dodgy, he plays a tough guy cop which he tried to do again in CAUGHT IN THE CROSSFIRE (2012) but he fails every time.\r\n\r\nI like him fine usually but yeah he's not at all believable as a 'bad ass'.\r\n\r\nBetter is Kristin Kreuk in the lead and Michael Clarke Duncan and Neal McDonough are pretty cool as the bad guys.\r\n\r\nAnd most of the fight-scenes are pretty well orchestrated (except perhaps the dance-club scene) and the cinematography is good and keeps at a good pace plus a pretty good soundtrack as well.\r\n\r\nAll in all, not a 'great film' but perfectly watchable if you leave your thinking cap on the shelves and just take it for what it is, if you enjoyed ELEKTRA (2005) you should be able to enjoy this... If you didn't (which granted many didn't) then tread carefully I suppose.\r\n","id":"5a562104c3a3685ebf022c43","url":"https:\/\/www.themoviedb.org\/review\/5a562104c3a3685ebf022c43","movie_id":15268}
{"author":"Andres Gomez","content":"Good movie, great cast and interesting plot.\r\n\r\nA movies as they used to be when interesting thrillers were on the screens with higher frequency.","id":"526a275719c2957f6106ec40","url":"https:\/\/www.themoviedb.org\/review\/526a275719c2957f6106ec40","movie_id":16995}
{"author":"Gimly","content":"**The following is a long form review that I originally wrote in 2013**\r\n\r\nI did like _Star Trek_. I did not, however, appear to like it as much as the rest of the whole damn planet.\r\n\r\nI appreciate the decent helping of Australian actors in the mix (like personal favourite Chris Hemsworth, above). I can get behind the colourful and impressive special effects spectacle. Most of all I dig the reboot angle they pulled. The whole time travel\/tangent universe thing is the perfect breeding of remaining true to the original, while still not constricting themselves to the old canon. Fantastic idea.\r\n\r\nBut I didn’t love it. I’m a big fan of origin stories, but I personally feel that _Star Trek_ never really breached past that point. The first half was brilliant, getting to know the characters, the world, the ideals, everything. But in the latter half it seems they just sort of went “Well, we spent a bunch of time doing stuff good, but now we don’t have enough time left to make an actual movie out of this… Oh well, just chuck an hour of lasers in there and we’ll worry about that next film!” which just isn’t good enough. When _Into Darkness_ comes out later this year, the format will probably pay off, but looking at the merits of Star Trek alone, I think it fell short.\r\n\r\nSimon Pegg (_Hot Fuzz, Shaun of the Dead_) as the new Scotty and Zachary Quinto (_American Horror Story, Heroes_) as the new Spock were both solid choices, but other casting decisions like Winona Ryder (_Black Swan, Alien: Resurrection_) as Spock’s mother were an off-shot in the worst possible way.\r\n\r\nI suppose though, in science fiction, it’s often safety first and little steps. As a member of what is probably the most frowned upon of the genres, I wish this Star Trek reboot all the best in its inevitable future, and it seems it will make good use of it. But for now, the solo film itself didn’t reach as far as I felt it could have with a little harder work towards the end.\r\n\r\n62%\r\n\r\n_-Gimly_","id":"5bb59d610e0a26339d00793a","url":"https:\/\/www.themoviedb.org\/review\/5bb59d610e0a26339d00793a","movie_id":13475}
{"author":"r0bot","content":"Different people look for different emphases in prenatal yoga (and yoga in general), but I was looking for something that had an even balance between stretching, strengthening and meditation, with the mediation helping me relax my body and connect to my baby. Others I've tried, and there have been many (by Shiva Rea, Jennifer Wolfe, Ann Richmond, Elena Brower and others), have either been too complicated and rigorous an aerobic fitness, for me meaning changing poses too quickly, for someone with minimal (but not no) yoga experience, with very skinny pregnant women, which managed to make me feel self-conscious even alone at home (I'm more average-in the size 6-8 range) which was just no fun, or on the other end, some others were a little too hippy-dippy for my taste, with what felt like an overdone and overly earnest emphasis on eastern philosophy lingo, without actual eastern philosophy. This DVD has a voice over description of the poses rather than someone talking while doing the poses, which I prefer, because it feels as though the voice is talking us both through it together. Many of the other DVDs, I'd try for 10-20 minutes and then give up, either tired and frustrated or bored. I make it through this one regularly, as it has great pacing, and I feel energized afterwards. You can also do this in sections (floor, standing, meditations at the beginning and end). I'm now in my third trimester, week 38 to be exact and I can still do and enjoy this tape, with my own modifications. Plus I love the look and music in this, which is simple and understated, spanish guitar, and also with an option to play without instruction, if you really feel comfortable with the poses (I never got to that point, but I like the option). I really like the simple and genuine references included throughout that help me connect me to the baby. Beautiful overall.","id":"552ead279251410965000a4d","url":"https:\/\/www.themoviedb.org\/review\/552ead279251410965000a4d","movie_id":335906}
{"author":"ViciousSnowflake","content":"This is kind of a rough movie to watch. A very victimized and bullied teen tries to get through life. It ends on a fairly positive note but damn. Incest babies is just a weird, skin crawling topic for me so that is always going to be rough to go through.","id":"5e8e7ca8d35dea0013723049","url":"https:\/\/www.themoviedb.org\/review\/5e8e7ca8d35dea0013723049","movie_id":25793}
{"author":"Wuchak","content":"***People with various mental abilities fighting each other in Hong Kong over a suitcase***\r\n\r\nThree individuals with mind powers in Hong Kong (Chris Evans, Dakota Fanning & Camilla Belle) vie with agents of a shadowy government agency called the Division over a mysterious suitcase. The super powers include pushers, who can push thoughts into other’s minds; movers, who have the power of telekinesis; watchers, who are seers; sniffers, who can find others; shadowers, who can block watchers and sniffers; screamers, who can attack through shrieks; and more. Djimon Hounsou plays the head agent of the Division. \r\n\r\n“Push” (2009) is a thriller that combines the style and themes of “Lucy” (2014) with the surreal take on a major Asian city of “Lost in Translation” (2003). Imagine the abilities of Professor X, Jean Grey and Magneto of the “X-Men” flicks, but without the costumes and superhero trappings, and you’d have a good idea of “Push.” The setting of Hong Kong is a highlight, but it focuses mostly on the working class underbelly rather than the posh areas of Tokyo seen in “Lost in Translation.”\r\n\r\nThe style is hip and kinetic, like “Lucy” and “Eye of the Beholder” (1998), and the film does a good job of keeping the complicated elements understandable to the viewer. There’s also a quality score\/soundtrack. Yet it’s the least of all these pics mentioned. The story’s just not as engrossing, but it’s not too far off either. The Division is suggestive of MK Ultra on steroids.\r\n\r\nThe film runs 1 hour, 51 minutes and was shot in Hong Kong.\r\n\r\nGRADE: B-","id":"5cc6849592514151ca06b629","url":"https:\/\/www.themoviedb.org\/review\/5cc6849592514151ca06b629","movie_id":13455}
{"author":"Andres Gomez","content":"Just, a complete joke ... but not very funny.","id":"539eff87c3a368280b0000f0","url":"https:\/\/www.themoviedb.org\/review\/539eff87c3a368280b0000f0","movie_id":14451}
{"author":"Per Gunnar Jonsson","content":"Given my Scandinavian origin and being a bit of a fan of all kinds of science fiction, fantasy, action and horror movies I of course had to have Dead Snow in my collection. Last Saturday me and my son got around to watch it.\r\n\r\nDead Snow is a pretty classical teenage-group-gets-into-big-mess-with-supernatural-beings kind of horror movie. In this particular case a group of teenagers goes for a hike in the Norwegian mountains where they camp in cabin. Not very original of course but what the heck, it is a zombie horror movie so…\r\n\r\nOne thing that makes the movie a bit original is that it is not so totally over the top with foul language and insane consumption of all kinds of drugs as the standard Hollywood crap. These teenagers actually behave fairly normally drinking a few beers and having a good time. Well that is until the mysterious stranger, who is in the movie just to set up the mood, shows up and tells his story about a unusually cruel Nazi officer and his men. Of course we all know where things are going from there…\r\n\r\nHere the movie starts to follow the usual recipe for these kind of movies. Naturally one of the teenagers needs to take care of some natural needs and separates himself from the rest of the party. Then follows the obligatory boy and girl having sex scene. This time in a old-fashioned Scandinavian “skithus” separated from the actual cabin. Anyone who has ever used one of these (I have and they stink) would know that you have to be pretty horny, drunk or both to have sex in one of those. Anyway, that was one less teenager in the party.\r\n\r\nSlowly the zombies become more frequent and the dire situation the party is in becomes more and more evident. As the zombies become more frequent so does the gory sequences and eventually the movie turns more into a comedy than a horror movie. I have to say that the Tommy Wirkola have little to learn from his Hollywood counterparts when it comes to horror movie violence. Body parts, external as well as internal, flies around like there was no tomorrow. Which for most of the characters involved is exactly the way it is.\r\n\r\nOn the whole this movie was one part classical horror movie and one part comedy and I found it quite entertaining but you have to be into these kinds of movies to feel that way of course.","id":"5608f8739251411adb00209e","url":"https:\/\/www.themoviedb.org\/review\/5608f8739251411adb00209e","movie_id":14451}
{"author":"DoryDarko","content":"Sometimes a film can turn out to be nothing like you expected, and it can be a real challenge not to be completely disappointed, but rather try and keep an open mind about what you're watching instead of dismissing it just because it's not what you thought it would be. Because every now and then, you just need to let something surprise you. Defendor is just such a film.\r\n\r\nAt first glance, everything about this film just screams 'hilarious comedy' (trailers can be so misleading...). Perhaps it was the production company's intention to promote it as such, but it is nothing of the sort. But then again, if they were afraid a dramatic film about a sympathetic loser who thinks he's a superhero wasn't going to fly with the audience, they shouldn't have made it in the first place. But they did and here it is, and it's no surprise it wasn't a big box office success. That's bad promotion for you.\r\n\r\nNevertheless, Defendor certainly has its charm, mostly, if not completely, thanks to Woody Harrelson. I've personally never seen him fail, and there's something about the way he plays this character that just makes him instantly lovable. He plays a really sweet, 'intellectually challenged' man named Arthur Poppington who prefers to be addressed as his vigilante alter-ego Defendor (with an O!), blindly convinced of his duty to defend the needy. The fact that he has no real skills, hardly any physical strength and relies on marbles, angry wasps and lemon juice as his weapons of choice, never deter him in any way. In fact, they're exactly the ingredients that make up his identity. \"Guns are for cowards!\" is his credo.\r\n\r\nBut it's only fun and games until he assaults the owner of a dry cleaner's and is placed under court-ordered psychiatric supervision. Here his story slowly unravels and it becomes apparent that there's much more to this silly, troubled superhero wannabe than meets the eye. In conversations with his psychiatrist we learn of his friendship with a young hooker named Kat and his obsession with catching his arch enemy, Captain Industry, whom he holds responsible for a traumatising experience in his childhood.\r\n\r\nLet me start with the films plus points. First of all, the cast is great. Like I said, Woody Harrelson never fails and his portrayal of Defendor is charming, sympathetic and just plain sweet. He is a simple man, but his intentions are genuinely heartfelt and righteous. When he's not fighting crime (with marbles...) he tries to help this girl Kat to kick her habit of drug use. And of course, he ends up needing her just as much as she needs him. This character is played by Kat Dennings, who is not yet very well known, but I have a feeling she definitely will be. I think she has more personality and talent than most \"glamorous\" young actresses that you see in every magazine these days, and she's very pretty, so that should work in her favour. Her character in this film is a tough, streetwise young woman, who has seen more and done more than any girl her age should, and she plays her role with style. Actually, the film mostly revolves around the chemistry between these two characters, and that chemistry is great.\r\n\r\nElias Koteas plays an undercover cop, Dooney, who keeps getting in Defendor's way. Although he is a good actor, his role here isn't very memorable. The same goes for Sandra Oh, who plays Arthur's psychiatrist. Not bad, but not irreplaceable. Basically, these characters could have been played by anybody. But that has more to do with the fact that these characters simply weren't written interestingly enough.\r\n\r\nAlthough Defendor is said to be a comedy, the funny moments are few and far in between, and although these moments are pretty hilarious here and there, there really aren't enough of them for this film to qualify as a full-fledged comedy. And that's not a bad thing, but if you're going to watch it, you should understand that this film is more of a drama film than a comedy, it's simply too dark and heavy for that. Thematically, Defendor focuses more on the main characters' issues than on the silly things they do. Though it must be said that Defendor's actions against his enemies make for some of the film's best moments, although said actions are actually more endearing than they are effective.\r\n\r\nSomething about this film that could have definitely used some improvement is the pacing. It takes too long for the story to really take off, and when it does it continues to just kind of meander along, without properly working towards a decent climax. Also, the ending isn't really satisfying. Actually, it is quite weak. This falls in line with the overall fluctuating quality of the story, which never really engages you much at any point, and then at the end just leaves you feeling kind of puzzled and somewhat disappointed.\r\n\r\nIn conclusion, Defendor is a charming little film, not strong enough to garner its own cult-following like some films in this genre have, but definitely nice enough to watch at least once.\r\n_(February 2012)_","id":"58a9ba4f92514173ee009844","url":"https:\/\/www.themoviedb.org\/review\/58a9ba4f92514173ee009844","movie_id":34769}
{"author":"YouShouldKnow","content":"The first thought I had after finishing the film was \"This shit is on par with The Wire\". It surely dramatized (it's a film after all), but it doesn't seem to be pulling any punches.\r\n\r\nThe colors, the lighting, the stories that intertwine... pretty damn good. But what I liked the most was that there's no happy ending. It's a not a feel good movie. It's raw, just like life and it's how it should be.","id":"5a36eac4c3a36814b9056344","url":"https:\/\/www.themoviedb.org\/review\/5a36eac4c3a36814b9056344","movie_id":26390}
{"author":"Andres Gomez","content":"Good performances from Cornish, Whishaw and Schneider for a folks and costums movie.\r\n\r\nYou will enjoy it if you like the genre. If not ... well, probably it would be a slow and dull romantic drama for you.","id":"545a2f0bc3a3687d4d0016c6","url":"https:\/\/www.themoviedb.org\/review\/545a2f0bc3a3687d4d0016c6","movie_id":29963}
{"author":"marchus weller","content":"This was an awesome independent film, really well made and well acted. I loved the story absolutely original and well thought out. The lead Tino Struckmann did a fantastic job leading this film, a great supporting cast, some well known faces compliments Struckmann's performance. But Struckmann belongs in great studio films to really shine and when Hollywood gets a look at him, I know he will get a chance to be a great star.\r\nGreat movie, if you are a war film fan you must see.","id":"574fd459c3a368793f001497","url":"https:\/\/www.themoviedb.org\/review\/574fd459c3a368793f001497","movie_id":19996}
{"author":"Andres Gomez","content":"This is one of those times in which you think that you have been really wasting 90min of your life.\r\n\r\nThe story is uninteresting and the actors quite mediocre.","id":"50924292760ee36eda0034f5","url":"https:\/\/www.themoviedb.org\/review\/50924292760ee36eda0034f5","movie_id":23720}
{"author":"boobfan","content":"**_Russ Meyer meets Frank Miller_**\r\n\r\nI had read a lot of bad reviews recommending not wasting time watching this movie, but I have to honestly say that **I really enjoyed _\"Bitch Slap\"_**. I think you have to take the movie as what it is and what it is intended to be, an homage to the 1950s-70s B movies mixing hot girls, fast cars, foul language, and outrageous action.\r\nAnd cleavage, of course, tons of jaw-dropping shots of double-D cleavage.\r\n\r\nThe **story** is indeed a bit flat, but **never boring** and has quite a few surprises due to its non-linear storytelling. \r\n\r\n**Visually the movie is stunning**. The mix of slow-motion shots and fast paced scenes is superb and it is extremely well edited. Overall it reminded me a bit of Zack Snyder's adaptation of Frank Miller's 300. (No, I am not joking.)\r\n\r\nIt is in deed a kind of a modern remake of the infamous Russ Meyer movie \"**Faster, Pussycat! Kill! Kill!**\" from 1965 in the style of a Frank Miller comic.\r\n\r\nThe three main female characters - a dark-haired stripper, a feisty red-head and a psychopathic blonde - are cleverly chosen and perfectly portrait by Julia Voth, Erin Cummings, and America Olivo. The acting is not what you would expect from a self-declared B movie - it is actually very good - and the change from serious acting to comical performance is well done. \r\nBut what stands out are the **stunning cat-fights** and **steamy love scenes**. Stunt Choreographer Zoe Bell has done a marvelous job as the fight scenes look gorgeous. \r\n\r\n_Bitch Slap_ is definitely not a movie you want to watch together with your wife at movie night, but if you like hot girls with over-the-top cleavage, sexy outfits, well choreographed cat-fights, and have a stomach for the sometimes graphical violence then you will enjoy this movie.\r\n\r\nI for sure did - even if I was maybe more staring than actually watching. **It was a lot of fun!**","id":"5b54bdac0e0a2673d600139a","url":"https:\/\/www.themoviedb.org\/review\/5b54bdac0e0a2673d600139a","movie_id":26715}
{"author":"fasm1976","content":"BOOBS CLEAVAGE GUNS PUNCH-UPS!! Erin Cummings is GORGEOUS!!! Worth seeing no matter what! Awesome girl on girl lesbian scenes n the BEST girl on girl punch up EVER!","id":"566551fb925141281d001ab2","url":"https:\/\/www.themoviedb.org\/review\/566551fb925141281d001ab2","movie_id":26715}
{"author":"John Chard","content":"Pythagorus As Nostradamus.\r\n\r\nKnowing is directed by Alex Proyas and collectively written by Ryne Douglas Pearson, Juliet Snowden and Stiles White. It stars Nicolas Cage, Rose Byrne, Chandler Canterbury, Lara Robinson, Ben Mendelsohn and Nadia Townsend. Music is by Marco Beltrami and cinematography by Simon Duggan. \r\n\r\n1959, and young schoolgirl Lucinda Embry (Robinson) keeps hearing voices. When asked to submit a drawing for the school time capsule\u0096 that's to be opened in 50 years time,\u0096 she writes a series of random numbers that don't appear to make sense. Forward to 50 years and the grand opening of the capsule, where Professor Jonathan Koestler (Cage) and his young son come by way of Lucinda's numbers. Just what do they mean? If anything?... \r\n\r\nAh yes, the good old disaster movie, a genre of film that continues unabated through the decades, this in spite of critical indifference. But the paying public still keep turning up in droves, even in this new technological age. Where once was models being destroyed, and paintings forming elegant backdrops, now is whizz bangery that costs a fortune. Still great fun, though, which is why something like Knowing exists and has many fans. \r\n\r\nIt's a splendid piece of sci-fi hokum pulsing with supernatural overtones, a gentle creeper unravelling the mystery in layers until the final countdown begins. The science is obviously dubious (it's a movie folks) and the air of pessimism that hovers consistently over proceedings (not only is the world in trouble, but all the protags have miserable issues as well), may be too much for some. However, Cage is as committed as ever, Proyas yet again proves himself a beautiful visualist, while the scenes of carnage are truly harrowing and unforgettable. \r\n\r\nA popcorner with moments of wonder and awe, and yes of course, some cheese as well. Ignore the Cage haters, if you like sci-fi infused disaster movies and haven't had fun with this one yet, then do so, it's a blast. And did I say it's gorgeous to look at as well? It is!\u0085 7\/10","id":"55fec13cc3a36877e700024d","url":"https:\/\/www.themoviedb.org\/review\/55fec13cc3a36877e700024d","movie_id":13811}
{"author":"Wuchak","content":"***What if everything’s not just meaningless chance?*** \r\n\r\nA disillusioned professor in the Boston area (Nicolas Cage) acquires a document that has successfully predicted tragedies for the last fifty years, but new ones as well (!). Rose Byrne plays the daughter of the seer.\r\n\r\n“Knowing” (2009) is a quality drama\/mystery with elements of disaster\/sci-fi and even a little horror. It’s along the lines of wonder-inducing flicks like “The Mothman Prophecies” (2002), “Contact” (1997), “The Forgotten” (2004), “The X-Files: Fight the Future” (1998), “Signs” (2002), “The Day the Earth Stood Still” (2008) and “War of the Worlds” (2005). If you favor the style and themes of those movies you’ll probably like this one.\r\n\r\nThe film runs 2 hours, 1 minute and was shot in Victoria, Australia, with establishing shots of the Boston\/Cambridge area.\r\n\r\nGRADE: B","id":"5cc35113c3a36872c9918132","url":"https:\/\/www.themoviedb.org\/review\/5cc35113c3a36872c9918132","movie_id":13811}
{"author":"John Chard","content":"The seventh installment, the appetiser.\r\n\r\nAs the ultimate wizarding battle between good and evil draws ever closer, Harry, Hermione and Ron bunk off from Hogwarts to go search for the \"Horcruxes\" with which to halt the ever stronger Voldermort and his army, on the way they learn the importance of the Deathly Hallows artifacts.\r\n\r\nSo this is the one that sees the comfort confines of Hogwarts left behind as our intrepid trio of best pals hit the mountains and forests in search of the tools to stop old snake face in his tracks. In what is ultimately a chase\/escape movie, one where the characters have to fight not only a number of challenges that come their way, but also their new found in-fighting capabilities, Deathly Hallows 1 wonderfully dangles the carrot for the final series entry to come. But the overriding thoughts you come away with from it is that firstly it's not really that much fun, and secondly that it shouldn't have been a stand alone movie. Too much of it plods where exposition and padding strains to get the film through its near two and half hour running time. Without the hustle and bustle of Hogwarts, and the myriad of characters that reside within, film struggles to escape the over reliance on just three central characters and a ream of MacGuffins. While some of the comedy and tender moments fall flat because tone is firmly pitched at dark clouds a gathering. However, where it does reward is with the action sequences, with David Yates once again proving he's a considerable talent when it comes to directing such passages.\r\n\r\nNew additions to the cast list feature Rhys Ifans, Peter Mulan and Bill Nighy, all welcome, and all sadly underused. As is the return of some older characters from earlier series entries (do you remember John Hurt was in the first film?!). While the thread involving the Ministry of Magic, and its nasty transformation into a Nazi like call for non-magical folk ethnic cleansing, is supremely adult and hits the nerves as it should do. Of the three principal young adult actors, it's still Emma Watson leading the way on ability, but alongside her, Radcliffe and Grint have earned our love and respect over the years for having to carry the weight of such expectation that has come with these roles. Fact is, is that now, having grown up with them and their characters for over ten years, we surely can accept them for not being multi ranged child actors. They have had to embody one character each for a decade, the range as such is the naturalism of aging through childhood like they have. Job done!\r\n\r\nTension is high and the magical moments engage big time, but the draggy nature of the beast makes this a film purely working as an appetiser to something sure to be far bigger and better. 6\/10","id":"5d5c87cdc4904800127cadff","url":"https:\/\/www.themoviedb.org\/review\/5d5c87cdc4904800127cadff","movie_id":767}
{"author":"John Chard","content":"Hormones over excitement as part six is merely an appetiser to the double billed closure to come.\r\n\r\nDeath Eaters are running amok as Dumbledore has an important task for Harry and Voldermort has one for Draco; all set to the backdrop of raging adolescent hormones. While Harry also acquires a rather helpful book written by the mysterious Half-Blood Prince.\r\n\r\nPotter 6 is not as dark as the pre-release chattings suggested it would be. Yes there's the usual dark moments, including a shattering turn of events that sets it up nicely for the finale, but this instalment is mostly fun, gentle and even sexy. Harry, Ron & Hermione are more under threat from their own adolescent urges than they are from the swirl of a Death Eater or the appearance of one young & creepy Tom Riddle. This of course makes for good viewing to most of us who have grown with the characters, with the principal young actors having nicely grown into said characters. But can it sustain a two and half hour running time? No it can't is the ass numbingly honest answer. There's some quality set-pieces including Quiddich (for a change) and a swamp attack by the Death Eaters, but by and large it's talky and breezy in equal measure.\r\n\r\nA filler Potter movie then, one that is far breezier than expected. Good but not great, but as a set up for the epic conclusion it hits all the right buttons. 6\/10","id":"5d5c8577a3d02700150aeb17","url":"https:\/\/www.themoviedb.org\/review\/5d5c8577a3d02700150aeb17","movie_id":767}
{"author":"Per Gunnar Jonsson","content":"We watched Harry Brown last weekend. I’m afraid it wasn’t as good as I hoped. I often like Michael Caine but I really didn’t like this particular movie. Some people say this movie is a British version of Clint Eastwood’s Gran Torino but that’s really stretching it as far as I’m concerned. Gran Torino had quite a few bright moments although the film as a whole was perhaps a bit tragic but Harry Brown was really only dark, slow paced and quite boring.\r\n\r\nSure it was well done and Caine sure wasn’t underperforming but the entire film was just too melancholic and depressing for my taste.","id":"5b3766edc3a368532f03bd06","url":"https:\/\/www.themoviedb.org\/review\/5b3766edc3a368532f03bd06","movie_id":25941}
{"author":"Gimly","content":"Personally, I found _Halloween II_ the darkest of any Rob Zombie movie, and certainly more menacing than any other _Halloween_ film to date. It’s full of tortured, nasty, hateful, abhorrent, violent and crude characters, and that’s just the good guys! Mikey is back, in a big way. His look is a little different, but in a realistic “I’m-a-serial-murdering-insane-homeless-giant” kind of a way. And although the bleak, demoralising nature of the film made it painful to watch at times, I would say it was worth it overall. Featuring some strong acting, a surreal but accomplished script, an absolutely amazing soundtrack, and a totally absorbing storyline. I may be alone in thinking this, but to me, _Halloween II_ is a worthy entry into one of the most successful horror franchises of all time.","id":"5a026f89c3a36861aa007dc5","url":"https:\/\/www.themoviedb.org\/review\/5a026f89c3a36861aa007dc5","movie_id":24150}
{"author":"NancyW9","content":"This movie is wonderfully written, it's one of my favourite films and I cry each time. Based on a true story of devotion the dog keeps going back to the train station to meet his owner who had a heart attack and died so is obviously he is not coming back, he becomes the train station mascot and people raise funds to help look after the welfare of the dog. it's lovely but you will need plenty of soft tissues to wipe away the tears.It's a classic.","id":"59338ec2c3a3685a45016718","url":"https:\/\/www.themoviedb.org\/review\/59338ec2c3a3685a45016718","movie_id":28178}
{"author":"Per Gunnar Jonsson","content":"What happened? When I watched the 2007 remake I was quite happy that it was a decent enough work and gave it 7 stars out of 10. This one though? Well the reboot is effectively killed as far as I am concerned. If there are to be made another movie in this franchise there has to be another reboot. This one is just ruined.\n\nThe first 20 minutes or so was not too bad. Then it just went to hell. Rob Zombie must have been high on drugs when he wrote this crud. A god chunk of it is just some drug-induced psychedelic mess.\n\nDebora Meyers is just a foul-mouthed brat who is so dislikable that you almost hope that Michael will get her. Dr. Loomis have been turned into a despicable asshole. Michael himself is mostly just a big dirty man who slashes people up. \n\nOccasionally he shows some of the supernatural qualities he is supposed to have but most often not. And he grunts a lot, what the f…? The dialogue is non-existent if you remove the foul language. I am normally quite resistant towards foul language but not when the movie is filled with it just to cover up the lack of talent in the writer.\n\nI think that I have not been so disappointed in a movie in a long time. This movie is utter trash and a disgrace to a franchise that is really one of my favorite horror ones.\n\nI am going to think more than twice before I ever watch a movie by Rob Zombie again.","id":"5aad917dc3a36846ba01aa9b","url":"https:\/\/www.themoviedb.org\/review\/5aad917dc3a36846ba01aa9b","movie_id":24150}
{"author":"John Chard","content":"Harry Warden is dead…\r\n \r\nMy Bloody Valentine is directed by Patrick Lussier and collectively written by Zane Smith, Todd Farmer and John Beaird. It stars Jensen Ackles, Jaime King, Kerr Smith, Kevin Tighe and Tom Atkins. Music is by Michael Wandmacher and cinematography by Brian Pearson\r\n \r\nA remake of George Mihalker’s 1981 slasher, the 2009 version was released in a blaze of 3D frenzy, where it absolutely coined it in at the World’s box offices. It’s not hard to see why, for no matter how much we may moan about remakes and the general languid nature of slashers turned out just for coin, there’s a big market out there for them. As it happens this isn’t half bad, oh it’s all very familiar, there’s another Michael Myers clone stalking the residents of some American town and offing them in gruesome ways. Here the perp is The Miner, dressed up in his work clothes, armed with a pickaxe, face covered by a gas mask that in turn makes him creepy looking and gives him Darth Vader breathing exercises to do. \r\n \r\nThe mystery element is that this new series of murders are being re-enacted from crimes ten years previously, so is the old killer back from the dead, or is there a copycat at large? Enter troubled teenagers, townsfolk acting suspiciously and mucho blood and screaming sitting in tandem together. There’s the requisite amount of nudity, including one of the longest nude scenes ever, while Lussier shows a good knack for blending humour with the terror. The 3D is of a high standard, and the sound mix is incredible, this really is one to give your sub-woofer a work out. It pans out as expected, but it manages to eek out good suspense for its finale and having Atkins and Tighe in the movie is a reassuring presence.\r\n \r\nThe original was no great film anyway, and although this is better, it’s still just a bunch of acting props being killed in different ways. But it is effective and above all else it’s fun. 7\/10","id":"5299481c760ee31c5e0d32c6","url":"https:\/\/www.themoviedb.org\/review\/5299481c760ee31c5e0d32c6","movie_id":14435}
{"author":"Wuchak","content":"***Quite good, as slashers go***\r\n\r\nThe heir of a mine (Jensen Ackles) in a remote town in Pennsylvania returns ten years after a Valentine’s Day massacre that took the lives of 22 people. When a psycho slayer dressed as a miner with a pickaxe also shows up the sheriff (Kerr Smith) naturally suspects the heir, who happens to be the ex-beau of his wife (Jaime King). \r\n\r\n\"My Bloody Valentine\" (2009) is a remake of the 1981 slasher but is different enough to view as a sort-of sequel. It includes most of the vital elements for an effective flick of this genre.\r\n\r\nThe basic formula was well established by \"Halloween\" (1978) and the first two \"Friday the 13th\" flicks (1980-1981): A crazy masked killer and a group of youths in a specific environment, whether a town, camp, forest, college, resort, building, etc. In this case it's a mining town, shot in Kittanning and Bethel, PA, and points nearby along the Allegheny River. So the film gets a big plus for filming somewhere other than friggin’ British Columbia! (Not that there's anything wrong with BC, of course, but enough is enough).\r\n\r\nBeautiful women is a must for these types of films and \"My Bloody Valentine\" delivers superbly with Jaime King (Sarah), Megan Boone (Megan) and Betsy Rue (Irene), the latter in an extended nude scene, which I think is unnecessary, but some will obviously appreciate it.\r\n\r\nMost importantly, the story is engrossing and keeps you guessing as to the identity of the killer till the very end. Compared to the original movie, it’s more compelling and all-around more entertaining.\r\n\r\nThe film runs 1 hour, 41 minutes.\r\n\r\nGRADE: B+","id":"5e57ef50a6d93100185e1e1c","url":"https:\/\/www.themoviedb.org\/review\/5e57ef50a6d93100185e1e1c","movie_id":14435}
{"author":"stackkorora","content":"The best way to describe this movie is \"Fight Porn\". The story is weak, the dialog terrible, and the acting is awful - all of that seems to only exist to loosely give a reason for why the next fight scene occurs. However, the fighting is actually quite entertaining. Sure, you can see a few times when the actors prepare for a hit too soon or they obviously prep for the next choreographed move. But for every flub, there's easily several amazingly well done fight stunts. So long as you set the bar low for the story and just want to watch some good fight stunts, this is a entertaining movie.","id":"5c2599a09251413ed41528f8","url":"https:\/\/www.themoviedb.org\/review\/5c2599a09251413ed41528f8","movie_id":38526}
{"author":"Debbie D'Amico","content":"I am a huge fan of indie films, actors and film makers and I had been reading online about Bazookas: The Movie for a long time and it was worth the wait!\r\n\r\n***SPOILERS*** \r\n\r\nThe owner of a family owned gym, Gus Bazooka (Stosh Zona, dies suddenly and leaves the business to his two sons. Angus (Vinny Duwe) is the good son trying to keep the business going and Judah (Sean R. Brooks) is the weasel of an older brother trying to sabotage the gym so he can sell it! The two brother make a bet that will give control of the gym over to the winner and that's where the movie really shines!\r\n\r\nAngus enlists his employees (Angela Cohen, Nicole Galati, Jason J. Michael, Roberto Lombardi & Steven Nelson) to help him save the gym by introducing some sexy new classes, while Judah plots to destroy it with his henchmen (Joseph Campellone and Omar Portilla).\r\n\r\nBazookas is total slapstick, college humor in the vein of Porky's or Old School and is just as good (if not better) than most!","id":"54de552f92514103bb001812","url":"https:\/\/www.themoviedb.org\/review\/54de552f92514103bb001812","movie_id":282741}
{"author":"Reno","content":"> A new kind of animation and probably the only kind to exist.\r\n\r\nA very unique Scandinavian-English language film from the technical aspect. The only one kind in the whole world which is actually an experimental product from the new productions. It was made primarily using photoshop, and then adobe after effects for animation. If you're wondering what kind it is, actually a 2.5D animation, that means it is neither 2D or 3D, but between those two. Like tricking the 2D object as the 3D material.\r\n\r\nWell they have succeeded to bring a visually impressive animation that mainly focused on the film character faces. The story was decent which is another dystopian concept where metro trains are the main content, hence it is called 'Metropia'. But the title also means 'visual refraction', that's what the story is slightly related too.\r\n\r\nAnyway, it was very suspenseful till the final and mostly talking drama than physical action sequences. At some point I felt it was like the recent stop-motion animation 'Anomalisa', but realised that I predicted wrong and the story travelled in a different path to end decently. Though the overall film was very impressive from both technical and narrative wise. One must not miss it, just for a its rare kind, especially you like animations, but best suitable for adults.\r\n\r\n7\/10","id":"577aaa86925141743e0012f5","url":"https:\/\/www.themoviedb.org\/review\/577aaa86925141743e0012f5","movie_id":36800}
{"author":"ColinJ","content":"A genuinely engaging bloke-led rom-com.\r\n\r\nThe sequel is also very enjoyable.","id":"58a8082292514156ab004ad0","url":"https:\/\/www.themoviedb.org\/review\/58a8082292514156ab004ad0","movie_id":28938}
{"author":"John Chard","content":"Faith is a gift I have yet to receive.\r\n\r\nAngels and Demons is directed by Ron Howard and adapted to screenplay by David Koepp and Akiva Goldsman from the Dan Brown novel of the same name. It stars Tom Hanks, Ewan McGregor, Ayelet Zurer, Stellan Skarsgard, Pierfrancesco Favino, Nikolaj Lie Kaas and Armin Mueller- Stahl. Music is scored by Hans Zimmer and cinematography by Salvatore Totino.\r\n\r\nSymbologist Robert Langdon (Hanks) is summoned to Rome and asked by the Vatican to help when four cardinals are kidnapped. Upon examining a tape recording that announces that the cardinals will be killed one at a time hourly, Langdon places the crime at the door of the ancient Illuminati. It's a race against time to not only try and save the lives of the cardinals, but also to avert the detonation of an anti-matter bomb which will destroy Vatican City. \r\n\r\nIn spite of The Da Vinci Code making gargantuan amounts of cash, there were many who actively hated the movie. Yet this follow up from Howard and his makers still enticed just under $500 million's worth of worldwide paying punters into see it. Ultimately it's a very different movie to Da Vinci, where that film was sombre and talky, and had a great religious hook that caused tremors in Christianity, Angels and Demons is a pacey race against time serial killer thriller. Albeit one that is still religion based and additionally topped up with some sci-fi gubbins. \r\n\r\nThe ticking time bomb format works well as a cliff hanger and the narrative allows Langdon and his latest lady investigator, CERN scientist Vittoria Vettra (Zurer), scope for no-nonsense detective work. There's a good solid mystery story at the heart, one which doesn't veer to being over complicated, and the production value is of a very high standard. Casting is first class, with McGregor and Skarsgard complimenting the reliable, and thankfully new haircut sporting, Hanks. It's a little draggy in the mid-section, as history comes crashing into the mix and the makers feel the need to be cerebral, and the finale is bizarre if wholly appropriate, but herein lies the problem\u0085 \r\n\r\nIf you can judge it on its own terms, not as a Dan Brown novel recreation and a link to bad memories of Da Vinci Code (not me, I liked it well enough actually)? Then it's a film of simple pleasures. If not then it kind of goes without saying that you probably already dislike the movie! 7.5\/10","id":"5d6c65ddd6c3000012e12083","url":"https:\/\/www.themoviedb.org\/review\/5d6c65ddd6c3000012e12083","movie_id":13448}
{"author":"Andres Gomez","content":"Oppresing and disturbing movie. Willem Dafoe and Charlotte Gainsbourg are superb and the OST is well chosen but the movie leaves too many questions open which leaves a bitter after taste.","id":"50f5654a19c2954ac5250073","url":"https:\/\/www.themoviedb.org\/review\/50f5654a19c2954ac5250073","movie_id":17609}
{"author":"John Chard","content":"Beautiful movie, visually, emotionally and humanely.\r\n\r\nWhat to say here? It's a road movie about a father and son played by Paul Hogan and Shane Jacobson respectively. After the untimely death of their wife and mother, the two end up on a long cross country journey to go fishing at the northern tip of Australia. They have previously never gotten on together, their differences seemingly impossible to put aside, but this trip will bring about many revelations, truths, pains and maybe even laughter?\r\n\r\nThe Australian landscape photography (Roger Lanser) is as stunning as the simplicity of screenplay, with the humour and emotional wallops delivered with great skill by Hogan and Jacobson. The message of it all is not heavily handled by director Dean Murphy, he and his team take us on a journey that rings true, one that brings hope to the many who need a prompt, a push in the right direction. Because it's true you know, life really is too short.\r\n\r\nA lovely and heart warming movie that's also very funny as well. It deserves to be better known. 8\/10","id":"5515170992514104620031eb","url":"https:\/\/www.themoviedb.org\/review\/5515170992514104620031eb","movie_id":27595}
{"author":"John Chard","content":"When Nathalie became Chloe.\r\n\r\nA remake of 2003 French film Nathalie, Chloe is directed by Atom Egoyan and it stars Julianne Moore, Liam Neeson, Amanda Seyfried and Max Thieriot. Story has Moore as a successful doctor who suspects her husband is being unfaithful with his younger students. Hiring a prostitute to pose as a student and catch him in the act, it sets in wheels the motions of untapped passions and deadly emotions.\r\n\r\nIt's a bit Hitchcock lite in truth, but the strength of the cast list always keeps the story interesting. The key turns in the plot are to be taken with a pinch of salt, but Egoyan and his team keep things ethereal as the tech credits are splendidly mounted. A safe and solid erotic thriller, even if it's more low-rent than high-grade. 6\/10","id":"5464c59f0e0a26294f001f3d","url":"https:\/\/www.themoviedb.org\/review\/5464c59f0e0a26294f001f3d","movie_id":28211}
{"author":"ZeBlah","content":"Quite dark, but entertaining and very well done. One of the few american animated movies I liked.","id":"5d17ba6f90fca30022ab1736","url":"https:\/\/www.themoviedb.org\/review\/5d17ba6f90fca30022ab1736","movie_id":14836}
{"author":"talisencrw","content":"Neil Gaiman is so contemporarily vital, both in literature and cinema, because he more than anyone else (with the possible exception of Terry Gilliam) notes that children and adults alike are fascinated with what lies outside our observable and tangible realms of existence. He realized the reasons storytelling have been significantly important since the dawn of mankind, and devised, as the Brothers Grimm did, that fairy tales and children's stories had to be haunting and entertaining to be both memorable and timeless. This is a great film depicting the growing sense as a child approaches adolescence that their parents and their world aren't exactly as they seem, and that through their trials and tribulations (the 'rites of passage', if you will) they'll reach the 'happy medium' they need to in order to find true happiness in their lifetimes.\r\n\r\nI definitely hope that all of Gaiman's books and graphic novels are made into movies (I most anticipate the 'Miracleman' graphic novels--both those by him and Alan Moore). Ones so well-written would truly be 'comic book movies' worth watching for me.","id":"572922759251413060000100","url":"https:\/\/www.themoviedb.org\/review\/572922759251413060000100","movie_id":14836}
{"author":"vrincon82","content":"Masters at peddling the paradise-romance concoction, the Kuta Cowboys have made Bali the world's leading destination for female sex tourists. In this one-of-a-kind documentary we reveal the secrets of the trade.\r\n\r\n\"If my son were to become a cowboy like my husband, I would be proud\", says Ne Neyong. Just a stone's throw from the straw hut where she raises her children, Bali's postcard-perfect beaches stretch out for miles. It's here that bronzed beach ambassadors like her husband look for foreign tourists. Selling 'i love you' in six different languages and accepting a drink or a gift in return. \"We don't take money for sex\", says Rudi, with a michievous smile, \"we just love women..\".\r\n\r\n\"Women in the West don't want to be women anymore. They come here searching for something, and they let their inhibitions go\". Young, sexy, and full of laughter, the Kuta Cowboys seem to be having the time of their lives. There's a surprising amount of calculation behind the women they choose to seduce – \"the older one means more money for me\". Yet playing guitar, and surfing on the beach all day, they exude a genuine enthusiasm for meeting people, which women from Europe in particular find hard to resist. \"They push the right buttons\", says Linnea from Sweden, \"and they really like to have sex\".\r\n\r\nYet poverty lies behind every chat-up line. Wayan \"wanted to be a policeman\", but a poor education and an ailing father led him to the beach. Both his father and his wife are proud that he provides for his family – because the aim of every good cowboy is to get a motorbike and a house. \"I lived in Germany, Paris, Belgium..\", Rudi says of the opportunities women have given him. But the lure of his simple life on the beach is always too strong. Because so long as they're young, there's always another woman, and another sunny day.\r\n\r\n\"I will be thirty soon, I probably only have two years more I can do this\". It's a story Bobby knows all too well. Now pushing 60, he wanders around the beach all day, regaling the younger boys with stories of his former glory. They think of him as a legend, but he admits \"people only see the good side of beach boy life\". Yet in this sun-soaked paradise, where illiteracy and poverty are rife, boys as young as twelve dream of following in his footsteps. \"When I'm eighteen I'll find a foreign woman\", says Alex. Surprising, entertaining, and informative.","id":"50b9796e19c295415e000d5d","url":"https:\/\/www.themoviedb.org\/review\/50b9796e19c295415e000d5d","movie_id":146907}
{"author":"Reno","content":"**Just do your job! Don't think above that like you can be a saviour!**\r\n\r\nIt looked like some kind of thriller, that's what anybody would say if they read the title correctly. The story was suspense, well developed to keep that for a very long time. Though it had no major twist, just a revelation like clarifying our doubts. Because most of the storyline seems alike 'Orphan', the film that came just months before this one. But this is a horror theme, I mean real horror, not a terror-horror like 'Orphan'. The overall story relied on one big secret that revealed at some time in the final act.\r\n\r\nI have seen many films about the child abuse, and this one set in as a same kind of theme, but takes a turn during the end of the first act. So when a social worker, Emily, finds a ten year old Lilith was abused by her own parents, she takes her away from them, followed by theirs arrest. Later, Emily adopts Lilith, but soon finds some strange events around her circle. That leads to suspect Lilith, but could not prove anything. Finding the truth becomes her first priority, but how she's going to solve it is what leads us to the conclusion part.\r\n\r\nI haven't seen Renee Zellweger in any recent films, she looked so good in this. Jodelle Ferland too was good as a little girl, the most important role in the film. But Bradley Cooper was in a small part. I think it was a decent film, but not a fresh theme, except developed differently with a new cast. If you are a big horror film fan, you might disappoint with it. Because those parts were minimised and the suspense was maximised. Yet surely most of us can easily predict many scenes, event the ending. So I conclude my review saying it is a decent watch.\r\n\r\n_6.5\/10_","id":"581cfae9c3a36859230001e0","url":"https:\/\/www.themoviedb.org\/review\/581cfae9c3a36859230001e0","movie_id":28355}
{"author":"Wuchak","content":"***Post-Apocalyptic Horror***\r\n\r\n\"Carriers\" (2009) is easily one of the best post-apocalyptic films. The story involves four youths in Southwest USA seeking sanctuary from a lethal virus that has wiped out much of the population and continues to do so. To all intents and purposes Government no longer exists and society is now a world without laws. To survive, they live by a set of rules of their own making: Avoid anyone with the disease, trust no one (not even your friends\/family), immediately sterilize anything a carrier touches and realize that anyone with the disease is already dead.\r\n\r\nThe four youths are Danny (Lou Taylor Pucci), his brother Brian (Chris Pine), his girlfriend Bobby (Piper Perabo) and Danny's school friend Kate (Emily VanCampo). Over the course of a handful of days they are continually forced to make difficult moral decisions that no human being should ever have to make. They soon discover that the real enemy is not the sinister pandemic, but the darkness within their own hearts.\r\n\r\nUnlike semi-goofy post-apocalyptic films like the Mad Max series, \"Carriers\" is deadly serious from beginning to end. This works in the film's favor because if the filmmakers take the material seriously the viewer can as well.\r\n\r\nOne of the moral conundrums explored is what do you do if a loved one gets the disease? Since anyone with the disease is as good as dead, do you mercifully kill them? Leave them behind to suffer and die alone? Or stay with them, which is tantamount to suicide since you'll catch the virus as well?\r\n\r\nThe film also explores one's reaction to such a pandemic: Do we forsake all sense of morality in an attempt to survive -- lie, steal, forsake and murder -- or do we hold on to our moral compass, come what may? Is life worth living if you must become an immoral, wicked savage to survive? Isn't it better to live with dignity at all costs -- fight with nobility and die with dignity when and if we must?\r\n\r\n\"Carriers\" is to be commended for provoking such poignant questions.\r\n\r\nSome denounce the film on the grounds that it's too downbeat and depressing, but wouldn't a lawless society with a highly contagious lethal virus on the loose be a very dire situation? In other words, the downbeat vibe reflects the reality of the story. This doesn't mean that every character has to be some moralless savage, as one of the main characters becomes, but it definitely makes the proceedings believable for the viewer. That said, I admit that I would have preferred if the film offered more glimpses of hope, faith and human dignity, but the filmmakers obviously wanted to explore the element of a near-hopeless-situation and the film should be accepted and respected on that level.\r\n\r\nOne obvious plothole is the perfectly maintained lawn of the golf course at the abandoned resort.\r\n\r\nThe film was shot in desolate regions of New Mexico & Texas and runs a short-but-sweet 84 minutes.\r\n\r\nFINAL SAY: \"Carriers\" is an excellent -- albeit decidedly melancholic -- depiction of a post-apocalyptic world where conventional law & order are non-existent. The film successfully stimulates moral reflection and is engrossing from beginning to end. Although it looses points for being too downbeat...\r\n\r\n***ENDING SPOILER ALERT***\r\n\r\n...especially the climax. C'mon, the dude makes it to the remote beach and he has a hot lass at his side; they could be the new Adam & Eve, but all he does is whine like it's the end of the world or something.\r\n\r\nGRADE: A-","id":"5e76df9ca055ef00182d85ea","url":"https:\/\/www.themoviedb.org\/review\/5e76df9ca055ef00182d85ea","movie_id":25769}
{"author":"sitenoise","content":"An extended essay on unrequited love. Some might call it two essays on unrequited love as the 3+ hour film is cut distinctly into two halves, complete with a credit roll separating them. The first half is in color and focuses on a guy whose married lover ends their affair. The second half is in mostly black & white and focuses on a woman the guy met in the first half (who tells her story in one 14 minute still-camera take against a concrete background. And nails it!).\r\n\r\nThe guy glues the two parts together. He’s bummed out in the first half, and then from serving as confidant to the differently-bummed-out woman in the second half he gets to feel better. He delivers good character arc and the juxtaposition in styles of bummed-outedness is told and executed well. But the story doesn’t matter.\r\n\r\n**Cafe Noir** is a linear quilt of set pieces and cinematic indulgences, vignette style. There are more than a half dozen scenes you could call music videos, gorgeous music videos with great music: Bach chorales, Korean indie funky dub, opera, Chinese avant-garde. The whole film is melancholy and these “music videos” barely raise its temperature. Except one. A dance number near the end to the middle eastern grooves of **Bill Laswell**. Dance number?\r\n\r\nThis film is the first born from a guy who was a leading and influential film critic for more than two decades; an intellectual type critic steeped in the **French New Wave** who doesn’t think much of films that simply entertain. There’s a short interview with him at **Hancinema** _http:\/\/www.hancinema.net\/film-critic-puts-his-reputation-on-the-line-in-directing-debut-27040.html_ that's worth reading.\r\n\r\nThe film is based on stories by **Goethe** and **Dostoevsky**. Most of the dialog is literary if not poetic. Beyond the inspirations and homages to great works of art, _Cafe Noir_ is also steeped in gobs of **Kim Ki-duk**ian religiosity and the academic musings on love of **Hong Sang-soo**, with plenty of nods to contemporary Korean cinema thrown in--there’s a scene by the Han river where the uncle of the little girl who was killed in _The Host_ talks about his feelings of loss. **So Meta**. The forlorn star of the second half is Hong regular **Jung Yu-Mi**. And it’s not by chance. The scene where she says \"fuck you, like you know it all!” will make Hong fans howl. There are also uncredited cameos from other Hong regulars as well as _Beautiful_’s **Cha Soo-Yeon**.\r\n\r\nViewers of the film familiar with Goethe, Dostoevsky and Classic Film auteurs will have a different experience of the film than I did. All that was lost on me (except for some red balloons). What struck _me_ throughout the film was how much it reminded me of early **Hal Hartley**, the director who famously said (something to the effect of) “I don’t want people to act in my films. I want them to deliver lines.” I imagine my feelings of the connectedness to Hartley are really once removed from the inspirations that informed Hartley's own work.\r\n\r\nBack to the Bill Laswell dance number. I loved all the musical interludes in the film and felt that if I were familiar with the genres of music he was picking from that I would have picked the same songs ... I was hoping he would pick some obscure number I'm familiar with and love as well. And then two and a half hours into the film, BANG! Not only did he pick a song I know and love but he delivered it just like Hal Hartley did in _Simple Men_ with **Sonic Youth**'s \"Kool Thing\" (and _Surviving Desire_). The actors just get up and dance to it. \r\n\r\nCafe Noir is stunningly gorgeous. I put it in the same category as **Anh Hung Tran**’s _Vertical Ray of the Sun_ and **Myung-se Lee**’s _M_. You can’t watch the film without acknowledging the mastery of it’s a\/v makeup.\r\n\r\nI had a couple aborted attempts to watch this film, though. The opening scene is a 5 minute take of a girl staring into the camera eating a cheeseburger. The whole cheeseburger. The second scene is a _Koyaanisqatsi_-esque trip around Seoul. I punted twice. \r\n\r\n_Cafe Noir_ is pretentious. It’s grandiose and overwhelming. It’s punishingly thick and multi-layered. It’s over three hours long and languidly paced. Characters in the film don’t talk to one another the way normal people do, they deliver lines. Ten year old girls quote Goethe and pontificate about love with more wisdom than I'll ever possess.\r\n\r\n_Cafe Noir_ is the most amazing film experience I’ve had in years.","id":"55a88aa9c3a368648e001471","url":"https:\/\/www.themoviedb.org\/review\/55a88aa9c3a368648e001471","movie_id":85959}
{"author":"John Chard","content":"Keep Away From Children.\r\n\r\nCase 39 is directed by Christian Alvart and written by Ray Wright. It stars Renee Zellwegger, Jodelle Ferland, Ian McShane and Bradley Cooper. Music is by Michl Britsch and cinematography by Hagen Bodanski.\r\n\r\nAnother in the long line of demonic\/psycho children films, Case 39 sat on the shelf for a few years before finally seeing the light of day around 2009. Met with a whole bunch of negative reviews it is somewhat pleasing to find that while it’s not a misunderstood classic or anything, it actually works well within this sub-genre of horror.\r\n\r\nStory in short order form has Zellwegger as Emily Jenkins, a social worker who after rescuing young Lilly Sullivan from crazed parents, takes her in on a temporary foster basis and soon comes to regret it.\r\n\r\nOffering up a more supernatural slant than many other films of a similar ilk, German director Alvart does still follow the familiar formula for crazed child movies. Lillith (unsubtle name or what?!) serenely ingratiates herself into Emily’s world and that of the people around her, then of course things start happening, bad things. Having taken his time to build it up during the first half, Alvart then revels in unleashing demonic chaos, with young Ferland giving an unnervingly superb performance as Lilly. The shocks and psychological torments are tidily crafted, and it all builds to a suitably daft and frenetic finale.\r\n\r\nIt’s too long at nearly two hours in length, it’s sometimes silly and it’s cliché heavy. However, some striking scenes, a mightily strong child performance and the decent chiller thriller fun factor, lifts this just above average status. 6\/10","id":"53b49d850e0a2676c40002ef","url":"https:\/\/www.themoviedb.org\/review\/53b49d850e0a2676c40002ef","movie_id":28355}
{"author":"Andres Gomez","content":"Exam is an entertaining movie about a stressful situation in a selection process. It could have been more interesting wouldn't it have been because it is deeply inspired in the original play El mètode Grönholm by Jordi Galceran and its following movie El método, by Marcelo Piñeyro, which are both much better.","id":"508e433819c29510580003ee","url":"https:\/\/www.themoviedb.org\/review\/508e433819c29510580003ee","movie_id":29917}
{"author":"Austin Singleton","content":"A fun one-room mystery that keeps you entertained throughout. Read my full review here.\r\n\r\nhttp:\/\/www.hweird1reviews.com\/allreviews\/exam-review","id":"57acefab925141588c000173","url":"https:\/\/www.themoviedb.org\/review\/57acefab925141588c000173","movie_id":29917}
{"author":"Kenneth Axel Carlsson","content":"A woman is found murdered in the swamp somewhere in the south. A brutal murder, quite possibly a serial killer. A policeman is investigating, and  while he does that, another body is found, but this one nothing but bones. This guy (a black guy) was killed 40 years ago, and the policeman suddenly remembers that he saw this murder happening when he was a kid. There doesn't seem to be any sort of connection between the murders, except the man investigating both of them.\r\n\r\nTommy Lee Jones plays the old cop who investigates the murders in the swamp. He is a man fighting his own demons, meaning mostly alcohol, but clearly the death of this black guy has also haunted him for 40 years. He wants justice to be served, but is not willing to do whatever it takes, at least not in the beginning.\r\n\r\nThis movie is not the most exciting crime movie out there. One thing that makes it stand out from most of them, though, is that it doesn't want to trick us. From the beginning, we know where the plot is going, we just need to follow it all the way to the end and see the ends being tied together. The story is ok, solid, but what really makes this thriller different is the characters and the pace. It is not afraid to slow down the pace and gives us a look into the people who live here, and those visiting. I especially liked the element introduced with Elrod Sykes and Kelly Drummond, two movie stars down here shooting a movie. By the way, it is Elrod who finds the old bones while taking a piss. The confrontations between a drunken Elrod and a sober Dave (the cop), are brilliant and really gives this movie a lot of heart.\r\n\r\nI also want to mention the music in this movie. It is there, but doesn't overshadow the images and plot, and most importantly, it has a very unique rhythm, like a beating heart, that drives us forward together with Dave Robicheaux. You notice it, but you don't notice it, if you know what I mean. Brilliant.\r\n\r\n_Last words... don't expect this movie to offer you gore and violence. Sure, people die, but you never actually see any sickly images. That's not the story it wants to tell, it wants to give you an insight into a man, a man that isn't so different from you and I._","id":"54a3cf9492514118600046e3","url":"https:\/\/www.themoviedb.org\/review\/54a3cf9492514118600046e3","movie_id":13975}
{"author":"Andres Gomez","content":"Tommy Lee Jones performance is superb and the Southern US atmosphere is really genuine but the story is just made overcomplicated and disappointing.","id":"539f54e70e0a2631db000d7c","url":"https:\/\/www.themoviedb.org\/review\/539f54e70e0a2631db000d7c","movie_id":13975}
{"author":"Shreyance Parakh","content":"**It's much more than JUST rugby**\r\n\r\nThough the movie doesn't give much insights into the life of the living legend(still breathing among us when I saw this movie) known as **NELSON MANDELA**, it sure tells us a lot about what the man is made of.That **we are the master of our fate, we are the captain of our soul**.\r\n\r\nForgiveness is a mighty powerful weapon that can make or break nations.How a sport can unite a divided nation into ONE, it is a well known fact but to actually be able to do that in a country like SOUTH Africa,at a time when it was ready to rise from the ashes or to fall into its own crevices lying beneath the surface and ready to torn apart the whole nation again into TWO,is what gives me INSPIRATION to rise whenever i'll fall...\r\n\r\nThe entire cast is brilliant without going overboard in situations that could've been intense.A truly inspiring movie that can be imprinted in your heart for the rest of your lives if you're **ready to FORGIVE people and make this world a better place to live in!**","id":"590b2e079251414f8d0154b3","url":"https:\/\/www.themoviedb.org\/review\/590b2e079251414f8d0154b3","movie_id":22954}
{"author":"Wuchak","content":"Refreshingly different alternative WW2 drama\/adventure\r\n\r\nRELEASED IN 2009 and directed by Quentin Tarantino, \"Inglourious Basterds\" takes place during the German occupation of France in WW2 and revolves around a ruthless “Jew Hunter” Nazi (Christoph Waltz), a beautiful young theater owner dripping with vengeance, a German war hero who pesters her and a brutal team of Jewish-American guerrilla soldiers led by Lt. Aldo Raine.\r\n\r\nThis was my first taste of the popular director's eccentric repertoire, although I've since seen all of his movies except “Death Proof” (2007). The first time I tried to watch \"Basterds\" I gave up around the 50-minute mark. Don't get me wrong, the dialogue-driven opening sequence is great but the film seemed to bog down with its focus on a French theater during the German occupation and the accompanying interminable dialogue (mostly in subtitles). I just wasn't ready for this because I was expecting a Dirty Dozen-styled WW2 film with lots of action and all that goes with it. What I got instead was a plot that focused on the aforementioned theater accompanied by long sessions of generally subtitled dialogue.\r\n\r\nI eventually gave it a second chance with the understanding that this wasn't some typical war flick. Strangely, the \"interminable dialogue\" pulled me in and I slowly became engrossed in the story, which isn't hard to follow. The drama is only occasionally interrupted by flashes of extreme violence. Until the end, that is, where all hell literally breaks loose.\r\n\r\nThere ARE elements that bring to mind \"The Dirty Dozen\" (1967), including a group of anti-heroes intent on mercilessly obliterating as many Germans as possible and the fact that the real action doesn't kick-in until the final act, but \"Basterds\" is hardly a Dirty Dozen clone. It may borrow a bit from notable films of the past but it absolutely possesses its own refreshing originality.\r\n\r\nAll effective films have quality characters and \"Basterds\" has several: The stunning Mélanie Laurent as Shosanna, the cinema proprietor who quietly seethes with retribution; Christoph Waltz as SS Col. Hans Landa, an articulate and suave love-to-hate villain who mercilessly hunts down Jews; Brad Pitt as the almost-comical, but no-nonsense leader of the brutal Basterds; super-sharp Diane Kruger as a German actress & British spy; and Daniel Brühl as a genial German hero with the hots for the beautiful Shosanna.\r\n\r\nLike Tarantino’s other great movies (“Pulp Fiction,” “Django Unchained” and “Jackie Brown”), \"Basterds\" pulsates with confidence, style, quirkiness and a sense of the unexpected from beginning to end, the perfect antidote to the idiotic \"blockbuster\" syndrome that plagues modern cinema with its predictability and overKILL action & CGI, etc. Most movies seem like they’re in a rush and shy away from extended dialogues because they fear losing the viewer’s limited attention whereas Tarantino makes them a highlight because it’s an area where he excels. Instead of pedestrian verbiage that merely advances the plot or conveys the obvious, his interchanges are rich with amusement and mindfood.\r\n\r\nTHE FILM RUNS 153 minutes and was shot in France and Germany.\r\n\r\nGRADE: A-","id":"5b5a2a279251411a64002a64","url":"https:\/\/www.themoviedb.org\/review\/5b5a2a279251411a64002a64","movie_id":16869}
{"author":"John Chard","content":"The Facts or the Folklore?\r\n\r\nWhat is a Cropsey? A Cropsey is the name given to a bogeyman used to frighten children by way of safe education (stay away from that place\/that man\/them woods etc). When Joshua Zeman and Barbara Brancaccio grew up they learnt that their Cropsey was in fact real. Or was he?\r\n\r\nAndre Rand was a convicted child kidnapper from Staten Island who is strongly suspected to have committed a number of child kidnappings and murders between 1972 and 1987. Most of the missing children were special needs cases, and with Rand having close ties to Willowbrook State School, a sorry place for the mentally ill thats conditions were exposed by Geraldo Rivera’s infamous documentary in 1972, and his known living arrangements out in the Greenbelt Woods around Willowbrook, he seemed the likely culprit for sure.\r\n\r\nZeman and Brancaccio do a sterling job of piecing together all available evidence and reports involving Rand, including interviews with family and friends of the missing children and the detectives who worked on the case. They even have epistle contact with Rand as they try to arrange a meeting with their very own bogeyman. The footage and stories involving Willowbrook are skin crawlingly effective, the visits to the ruins of the place equally creepy. \r\n\r\nWe constantly see pictures of the missing children, and that of the only one who was found, murdered, close to one of Rand’s makeshift campsites. These are real horrors in this horror film, and they cut the psyche like a knife. Unfortunately the makers lose a little focus in the final third, as more revelations and accusations enter the debate some of the unease wears off, the doc gets chocked as it were, and some of the harsh realities are replaced by fanciful supposition.\r\n\r\nStill, in the main this is a tremendous documentary, challenging and unbiased. It could just have been Zeman and Brancaccio walking around interviewing the usual suspects et al, but they go deeper than that to leave a lasting impression on both the mind and the soul. 8.5\/10","id":"544712540e0a2672d4000ad1","url":"https:\/\/www.themoviedb.org\/review\/544712540e0a2672d4000ad1","movie_id":56811}
{"author":"Wuchak","content":"A teen joins a freak circus where he encounters a war between vampires\r\n\r\nRELEASED IN 2009 and directed by Marco Brambilla, \"Cirque Du Freak: The Vampire’s Assistant\" is a fantasy\/horror\/comedy about a teen (Chris Massoglia) who is compelled to join a circus of freaks where he becomes (you guessed it) the assistant of a vampire (John C. Reilly) and learns of a war between two classes of vampires. Josh Hutcherson is on hand as his best friend while Michael Cerveris plays the mysterious Mr. Tiny. Ray Stevenson is formidable as a vampiric heavy.\r\n\r\nAfter the mega-hit of “Twilight” (2008), producers naturally thought that another young adult book series involving vampires might be profitable. As such, this movie is based on the opening trilogy of the 12-book series “Cirque du Freak: The Saga of Darren Shan” by Darren Shan (pen name of Darren O'Shaughnessy). It mostly focuses on the first book with uber-fans of the books complaining about deviations. In any case, the film wasn’t a hit at the box office (costing $40 million and making back $39 million worldwide with $14 million of that made in North America). Regardless, I much prefer it to “Twilight.”\r\n\r\nFor some reason I always enjoy stories that center around life in circuses and carnivals. The excellent “Water for Elephants” (2011) is a good example. While that movie was decidedly realistic, “The Vampire’s Assistant” is obviously rooted in fantasy.\r\n\r\nThe first act is a low-key introduction to the two teen friends, their situation in life, and their intriguing visit to the Cirque Du Freak, which in English means The Freak Circus. The film improves in the second act with the excellent character of Larten Crepsley moving to the spotlight. Reilly is commanding and fascinating in the role. The third act is also really good, centering on the war between the vampires and the vampanese. The plot is involved enough without being too complex and the movie is impressively imaginative on practically every front.\r\n\r\nSalma Hayek stands out in the female department as one of the performers with a lame talent. But the creators don’t really take advantage of her presence. In other words, don’t expect anything like Salma’s mind-blowing sequence in “From Dusk till Dawn” (1996). The striking Jane Krakowski is on hand, but her role is very small. Winsome Jessica Carlson plays Rebecca, a potential babe for the protagonist, I guess; she was only 15 during shooting and looks it.\r\n\r\nTHE FILM RUNS 1 hour, 49 minutes and was shot in Louisiana (New Orleans, Baton Rouge and Folsom) and Los Angeles with studio work done in Universal City.\r\n\r\nGRADE: B","id":"5b18583a0e0a261f85000746","url":"https:\/\/www.themoviedb.org\/review\/5b18583a0e0a261f85000746","movie_id":24418}
{"author":"talisencrw","content":"From watching John C. Reilly over the years, in everything from 'Hoffa' and 'Dolores Claiborne' when he was developing his craft, to 'Step Brothers' and 'Carnage', in which he was one of the leading actors that the film was centered on, I really wanted this film to work for me, though I feel in this recent glut of cinema spawned from Hollywood's post-'Twilight' obsession with vampires, that someone really needs to give this trend a coffin rest, at least for a while so creative fires can have a chance to rekindle--it seems to have been done to death. I'm sure this wasn't what Bram Stoker had in mind with his original 'Dracula'. There's nothing in these recent CGI-bloated messes meaty enough to sink one's teeth into. I'm sure Dr. Alucard himself is cursing the day he was granted immortality, if only to avoid his local multiplex, for this very reason.\r\n\r\nLike another recent film I tried to get into, but basically flew off the rails in an enormous video game-like tidal wave of effects I neither wanted nor needed to see ('Your Highness' by David Gordon Green), the filmmakers ill-advisedly thought that the audience had to be captivated by fights and chases galore, but it's like seeing yet another explosion in a Michael Bay movie: Just give me: a) Great presence in an actor, for once, like the Sir Christopher Lees, Sir Peter Cushings, Vincent Prices, Boris Karloffs and Bela Lugosis of yesteryear; b) A story worth telling; and c) A director who knows a thing or two about storytelling--otherwise, I'd rather boycott drinking blood, and simply switch, at least for contemporary film, to a different cup of tea. I'm not surprised whatsoever that this didn't do well at the box office, and that filmmakers decided not to continue with the franchise. Even for vampires, sometimes enough is enough for a lifetime.","id":"570d9fc992514124ef000a7d","url":"https:\/\/www.themoviedb.org\/review\/570d9fc992514124ef000a7d","movie_id":24418}
{"author":"Per Gunnar Jonsson","content":"I found this movie pretty much by accident when flicking through the Netflix catalogue. I thought what the heck and started to watch it. My hopes were really not that high. Actually I am not sure I had any hopes at all since I just stumbled on the movie and started to watch it on a whim. What I found was a rather okay and fun movie actually.\r\n\r\nThe movie is apparently based on popular book series Cirque du Freak by Darren Shan. Unfortunately, in their usual arrogant manner, the Hollywood moguls decided to rip the books appart and mash together book one and two in this movie. It appears the general consensus is, not surprisingly, that the books are better than the movie. Nevertheless, the movie was good enough that I most probably will have a go at reading at least one of the books in the series.\r\n\r\nThe movie itself then? Actually I liked it more than I expected. It took a little while before it got started but once it got going it was a good teenage magical fantasy adventure. I am actually a bit saddened that it appears there was never any sequels using the other books in the series.\r\n\r\nThe name Cirque du Freak is well chosen. This is not the usual bunch of people with magical abilities or fangs or some of the other attributes you usually see in magic or supernatural movies. The members of the Cirque are freaks in every sense of the word. I do not think I have seen such a bunch of weird and bisarre creatures before. Heck, the vampire that takes Darrel as his assistant is probably the most normal of the bunch.\r\n\r\nThe story is quite okay and the acting acceptable. The vampire, Creepsly, felt a bit underwhelming at first but he grew on me. So did Mr. Tiny who I definitely didn’t like at first but found doing quite a good job of playing the evil mastermind towards the end. His sleaziness was downright creepy.\r\n\r\nI am sure a lot of the story and character development from the books were left out because there is so much more that could have been done with the story. Darrel befriending the snake man, the brewing romance, Darrels relation with Creapsley and all the other interactions and characters that took place. If the producer had wanted to do a good job he could easily have added another 40 minutes to the movie. A shame he did not.\r\n\r\nBottom line, watching this movie was a pleasant experience. It is perhaps not a blockbuster but a nice little adventure, magic, supernatural and fantasy gem.","id":"58a07ef59251412609007d63","url":"https:\/\/www.themoviedb.org\/review\/58a07ef59251412609007d63","movie_id":24418}
{"author":"John Chard","content":"It's a classic transformation story. Are you now or have you ever been a Norse God, Vampire, or Time Traveling Cyborg?\r\n\r\nAnother in what is a long line of body swap comedies, 17 Again is fun, frothy and full of warmth; just like all the other ones really! There's nothing new here, it's the same old format as a grown up Mike O'Donnell (Matthew Perry) rues how his life has grown to miserable proportions but magically gets to be a high-schooler again and grasp that second chance. Back in his 17 year old bod (Zac Efron looking like a young Rob Lowe), Mike oversees the trials and tribulations of his two kids who attend the same school, whilst also forming a \"special\" bond with his future wife Scarlet (Leslie Mann) who is going to divorce him! Cue much high-school pranks, perils and near misses and a few worthy messages in the narrative.\r\n\r\nTailored towards a certain demographic with the casting of Efron, who is very likable and a worthy lead here, the film thankfully doesn't lack for good performances elsewhere. Both Mann and Melora Hardin as the hot principal make their roles stand out, while Thomas Lennon as Mike's uber rich man child buddy steals the movie. It's rich in clichés of the formula and the predictability of outcome robs us of a surprise, but these are not actually irritants, for this is a very enjoyable movie. One where the teens hot for Zac can stare lovingly, and one where the adults can nod in knowing agreement at some plot dynamics. 7\/10","id":"5424ae4e0e0a263b7700468d","url":"https:\/\/www.themoviedb.org\/review\/5424ae4e0e0a263b7700468d","movie_id":16996}
{"author":"angrek","content":"In 2009 is geoloog Adrian Helmsley op bezoek in India bij een collega en krijgt te horen dat door een grote zonnevlam neutrino's tegenwoordig microgolven afgeven. Daardoor warmt de kern van de aarde met grote snelheid op wat zal leiden tot rampzalige gevolgen voor de planeet. Adrian haast zich terug naar de Verenigde Staten en waarschuwt Anheuser, stafchef van het Witte Huis, die op zijn beurt de president inlicht. Adrian maakt vanaf dan deel uit van de staf van de president en wordt gevraagd een schema te maken van de mogelijke gebeurtenissen die zullen plaatsvinden in de komende jaren.\r\nIn 2012 blijkt dat de president opdracht heeft gegeven om 8 grote arken te bouwen waarin 800.000 mensen op basis van DNA, expertise en wetenschap zich schuil zouden kunnen houden. Inmiddels weten ook alle leiders van de meeste landen in de wereld van dit plan af en worden er selecties gemaakt. Ondertussen komt Jackson Curtis in Los Angeles zijn kinderen ophalen bij zijn ex-vrouw Kate (die samenwoont met haar vriend Gordon). Hij neemt z'n kinderen mee naar Yellowstone National Park. Daar worden ze vervolgens meegenomen door het leger en ontmoeten Adrian, die hen de smoes voorlegt dat Yellowstone in moeilijkheden verkeert en daarom geen toeristen toestaat. Ook ontmoeten ze Charlie Frost, die een eigen radiozender heeft en Jackson vertelt dat de wereld binnenkort vergaat. Hij zegt erbij dat er een grote groep mensen is die plaats mag nemen in \"ruimteschepen\" waar hij de locatie van weet. Jackson brengt op verzoek van zijn ex-vrouw zijn kinderen terug naar L.A., alwaar hij hoort dat er een aardbeving heeft plaatsgevonden die een grote scheur in de aarde heeft veroorzaakt. In het Witte Huis wordt duidelijk dat het schema van Adrian sneller verloopt dan ze dachten, en dat door de grote hitte van de aardkern de mantel ook vloeibaarder is geworden, waardoor de aardkorst als het ware \"los\" kan drijven, en dus zal gaan verschuiven. Ook krijgen ze te horen dat er maar 4 arken op tijd klaar zullen zijn. Jackson wordt opgeroepen als chauffeur om de zoons van de Russische miljardair Yuri Karpov op te halen en ze naar het vliegveld te brengen. Hier laat één van de zoons per ongeluk los dat zij de rampen zullen overleven en Jackson niet. Met de informatie die Jackson al van Charlie kreeg, realiseert hij zich dat er inderdaad rampzalige dingen zullen gaan gebeuren, en hij rijdt terug naar L.A. om z'n familie op te halen. Hij gebruikt een vliegtuig en Gordon, die amateurpiloot is, is uiteindelijk gedwongen het vliegtuig te besturen wanneer hun piloot blijkt te zijn omgekomen. Terwijl ze opstijgen is de familie Curtis getuige van de complete verwoesting van Los Angeles. De stad verdwijnt door de aardkorstverschuiving volledig in de Stille Oceaan.\r\nIn het Witte Huis wordt Adrian verteld dat de aardkorstverschuiving voor honderden aardbevingen heeft gezorgd en al 2 miljoen slachtoffers heeft geëist. President Wilson geeft het bevel dat zijn personeel zo snel mogelijk het vliegtuig in moet om naar China te vertrekken, waar de ruimteschepen liggen. Hij onthult ook aan Adrian dat hij zelf niet mee zal gaan, omdat iemand de rest van de wereld op de hoogte zal moeten brengen van de komende rampen die tot het einde van de wereld zullen leiden. De president vindt dat hijzelf daar de aangewezen persoon voor is. Adrian gaat vervolgens met Anheuser en andere personeelsleden aan boord van een Air Force One. Jackson beseft intussen dat als ze het willen overleven, ze de locatie van de schepen moeten zien te achterhalen. Hij overtuigt Gordon er daarom van om naar Yellowstone te vliegen en Charlie te vinden, om zo de locatie van de \"ruimteschepen\" te achterhalen. Terwijl Gordon het vliegtuig bijvult met brandstof, gaat Jackson op zoek naar Charlie en vindt hem. Hij vertelt dat de kaart in zijn camper ligt. Jackson weet net op tijd weg te komen als de vulkaan onder Yellowstone plotseling uitbarst. De familie ontsnapt met het vliegtuig net op tijd aan de aswolken. Jackson ontdekt op de kaart dat ze naar China moeten en ze landen uiteindelijk in Las Vegas om nieuwe brandstof te tanken. Hier lopen ze Yuri en z'n gezin tegen het lijf. Hun vliegtuig is gecrasht. Yuri's piloot Sascha neemt vervolgens een oude Antonov An-225 over, maar heeft een co-piloot nodig, waardoor de familie Curtis en Gordon mee kunnen. Ze willen landen in Hawaï om meer brandstof te tanken, maar ontdekken dat Hawaï volledig is veranderd in een vulkanisch gebied. Ze zijn gedwongen verder te vliegen. Sascha voorspelt dat ze binnen 15 minuten in de Stille Oceaan zullen neerstorten. Wanneer hij door de wolken heen is, ziet hij dat waar de oceaan zou moeten zijn, een grote ijsmassa te vinden is. Jackson realiseert zich dat de aardkorstverschuivingstheorie werkelijk bestaat. Ze storten neer op een gletsjer waarbij Sascha omkomt. Vervolgens worden ze gevonden door Chinese troepen, die bezig zijn dieren over te brengen naar de schepen. De soldaten nemen Yuri en z'n kinderen mee wanneer hij zijn tickets laat zien. Daardoor blijven de familie Curtis, Gordon en Yuri's vriendin Tamara (die geen ticket had) achter. In China, bij de schepen, wordt duidelijk dat van één van de arken het dak is ingestort door de aardkorstverschuiving en wordt het Laura en Adrian duidelijk dat de passagiers helemaal niet op basis van DNA en wetenschap zijn gekozen, maar dat rijke mensen hun toegang hebben kunnen kopen: zij hebben per ticket 1 miljard euro neergeteld. Adrian wordt vervolgens door zijn Indiase collega opgebeld met de mededeling dat India op het punt staat overspoeld te worden door een gigantische tsunami. Hierdoor beseft Adrian dat de tsunami hen eerder zal bereiken dan gepland, en dat ze op moeten schieten. Wanneer Anheuser dit hoort, maakt hij de beslissing de poorten van de schepen eerder te sluiten, waardoor tienduizenden mensen, onder wie Yuri en zijn zoons, buitengesloten worden.\r\nJackson en z'n familie worden intussen opgepikt door een Tibetaanse monnik die op weg is naar de schepen om aan boord te gaan. Ze worden door diens broer aan boord gesmokkeld van een ark via de machinekamer en Jackson beseft dat de schepen geen ruimteschepen maar arken zijn. Ze komen vast te zitten wanneer de poorten weer zakken op bevel van Adrian, die de buitengesloten mensen toch wil binnenlaten. Gordon wordt tussen de tandwielen geslingerd en overlijdt, en tegelijk komt ook een drilboor vast te zitten tussen de motoren, waardoor de poort niet meer volledig kan sluiten. Yuri weet z'n kinderen net op tijd aan boord te krijgen, maar valt vervolgens zelf van het platform en sterft. Nu de poort niet meer volledig sluit, kan de bemanning de motoren niet starten. De tsunami komt al snel hun kant op en water begint de ark binnen te stromen, waarna de passagiers benedendeks door het water waden. Jackson en z'n gezin worden gesplitst doordat waterbestendige deuren sluiten. Daardoor komen zij in verschillende compartimenten terecht. Adrian ziet via de camera's dat Jackson aan boord is weten te komen en haast zich naar de compartimenten om hem en zijn familie te redden. Tamara, die alleen zit, verdrinkt al snel wanneer het water te hoog komt. Jackson hoort van Adrian dat de compartimenten alleen maar open kunnen gaan wanneer de boor uit de motoren wordt gehaald en het hele systeem weer werkt. Met hulp van z'n zoontje Noah weet Jackson dit voor elkaar te krijgen. De poort sluit weer zodat de motoren kunnen worden gestart en een botsing met de Mount Everest ternauwernood wordt voorkomen. Jackson en z'n familie maar ook de monniken worden bevrijd, en Jackson en Kate herenigen zich.\r\n27 dagen later (datum: \"27ste dag van de eerste maand, jaar 0001\") krijgen de arken de eerste satellietfoto binnen, waaruit duidelijk wordt dat Afrika het enige continent is dat niet volledig is overstroomd. Het ligt nu zelfs hoger, waardoor de Drakensbergen nu de hoogste bergen ter wereld zijn. Uit metingen wordt duidelijk dat de lucht weer enigszins schoon is en dat de poorten van de arken kunnen worden geopend. Daardoor kan de mensheid voor het eerst sinds de overstroming weer naar buiten.","id":"519a3369760ee37bb029a010","url":"https:\/\/www.themoviedb.org\/review\/519a3369760ee37bb029a010","movie_id":14161}
{"author":"John Chard","content":"And the public gets what the public wants.\r\n\r\nRoland Emmerich was armed with a $200 million budget, and this is what it produced. It's an easy film to dislike from an intellectual level, artistically as well, while the science fiction boffins no doubt had kittens where the science was concerned. It's also easily one hour too long in length, and come the second half of the marathon it starts to sag. There's only so many times you can watch your lead protagonists escape crumbling carnage - via various modes of transport - before the fun factor begins to wane. However.\r\n\r\nThe carnage effects are grade \"A\" stuff, eye popping and ear splintering, Emmerich is a master at this sort of thing, and with a likable cast comfortably chewing through the safe disaster film making screenplay, it's a very decent popcorn blockbuster. It also isn't afraid to explore some dark moments, all of which - while not all being a surprise - strike strong emotional chords. It knows its disaster movie roots and is happy to tug on them.\r\n\r\n2012 made a $500 million profit, that's a figure not to be ignored. The blockbuster movie loving public lapped it up, they often love this stuff, they just want to see the world exploding and chases and crashes and humans imploding or being heroic. If you have to strip it bare on any sort of cerebral level, then of course it's naked. But fully clothed, attired purely in modern film popcorn clobber, then it's grand dramatic and exciting fun. And this even as you have to massage your buttocks at the two hour mark. 7\/10","id":"56473fc09251413ae10033a4","url":"https:\/\/www.themoviedb.org\/review\/56473fc09251413ae10033a4","movie_id":14161}
{"author":"Gimly","content":"I know that even amongst the rocky track record of the _Terminator_franchise, _Terminator Salvation_ is not especially well-liked. I've always been a little bit of an outlier when it came to this series though; like everyone else, I know the first two are the only great ones, but to me, it's actually not _T2_ that stands at the top of the pile, but _The Terminator_, the first film. And since that first film, we've copped 5 new runs at a _Terminator_ movie. Out of all 5 of them, _Salvation_ is the only one that tried something different from the first one. Even the lofty success of _T2_ was garnered using the same core concept as the original movie. _Salvation_ hits something new, and while that obviously doesn't work for a lot of its audience, for me, it's the best movie outside of the first two that the franchise has made to date.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5e86c3053f7e1d00175d6748","url":"https:\/\/www.themoviedb.org\/review\/5e86c3053f7e1d00175d6748","movie_id":534}
{"author":"Hady Palsu","content":"worst of the terminator series","id":"50950a25760ee369ec001532","url":"https:\/\/www.themoviedb.org\/review\/50950a25760ee369ec001532","movie_id":534}
{"author":"Jodie","content":"What can I say about Terminator Salvation? It's a decent addition to the Terminator series, but has major issues. Some would say that it is the worst of the series, but I disagree. T3 will always hold that top honor for me. \r\n\r\nIt was nice to see the return of Kyle Reeese. It was a different look at a character that was forgotten to quickly. John Connor was a bit stale and I wanted way from his character. \r\n\r\nIt was nice to see this future everyone spoke about in past films, Problem was this film felt darker than all the others, excluding T1. The first film was pretty dark but had a storyline And an R Rating to back that up. This film just didn't feel like it belonged to the Terminator world. And a few nostalgic lines and visuals did nothing to make it feel like it was part of the franchise. \r\n\r\nAll of that being said, the film still had some decent action scenes and some interesting moments. It's not bad, but its not fantastic either.","id":"58a854b09251415671008faf","url":"https:\/\/www.themoviedb.org\/review\/58a854b09251415671008faf","movie_id":534}
{"author":"Anton2k","content":"What can I say about this movie, its amazing! full of explosions and action. The setting is slightly different than other terminator films but I like this new \"survival\" setting more so than the older terminators. Terminator 2 was and always will be my favourite terminator movie but this one sure comes close, defiantly my second favourite terminator movie.\r\n\r\nThere is only so much a review can tell you but this is a must watch movie for any one who has not seen it yet.","id":"500ece6f19c295594f0033b2","url":"https:\/\/www.themoviedb.org\/review\/500ece6f19c295594f0033b2","movie_id":534}
{"author":"Reno","content":"**A relationship viewed from the past and present!**\r\n\r\nNot easy to understand in just one watch. But still it does justice for watching it once. Too random sequences of present and past, though the point was proven. It's nothing, but a simple romance drama. Most close to the real world relationship. You would still feel the cinematic effect, yet if you encounter a scene that happened in your life and around you, that won't be a surprise. Because a relationship has to go through such phases.\r\n\r\nI felt like the dialogues should have been much better, because I can't point out it was whether editing issue or the dialogues. At the end, I realised it was the character Peter, designed in that way. Yep, he seems an average, particularly his skills against women, are poor. So I felt bad for Vandy to get trapped with such person. But love can strike anywhere to\/with anyone, right! This is a decent film if you like to take a chance, because it is not your regular romance-drama.\r\n\r\n_6.5\/10_","id":"5a77120ac3a3686b5101ec55","url":"https:\/\/www.themoviedb.org\/review\/5a77120ac3a3686b5101ec55","movie_id":34128}
{"author":"Wuchak","content":"Twilight of the grim, grey… um…\r\n\r\nRELEASED IN 2009 and directed by Nicolas Winding Refn, \"Valhalla Rising” takes place in the 11th century where a one-eyed mute thrall (Mads Mikkelsen) obtains his freedom in the Scottish Highlands and joins a band of Viking Christians on a voyage to the Holy Land to fight in the Crusades, but the expedition doesn’t go as planned.  \r\n\r\nThe movie definitely LOOKS and SOUNDS awesome with an ambient score reminiscent of Agalloch, but without the heavy riffing or manic drumming. It’s an artsy non-blockbuster with a tone akin to \"Aguirre, The Wrath of God\" (1972) and \"Black Robe\" (1991). “Apocalypto” (2006) is a good modern comparison, although the story isn't as compelling as “Black Robe” or “Apocalypto.” It has elements of “Apocalypse Now” (1979) but the thin story just isn’t anywhere near as fascinating. Still, it’s okay.    \r\n\r\nThere are some weak points, like the Viking chief saying \"It's a river\" when this would've been obvious about an hour earlier when the mist first cleared (aduh). I'm sure the director would chalk it up to artistic license. Another issue is that the film is slow with not enough events to justify its runtime. As such, we get needlessly drawn-out scenes like the discovery of fresh water (which was obvious from the get-go of the sequence). The whole episode could’ve been done in a third of the time given.\r\n                   \r\nTHE MOVIE RUNS 1 hour, 33 minutes and was shot in Scotland. WRITERS: Refn, Roy Jacobsen and Matthew Read. \r\n \r\nGRADE: B\r\n\r\nINTERPRETATION ***SPOILER ALERT*** (Don’t read further unless you’ve seen the movie).\r\n\r\nThe silent One-Eye is the incarnation of Odin. He is invincible and holds the power to see the future. He disdains the Christian Vikings who’ve usurped his influence over his people. He tests many in battle to see if they’re worthy, but finds none. Nevertheless, he sullenly sees his people off to their new (holy) land, America, where Scandinavians were the third most numerous immigrants. The Boy is a type of Thor, his son, who will sort of replace him in America once the grim god ironically sacrifices himself à la Jesus Christ.","id":"5aef428a925141768800868a","url":"https:\/\/www.themoviedb.org\/review\/5aef428a925141768800868a","movie_id":37861}
{"author":"John Chard","content":"It never manages to rise above its one trick.\r\n\r\nNicolas Winding Refn directs and Mads Mikkelsen stars in this ponderous exercise in arty veneers. Refn boldly strips back the dialogue and plot to reveal a picture big on ideas but poor in execution. As the story plods along, stopping only briefly for some guttural violence now and then, it becomes evident that the makers have made a painfully boring movie. At first the drained out colour photography looks like a masterstroke of ethereal atmospherics, but this also wears off and only compounds the overall feeling of monotony that pervades the pic.\r\n\r\nHugely disappointing venture from a director capable of so much more. 3\/10","id":"538e5c5ac3a36832c60001dc","url":"https:\/\/www.themoviedb.org\/review\/538e5c5ac3a36832c60001dc","movie_id":37861}
{"author":"John Chard","content":"I should have crushed you under my heel the day you were born.\r\n\r\nUnderworld: Rise of the Lycans is the prequel to the previous two Underworld films. It tells the story about what led to the werewolf\/vampire feud, with bloody energetic results.\r\n\r\nIn core essence this is Braveheart\/Spartacus, only in CGI laden horror\/action form. Michael Sheen buffs up into Karl Urban, who as Lucian (bad ass Lycan) leads his species to a bloody revolt, and Kate Beckinsale has made way narratively for Rhona Mitra, who sexes things up. The action is pulse raising and the Gothic designs and atmospherics are first rate, while the battle royale finale is fit to crown any genre film of its type. \r\n\r\nProblems are evident, though. The constant flow of CGI blood becomes irritating after a while, and Bill Nighy (in spite of being a franchise regular) is still looking miscast! But it has proved to be a series with hairy legs and fangs that refuses to die, a popcorn munchers dream. So enjoy the spectacle and the screenplay homages, and I'll have a bag of tortilla chips and a choc ice please. 6.5\/10","id":"561766329251412af8001bc0","url":"https:\/\/www.themoviedb.org\/review\/561766329251412af8001bc0","movie_id":12437}
{"author":"EvilWayz","content":"No idea why the rating for this flick is hovering just above 50\"%.  As far as prequels go this one is brilliant.  The first movie left a lot of gaps in the story, where did Lucian come from, what started the war, how did he get to be the lover of the King's daughter in the first place.  While there is a lot of epic battles with the gore that goes with, this movie is easily the best movie in the franchise, which is minor heresy on my part since Kate Beckinsale is the quintessential vampire in my book.  Rhona Mitra throws down hard as the rebellious daughter of the King, and her haughtiness and disdain are completely believable to the point we think that Lucian's love for her is unrequited.  I can't go into it any more without spoiling the movie but if Evolution let you down a bit, Rise of the Lycans will restore you faith in the franchise.","id":"59570ab39251412b31076baf","url":"https:\/\/www.themoviedb.org\/review\/59570ab39251412b31076baf","movie_id":12437}
{"author":"Wuchak","content":"***Friday the 13th meets Bring It On***\r\n\r\nA cheerleading squad from the suburbs of Houston goes to summer camp to improve their camaraderie and cheer skills, but a masked killer is on the loose and most of the youths end up dead one-by-one.\r\n\r\n“Spirit Camp” (2009) is a satirical meshing of the Friday the 13th and Bring It On flicks. It’s a spare change Indie, but the director\/writer (Kerry Beyer) is proficient and so the filmmaking is professional with quality locations, lighting, photography, gore, sound and score\/soundtrack. Even the no-name cast rises to the challenge with an amusingly campy approach, although there are a couple of scenes with noticeably dubious “acting.”\r\n\r\nBeyer wisely includes all the staples of the slasher genre and, best of all, knows how to photograph women. The standouts are Katy Rowe (Amber), Denise Williamson (Monica), Amy Morris (Lindsay), Julin (Rachel) and Sarah McCulley \/Thygeson (Beth); superb job on this front.\r\n\r\nWith the campy vibe I had doubts that the story would remain compelling over the course of the slightly overlong runtime (for an Indie slasher, that is), but Beyer keeps things moving and I eventually found myself taking the events fairly seriously (surprisingly). A plus is that I couldn’t predict who the killer turns out to be. A minus is that he shoulda toned down the crudity, but it’s not as bad as some flicks, e.g. the tasteless “American Pie,\" and he was obviously aiming to amuse. \r\n\r\nThe film runs 1 hour and 36 minutes and was shot in Cleveland, Texas (a 2.5 hour drive south of Lake Tyler), with the suburban scenes done in Houston.\r\n\r\nGRADE: B\/B-","id":"5e5c06749b8616000ffa71fd","url":"https:\/\/www.themoviedb.org\/review\/5e5c06749b8616000ffa71fd","movie_id":40770}
{"author":"Andres Gomez","content":"The FX is OK and the uneasiness and thrill is always there but the script is stereotypical, weak and full of holes.","id":"547585bdc3a368364c00212c","url":"https:\/\/www.themoviedb.org\/review\/547585bdc3a368364c00212c","movie_id":37707}
{"author":"John Chard","content":"Brundledren!\r\n\r\nSplice is a tricky picture to evaluate, for its ideas are superb. One could argue that it brings a new petri dish full of meddling scientists facing the consequences of their actions, while conversely it justifiably feels like a Cronenberg knock-off.\r\n\r\nPsychological discord is in abundance, with its slants on skew-whiff parenting giving the pic a dark fascination, and as unpleasant as the male fantasy angle is, it does hold a morbid interest factor.\r\n\r\nYet come the final third the makers let things run away from them, the bonkers dangers of tampering with science giving way to daft schlock, even managing to be distasteful in the process - while the finale is a weak attempt at a \"TBC\" cliff hanger.\r\n\r\nLead cast members are turning in good perfs. Adrien Brody and Sarah Polley as the meddling science couple hold court well, and Delphine Chaneac as the Chimera splicer of the piece really nails all the various emotional strands required for a tricky role.\r\n\r\nDirector Vincenzo Natali  has shown with Cube and Cypher he has something to offer the horror\/sci-fi splinters of film, but this is a mixed bag. A film of great ideas let down by overheating the plot for shock values, while the levity inserted into the play is misguided and damaging for dramatic worth. 6\/10","id":"5c04070592514113290ab255","url":"https:\/\/www.themoviedb.org\/review\/5c04070592514113290ab255","movie_id":37707}
{"author":"John Chard","content":"This childbirth thing is murder you know!\r\n\r\nOh no, not another evil child horror film I hear you cry! Yet there’s something very fresh about Paul Solet’s movie, it’s deeply unsettling but emotionally complex, even gnawing away at our inner built capacities for empathy and sympathy.\r\n\r\nJordan Ladd plays the mother of the piece, hit with personal tragedy time and time again, her will is tested to the limit when a car crash strips her of her husband and renders the baby she is carrying as being a sure case of still born. But she’s determined to carry it to term, and when she literally wills the dead child alive, it responds in kind and becomes Grace, the miracle baby…\r\n\r\nWhat follows is the disintegration of Ladd’s character and of the key characters around her. Meditations on grief are heavy but richly so, as is the nods to post-natal depression. The horror elements are strong, as baby Grace shows a thirst for something other than milk, and the slow-burn approach favoured by Solet pays off with a final quarter of heartbreaking devilment. Cast are dandy, especially a very committed Ladd, while other tech credits keep the film very much in the upper echelons of this sub-genre of horror. 8.5\/10","id":"54484338c3a3680faa00026d","url":"https:\/\/www.themoviedb.org\/review\/54484338c3a3680faa00026d","movie_id":21398}
{"author":"Andres Gomez","content":"Some kind of modern Tom Sawyer.\r\n\r\nNothing exceptional, but good to spend an evening with the family.","id":"5335dd34925141098500256b","url":"https:\/\/www.themoviedb.org\/review\/5335dd34925141098500256b","movie_id":51249}
{"author":"John Chard","content":"As warm and as enchanting as a Whisky Mac.\r\n\r\nHe's a failed actor, his girlfriend has left him and gone to make it big in America, and now, school teacher Paul Maddens has to direct the Nativity play. Worse still, after a little white bragging lie to an old rival, Maddens finds things escalating out of his control.\r\n\r\nAh, the Christmas movie, a piece of work aimed at a certain market at a certain time of year. Many movies of Christmas past have been excruciatingly bad, either by losing sight of the holiday heart, or by going for a different angle at a season which is meant to be jolly. In the main then, the Crimble picture has been blighted by a train of thinking akin to damned if you do, damned if you don't. Debbie Isitt's Nativity! will not achieve any reviews proclaiming it to be refreshingly new, rightly so since it's a standard seasonal fare based story. What hopefully will be said is how utterly beguiling and warming the film is, so yeah! Basically a Christmas picture doing its job.\r\n\r\nChiefly in its favour is that it has a naturalness to it that keeps its charm grounded. There's no miracle in the offering here, no boink over the head with a sledgehammer to enforce its message. Isitt is happy letting the film and its delightful characters go with the flow, the result ending up as being a fully involving experience. It helps too that the army of children (plucked from local auditions by Issitt) are adorable and funny in equal measure. Not that the adults come up short either. Martin Freeman (Maddens) gives a wonderfully controlled performance as the central character, while Marc Wooton as Mr. Poppy, a character showing the child in all us adults, almost steals the movie from the delightful moppet squad. It has its faults, such as a trip to America that quickly loses momentum, and if we are honest then surely the actual Nativity finale goes on a touch too long. But such missteps are easily forgiven given the impact as a whole.\r\n\r\nMy cinema visiting group at Xmas 2009 consisted of 4 adults and 4 teenagers. As we filed out, there was a mixture of wet eyes and beaming smiles. So yeah! Job done for sure. 8\/10\r\n\r\nFootnotes: Xmas 2013. With a sequel hitting the theatres this Christmas I thought it time to revisit this film. Delighted to report that it still manages to warm the old cockles of my Xmas heart and remains a seasonal picture that I urge more folk to seek out.\r\n\r\nXmas 2015. Rewatched, still lovely.","id":"568074b79251414f630075cc","url":"https:\/\/www.themoviedb.org\/review\/568074b79251414f630075cc","movie_id":49522}
{"author":"Andres Gomez","content":"Great drama in which a ball of lies hit back to the main characters once and again.\r\n\r\nThe suspense is greatly kept while we attend to the limitations and roles imposed by culture and social conventions. In several ways, a movie setting the path for the next one: \"A Separation\".","id":"543f798bc3a3685e45001267","url":"https:\/\/www.themoviedb.org\/review\/543f798bc3a3685e45001267","movie_id":37181}
{"author":"Debbie D'Amico","content":"*SPOILERS* \r\n\r\nI bought this film from Amazon and I really liked it! I've read some really positive reviews and some negative ones as well, but being an indie film fan and a fan of previous John Orrichio films - I bought Abduction. The camera-work is his best yet with beautiful outdoor shots and disturbing lighting and effects that show how the town is twisted behind closed doors, but picturesque and normal to the outside world.\r\n\r\nIt's the story of a remote New Jersey small town that is not on any map. Basically the townsfolk kidnap unsuspecting tourists and sell them into slavery, they harvest their organs for sale on the black market or make leather goods out of them! Everything starts to unravel when an up & coming pop star from South America is kidnapped and her bodyguards come to town to find her. The whole town is in on the secret. The story is original and plays out well. The first 10 minutes are a little slow, but it picks up nicely from there.\r\n\r\nAs for the acting, Tony Rugnetta (Jacob) is excellent. His best role to date. Roberto Lombardi (Johnny) is perfect, convincingly evil & sexy at the same time! Christy Callas (Lilly) who is vulnerable & sinister at the same time and Gerry Kirschbaum (Doc) who has the cool demeanor of a Doctor with a hidden mania. Other notable performances are Deana Demko (Rosie) and Christina Sampson (Myrtle). There is rarely a stumble by any of the actors.\r\n\r\nI also think that to truly enjoy this film you have to take it for what it is. A low budget, well made drama \/ thriller that is a little creepy, a little campy\/funny and a little bloody. It's not a horror film per se and it's not for everyone. If you want the thrills of a Saw movie, pass on this. If you like Rosemary's Baby, this is right up your alley. The film has gotten bashed, but I believe that is coming from former colleagues of the film maker who are bitter. Judge for yourself!!","id":"54de546cc3a368454d001e68","url":"https:\/\/www.themoviedb.org\/review\/54de546cc3a368454d001e68","movie_id":175944}
{"author":"Andres Gomez","content":"Good story telling and cast. Nothing outstanding but a good time and laughs.","id":"54f5f836c3a3683a5700004e","url":"https:\/\/www.themoviedb.org\/review\/54f5f836c3a3683a5700004e","movie_id":38842}
{"author":"Andres Gomez","content":"Jeunet is faithful to his style. Nice and kind story, not close to Amelie but entertaining nevertheless.\r\n\r\nThe cast, in any case, is superb.","id":"52533f8319c29576090252b1","url":"https:\/\/www.themoviedb.org\/review\/52533f8319c29576090252b1","movie_id":27936}
{"author":"Per Gunnar Jonsson","content":"This movie is kind of difficult to rate. In one sense it is the kind of hardboiled private investigator taking no shit and dishing out his own kind of justice that I like. However it is also, at times, a really silly movie with rather a silly script and a main character that takes a ludicrous amount of beating and still pops up and kicks ass.\r\n\r\nIn the end I decided that I did indeed like this movie. I liked its rather “noir” atmosphere and the fact that the character indeed is tough as nails and kicks some serious ass. There is plenty of action in the movie and it is quite violent and sometimes a bit silly but it fits the movie and I think this particular movie would be less to my liking without it.\r\n\r\nThere are some interesting bad guys in the movie as well. There are of course the basic thugs which are disposed of rather quickly but there is the lollypop girl which is adding a bit of flavor, there is the big black guy which is really not so much a bad guy but a worthy adversary of Malone and then there is the totally whacko pyromaniac, Matchstick. This guy is insanely scary. I quite liked him, not as a person of course but as an element of the movie.\r\n\r\nThe story is sometimes as whacko as some of the characters in the movie so do not expect a good mystery or even a coherent story out of this movie. Sure it has a red thread going through it and there is an explanation at the end but sometimes what the characters do and how we get from start to finish seems rather ad-hoc to me. Still, the overall wackiness of all the various elements of this movie combines to something that I did indeed like.\r\n\r\nThe end was a wee bit disappointing though. Sometimes, when watching a movie, it is clear that there was an intention to produce a sequel but end a feature movie with a “To be continued…” text is really stupid unless you already have a signed contract for the sequel. Luckily the actual story is brought to a good enough conclusion and it is just a few of Malone’s personal loose ends left at the end of the movie.","id":"54212d45c3a36818c6000df7","url":"https:\/\/www.themoviedb.org\/review\/54212d45c3a36818c6000df7","movie_id":28019}
{"author":"Wuchak","content":"***Hitchcock-ian desert mystery that leaves you scratching your head***\r\n\r\nAfter a shotgun wedding in Vegas, a couple (Thomas Jane & Lauren German) experiences a night of hellish mystery in the desert. Ron Perlman plays a cop and Chris Browning a curiously intrusive stranger. Jane directed the film based on a script by Tab Murphy.\r\n\r\n“Dark Country” (2009) is a modern Hitchcock-ian mystery\/thriller similar in tone to, say, “Wind Chill” (2007) but with a different story and inverse setting (the nighttime desert rather than the nighttime snowy forest). The first half is slow-going with mundane dialogues and weird goings-on, but the story picks up in the second. Unfortunately, the last act is muddled and leaves you with many questions. But, if you reflect on it, the answers are there if you care enough to seek ’em out.\r\n\r\nVisually, this is a masterpiece of mood and haunting imagery. Have you ever stopped at a rest stop in the middle of nowhere late at night? How about hang out in the desert wilderness at night, whether in a vehicle or on foot? Either can be eerie and “Dark Country” captures this. Story-wise, however, it’s not as good as “Wind Chill”; the strange climax lacks the emotional whollop and is just too ambiguous IMHO.\r\n\r\nThe movie runs 1 hour, 28 minutes and was shot in New Mexico.\r\n\r\nGRADE: B-","id":"5c7561640e0a260b581a7621","url":"https:\/\/www.themoviedb.org\/review\/5c7561640e0a260b581a7621","movie_id":23382}
{"author":"JPV852","content":"Not great but still entertaining vampire movie with a fun twist at the end. I'm not usually the biggest fan of vampire films, or zombie ones for that matter (I'm more a fan of classic slashers like Halloween and Friday the 13th) but this one wasn't too bad, aside from the occasional terrible CGI blood. Also helped that the film has Willem Dafoe in it, who I wish was the central character (though Hawke was by no means bad).","id":"5d683b36a275020012af895c","url":"https:\/\/www.themoviedb.org\/review\/5d683b36a275020012af895c","movie_id":19901}
{"author":"John Chard","content":"The female of the species is more deadly than the male.\r\n\r\nVince is crestfallen, his relationship with his lady is over. Enter his blokey bloke mates who decide to take him out to a country village for a fun lads weekend. Trouble is is that the village of Moodley has seen the female population turned into an army of man-eating \"zombirds\" out for male flesh.\r\n\r\nNo doubt about it, Doghouse will not so much divide in two the horror\/comedy faithful, it will dissect them into little pieces and continue to do so for quite some time. Already it has been chastised for being misogynistic, a poor imitation of British genre benchmark Shaun Of The Dead, and more baffling to me, a waste of British talent. All of which are wrong. Of which the last statement from me has probably already seen a number of internet users vote negative on this review before reading further. Cest la vie, but if you are still with me? Then thank you for your time.\r\n\r\nDoghouse is one of the most in tune self mocking British comedies concerning lad culture of recent times, arguably ever? Fifteen minutes into the film our group of \"lads,\" after having been introduced to us through a series of attitudes involving their partners {there's a gay guy too folks}, stand together and a phone rings. The ring tone is that bastion of British machismo, the \"Match Of The Day\" theme, our group collectively dig into their pockets for their mobiles thinking it may be their phone ringing. From here on in, the marker for what type of film Doghouse is has been set.\r\n\r\nFrom there we lurch into a battle of the sexes with wry observations as our \"heroes\" do battle with zombiefied female stereotypes. Hairdresser, dentist, schoolgirl, goth girl, a bride, horsey type and even a god damn lollipop lady. All scripted with astute knowing and self-critique from Dan Schaffer as the \"lads\" veer from scared cat wimps to once again being sexually brave Ramboesque types. Honestly, and I speak as a seasoned British male, some of the dialogue here is as sharp as the sexy zombie hairdresser girl's scissors are. Oh yeah, forgot to say that the blood flows for those of the gore persuasion, very much so. Some scenes are horror delights, they may come with a quip or a tongue in cheek reference, but there is some fine blood letting stuff here.\r\n\r\nIn the cast you have Stephen Graham, Noel Clarke and Danny Dyer. I wonder how many folk have noticed the irony that all three guys are not long out of being in \"blokey\" hooligan type films? Dyer does his usual Cockney wide boy act that will annoy those who don't buy into it, but really there is a reason he plays to type, it's because like it or not? He's effing good at it governor. Graham and Clarke are both British treasures, not based on this film you understand, but they have much ability and it's great to see them having such a great time. While the support from the likes of Lee Ingleby as a horror comic\/Evil Dead fan is truly \"nudge nudge-wink wink\" enjoyable. Director Jake West has moved considerably a few notches forward with this picture, so add his name to the list of British genre directors to watch alongside Paul Andrew Williams and Christopher Smith.\r\n\r\nComparisons with Shaun Of The Dead are folly, that film is an awesome parody of the genre, a film that remains a sub-genre highlight. This is a different film, though, one that parodies the genre with a totally focused observational narrative on a culture that warrants humorous inspection. So be it, I will happily watch this (and have done) with any of my film loving lady friends because I know they will see the pointedness of it all. And besides, any film that slots in Space's magnificent \"The Female Of The Species\" has to be worth a look at least. 8\/10","id":"5bd95835925141155f008d28","url":"https:\/\/www.themoviedb.org\/review\/5bd95835925141155f008d28","movie_id":20606}
{"author":"MoHA","content":"Doogtooth, the official Greek entry to the 2011 Academy Awards, is nominated for Best Foreign Film.  Released in 2009, and directed by Giorgos Lanthimos, Dogtooth is a strikingly original film that captures a world that is at once like nothing you’ve ever seen, but oddly familiar at the same time.\r\n\r\nThe story is about a family of five who live in a beautiful walled villa in Greece.  It’s more like a compound because the patriarch (Christos Stergioglou) is the only one who ever gets to venture into the world beyond the tall fences that surround the property.  His wife (Michele Valley) and three teenaged children live in a world that at first seems oddly Edenic.\r\n\r\nThe film opens with the children listening to an instructional cassette.  They learn that the word “sea” means a leather armchair, “motorway” means a strong wind, and “excursion” means a strong, resilient material.  Anything that hints at the world outside the walls of their home is obscured.  Even the airplanes that fly in the air are construed to be toys, and when one is spotted, one of the parents will run into the house and through a toy plane out into the garden so the children will believe the lie.\r\n\r\nThe only outsider allowed into the compound is a woman named Christina (Anna Kalaitzidou), a security guard at the father’s place of employment who moonlights as a kind of private prostitute whom the father hires to satisfy his son’s budding sexual urges.  Christina is brought to the compound blindfolded, but on the rides to and from the family home, the father tries to engage her in small talk, which amounts to questions about her hygiene, and whether she wears the perfume he has bought her as a gift.\r\n\r\nMuch time is devoted to daily routine of the family.\r\n\r\nWe see the father at work, where he has created yet another elaborate ruse to get out of having his boss over for dinner (he says that his wife, a former handball champion, is confined to a wheel chair – the result of a tragic accident).  He’s such a cipher of a man that the boss, along with the children, buys into the lie without a hint of suspicion.\r\n\r\nLife at home, though, is where the film really shines.  We see the kids at play.  The eldest child is the son (Hristos Passalis), who looks to be 18 or 19.  Two sisters (Angelika Papoulia and Mary Toni) look to be 18 and 17.  Though they are on the verge of adulthood, the behavior of the children is more pre-adolescent.  There is an innocence about them that is both sad and endearing.  The actors playing the kids beautifully capture the behavior and mental territory of young kids that comes through in the games they play and the way they bicker with one another and depend on their parents for all their information about the world – a world they will only be ready to experience when either their left or right dogtooth falls out.\r\n\r\nWhat is a dogtooth?  Exactly.\r\n\r\nWhen the son asks the mother what a zombie is, she asks where he heard the word.  He lies and says that he thinks he heard the father say the word.  The mother pauses, then tells him a zombie is a small yellow flower.  Later, the joke is paid off when the son stops in the middle of his play in the garden and yells for the mother to come and see two zombies he’s found.\r\n\r\nTricking children is one thing, but as they grow, certain fantasies and myths that parents create are found out to be lies.  Of course, this often happens when our kids come home with conflicting information from the outside world, which is what happens to make the artificial world of the father begin to unravel.\r\n\r\nChristina, the prostitute, wants oral sex, which the son doesn’t like, so she bribes the oldest daughter into satisfying her by bringing videos, like Rocky and Flashdance, that give the daughter a notion of what goes on in the world her father has taught her to fear.\r\n\r\nThese videos are like the bite from the fruit of the tree of knowledge of good and evil, and even though the father finds out about them and banishes both them and Christina from their lives, the damage has been done.  Things will never be the same again.\r\n\r\nThe acting in Dogtooth is beautifully realized.\r\n\r\nStergioglou doesn’t play the father as a tyrant, but as a kind, loving, but firm parent, with only the best interests of his family – as he sees them – in mind.  This father, despite what happens in the movie, never comes across as a villain, which is to Stergioglou’s great credit.\r\n\r\nThe children, especially Papoulia and Tsoni, capture a prolonged innocence that doesn’t rely on tricks or costuming, but on finely observed performances.  What’s weird is that these are very damaged people, but until they are told so or try to live in the outside world, they’re just kids.\r\n\r\nBecause of how perfectly Lanthimos sets up this alternate world, I never once questioned anything that went on there.  It all made sense.  Dogtooth is a well constructed escape that takes a long, hard look at family and parenting and the choices we sometimes make as parents to both lock out the world and lock in our kids – and the toll those decisions sometimes take.  Sometimes sad, sometimes funny, Dogtooth is a film deserving of its nomination – and your attention.","id":"55d9073192514143e6002fa9","url":"https:\/\/www.themoviedb.org\/review\/55d9073192514143e6002fa9","movie_id":38810}
{"author":"Gimly","content":"Handballs it in on just about every important (and engaging) aspect of the actual _Portrait of Dorian Gray_ story. \r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5e0761d29bcd0f00151113f8","url":"https:\/\/www.themoviedb.org\/review\/5e0761d29bcd0f00151113f8","movie_id":23488}
{"author":"John Chard","content":"How Ominous!\r\n\r\nAnother adaptation of the Oscar Wilde story. Film is about Dorian Gray (Ben Barnes), a man taken by the hedonism bug shown to him by Lord Wotton (Colin Firth). Upon having his portrait painted, Dorian comes to never age, but at what cost?\r\n\r\nClearly not faithful to the literary source, Oliver Parker's film is an interesting misfire. As a sexy chiller it kinda works, having more in common with Hammer Films of the 70s than with Wilde's prose. Yet it often feels like style over substance, blood or nudity for blood and nudity's sake. While strong performances by Firth and late in the play by Rebecca Hall hold the attention, Barnes is bland and apart from being pretty, is unconvincing. Also irritating is Charlie Mole's musical score, it's good, it's just not in the right movie!\r\n\r\nThe makers try to make a Gothic horror film from a Gothic horror novel, but never quite get to grips with the undercurrents of the story. Shame. 5\/10","id":"5633d9e09251412857015935","url":"https:\/\/www.themoviedb.org\/review\/5633d9e09251412857015935","movie_id":23488}
{"author":"Andres Gomez","content":"Quite a disappointment. I was expecting much more from this movie but the story is just boring and uninteresting. Jared Leto makes a good performance (the movie is just tailored for him) and they are also good Kruger and, specially, Regbo and Temple.\r\n\r\nHowever, as I said, the story is quite pointless. The movie finishes and you just feel like you have watched a bad joke without purpose.","id":"571fe63192514152e7000835","url":"https:\/\/www.themoviedb.org\/review\/571fe63192514152e7000835","movie_id":31011}
{"author":"John Chard","content":"Art Deco Neo-Noir has more style than substance?\r\n\r\nAcross the Hall is directed by Alex Merkin and Merkin co-writes the screenplay with Jesse Mittelstadt and Julien Schwab. It is adapted from Merkin's short film of the same name that aired in 2005. It stars Mike Vogel, Brittany Murphy, Danny Pino, Natalie Smyka and Brad Greenquist. Music is by Bobby Tahouri and cinematography by Andrew Carranza.\r\n\r\nThe Riverview Hotel, and Terry (Pino) has rented the room opposite the room where he believes his fiancée June (Murphy) is cheating on him...\r\n\r\nAlex Merkin clearly loves film noir and knows his noir onions, this is not in doubt due to the twisty story, characterisations and superb stylistics on offer here. And just in case anyone is in any doubt about this, the keen of noir eye will notice the film showing at the theatre next to the Riverview Hotel is Nightmare Alley, the brilliant Tyrone Power noir pic from 1947.\r\n\r\nOn the style front the production is top draw, Carranza's photography is both beautiful and ghostly, creating a brooding atmosphere befitting the plot machinations. The look is supplemented considerably by Tahouri's edgy pulse like musical score, while the Art Deco design of the Riverview is a splendid accompaniment to dark deeds unfolding.\r\n\r\nAs a story we are served up standard fare, the insertion of twisters and linear jumps not really lifting it out of its predictable trajectory. Which is a shame, because performances are solid and Merkin obviously has love for noir as a film making style. The resolution is expected but handled well enough to pay off the patient, but as a whole Across the Hall just about rises above average, but really this is more down to style than substance. 6\/10","id":"5c0507de0e0a2629ce0c0c92","url":"https:\/\/www.themoviedb.org\/review\/5c0507de0e0a2629ce0c0c92","movie_id":21469}
{"author":"John Chard","content":"Profanity is a brutal vice. He who uses it, is not a gentleman.\r\n\r\nMichael Jai White is one of the baddest men on the planet, so it was inevitable that he would follow in the footsteps of Van Damme, Seagal, Norris etc etc into movies. \r\n\r\nA martial artist of supreme skill and deadly grace, White brings not only his imposing physique and skills to the film, but also a moody poise to the role of Isaiah Bone, an ex-convict who infiltrates an underground fight circuit to avenge the murder of a friend.\r\n\r\nThere is absolutely no surprises in store here, narratively speaking, but the action, the choreography and the editing are high grade stuff. So strap yourself in and roll with it, let the kinetic fury grab you, and rejoice as another martial arts expert enters the fray late in the day.\r\n\r\nA terrific action film, hoo-hah! 7\/10","id":"56b7b471c3a3684816007841","url":"https:\/\/www.themoviedb.org\/review\/56b7b471c3a3684816007841","movie_id":22164}
{"author":"DanDare","content":"Director Joel Schumacher mixes Viking rune-stones in the USA with Nazi occultists who drink blood, try to grow a third eye in order to become supermen.\r\n\r\nA prologue set in the 1930s sees Nazi historian Richard Wirth (Michael Fassbender) arriving at a farm in Virginia study ancient Viking runes but intends to use the power of the stones for his own means and the German family that owns the farm become his unwilling accomplices through the decades.\r\n\r\nIn the present day Evan Marshall (Henry Cavill) a paramedic suddenly comes face to face with his war hero brother, Victor (Dominic Purcell) who has been missing, presumed dead.\r\n\r\nVictor tells him his outlandish story of being held captive in a farm which he has escaped from and now wants to return and kill everyone there. \r\n\r\nEvan finds the immortal family who claim to be living there is terror and a demonic Wirth in the cellar who needs blood in order to mutate.\r\n\r\nSchumacher has made a low budget but fast paced horror film with a better cast than he ought to have. He even manages to fit in a zombie horse, the plot makes little sense apart from Wirth planned Victor to escape in order to complete his transformation in this blood soaked film.","id":"59203ddc925141499004576d","url":"https:\/\/www.themoviedb.org\/review\/59203ddc925141499004576d","movie_id":30685}
{"author":"Blackdynamite","content":"Best movie ever. That's all.","id":"514b3d2c760ee3622d101433","url":"https:\/\/www.themoviedb.org\/review\/514b3d2c760ee3622d101433","movie_id":24804}
{"author":"John Chard","content":"Mottola strikes one from the heart. \r\n\r\nIt's 1987 and James Brennan is home for the summer after earning himself a degree in Renaissance Studies. Which unsurprisingly isn't any use to him when trying to gain employment in this part of Pittsburg. Which is now a problem since his planned trip to Europe has fell by the wayside due to his father's enforced unemployment. So thus he finds himself working at Adventureland, a rusting time warp amusement park where only odd balls and idiots appear to frequent. But here James will make friends, learn life lessons and maybe just find true love?. \r\n\r\nBe under no illusions, Adventureland is no teen sex comedy reliant on crude jokes and cringe slap-stick moments to get its humour. Which as it's brought to us by the director of Superbad may come as something of a surprise. Greg Mottola is the said director, who here has crafted an ode to his own teenage strife's concerning first jobs and first loves. Though not really offering anything new as such, I mean the old \"summer I came of age\" film is hardly new is it? Mottola has however managed to blend youthful spirits with a serious kink and nicely cloak it in a bittersweet 80s haze. \r\n\r\nSome parts are clearly aimed at the guffaw teen viewers, awkward erections and friends who punch you in the testicles - tee hee hee, Adventureland feels, and is, a subtle film made by someone who clearly lived it. The care and thought that Mottola has put into it benefits the cast as much as it does the viewers. Jesse Eisenberg (James) is a splendid bit of casting, almost poetically slow, he nicely plays it to have the upcoming tribulations totally believable. Enter Kristen Stewart as Em, pretty and smartly essaying a girl, soon to be woman, trying to make sense in her off kilter world. Her scenes with both Eisenberg and the buff Ryan Reynolds, in a role that takes some skill to get as right as he does, are the highlights of the piece. While Martin Starr is the other performance of note as the pipe smoking intellectual, Joel. \r\n\r\nWhat youngsters that I know who have seen the film have had less than favourable reactions to it. This can probably be put down to two things. One is that the expectation of another Superbad-a-like comedy has not been met. Two is that, you know what folks? Mottola hasn't made this for kids, he's made it for those who were once kids themselves in a decade not so very long ago... 8\/10","id":"5eb5b61bbbe1dd00217fdc87","url":"https:\/\/www.themoviedb.org\/review\/5eb5b61bbbe1dd00217fdc87","movie_id":16614}
{"author":"Gimly","content":"I will always, always, always give Australian genre films a chance, but Prey is pure trash.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5a1df565c3a3680b880715bc","url":"https:\/\/www.themoviedb.org\/review\/5a1df565c3a3680b880715bc","movie_id":74024}
{"author":"John Chard","content":"Drifter, Shifter, Fanciful Mister.\r\n\r\nSerial killer movies have become two a penny, it feels like at least a couple come out each year. This one, directed by Michael Feifer, just feels like old hat, like it is treading water to make a point that has been made a hundred times before. It doesn’t help that Henry Lee Lucas has already been covered in brilliantly grainy fashion previously with John McNaughton’s 1990 skin itcher Henry: Portrait OF A Serial Killer, which quite frankly is superior to this in every department. On the plus side are the performances of Antonio Sabato Jr. (Henry) and Kostas Sommer (Ottis), where the former is broody and twitchy, the latter hyper insane, but ultimately it achieves nothing. Kudos, however, is due for at least cleaving close to what facts of the case are known to be true. 4\/10","id":"54485977c3a3680fa50005ff","url":"https:\/\/www.themoviedb.org\/review\/54485977c3a3680fa50005ff","movie_id":31991}
{"author":"John Chard","content":"Gerty, we're not programmed. We're people, do you understand?\r\n\r\nDirected by Duncan Jones and starring Sam Rockwell, Moon finds Rockwell as Sam Bell who is coming to the end of his three year contract on a lunar station working for Lunar Industries. His only companion is an intelligent computer named GERTY (voiced by Kevin Spacey). When Sam has an accident he awakens to find he is now not alone and all he thought and believed in is just not as it seems.\r\n\r\nForget any fears about a low budget and any plot similarity to 2001: A Space Odyssey, for this is a cracker jack of a science fiction picture. Film quickly fills us in on Sam Bell the man and his function up there on the lunar station. His relationship with GERTY the computer grabs our interest whilst the production design has a sort of medicinal sheen to it. Once Sam's solitude is established, the minimal contact with Earth explained, the pic then spins into another dimension, dragging both Sam and us viewers into the vortex.\r\n\r\nTo say more would be churlish, but this is adult science fiction, clever in existential whiles and scathing with observations on corporate shenanigans. Narratively it's evocative in its telling, even haunting and philosophical, where a brilliant Rockwell nails every inch of Bell's search for being, and crucially, the truth. It's all building towards a finale of some devilish substance, no cop outs or easy fed answers, just a pertinent question asked of the viewers. Moon comes highly recommended to sci-fi fans who are after a bit more than mere sparkly fluff and robotic chaos. 9\/10","id":"5c24f4630e0a264ddbf36c6b","url":"https:\/\/www.themoviedb.org\/review\/5c24f4630e0a264ddbf36c6b","movie_id":17431}
{"author":"DanDare","content":"An over the top Ninja action film with visceral bloody scenes. Humdrum story but goofily entertaining.\r\n\r\nRaizo has been trained by the Ozunu clan to be a Ninja assassin since childhood but has turned his back on them.\r\n\r\nRaizo teams up with a Europol investigator Mika to go after his former master to get revenge for the killing of his friend.","id":"5939d465c3a3682371001f9d","url":"https:\/\/www.themoviedb.org\/review\/5939d465c3a3682371001f9d","movie_id":22832}
{"author":"Gimly","content":"Doesn't hold a candle to the original, of course, but none of the change upos that were decided on for this remake really hurt it too badly. The location's changed, most of the characters, but it's still a night, and there's still demons. Better that _Night of the Demons III_ at least.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5d625d2654f6eb711d9b0616","url":"https:\/\/www.themoviedb.org\/review\/5d625d2654f6eb711d9b0616","movie_id":27646}
{"author":"Wuchak","content":"***A famous director loses his inspiration and seeks aid from the various women in his life*** \r\n\r\nReleased in 2009, “Nine” is a drama\/musical about a famous Italian director in 1965 (Daniel Day-Lewis) who loses his inspiration, but its urgent he gets it back because his ninth movie is set to start shooting in ten days and he doesn’t even have a script. He turns to the several women in his life for succor: his wife (Marion Cotillard), his mistress (Penélope Cruz), his costume designer (Judi Dench), his star actress (Nicole Kidman), his mother (Sophia Loren), a fashion journalist (Kate Hudson) and a prostitute from his boyhood (Fergie).\r\n\r\nThis is an adaptation of the 1982 Broadway musical, also dubbed “Nine,” which itself was based on Federico Fellini's semi-autobiographical 1963 film “8½.” It’s very similar to director Rob Marshall’s “Chicago” (2002), but with a different story, cast and location (Rome and points nearby).\r\n\r\nDuring the first half I wasn’t so sure about the story, but I eventually found myself absorbed into the life of the tormented director and his mid-life crisis. His unfaithfulness to his beautiful wife, Luisa (Cotillard), is off-putting of course, but maybe we should have mercy for a man who has scores of gorgeous women offering themselves to him practically every day. It helps that he WANTS to be free from his adulteries and be true to Luisa.\r\n\r\nYet I have a hard time picturing Guido (Day-Lewis) seeking the amorous attentions of Carla (Cruz) above Luisa. Carla is decent, as far as all-around physical beauty goes, but Luisa has better curves. Both of the characters’ have imaginative dance sequences, but Luisa comes out on top even though her routine is less tantalizing.\r\n\r\nDay-Lewis is fascinating as the guilt-stricken director who hasn’t let his fame go to his head. When he asks a cleric for advice about God and his troubles, the vicar responds: “Imagination is God’s garden, don’t let the devil play in it.”\r\n\r\nI generally don’t favor musicals where the characters suddenly jump into song & dance while walking at the park or eating dinner. My wife & I sometimes poke fun of these kinds of musicals by mimicking them while doing mundane activities. For me, musicals only work, generally speaking, when the singing\/dancing sequences are legitimate, like a performance at a nightclub or one's imagination, both of which were used in \"Chicago.\" Of course it’s more challenging and takes more creativity to incorporate song & dance routines in this manner and keep the movie seamless & realistic. “Nine” does this.\r\n\r\nThe film runs 1 hour, 58 minutes and was shot in Italy and England.\r\n\r\nGRADE: B","id":"5c12aa130e0a263705cfedb1","url":"https:\/\/www.themoviedb.org\/review\/5c12aa130e0a263705cfedb1","movie_id":10197}
{"author":"Asa_movies","content":"Mary and Max- Am I sad or happy? Am I philosopher?\r\n\r\nIt's hard to understand weird people. Oh, actually, I'm weird. It's hard to understand normal people. I've been depressed for a great deal of time. Not depressed like: ”oh, I'm not feeling okay now. But everything is okay”. It's something like: “I'm feeling very bad, and sad; probably I'm considered as I am freak. But I consider others as being freaks. I'm not depressed because of weirdness – it's because of life, as it is”. Uncertainly, I'm both Mary and Max.\r\n\r\nThe first – my state of mind.\r\nUnbearable pressure in head, which I almost can't put literally vertical on my head. It's pretty hard, considering it's mass. I feel like an invisible ghost pushes my head and makes my eyes falling down. Teeth and jaw are stiff. I'm going to sleep. It's the most comfortable way to make reality become unreal and relaxing. I'm crying when the story of the sense of life is being said. I'm smiling when there are people around me. It's a spontaneous reaction. Probably because I'm Max in my mind, Mary in my soul.\r\n\r\nPeople probably wrongly understand depression; or more precisely – they have no idea how actually it functions for real, in mind of attached person. They think they are mad, or they're pretending something wrong is happening- “depression is nothing serious”.\r\n\r\nI'm Mary:\r\nI'm ready to finish my living, to kill myself, to die in the full coldness of the life. There is no good person in the world, there is no sense of\r\nlife, there is no hapinnes in the world, there is nothing funny to do. But I won't do this. Medicines are really useful. They're changing our brain. I want to be in a closed room, I don't want to eat, I hardly ever sleep, but I'm tired. My willing is just to make me being physically smaller, to become a dot in a nowhere and to forget about everything. I have headaches. I almost haven't eaten anything for a couple a days, I'm sad, unsuccessful, bad in every possible way. There is no meaningless of living. We've been born. We're going to dye. We're nothing. I'm isolated, obsessed with horrible thoughts, (horrible from my point of view). These thoughts are as normal as they could be. I'm right but\r\nnobody understands me. Acting happiness and smiling and funny person makes me feeling even worse after a while. The first thing I'm going to do is to push walls around me, to make me feel pain, to be alone and to do nothing – because, there is nothing to do. The only one friend I believed in disappointed me. Nobody cares. The next state is that I would try to be “normal”. I'm buying stupid cosmetics instead of going to travel. I'm talking to people, doing this as they do. Pretending being cool and perfect. Funny. Communicative. Everything went bad because it's not me. Go ahead!\r\n\r\nNow, I'm Max:\r\nEinstein said there were only two infinite things: cosmos and one's stupidity. I agree with him. I am different, I'm maybe even smart, I'm trying to understand the world. Maybe others are, too. Different, and also triers. I like chocolate, I don't have friends, there is no justice in the world. Anxiety and changing mood are no so simple things. Feeling are unpredictable, emotions are strong. Emotions are strong but undefined. I gave up. My psychiatrist is giving me instructions how to act in real life. “This is good, this is bad, in this situation you have to cry, in this to laugh, in this to imitate some nerd.” I was even using small notebook where I wrote “acting explanations”. I met Mary, but who cares. I'm used to living on my own. There is no friend. I am distanced form everyday life, like there is invisible barrier between me and others. It makes me being special; but obviously not in a good way.\r\n\r\nWe're now good friends. She is the best one for me; but also the only one. Oh, there are more freaks here. Haha. Impossible. She understands my needs, my mind, my reactions, my way of viewing stuff.\r\n\r\nThe second – don't worry. Robots are walking down the streets. Everyone is the same as the others. They define themselves as normal guys. Just define, don't worry. You can define them as you want The left person is copy of the right one. Everyone is the same. Everyone\r\nhas striped hair, blue narrow jeans, the equal brains, the equal opinion.\r\nIt's easier acting like they are acting. Just go down the street, listen to the others, turn off your mind, point of view the world and your charm. Just be like others. Be stupid. Be robot. I'm starting to believe Einstein. This is not myth he's very smart. But also you need to be good. Brave, beautiful, funny, intelligent, popular,...(just kidding) ;)\r\n\r\nBe who you are, and help humanity. And believe there are also people worth respecting, because they are not robots. You just have to find them. Also they'll find you. They exist. Look bright, go straight. We're here and we can't run out of it. Imagine our life is one adventure we are lucky to have chance to play in. You're not a weirdo. Just go on, enjoy the adventure, be yourself, even when you have to be pathetic as I am now. :) After that, sense of life will come to you; you don't have to search so much! Just relax ;)\r\n\r\nLet the game begin!\r\n\r\nWritten by Mary and Max,\r\nDecember 2016,\r\nfor goodness of the world","id":"58e246e0c3a36872de00d543","url":"https:\/\/www.themoviedb.org\/review\/58e246e0c3a36872de00d543","movie_id":24238}
{"author":"John Chard","content":"Why would a man frame himself... for murder? \r\n\r\nBeyond a Reasonable Doubt is directed by Peter Hyams and Hyams adapts the screenplay from Douglas Morrow's story\/screenplay for the 1956 film of the same name. It stars Jesse Metcalfe, Amber Tamblyn, Michael Douglas, Joel David Moore and Orlando Jones. Music is by David Shire and Hyams also tackles cinematography duties. \r\n\r\nC.J. Nicholas (Metcalfe) is a journalist aiming for high things. He is convinced that high profile lawyer Mark Hunter (Douglas) is corrupting legal issues and sets about proving it... \r\n\r\nThe 1956 film was the great Fritz Lang's last American film, more court drama than being overtly film noir, it was a film well tuned into legalities of its time. Hyams here updates to a modern era setting and it is fanciful - due to the advancements in technology - in the extreme. Of course those things can often be forgivable if the film is well put together and holds some thriller\/drama weight. \r\n\r\nThe look of the film is cheap, as in a TV movie look, with the cinematography uninspiring, the young cast members hardly turn in characterisations to care for, while Douglas (who is very good) is surprisingly under used. The story is a fascinating one as per human foibles, and there's a double whammy stroll down twister street that lifts the film to a rewarding closure. But it's still a disappointment, and this even if you haven't seen Lang's far superior 56 film. 6\/10","id":"5770f13bc3a36859a60000b6","url":"https:\/\/www.themoviedb.org\/review\/5770f13bc3a36859a60000b6","movie_id":25137}
{"author":"Adam CJ","content":"A fantastically well written, well acted, well directed and well shot film. You barely notice its 2 hr length, as every minute is rich in drama and character. It's not an epic film by any stretch, but it's a significant one - bringing forth an engaging, touching, and at times poetic, story of a part of the World where life has complexities we understand little of. It may not quite match fellow notable Foreign Language Oscar nominees, City Of God, or A Prophet; but it comes very close and has many similarities.","id":"51d87fe819c29525f4032340","url":"https:\/\/www.themoviedb.org\/review\/51d87fe819c29525f4032340","movie_id":24424}
{"author":"talisencrw","content":"This was an outstanding debut by the New Zealander Blomkamp. Consistently enthralling and keeping one at the edge of his seat. THIS is a recent film, like 'Master and Commander: The Far Side of the World', that should have spawned sequels. Much better than his follow-up, 'Elysium' (I haven't watched any others he's made since; hope he doesn't end up a cinematic one-trick pony like M. Night Shyamalan...).","id":"57b387bec3a3681a30000917","url":"https:\/\/www.themoviedb.org\/review\/57b387bec3a3681a30000917","movie_id":17654}
{"author":"Wuchak","content":"Entertaining and amusing TV-budget werewolf flick, not to mention gory\r\n\r\nRELEASED IN 2009 and directed by Fred Olen Ray, \"Dire Wolf\" (also known as \"Dinowolf\") chronicles events in rural Southern California when a genetically modified creature that's half-dire wolf and half-human escapes a government-funded research facility and goes on a gory rampage. The local Sheriff (Maxwell Caulfield) & game warden (Blake Cooper Griffin) team up with two federal agents (Kristen Howe & John L. Curtis) and one of the researchers (Dawn Ann Billings) to track it down. Gil Gerard has a small part as the commanding officer in charge of the dubious project.\r\n\r\nThis is an entertaining TV-budget werewolf flick (while some might nitpick that it's not truly a werewolf movie, it is at heart). The movie has a humorous edge, mostly with the quirky \"Rainman\" Sheriff, but it's largely serious (with a wink) and even has some moving parts, like when a certain character bites the dust and shares his last words with someone close to him.\r\n\r\nIt's nothing great, but it's entertaining and well-rounded Grade B horror with a likable cast and some seriously gory parts, not to mention a classy score here and there. On top of this, there are several worthwhile women, including several cuties, such as Kimberly Horner (Amber), Summer Harlow (the blonde researcher), Gina Scoles (the bikini girl) and Laura Niles (Kelly at the restaurant).\r\n\r\n\"Dire Wolf\" was made in the mold of seminal TV-horror flicks, like 1972's \"Gargoyles.\" If you like that movie you'll definitely appreciate this one. In some ways it's even better (although I give the better rating to \"Gargoyles\" due to its originality and place in history). The filmmakers, cast and crew of \"Dire Wolf\" knew they were making a low budget horror flick, but they gave it their all to make sure it was entertaining, amusing, moving and even a little classy.\r\n\r\nTHE FILM RUNS 87 minutes and was shot in Southern California. WRITERS: Dan Golden and Patrick Moran.\r\n\r\nGRADE: B","id":"5b3cfa8dc3a368594200d600","url":"https:\/\/www.themoviedb.org\/review\/5b3cfa8dc3a368594200d600","movie_id":138858}
{"author":"daisyrowley","content":"Avatar is an overwhelming, immersive spectacle. The state-of-the-art 3D technology draws us in, but it is the vivid weirdness of Cameron's luridly imagined tropical other world that keeps us fascinated. I like this film and I have written many review for <a href=\"https:\/\/domywriting.com\/\">essay writing service<\/a>. The special effects are so good here that you don't even notice them. It is eerie how Cameron has made it look and feel like he is just pointing a camera at the action.","id":"5b6964e1925141404f0d1094","url":"https:\/\/www.themoviedb.org\/review\/5b6964e1925141404f0d1094","movie_id":19995}
{"author":"John Chard","content":"It's cinema Jim, but not as we know it. \r\n\r\nSo here it is then, what has been in gestation in James Cameron's mind for over 12 years finally hit the silver screen towards the back end of 2009. Made for gazillions amount of cash, Avatar went on to make a billion trillion in Worldwide receipts-and this before the rush rush release of DVD\/BLU RAY sales are factored into the equation. The film, and all its technical wizardry, is quite simply a gargantuan piece of cinematic history. Released in 2d and 3d, and probably some other format that I'm forgetting, every advanced tool of the trade has been utilised by Cameron and his team to create what is now the ultimate popcorn blockbuster. Shame then, that away from the visual extravaganza the film is as shallow as this review will ultimately end up being.\r\n\r\nNo doubt about it, this is a joy for the eyes and ears, the minuscule details are wonderful and the colour positively pings from every frame. But in the eagerness to create such splendour they forgot to put any substance into the writing. This is plot simplicity. And even its messages, as Cameron smugly preaches his sermon from the pulpit, now seem old hat. Do we really need another boink over the head about eco invasion? Or a curt reminder of American infiltration into some land where motives are suspicious at best? No we don't really do we? Worse still is some of the dialogue, which quite frankly could have come from some playground encounter as the kiddies play kiss chase or bang bang your dead army. There's also a sense of familiarity with other better scripted film's, Dances *cough* With *cough* Wolves *cough* It's as if Cameron just knew that narrative structure wasn't as important as having the expensive gimmicks. He's like a modern day William Castle-only with considerably more readies at his disposal.\r\n\r\nThe cast are OK, Zoe Saldana puts a sexy feistiness to her blue alien Neytiri, Sam Worthington keeps the humanistic elements just about above water, while Sigourney Weaver is as ever the consummate professional. But ironically, in a film shimmering bright in 2d & 3d, the characters are all one dimensional. None more so than Stephen \"The Party Crasher\" Lang's Colonel. A man so gruff and gung-ho menacing he really ought to be in Sly Stallone's upcoming testo movie The Expendables. Nominated for nine Academy Awards, including Best Picture and Best Director, it won three, for Best Cinematography, Best Visual Effects, and Best Art Direction. Those were richly deserved. They also tell us all we need to now about Cameron's Behemoth. 5\/10","id":"5ea448e4bdc34c0020261327","url":"https:\/\/www.themoviedb.org\/review\/5ea448e4bdc34c0020261327","movie_id":19995}
{"author":"Reno","content":"> Not a superhero to save the world, just a mischievous toyfriend.\r\n\r\nThe outcome was as expected, so I haven't disappointed with it. But sparing time for it was the big decision I had made, knowing a film not for my age. Without a single bit of graphics they have managed it well to tell a story. The production was decent, but the story was too predictable with a below average jokes. I just wanted to clear the air that I was not bored of it, simply not my type of entertainment film, that's all.\r\n\r\nPerhaps the adult comedy, 'Ted' might have inspired by this, except it is a children's film. The actors were decent, because they did not get a challenging role. With a giant Ted in the title role, it should have been an adventure film. He's here to help the kid and I think his character did nothing big achievement rather boring writing of his character.\r\n\r\nEveryone knows that's a man was inside the fur, so the stunts would have not cost too much if they had used a stunt artist. Because adding a couple of those scenes would have given a reason for the audience to cheer. The end was a loop, they kept it that way, in case of a sequel planned in the future. But I hope they won't make it, unless a very adventurous. Not recommended unless you plan to show it for your kids.\r\n\r\n3\/10","id":"5787b87892514131d2000b3e","url":"https:\/\/www.themoviedb.org\/review\/5787b87892514131d2000b3e","movie_id":21293}