{"author":"CRCulver","content":"<i>Last Hippie Standing<\/i> is a 45-minute documentary by German filmmaker Marcus Robbin about the counterculture scene in Goa, India. It juxtaposes the first hippies here with a later generation of travellers who came for the rave scene.\r\n\r\nOne of the positive features of the documentary is its inclusion of handheld camera footage that shows us how the first travellers here looked and spent their time. In contemporary interviews three figures represent the hippie community of the 1960s and 1970s here. Goa Gil came to India in 1969, after seeing the collapse of Haight-Ashbury, and developed the Goa Trance style of dance music. His friend Swami William came for spiritual enlightenment. The third figure interviewed is the late Cleo Odzer, a ditzy scion of a wealthy New York family who came in the 1970s. Her 1995 book Goa Freaks: My Hippie Years in India was a tell-all that, though it documented some of the troubling aspects of the hippie community like hard drug use, angered many of her peers. Those sorts of revelations are absent here, and indeed we just get from her some general remarks that Goa was a great place, a perfect den of hedonism. I found her portions tiresome, but since so much of the Super 8 footage is from her, I suppose we ought to be grateful for her participation.\r\n\r\nThe contemporary scene was documented in the winter of 1999-2000. Robbin captures footage of tourists in the market and at raves on the beach. There is also an interview with Francisco Sardinha, then chief minister of Goa, who says unabashedly that he does not want hippies, but rather wealthy tourists who can pump a lot of money into the local economy.\r\n\r\nWhen this documentary was made, it juxtaposed historical footage of Goa with what was then contemporary. For audiences watching today, the documentary is doubly historical. The rave culture depicted in 1999 has now been more or less eradicated from Goa, with noise laws bringing an end to psychedelic parties on the beach. Plus the overpopulation and pollution has made the place less idyllic. When I visited Goa exactly a decade after the making of this documentary, all I found was mainstream clubbing like you'd find in any Western city and some incredibly filthy beaches. To a large degree, Sardinha got his wish. The documentary ends with Goa Gil and Swami William at the Berlin Love Parade musing on the gloabal impact of Goa hippie culture. That's pretty much played out too.\r\n\r\nI found <i>Last Hippie Standing<\/i> interesting, but far too short. There are other areas that could have been explored, such as the changing demographics of the counterculture there (I find the rise in Israeli post-army tourism in India a fascinating phenomenon) and the transition from hippies playing guitars and flutes to the electronic dance music that is Goa Trance. It's hard to recommend shelling out full-price for a DVD unless you are really obsessed with the overland trail and subsequent tourism in India.","id":"5b934ed00e0a261978002445","url":"https:\/\/www.themoviedb.org\/review\/5b934ed00e0a261978002445","movie_id":145385}
{"author":"John Chard","content":"Arach Attack!\r\n\r\nSpiders escape from a spider farm in Prosperity, Arizona, and become giant man eating beasts on account of toxic waste carelessly dumped in a near by river. Can the odd ball inhabitants of this Arizona town escape with their lives? Or will spiders rule the earth and lay waste to man kind?\r\n\r\nEight Legged Freaks is unashamedly homaging B movie creature features from the 1950s. The likes of Tarantula and Them! have their Pedipalps well and truly watered, in what is possibly the most undervalued of all the modern day creature feature homages. Having no pretensions what so ever, the only real thing not in \"Freaks\" favour is the usage of CGI, but even that doesn't hurt the film, if anything it adds to the obvious preposterous nature of the genre. I mean how else are we to get 20 foot jumping spiders chowing down on some annoying teenager?\r\n\r\nPerhaps \"Freaks\" is viewed harsh because the cast is relatively C list? Again that is a genre staple, surely? For what it's worth I think they do real fine, David Arquette has oodles of goofy charisma, Kari Wuher makes a fine female ass kicker, and the kids (one a young Scarlett Johansen) are really rather cool. Director Ellory Elkayem, who after doing They Nest in 2000 clearly has bug issues, adheres to genre staples. Kooky western town out in the desert, the inhabitants of which range from near loonies to dopey politicians, and the plot follows the traditional sense of impending doom played for laughs. Listen out for the score from John Ottman, which plays on variants of \"Itsy Bitsy Spider\", whilst cast a keen eye on John S. Bartley's Arizona camera work.\r\n\r\nWhilst not having the savvy scripting of homage daddy, Tremors, or the star appeal of 1990's Arachnophobia, Eight Legged Freaks deserves its place amongst such fun and creepy company. As the tag line says, \"Do you hate spiders? Do you really hate spiders? Well they don't like you either\". With that, I think it's web well and truly spun, don't you? 7\/10","id":"55f8f97792514108120015eb","url":"https:\/\/www.themoviedb.org\/review\/55f8f97792514108120015eb","movie_id":8869}
{"author":"AirGordon","content":"A very unique spy \/ corporate espionage film. I don't want to give too much away due to the way the plot unfolds. This movie is one of those hidden gems that many look over or miss; don't be one of those people!","id":"5d2267ef94d8a8498444676d","url":"https:\/\/www.themoviedb.org\/review\/5d2267ef94d8a8498444676d","movie_id":10133}
{"author":"LDK","content":"This was my first Sophie Ngan film and after watching this, I started looking for her in other titles - she really is that hot! This film was hard for me to understand, poor audio and poor subtitles but luckily the focus of the film was neither the plot nor the dialogue but rather contriving different ways to get the actresses in this film to get naked at all possible times.\r\n\r\nThe plot seems to revolve around a young man who has incredible luck with the ladies. Somehow he has two separate instances where he stumbles upon beautiful ladies in the woods who allow him to have his way with them. Well they turn out to be ghosts of some sort. At the same time he ends up marrying a beautiful young lady and all the practice he has with shagging comely ghosts comes in handy when introducing his new bride to the world of erotic delights. The new wife, played by Sophie Ngan falls for him and the two have many extended sex scenes showing off her amazing body.\r\n\r\nThe two ghosts manage to find our young hero alone on several occasions and engage in more hot and heavy sex either one-on-one or two-on-one. It makes for some really erotic viewing. Definitely not much fast-forwarding required for the second half of this film. It helps that both \"ghosts\" are lovely to look at yet different (example, one is bustier than the other)\r\n\r\nAt the conclusion some monk drops by, not sure why, and the end result is that the ghosts become mortal and become his 'extra' wives with wife #1 seemingly giving full approval as evidenced by the seemingly limitless sex this guy gets.\r\n\r\nIn my estimation, the lead actor is one of the luckiest thespians in Hong Kong history getting to paw at 3 lovely ladies. As for the movie, OK cinematography, not much plot, cheap looking sets, but awesome looking ladies. Sophie was an eyeful. The two ghosts were very sexy as well.\r\n\r\n7\/10 by J Charles","id":"503eaee519c295708b0096dd","url":"https:\/\/www.themoviedb.org\/review\/503eaee519c295708b0096dd","movie_id":129171}
{"author":"tmdb44006625","content":"It's rare that I wish a movie could keep going on and on, but Lilo & Stitch could have added a whole hour to its runtime and I would have welcomed it with open arms. This is a beautifully animated film, one of the best Disney has ever put out. Stitch has become something of a pop culture icon. Much like Jack Skellington and Bart Simpson, Stitch has struck an emotional chord with audiences. Aside from him being adorable, it also must have something to do with how Stitch, a being created to destroy, ends up being the missing link that brings a broken family together. There are times that Lilo & Stitch touches on dark subject matter. Lilo reminds me of many problem children that were misunderstood by parents, kids, and the system. But by the end, Lilo & Stitch will have you smiling by bringing you into a very happy place.","id":"5c847cb60e0a26765e597141","url":"https:\/\/www.themoviedb.org\/review\/5c847cb60e0a26765e597141","movie_id":11544}
{"author":"John Chard","content":"Clap Trap.\r\n\r\nTrapped is directed by Luis Mandoki and written by Greg Iles. It stars Charlize Theron, Kevin Bacon, Courtney Love, Stuart Townsend, Pruitt Taylor Vince and Dakota Fanning. Music is by John Ottman and cinematography is by Frederick Elmes.\r\n\r\nBased on Iles’ book 24 Hours, Trapped aspires to be a potent kidnap thriller, an attempt to use the kidnapping of a young girl as some sort of edge of the seat entertainment, sadly it’s poorly constructed and quite frankly ill advised.\r\n\r\nA fine cast has assembled for the picture, but nobody distinguishes themselves as they try to make the generic and idiotic material work. On the atmosphere side of the fence things aren’t half bad, there’s a grim and grubby feel to proceedings, but Mandoki consistently ruins each passage of promise with cack-handed convolutions, which when the core plot device is a dumb drug set-up, only makes the feeble efforts of making a twisty thriller even more laughable. The crowning glory of the latter being the finale, which is ludicrous. 2\/10 with young Fanning the only one coming out of it with any credit.","id":"53aece98c3a3682eee0037e5","url":"https:\/\/www.themoviedb.org\/review\/53aece98c3a3682eee0037e5","movie_id":9039}
{"author":"bollywoodqueen","content":"**Fantastic film**\r\n\r\n_Originally posted on IMDb 21st December 2013._\r\n\r\nThis is the second time I have watched 'Satin rouge', and I thought I would write a short review.\r\n\r\nThe first time I watched the film I became very intrigued about Tunisian culture; at the time I knew virtually nothing about the country. I was surprised to read about how much more liberal the country is compared to other Islamic countries in the Middle East\/North Africa. For example the Government actually discourage the wearing of the hijab, and religion in general seems to be a bit more secular. The liberation of women in Islamic-dominated countries is not often seen so I enjoyed that aspect of this film in particular.\r\n\r\nThe main reason why I chose to watch 'Satin rouge' initially is because of the beautiful Hiam Abbass, a seasoned actress, whom I have seen in many films now.\r\n\r\nI enjoyed the film more after watching the second time. What I love most about it is that there is nothing overly spectacular about it. The plot, the editing, the scenes. But that's what makes it so good as well, because it is simple and that adds a sense of realism. It is a lovely little depiction of Tunisian life and culture.\r\n\r\nHiam was the perfect choice as traditional Lilia. It was amazing to see her character transform from a shy, plain widow with a bland and uninteresting life, into a more liberated, confident, expressive and beautiful woman with a new zest for life.\r\n\r\nWhilst we don't see much depth in some of the supporting characters (including Lilia's daughter), they all complement Lilia's character nicely. There are a couple of saucy scenes too!\r\n\r\n'Satin rouge' goes against the usual grain of Islamic\/Middle Eastern (or in this case, North African!) culture and society and for that, it is definitely a gem for those who appreciate Indie cinema.","id":"58bcbdc7c3a368666b03f02f","url":"https:\/\/www.themoviedb.org\/review\/58bcbdc7c3a368666b03f02f","movie_id":97447}
{"author":"John Chard","content":"I am not a man. I began as one, but now I am becoming more than a man, as you will witness. \r\n\r\nRed Dragon is based on the novel of the same name written by Thomas Harris and is directed by Brett Ratner and written by Ted Tally. It stars Edward Norton, Anthony Hopkins, Ralph Fiennes, Emily Watson, Harvey Keitel, Mary-Louise Parker & Phillip Seymour Hoffman. Dante Spinotti is on cinematography and Danny Elfman scores the music.\r\n\r\nRed Dragon is a prequel to the hugely successful Silence of the Lambs. The story had already been filmed as Manhunter in 1986 directed by Michael Mann. The signs weren't particularly good for Red Dragon. The previous year had seen Ridley Scott tackle Silence Of The Lambs follow up, Hannibal, with tepid results. While at the helm here was the director of such fodder as Rush Hour 1&2, and of course Mann's take on the story is viewed as a grainy and skin itching cult classic. Nice to report then that even tho it's hardly in the same class as \"Lambs,\" it's a willing entertainer that genuinely manages to unease.\r\n\r\nFirstly one has to get past the Hannibal Lecter factor to fully enjoy (and dampen expectations) the movie on its own terms. Lecter (Hopkins enjoying himself but going through the motions) is a secondary character. Important? Yes! But still secondary to Norton's troubled but gifted FBI agent Will Graham and Fiennes bonkers serial killer Francis Dolarhyde (AKA:The Tooth Fairy). Red Dragon is first and foremost a ripping good old detective story, with Ratner and Tally wisely using the bits that made Harris' novel such a page turning success. They have added their own bits of course {the pre-credit sequence involving Lecter & Graham sets things up perfectly}, but ultimately it's a loyal enough telling of a gripping and goose flesh inducing story.\r\n\r\nThe makers have wisely filled the film out with quality performers. Norton underplays Graham nicely, a character unable to stay away from the job that threatens his family, he becomes an easy guy to root for as things start to get troubling. Fiennes too doesn't go over the top, in great physical shape and with piercing blue eyes, he exudes menace without resorting to being a cackling caricature. Hoffman was a shoe in for a weasel reporter since he does it so well, while Keitel, tho not having to stretch himself, offers up a stoic turn as Jack Crawford. But the main performance, and sadly unheralded, comes from Emily Watson as the blind Reba. With Reba acting as both a romantic and redemptive foil to Dolarhyde's split-personality, Watson gets the tough gig, and comes up trumps with an affecting turn featuring the right amounts of spunk, sadness and needy tenderness.\r\n\r\nIt's a bit too polished to be a nerve shredder, with Ratner unable to give the film an atmospheric feel befitting the darkness at its core. But it does deliver on the promise of not only that opening segment, but also on Harris' fine procedural narrative. 7\/10","id":"5ea1704f0b5fd60024816af7","url":"https:\/\/www.themoviedb.org\/review\/5ea1704f0b5fd60024816af7","movie_id":9533}
{"author":"lmao7","content":"Now this is…really something different like the story and Benigno. I know what he did was so so wrong but I felt bad for him. Such a heartbreaking story and I love how the friendship was formed, although I really didn’t care about the writer and matador. I just couldn’t stop watching this film when I saw it on Sundance, until the ending, like the butt shakin partner dance before the end credits. It may be the music. And of course…Paz Vega’s black and white silent film, the shrinking man who went inside her…literally!","id":"58cba5459251415e5700ed69","url":"https:\/\/www.themoviedb.org\/review\/58cba5459251415e5700ed69","movie_id":64}
{"author":"Cyberknight","content":"CGI manages to completely shadow Jackie Chan's talent. Why wire-fu, when he can do much better for real (as he has more than proved throw his films).","id":"5d87955e336e0100191797b7","url":"https:\/\/www.themoviedb.org\/review\/5d87955e336e0100191797b7","movie_id":10771}
{"author":"sitenoise","content":"The Sea is Watching starts off as an attractive film; rich colors, effective photography, nice framing, fetching prostitutes. Then it goes melodrama, followed by silly, culminating in corny which brought a smile to my face before the surreal kicked in. It never stops looking good, though.\r\n\r\nThere's nothing new or groundbreaking story-wise. It's a charming, sometimes funny, bittersweet tale of the inhabitants of a samurai-era brothel whose entire district ends up under water. Plot-wise it focuses on the love lives of two of the working girls: Kikuno (Misa Shimizu) plays an elder to the younger girls and enjoys being the object of pursuit, never giving in to the suitors who want to take care of her and take her for their very own; and Oshin (Nagiko Tono) who seems to fall in love with every one of her clients. One of them, a sweet samurai type, visits her often and convinces her that her \"fallen soul\" and \"soiled body\" can become pure again—just like a person's hair, nails, and teeth fall out and grow back. \"A body can become pure again ... it would be too horrible for words if it weren't true\".\r\n\r\nOshin is the main protagonist of the film and is meant to give it an emotional center as her heart breaks and yearns, but it never quite happens. Although Shimizu and Tono give good performances, overall the acting is not one of the film's high points. I recommend the film to those wanting a taste of historical Japanese culture and who enjoy quiet films about love, loss, and friendship. Yes, the ladies are prostitutes but they have feelings too.","id":"57074dcbc3a36831790003bc","url":"https:\/\/www.themoviedb.org\/review\/57074dcbc3a36831790003bc","movie_id":41453}
{"author":"John Chard","content":"Is she still in the dark place?\r\n\r\nAfter the mysterious death of her niece Katie, journalist Rachel Keller starts to investigate an urban legend about a videotape which kills you seven days after watching it. With dire consequences coming her way if she can not solve the mystery....\r\n\r\nThe sentence, English language remake of successful foreign horror film has been known to instill fear of the wrong kind in many a genre fan. So when it was announced that Gore Verbinski was to remake Hideo Nakata's terrifying nerve shredder, Ringu, the reaction in horror circles was akin to someone urinating on your chips. Refreshing to report then that The Ring is a candidate for best American remake and proof positive that remakes sometimes can be a good thing.\r\n\r\nStarring Naomi Watts (who is terrific) as Rachel, Verbinski and writer Ehren Kruger (adapting from Kôji Suzuki's novel) successfully transfer the atmospherics of Nakata's piece to a dank and eerie Seattle. It's with atmosphere that The Ring starts to play on your nerves, because after viewing the creepy and unsettling tape itself, we ourselves have been set up for the race against the clock theme that is driving Rachel on. So as the mystery starts to unravel, and sadness threatens to take a hold, the story quickly shifts direction to give horror one of its most baddest and cruelest characters. It's the kind of impact that crawls under your skin and refuses to move when you are trying to sleep at night.\r\n\r\nThough the story has been streamlined from its source, The Ring still has a bit too much filler in its meaty structure. Feeling a need to give Watts a quest among quests, Verbinski almost over cooks the mystery essence of the plot. However, with much relief he reins it in to stop any sort of scooby doo like nonsense detracting from the creepy sense of dread that has been built up previously. The ending here works a treat, but it is a tone down from the source and with that it's not even close to Nakata's version, and just maybe it has something to do with Dream Works wanting to secure a PG-13 rating? \r\n\r\nWhat is left though is a truly suspenseful and unsettling thriller - come horror film. One that even on revisits manages to bother and keep one on the edge of the seat. It made an $80 million profit in America alone, ensuring that a sequel was sure to follow. Now was that one a bad idea! 8\/10","id":"5bd67a630e0a2622bd03c7d2","url":"https:\/\/www.themoviedb.org\/review\/5bd67a630e0a2622bd03c7d2","movie_id":565}
{"author":"Gimly","content":"When _The Scorpion King_ first came out in '02, it would be hard to imagine that between this franchise and its forebears (_The Mummy_ & _The Mummy Returns_), that it would be _The Scorpion King_ who would continue to live on in the following decade. Though that's maybe less shocking knowing that _Tomb of the Dragon Emperor_ happened.\r\n\r\n_Scorpion King_ delivers on a small amount of the hammy fun it could have been, though I can't help but wonder just how amazing it would be if we had gotten a _Fast & Furious_ level Rock portraying Mathayas.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"59526bdac3a3683526008e5b","url":"https:\/\/www.themoviedb.org\/review\/59526bdac3a3683526008e5b","movie_id":9334}
{"author":"Wuchak","content":"***Brits fighting Sudanese rebels in 1884 with Heath Ledger, Wes Bentley and Kate Hudson***\r\n\r\nBased on the novel by A.E.W. Mason, a greenhorn British regiment in 1884 is commissioned to Egyptian-ruled Sudan to fight Mahdi rebels. A young officer, Harry (Heath Ledger), unexpectedly resigns and is shamed as a coward by his three best friends (e.g. Wes Bentley) and fiancée (Kate Hudson). After the negative fallout he goes to Sudan undercover to hopefully redeem his honor.\r\n\r\n\"The Four Feathers\" (2002) is similar to Victorian-Brits-fighting-in-Africa flicks like “Zulu” (1964) and “Khartoum” (1966), but I prefer this one as it’s just more compelling and is a quality modern production (I’ve never seen the old-fashioned 1939 version).\r\n\r\nThere are a lot of gems to mine here, like Harry’s individualism in the face of great social pressure to conform. His reasoning is simple: He never wanted to be a soldier and only took the commission to please his gung-ho militarist father. Besides, how is what’s happening in the Sudanese desert relevant to him and the British in the first place? Why should he risk dying or losing a limb for this dubious purpose? One of the best parts is Harry’s growing friendship with Sudanian Abou Fatma (Djimon Hounsou).\r\n\r\nUnfortunately, the movie’s hampered by two problems: The mechanics of the plot sometimes drive the characters and it doesn’t feel natural or real. For instance, when Harry easily joins the Mahdi rebels and is later seen riding toward the British regiment it’s serious “Yeah, right” territory. Another problem is that, from the main battle forward the movie doesn’t allow itself to breath and seems like it’s in a rush, like it doesn’t have the confidence to slow down and tell the story because it’s worried about fitting into a 2-hour timeframe and pleasing those with ADHD.\r\n\r\nIf you can get past those two hitches, this is a worthy historical adventure flick.\r\n\r\nThe film runs 2 hours, 12 minutes and was shot in England and Morocco.\r\n\r\nGRADE: C+\/B-","id":"5ce44b599251414a92b9a1df","url":"https:\/\/www.themoviedb.org\/review\/5ce44b599251414a92b9a1df","movie_id":9093}
{"author":"Wuchak","content":"***Haunting Mystery with Supernatural Elements – Reverent, Beautiful, Brilliant***\r\n\r\nRELEASED IN 2002 and directed by Mark Pellington, \"The Mothman Prophecies\" details some of the strange events that occurred in Point Pleasant, West Virginia, from November 15, 1966, to December 15, 1967 (13 months). The movie, however, transplants the events to the year 2001.\r\n\r\nPLOT: Richard Gere plays John Klein, a journalist for The Washington Post trying to come to grips with the sudden death of his wife, Mary (Debra Messing). He mysteriously shows up in Point Pleasant, West Virginia, where he develops a relationship with the sympathetic police sergeant, Connie (Laura Linney). Many of the town's residents have sighted an eerie mothman-like entity, similar to the one Mary saw before she died. A researcher (Alan Bates) believes that the ‘mothmen’ exist on a sphere beyond human comprehension and that they can foresee impending calamities. Is the ‘mothman’ sighted in Point Pleasant warning the citizens of one? If so, what is it?\r\n\r\nThis is not a monster movie or a slasher horror flick; if you want that see “Mothman” (2010), which is actually pretty good for a TV creature feature (and interestingly links the mothman to the unjust slaying of Cornstalk, aka Hokoleskwa, in 1777). “The Mothman Prophecies,” by contrast, is a supernatural\/mystery story with cogent creepy mood. Every element skillfully works: acting, story, editing, score, cinematography, locations, effects, etc. Underneath the film’s eeriness there’s an undeniable reverent, beautiful quality while the ending is strangely touching.\r\n\r\nOne critic claimed that the mysteries presented in the story are not supposed to be figured out and, indeed, CANNOT be figured out. But this is untrue. The film is intricate and respects the intelligence of the viewer. Questions are raised with varying possibilities. The answers are there, but you may have to watch it a few times to discover them. I appreciate the fact that the director and writer refused to spell everything out for the viewer, even allowing room for complete misinterpretation. If the viewer wants answers s\/he must have \"ears to hear\" and be willing to work for them.\r\n\r\nMy initial interpretation was that the ‘mothmen’ are good spiritual beings that are trying to help humanity by predicting great calamities but can be misunderstood because they are so far superior to humans. In a nutshell, my interpretation was that the mothman somehow brought Klein to Point Pleasant to meet and save the future replacement for his dead wife, who died due to a pre-existing condition that only the mothman knew about. This explanation obviously suggests that the mothmen are good in nature.\r\n\r\nI've come to see that this interpretation is false; a brilliantly implemented red herring.\r\n\r\nBOTTOM LINE: \"The Mothman Prophecies\" is a rare film that’s genuinely intriguing and filled with gems to mine, even if you’ve already seen it several times. It’s so artistic that it’s a pleasure to behold over and over.\r\n\r\nTHE FILM RUNS 1 hour, 59 minutes and was shot in Kittanning, Pennsylvania (substituting for Point Pleasant), Pittsburgh (the factory and city scenes, etc.) and other Western PA towns. WRITERS: Richard Hatem wrote the screenplay from John Keel’s book.\r\n\r\nGRADE: A\r\n\r\nINSIGHTS ABOUT THE MOTHMEN *** SPOILER ALERT *** (Don’t read until you view the movie).\r\n\r\nThe ‘mothmen’ are evil spirits or fallen angels (they're synonymous). This is clear when viewing eye-witness drawings of the creatures, which never show beautiful angel-like beings, but rather dark disturbing, obviously-malevolent winged-creatures. It’s the same thing with the actual appearances of the creature (freeze frame the images).\r\n\r\nA mothman CAUSED the auto accident that injured Debra Messing. Would a GOOD angelic being cause such a tragedy (regardless of the fact that she ultimately dies of a pre-existing problem)?\r\n\r\nThe bible calls Satan the \"prince of the power of the air;\" hence, his filthy underlings (demons) are spiritual and electro-magnetic in nature. They can thus speak through a phone that's not plugged in or perhaps manipulate a traffic light. They can mimic the voices of dead loved ones or even take human form, like Indrid Cold, Mary or the male nurse who insists that Mary's drawings are of \"angels\" and then mysteriously vanishes.\r\n\r\nThe researcher from Chicago reveals that the mothmen are from “hell” (the spiritual underworld that underpins the earth) and send out mixed messages to ruin people’s lives. They may seem to be benevolently warning humans but, at the same time, are obvious instigators of human suffering (the car crash, Gordon's job loss, insanity & ultimate demise and the researcher's loss of his family, career & respectable social life). Also, they refuse to reveal their true selves and intentions. They are highly skilled masqueraders.\r\n\r\nThe reclusive researcher also points out that they have been around for millennia and therefore see things 2-3 moves ahead of humans; they use this vantage point to manipulate, deceive and destroy. Since their M.O. is to “kill, steal and destroy,” they feed on death, destruction and torment and therefore venture to the places where great tragedies will transpire, like the Silver Bridge collapse.\r\n\r\nThe saved police woman at the end was number \"37,” historically a numerical symbol of The Christ, which shows that her submersion in the river and figurative resurrection is a type of the Anointed One. Yet she is still a victim in that her previous views that the mothmen are destructive and manipulative could now flip-flop into the deception that they are somehow agents of good. Of course we never find out if this happens because the tale potently ends with Klein and Connie in shock sitting in an ambulance just glad to be alive.\r\n\r\nThe film powerfully illustrates that humanity is caught in a cosmic war and that there are malevolent beings who purpose to ruin or destroy us. Failure to understand and tactically prepare can be fatal or lead to great suffering. The only true protection from these evil spiritual beings is reconciliation with the Creator through Jesus Christ's blood shield of atonement and utilizing the armor of light.","id":"5b2965720e0a2659d40092bd","url":"https:\/\/www.themoviedb.org\/review\/5b2965720e0a2659d40092bd","movie_id":2637}
{"author":"John Chard","content":"Fantastic story given a quite smashing adaptation.  \r\n\r\nEvery once in a while, when Hollywood is stuck for new swashbuckling ideas, they turn to the writer of \"The Three Musketeers\", \"The Man In The Iron Mask\" and \"The Count Of Monte Cristo\", one Alexandre Dumas père. Which of course is no bad thing as long as the adaptation is given care and consideration - which hasn't always been the case. So when it was announced that the director of Waterworld, Kevin Reynolds, was to direct the latest version of \"The Count Of Monte Cristo\", many feared the worst. Made for around $35 million, Reynolds' film fared OK at the Worldwide box office, taking in around $76 million. Yet although far from being a flop, it upped and vanished rather quickly and was barely given a mention come the arrival of 2003. Thankfully the film gathered momentum with the rental releases and is now firmly established as a much loved genre piece.\r\n\r\nOn the two big hitting movie internet sites, Rotten Tomatoes & IMDb, the film scores 75% and 7.5 respectively, that's about right I would say. Reynolds' film doesn't bring anything new to the table as regards the story, but if it isn't broke then why fix it? Staying safe and true to the spirit of the source, Reynolds has simply crafted a rip roaring movie about betrayal, torture, faith, revenge and love. The makers have costumed it up and added the necessary sword play ingredient. All that was needed was for his cast to deliver performances worthy of such period shenanigans. And he got them.\r\n\r\nJames Caviezel plays Edmond Dantes. Two years away from playing Jesus Christ, the role that would make his name known, Caviezel had prior to Cristo looked anything but a leading man. But here he finds a role to get his teeth into and it's a comfortable fit, and crucially he seems to be having a good time with it. No such point to prove for Guy Pearce (Fernand Mondego) though, for he already had \"L.A. Confidential\" & \"Memento\" under his belt. Here he gives it the full pompous villain act and struts around like some dandy spoiled brat. It's a film stealing performance that shows that the guy who played Mike Young in Aussie soaper Neighbours, has indeed come a long way. Richard Harris adds a touch of class as Abbé Faria, gravel voiced Michael Wincott does a nice line in sadistic bastard as the Château D'If governor, Armand Dorleac. While Luis Guzmán as Jacopo is fun comic relief and Dagmara Dominczyk as Mercedès Iguanada is both sensual and heartfelt.\r\n\r\nNever over camping the movie, Reynolds keeps it pacey and dots it with smart set pieces and memorable scenes. Backed up by an on form cast and a sure fire source story to work from, \"The Count Of Monte Cristo\" turns out to be period winner. So see it if you haven't done so already. 8\/10","id":"5c8c28390e0a2612ed51a9aa","url":"https:\/\/www.themoviedb.org\/review\/5c8c28390e0a2612ed51a9aa","movie_id":11362}
{"author":"Wuchak","content":"That Damned Ring.\r\n\r\nRELEASED IN 2002 and directed by Peter Jackson, “The Lord of the Rings: The Two Towers” adapts the second part of JRR Tolkien’s popular fantasy trilogy about adventures on Middle-Earth. The surviving ‘Fellowship’ of the first film has been divided into three small groups for this one: The Hobbits Frodo and Sam (Elijah Wood and Sean Astin) team-up with the mad Gollum (Andy Serkis) to make their way to Mordor, but are captured by Faramir (David Wenham), the brother of the deceased Boromir. Aragorn (Viggo Mortensen), Legolas the Elf (Orlando Bloom) and Gimli the Dwarf (John Rhys-Davies) encounter the once-great King Theoden (Bernard Hill), who has fallen under the spell of Saruman (Christopher Lee) via his devious minion Grima Wormtongue (Brad Dourif). Meanwhile the Hobbits Pippin and Merry (Billy Boyd and Dominic Monaghan) try to enlist the help of huge tree creatures. Gandalf is also on hand (Ian McKellen). These story threads culminate in the great Battle at Helms Deep in the third hour.  \r\n\r\nThis three-hour fantasy\/adventure starts out more engaging than the first film, which was laden by its overlong, convoluted and (for the most part) unnecessary prologue. Like that movie, the characters are colorful, the tale is imaginative, there’s a lot of brutal action rounded out by quieter moments and everything LOOKS and SOUNDS great. Unfortunately, after the first act, Jackson opts for CGI porn (excessive use of CGI with the corresponding dizzying visual effects). The first film did this too, but this one ups the ante and so there’s not as much spectacular New Zealand cinematography (i.e. real forests, mountains, rivers, etc.). If cartoony CGI is your thang then you’ll likely appreciate this installment more than me.        \r\n\r\nThere are other problems: While the characters are imaginative, they’re also shallow and rather dull, at least for mature people who require more depth to maintain their interest. Also, the wide-spanning (meandering) story with numerous characters and hard-to-remember names tends to be disengaging. I was never much captivated by the characters and their causes, although uber-fans of Tolkien might be.  \r\n\r\nAnother problem is the lack of prominent female protagonists. We have Miranda Otto as Éowyn, Théoden's niece, who falls in love with the noble Aragorn and that’s about it, except for cameos by Liv Tyler as Arwen and Cate Blanchett as Galadriel. “Mythica: A Quest for Heroes” (2014) cost LESS THAN $100,000 to make, which is a mere fraction of the $94 million it cost to make this blockbuster and the filmmakers knew enough to include a couple of prominent babes as key protagonists in the story. \r\n\r\nDespite these negatives, “The Two Towers” was an ultra-ambitious undertaking and is a must for fantasy\/adventure aficionados who liked the first movie.                      \r\n\r\nTHE MOVIE RUNS 2 hours 59 minutes and was shot in New Zealand.  \r\n\r\nGRADE: B-\/C+","id":"5aa436d1c3a3687c06010e30","url":"https:\/\/www.themoviedb.org\/review\/5aa436d1c3a3687c06010e30","movie_id":121}
{"author":"John Chard","content":"Let's see. Who else has 27,000 nukes for us to worry about?  \r\n\r\nThe Sum of All Fears is directed by Phil Alden Robinson and adapted to screenplay by Paul Attanasio and Daniel Pyne from the novel of the same name written by Tom Clancy. It stars Ben Affleck, Morgan Freeman, James Cromwell, Ciaran Hinds, Liev Schreiber, Bridget Moynahan and Michael Byrne. Music is scored by Jerry Goldsmith and cinematography by John Lindley.\r\n\r\nFilm is the fourth film to feature the character Jack Ryan (Affleck). It is set in present day 2002 but with Ryan younger than in the other films and at the start of his career in the CIA. Plot is Cold War themed and finds America in a sweat when it is found that renegade terrorists have a nuclear weapon in their possession; just as a new supposed radical president takes up office in Russia.\r\n\r\nOur most basic common link is that we all inhabit this small planet, we all breathe the same air, we all cherish our children's futures, and we are all mortal.\r\n\r\n2002 saw two great thrillers released that starred Ben Affleck, one was Changing Lanes, the other was this Jack Ryan based effort that attempted to reboot the series. Coming a year after the September 11 attacks and featuring a plot involving terrorists using a bomb that America supplied the Israelis in the 70s during the Yom Kippur War, it was material too close to the bone for some critics. Yet the film did well at the box office in the States and including Worldwide takings it garnered well over $100 million in profit. Impressive figures considering it's not an action blockbuster, it relies on brain over brawn and leading man Affleck was on the back of Pearl Harbor and bearing the brunt of critical scorn.\r\n\r\nEach day we lose a little bit more of our separate, sovereign ability to determine our own futures... and each day the world comes a little bit closer to that terrible moment when the beating of a butterfly's wings unleashes a hurricane God himself cannot stop.\r\n\r\nComforted by the superb cast around him, which also includes the likes of Colm Feore, Phillip Baker Hall and Alan Bates in support slots, Affleck proves perfect for the material to hand. Without doubt he's no Harrison Ford, in the same way Moynahan is no Anne Archer, tough boots to fill in the roles of Jack and Cathy Ryan respectively, but in a re-jig of Ryan the character, we now have the arrogance of youth dressed up in slacks and t-shirt, a smart brained youngster beginning his CIA career at a perilous time, a time that thankfully is devoid of jingoistic flag waving, but of adult political sensibilities. Affleck's Ryan as a character is as refreshing as the writers' responsible attitude is.\r\n\r\nYou dropped the bomb on Hiroshima. You dropped the bomb on Nagasaki. Do not lecture me on Chechnya!\r\n\r\nWith shades of the Cuban Missile Crisis and a Fail-Safe like finale, The Sum of All Fears rounds out as a nail biter of a thriller. Dig deeper and some implausibilities surface, but we are asked to tune into the paranoia and get in deep with the characters trying to avert global catastrophe, to decry the film's cerebral thriller qualities is churlish. The Jack Ryan parts of the film involving Cathy the girlfriend are the least interesting, but here's the thing, young Jack Ryan is just one of the components making up a far bigger whole. The film isn't solely a Jack Ryan movie. The source novel was a door stopper, so inevitably much as been excised from it, and inevitably fans of the book have been vocal in their displeasure; though we would have needed another hour of film to even get close to Clancy's big block of fiction. So in place is a picture that is uncomplicated in structure and story telling and comes in at under two hours running time. It's credit to director Robinson that The Sum of All Fears engrosses from start to finish.\r\n\r\nIt was hoped that the reboot would herald the start of a run of more Jack Ryan based movies, but in spite of the great box office, this didn't materialise. But that is in no way any marker to the quality of the film, or its standing in the Jack Ryan series. Judge it on its own merits and ideas and the rewards are many, especially on a second viewing. At the time of writing Jack Ryan will return to the big screen in December 2013, titled simply as Jack Ryan, with another young actor, Chris Pine in the role of Ryan. Undoubtedly that will be high on action, such is the way of drawing in the young dollars at the multiplexes these days. But if it has half the tension and brains of Robinson's picture then we will be blessed. If not? Then there's an even bigger reason to treasure Jack Ryan's 2002 version. 7.5\/10","id":"5c8c3db0c3a3686119475c76","url":"https:\/\/www.themoviedb.org\/review\/5c8c3db0c3a3686119475c76","movie_id":4614}
{"author":"John Chard","content":"My name is Tom Van Allen. I'm a trumpet player.\r\n\r\nThe Salton Sea is directed by D. J. Caruso and written by Tony Gayton. It stars Val Kilmer, Vincent D'Onofrio, Peter Sarsgard, Doug Hutchinson, Anthony LaPaglia, Debora Kara Unger, Adam Goldberg and Luis Guzmán. Music is scored by Thomas Newman and cinematography by Amir Mokri.\r\n\r\nDanny Parker (Kilmer) is hanging out with a bunch of methamphetamine users, apparently in an effort to numb the pain of his one time life that saw his wife murdered. Or is he? The word of mouth for it was strong, but no sooner did it hit cinemas than it disappeared off the face of the earth. However, the cult cinema world is often a vibrant place to lurk, enter there and you find The Salton Sea, a wonderfully tricksy and off beat neo-noir awash with misery, revenge, redemption and odd ball characters that are either stuck in purgatory, or heading to nowhereville.\r\n\r\nProtagonist Danny Parker leads the film, a man whose identity is fractured after being dealt a blow from the hands of fate, very much in limbo mentally, he none the less has goals to achieve, nothing is never quite as it seems until director Caruso wants us in on the side-shifts. Danny is often in the company of danger and weird characters, from a hopped up harpoon wielding loon, to a no nose psycho (too much meth up the nose will make you lose it kids), via dirty cops and meth heads, it's a world of unease, the twisty plot drawing the viewer in with a kinky smile on its face.\r\n\r\nCaruso also pulls off the neat trick of placing humour in this off kilter world without hurting the dramatic harshness of the thematics. There's a quite brilliant sequence that shows a botched crime being attempted by the meth head crew, this we watch at the same time as they discuss about actually pulling the crime off. That it involves a stool sample from Bob Hope should tell you all you need to know about the intelligence of the wannabe perps! Caruso's camera is fluid and he uses certain neo-noir visual tricks of the trade as well (time lapses etc), and he also has a knack for varying the mood without averting the slowly bubbling to the surface pace that the story requires.\r\n\r\nKilmer is superb, perfectly low-key, there is no need for rage, the yearning for revenge and redemption, for identity, is brought out via calmly delivered dialect, and it's very affecting. D'Onofrio as Pooh Bear, the afore mentioned no nose fella, steals the movie with another of his off the planet nut-jobs. Elsewhere, Sarsgard is as appealing as he has ever been as Danny's stoner best mate, Hutchinson and LaPaglia cut fine figures as dirty cops, while Guzmán and Danny Trejo leave an impressively grungy mark. The only disappointment is the lack of screen time for Kara Unger, a fine actress, she is playing what turns out to be a critical femme fatale role, but really we needed more of her. It's a rare misstep in an otherwise cracking neo-noir that is highly recommended to fans of similarly devilishly fun pictures. 8.5\/10","id":"5569d2fec3a36876980018f3","url":"https:\/\/www.themoviedb.org\/review\/5569d2fec3a36876980018f3","movie_id":11468}
{"author":"NeoBrowser","content":"Peter Jackson has always maintained that The Two Towers is \"the second act\" of his epic undertaking, and perhaps the true greatness of the middle chapter will only be clear when viewed in context. As a stand-alone film, however, The Two Towers is not quite as good as Fellowship. (Nor, indeed, does it extend the universe or deepen the relationships in the manner of The Empire Strikes Back.) That it still merits the full five stars is merely an indication of how high the benchmark has been set.\r\n\r\nPicking up pretty much where Fellowship left off, this is a considerably darker film, with Frodo (Wood) falling further under the influence of the Ring (giving rise to some seriously spooky hallucinations), while Saruman (Christopher Lee) wreaks even more havoc. There's also the first appearance of Saruman's spy, the sinister Wormtongue (Brad Dourif), and the complex Gollum, a brilliant combination of computer trickery and raspy vocals from Andy Serkis (the campaign for a Best Supporting Actor Oscar starts here).\r\n\r\nOther newcomers include Faramir (David Wenham), the understandably miffed brother of the recently deceased Boromir, and Éowyn (Miranda Otto), who spends much of her time casting winsome glances in the general direction of Aragorn (Mortensen). Eventually the plot complexities become more coherent, setting the action up for the forthcoming finale, The Return Of The King.\r\n\r\nAs we've come to expect, this is spectacular stuff - from an opening which sees Frodo troubled by dreams about the demise of Gandalf, through to the climactic Battle Of Helm's Deep, which is nothing short of breathtaking. But Jackson cleverly tempers the louder, brasher sequences with some heartstring-tugging moments - peasants despondent as they are forced to abandon their villages, Aragorn and Arwen's troubled relationship, and, of course, the return of Gandalf (Sir Ian McKellen, superb as ever), one of the film's most powerful, memorable images that may well leave Ring devotees a little misty-eyed.\r\n\r\nHowever, those who still believe that the trilogy is beyond criticism may find their views challenged by The Two Towers. It's just as long as the first film, but gets the heroes no closer to a final victory. And, where the first movie developed its emotional tone from the brightness of The Shire to a darker climax, the sequel is more of a one-note affair, shadowy in both look and content.\r\n\r\nThis is particularly true of the Ringbearer's quest, which adds the not-insignifcant Gollum to the party, but suffers more than the other story strands from the cross-cutting and finishes with a nearly identical pep talk from Sam to the tearful speech that climaxed Fellowship. Of course, given the nature of the material, and Jackson's desire to be faithful, this is all understandable. And by the time we all end up under siege at Helm's Deep, it's unlikely anyone will give a toss about narrative arcs: like Gollum, this is simply gob-smacking, mind-blowing, never-seen-before stuff.\r\n\r\n\r\nVerdict - It may lack the first-view-thrill and natural dramatic shape of Fellowship, but this is both funnier and darker than the first film, and certainly more action-packed. An essential component of what is now destined to be among the best film franchises of all time. \r\n\r\n5\/5\r\n\r\n- Caroline Westbrook, Empire Magazine","id":"51ea5212760ee3602024ac6f","url":"https:\/\/www.themoviedb.org\/review\/51ea5212760ee3602024ac6f","movie_id":121}
{"author":"The Movie Diorama","content":"Phone Booth dials up its millennial tension through suspenseful confined calls. Joel Schumacher is a rather inconsistent director. Unusual, yet capricious. From ‘The Lost Boys’ to ‘Batman & Robin’, his career has been considerably scattershot in terms of quality. Phone Booth, whilst quintessentially being a product of its time, happens to be his most simplistic. An arrogant publicist is held hostage in a phone booth by a mysterious sniper who offers him an ultimatum.\r\n\r\nA hyperbolised exercise in absolution from an absurdist’s perspective, Schumacher delivers a nail-biting thriller from the confinement of one besmirched public booth. Unscrupulous sex shops on one side of the grubby New York street, and a religiously inclined series of posters dictating “who do you think you are?” on the other side. It may just be a lightning paced disposable techno thriller to many, but if you divulge into the finer details you’ll notice it is overwhelmed with morality. The repentance of sins. Cleansing the soul from immorality. The harsh tones of Sutherland’s antagonistic voice, likening himself to a higher (or lower...) entity, offering Farrell’s Stu a chance for redemption. A surprisingly thematic endeavour for Schumacher, whether intentional or not, the religious symbolism in its subtle visuals or literary narrative were certainly profound.\r\n\r\nIt smooths out the neo-noir roughness that forces this thriller to be nothing more than disposable entertainment. Aside from Farrell’s strong performance as the arrogantly unlikeable Stu and Sutherland’s menacing tone, the supporting cast were mediocre at best. Whitaker, Mitchell and Holmes rarely had an opportunity to shine within the mucky street and had a tendency to overact. The act of forgiveness, whilst being a pivotal point to the whole ordeal, seemed incredibly vacuous without much deliberate intervention. All too easy, considering how long Stu kept his unfaithful behaviour up for. Cohen’s script was sharp and concise, occasionally stagnating in moments of desperation when not knowing how to progress the hostage situation further.\r\n\r\nStevens’ editing was swifter than Sutherland cocking his sniper rifle multiple times. On screen graphics to display scenes running simultaneously, such as police officers tracing the encrypted phone call, keeping the pace consistently tight. Some of visuals, such as the red dot from the sniper, obviously smelt of fakery as well as the space effects showcasing the satellite sending communications to mobile phone chips etc. Y’know, common tropes from films created in the early naughties.\r\n\r\nAs I said, it’s very much a film of its time. Yet despite the rough disposable nature of Phone Booth, it’s a much more entertaining call then being on hold for an hour and a half. I can tell you that from experience...","id":"5e207134e004a60015992c73","url":"https:\/\/www.themoviedb.org\/review\/5e207134e004a60015992c73","movie_id":1817}
{"author":"Wuchak","content":"***Snakes on an Island***\r\n\r\nA group of tourists, resort workers & guides in South Africa struggle to survive after getting stranded on an island with a profusion of deadly snakes. William Katt (Malcolm), Wayne Crawford (Jake) and Kate Connor (Heather) emerge as the main protagonists. Crawford also directed and co-wrote the script.  \r\n\r\n“Snake Island” (2002) is a low-budget South African production with a few American actors; it probably cost half of what the typical SyFy flick costs. But it gives you what you pay for (although I hope you watched it for free): a plethora of snakes, authentic African locations, a mildly entertaining survival situation with an okay cast, a subdued sense of humor and some decent horror. It helps that most of the snakes appear to be real rather than CGI.\r\n\r\nBut it’s overall pedestrian, unfortunately. I guess it doesn’t help that I don’t find snakes particularly frightening. Director\/writer Crawford tried to perk things up with a tiki party sequence wherein the group lets their hair down and some of the females start dancing topless. But the women, while okay, aren’t anything overly alluring, although Kate Connor eventually won me over.\r\n\r\nThe film runs 1 hour, 30 minutes and was shot in South Africa.\r\n\r\nGRADE: C\/C-","id":"5cbb50d00e0a2660dcee2ec7","url":"https:\/\/www.themoviedb.org\/review\/5cbb50d00e0a2660dcee2ec7","movie_id":29958}
{"author":"John Chard","content":"Fincher's often derided thriller demands repeat viewings.\r\n\r\nMeg Altman and her daughter Sarah, move into a vast Brownstone home, this place is unique because it has a panic room, a room of safety from where no intruders can gain access. Sure enough on their first night in their new home, they are forced to flee to the room as three intruders break in to the house, but trouble is, is that what the intruders want is in the panic room itself.\r\n\r\nFrom the off we know that Panic Room is going to be oozing David Fincher stylishness, the opening credits sprawled across the Manhattan skyscrape like advertising billboards, perfectly set the tone for the movie to follow. I personally think that following on from the harshness and ingenuity of \"Fight Club\", many were surprised at the simplicity of Panic Room's structure, this is after all a straight forward cat and mousery thriller set in one foreboding building. Yet Fincher gains much claustrophobia from such a large building setting, managing to rack up the tension in every reel. The film, in spite of the oppressive nature of the story, never sits still either. The action kicks in from the off and through a series of devilish stunts, it continues through to the pulse raising finale.\r\n\r\nThe David Koepp screenplay does not seem dark enough on the first viewing, because some of the interplay between the three intruders is actually jocular, but it never loses sight of its thriller heart. Subsequent revisits to the film reveal it to be a tightly constructed character piece, in what is practically a five character story. The real winner in that department is Jodie Foster's Meg Altman, it would have been easy for the character to be ground out as some super heroine, with death defying feats of courage masking her out as wonder woman, but Fincher has her pure and simply as a resourceful human being. She's fiercely maternal and strong and intelligent, but at her core she remains fallible, and with that she becomes believable. The other big plus point in the film is Fincher's use of the house, where his camera glides about like a phantom, a ghostly observer to the unfolding proceedings. In and out of locks and coffee pots, up and down stairs, tilts, as we track the movements of the intruders, Fincher isn't showing off, he's putting us the viewer into the mix as well.\r\n\r\nCast are very good, Jodie Foster, Forest Whitaker, Jared Leto and a surprisingly potent Dwight Yoakam all come together very well under Fincher's watchful eye, whilst young Kristen Stewart as Sarah puts much emotive heart into a role that could so easily have been too syrupy approaching the final act. Yes it's fair to say that one has to suspend disbelief, this is after all a home invasion thriller following a true course, but in Fincher's hands it rises above cliché to thrive on atmospherics and character dynamics. Well put together and big on ticking time bomb tension, Panic Room gets better on repeat viewings. 8\/10","id":"5e603cf5459ad6001a51bddc","url":"https:\/\/www.themoviedb.org\/review\/5e603cf5459ad6001a51bddc","movie_id":4547}
{"author":"Wuchak","content":"_**Is it really about aliens?**_\r\n\r\nM. Night Shyamalan's \"Signs\" (2002) is about a disillusioned ex-minister (Mel Gibson) who lives in the country with his son & daughter and brother (Juaquin Phoenix). The reasons for his disillusionment become clear as the story unfolds. When a mysterious crop circle is discovered in their cornfield they wonder if it's a prank or an alien invasion!\r\n\r\nAlthough the plot deals with a possible alien invasion, the theme is faith. There are two general views of life: (1) That life and the universe are one big meaningless accident and you're just an insignificant bug that will soon be squashed out of existence and memory. And (2) that there's an intelligent design to the universe and, although it's somehow fallen (i.e. severely messed up), there IS meaning, love, hope and purpose, even if we are presently unable to fully comprehend it.\r\n\r\nThe film addresses the clash of these two opposing views. We've all experienced the conflict of these two positions within our OWN hearts; it's the clash of flesh (id) and spirit (super-ego). On the one hand, we WANT to believe the latter position, but life dishes out so much crap that we are seriously tempted to give-in to the former.\r\n\r\nThis is the struggle Gibson's character faces in the story. He's given up on God and is stumbling in the dark; he's just going through the motions to exist. His smile is mostly a facade.\r\n\r\nMany people diss the film for an obvious plot hole regarding the alien's weakness, but Shyamalan's too talented to not realize this. It's a sign to what the film is really about (sorry; I couldn't resist).\r\n\r\n**SPOILER ALERT** (Don't read further unless you've seen the film)\r\n\r\nIt's possible that the aliens aren't really extraterrestrials but rather demons from the underworld (the dark dimension) invading the physical realm to take as many victims as they can. The idea that they are aliens is just a mass deception and, remember, the devil is the \"father of lies\".\r\n\r\nThere are many clues: The spaceships are never seen, just lights in the sky (the devil's also called \"the prince of the power of the air\" in the bible). The \"aliens\" look decidedly demonic and have cloven hoofs. The “primitive method” of repelling the aliens is discovered in “three cities the Middle East” and is holy water, which is ordinarily used by Catholic & Episcopal exorcists against demonic manifestations (Shyamalan, by the way, attended Catholic & Episcopal schools). The daughter, Bo, was said to be a \"gift from God\" who is sensitive to impure (unholy) water. Her name in Old Norse means \"to live\" and she was able to discern the weapon of life needed to defeat the demonic menace. The dog and bird were clearly possessed. The crop circles are occultic symbols and possible portals to the underworld. The crop circle in the Hess cornfield resembles a pitchfork. When the disillusioned minister cries out to God that he hates him he actually displays his faith; after all, he has to believe in God in order to converse. At that precise moment his son recovers from the asthma attack and the news announcer declares that the \"aliens\" are retreating. You see, FAITH sends the enemy fleeing with their tails between their legs.\r\n\r\nAlso, we see evidence that the demons are personal in nature. The \"alien\" locked in the vet's pantry was linked to the guilt and disillusionment that haunted the vet and the minister after the death of the latter's wife.\r\n\r\nAlso, we see evidence that the demons are personal in nature. The \"alien\" locked in the vet's pantry was linked to the guilt and disillusionment that haunted the vet after the death of the minister's wife.\r\n\r\nKeep in mind that when the film debuted, Shyamalan was known as the king of the plot twist, yet the revelation that the aliens’ weakness is water wasn’t exactly a mind-blowing turn seeing as how the earth is 71% water and technologically advanced aliens who can travel the galaxy would know this. Moreover, the aliens curiously have no physical weapons and are easily trapped by a pantry door. It stands to reason that Shyamalan hid the twist in the movie. That twist is that the aliens are really demonic in nature.\r\n\r\nI'm not saying you can't view the movie as a literal extra-terrestrial invasion flick, but rather that the underlying demonic reading is a legitimate way of viewing the material because it all ties together and links to the story arc of the disillusioned ex-minister finding redemption. Also, I'm not suggesting that you have to believe in God to appreciate this movie, which is obviously not the case.\r\n\r\nBOTTOM LINE: This is a quality Shyamalan film and is about on par with \"The Sixth Sense\" and \"The Village.”\r\n\r\nThe film runs 106 minutes and was shot in Eastern Pennsylvania.\r\n\r\nGRADE: B+","id":"5e84287098f1f10014a856d8","url":"https:\/\/www.themoviedb.org\/review\/5e84287098f1f10014a856d8","movie_id":2675}
{"author":"LJ_989","content":"This film is very dreamy and has a 2001 feel. The story is romantic and lends itself to an inevitable doom. The music is intertwined beautifully and the acting is phenomenal.","id":"5346d81e0e0a265fef001b81","url":"https:\/\/www.themoviedb.org\/review\/5346d81e0e0a265fef001b81","movie_id":2103}
{"author":"Gimly","content":"I'm not a diehard _Star Wars_ fan. I've seen all the movies, seen them all more than once even, and I have my opinions, but when I see the way people talk about _Star Wars_ online, I can't really find myself behaving the way that \"true fans\" or whathaveyou do. That being said, I think that the majority of the _Star Wars_ films have been pretty good. The notable exception to this, for me at least, is the prequels. And yes you can include the animated _Clone Wars_ movie that they made in that era too. These four movies, again, for me, are all bad. But even amongst them, there is still a ranking in my mind, and in that list, at the very bottom sits _Attack of the Clones_. Yes it is this movie which holds the title, of the very worst Star Wars theatrical release of all time. \r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5e095a0dfea0d70013bc3ca9","url":"https:\/\/www.themoviedb.org\/review\/5e095a0dfea0d70013bc3ca9","movie_id":1894}
{"author":"NeoBrowser","content":"\r\n\r\nThe collective fever that characterized the countdown to The Phantom Menace had long since dissipated by the time the first sequel prequel rolled off the ILM production line. Casual spectators, once stung, had decamped en masse to the newly discovered Middle-Earth, leaving George Lucas with just the few million hardcore fans - true believers who, with all the apprehension of parents at a nativity play, willed their defrocked hero back towards respectability.\r\n\r\nThere are certainly stretches in the patchy Attack Of The Clones when Lucas’ flat-packed dialogue struggles to keep the hecklers quiet – Anakin’s seduction of the former Queen has all the charm of a teenage lunge behind the bike-sheds and none of the feeling – but by the time climactic ‘reel six’ cranks into high gear the saga’s reputation as the godfather of modern sci-fi spectacle is more or less restored. Indeed, when Yoda finally unsheathes his mini-saber and kicks Sith ass the faithful can reliably be found standing on seats hollering as if the outcome was never in doubt. But, as the little Jedi might say, in doubt it was.\r\n\r\nWhere Episode V fairly zipped around the galaxy with all the breezy confidence of youth, unafraid to travel anywhere, even dark places, the second middle child of the saga is saddled with an altogether heavier burden from which it struggles to escape. Empire hits the ground running on ice planet Hoth, Clones however, has a truly cold start to contend with, aware perhaps that the movie’s most pressing task is to simply atone for the more egregious sins of Episode I. Thus, Jar Jar is quickly sidelined, the upgraded CGI Yoda gets a showcase and those damn Amidala-clones are killed off on page one. On Coruscant we also meet the grown-up ‘Ani’ - okay so he’s a whiny teenager but that’s still a vast improvement on the bowl-haired moppet the world was asked to root for in 1999.\r\n\r\nAlso more powerful than when last we met is Ewan McGregor’s Obi-Wan, the Jedi who was simply wan in Menace is a much more forceful presence as a full-bearded Master, struggling manfully with the endless exposition and even landing the odd punchline.\r\n\r\nAs with Empire, the protagonists are separated for the second act: while Obi-Wan is busy uncovering the conspiracy of the Clones, Anakin and Padme turn into colourless clones of Han and Leia in the romance stakes. There are pleasures (Obi-Wan squares off against Jango Fett) and pitfalls (Anakin and Padme have a picnic) in roughly equal measure throughout this flabby middle act but as with Episode I mostly you get a sense of drama that is willed into being, a necessary bridge to Episode III that requires Lucas to traverse territory – romance, politics – he is simply not comfortable in.\r\n\r\nMatters improve greatly in the final forty minutes: Christopher Lee’s Count Dooku arrives to provide some much needed gravitas, C-3PO turns up to do his C-3PO thing and Padme puts on a skin-tight white leotard. Best of all, Lucas finally cuts loose. The classic trilogy bristled with seat-of-your-pants filmmaking, our heroes bouncing from cliffhanger to cliffhanger, and in the final section of Episode II – almost four hours into this prequel enterprise - Lucas at last cranks up to this Saturday morning serial pace: from the Tex Avery goofiness of the droid factory, to the Cecil B. De Mille grandeur of the gladiator arena, the action never lets up.\r\n\r\nAlso in the last reel we finally get to divine something of Lucas’ grand design, with ironic pay-offs for the fans still paying close attention - it is the witless Jar Jar who makes the creation of a clone army possible and Yoda who first leads what will become Stormtroopers into battle. In its own way, the end of Episode II is every bit as dark as the famous end of Episode V.\r\n\r\nUnsurprisingly, the least anticipated movie of the saga suffered at the box office – Episode IV raked in more money at the US box office back in 1977 – and remains largely unloved by the fanbase for its emphasis on the central love story but despite no real improvement in dialogue or acting it functions perfectly well as an old fashioned romantic epic, complete with standalone set-pieces, rich political intrigue and a painters’ pallette. Indeed, so indebted is Lucas to David O. Selznick here, ultimately he may have been better served abandoning his own trilogy structure and boiling both Episodes I and II down to a 3-hour Gone With The Wind style classic – an approach that would have at least halved all that damn anticipation.\r\n\r\n\r\nVerdict - The middle episode that can make a virtue of its bridging role is rare indeed. And where The Empire Strikes Back dazzled with vertiginous cliffhangers, Clones is more typical of the breed, necessary but not vital. However, as we make the awkward journey through Anakin’s teenage trials a sparkling digital print ensures there is still much to marvel at, not least a little green fella who is surprisingly quick on the draw.\r\n\r\n3\/5\r\n\r\n- Colin Kennedy, Empire Magazine","id":"51ea48b9760ee3277214afa8","url":"https:\/\/www.themoviedb.org\/review\/51ea48b9760ee3277214afa8","movie_id":1894}
{"author":"Andres Gomez","content":"A good surprise, knowing that this was not a too good comedy. Pacino plays well his role in another middle age crisis stupid movie in the tradition of \"The Woman in Red\" or \"10\".","id":"5612713e925141061500830e","url":"https:\/\/www.themoviedb.org\/review\/5612713e925141061500830e","movie_id":9296}
{"author":"Gimly","content":"Techically unimpressive, but an interesting story well-acted.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5c440cc9c3a3681a0923ea72","url":"https:\/\/www.themoviedb.org\/review\/5c440cc9c3a3681a0923ea72","movie_id":12576}
{"author":"Wuchak","content":"***A total BORE about being lost in the desert, but Worthwhile for a few reasons***\r\n\r\n\"Gerry\" (2002) is a film by Gus Van Sant, the director of \"Good Will Hunting\" and \"Elephant.\" It stars Matt Damon and Casey Affleck as two friends who get lost in the desert; they spend the entire film just walking around the beautiful parched landscapes trying to find a way out.\r\n\r\nAs a captivating piece of cinema, \"Gerry\" is a TOTAL failure. I say this without any reservation because my definition of a good film is one that simply maintains your interest. If the film fails to capture your interest, that is, it bores you, causes your thoughts to wander, puts you to sleep, etc. THEN IT'S NOT A GOOD FILM. Yet, even though this is true, I find there are a number of reasons why \"Gerry\" is a worthwhile piece of cinema: \r\n\r\n1. It gives a good laugh. Although it's a serious \"story\" and by no means a comedy, I found myself uproariously laughing on quite a few occasions. Why? I don't know, perhaps because I can't believe someone would actually blow the money ($3.5 million) on making such a \"film\" and actually think people would like it (well, beyond pretentious art-geeks). Also there are several laugh-inducing sequences, albeit unintentional, like the absurdly overlong CRUNCH, CRUNCH, CRUNCH scene.\r\n\r\n2. It makes for a great joke movie. What I mean is, you can tell a friend or family member what a great movie you have for them to watch (do a lot of raving) and put \"Gerry\" in; then just kick back and wait for their inevitable negative reaction (e.g. \"This movie's a piece of sh**\", etc.). In most cases it will only take between 15 and 20 minutes, and certainly no longer than 35-40 minutes, unless it's someone who has a romantic interest in you and doesn't want to hurt your feelings.\r\n\r\n3. If, like me, you enjoy watching beautiful landscapes, in this case desert landscapes filmed in America (Utah & Southern Cal) and Argentina, then \"Gerry\" is a decent flick in which to kick back. Especially if you just want to relax and not have to THINK. The ambient piano\/violin score nicely enhances the relaxing mood.\r\n\r\n4. It is a great sleep-aid. Seriously, if you're having trouble sleeping, pop in \"Gerry\" and it'll send you straight to la-la land. I'm serious here, the first time I watched it I was ready to fall asleep after a mere 20 minutes, although I ended up lasting about a half hour. Because of this, it took me FOUR intervals to complete the film (and, yes, it put me to sleep each time).\r\n\r\nJust so you know, the movie is titled \"Gerry\" because the two guys constantly refer to each other as \"Gerry,\" a friendly nickname meaning \"loser\" or \"screw-up.\" \r\n\r\nAlthough the film itself is a bore I do enjoy the debates over its probable meaning, e.g. life itself is a desert and the foolhardy side of your psyche (that is, your “id” or “flesh”) must perish in order for you to survive and thrive.\r\n\r\nBy the way, the Affleck character fits the name \"Gerry\" to a 'T.' You gotta listen REAL close when he speaks because he just sort of mumbles his lines (what few there are).\r\n\r\nBOTTOM LINE: Although \"Gerry\" is an abysmal failure as far as captivating cinema goes, it's worthwhile for the four reasons noted above, plus it’s interesting to interpret, hence my 2-Star rating. I suppose \"Gerry\" can be respected for brazenly rejecting EVERY cinematic convention, but that’s more stupefying than bold. Which prompts me to wonder: Maybe Gus Van Sant is pulling the ultimate Gerry on us… and we're all Gerrys because we FELL for it!\r\n\r\nThe film runs 1 hour and 43 minutes and is at least an hour overlong. Several tedious scenes are about ten times longer than they need to be. I wish I were kidding. They’re laughable.\r\n\r\nGRADE: D-","id":"5ce0779b0e0a266f86cbbbf6","url":"https:\/\/www.themoviedb.org\/review\/5ce0779b0e0a266f86cbbbf6","movie_id":1956}
{"author":"Wuchak","content":"Like Hogan's Heroes but serious and quasi-realistic\r\n\r\nRELEASED IN 2002 and directed by Gregory Hoblit, \"Hart's War\" is a war flick about a paper-pushing lieutenant with a background in law (Colin Farrell) who is unexpectedly captured in Belgium and taken to a POW camp in southern Germany in the closing months of the European theater of the war. He eventually befriends and defends a Tuskegee Airmen (Terrence Howard). Marcel Iures plays the humane German commandant while Bruce Willis plays the tough-as-nails American colonel of the POWs. Cole Hauser is on hand as a racist soldier. \r\n\r\nThis is obviously not a conventional WWII flick. Although it starts out with some great war action, it has more in common with films like \"Stalag 17\" (1953) and \"The Great Escape\" (1963), albeit with modern filmmaking craft. As my title blurb points out, it's reminiscent of Hogan's Heroes but without the comedy, plus elements of “A Few Good Men” (1992). The film isn't really about survival in the POW camp, but rather the tensions of the prisoners and the criminal drama.\r\n\r\nSome have complained that no fascist camp colonel in his right mind would allow such a trial as depicted in the movie. But there are several reasons why the commandant would allow it: (1.) for entertainment, (2.) to witness and understand the American way, (3.) he knew the war would be over soon and wanted to have the Allie's favor, or (4.) a mixture of the above. Keep in mind that the commandant went to school in the US after the first world war so he was enamored by American lifestyle and had a fondness for jazz. I'm sure entertainment was a huge factor since POW camp life is just as boring for the captors as it is for the captives over time.\r\n\r\nThe climax telegraphs that this is a war MOVIE and not real life, but it's packed with action and gripping drama. It’s also ultimately quite moving. Although it failed at the box office, \"Hart's War\" is a very good WWII POW camp movie and, in some ways, great.\r\n\r\nTHE FILM RUNS 125 minutes and was shot in the Czech Republic.\r\n\r\nGRADE: B+\/A-","id":"5b1032129251415ec80087c2","url":"https:\/\/www.themoviedb.org\/review\/5b1032129251415ec80087c2","movie_id":10592}
{"author":"Gimly","content":"_Michael Myers: The Reality TV Show!_\r\n\r\n...Somehow still less dumb than _Halloween 6_.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5a026c2d92514111da008457","url":"https:\/\/www.themoviedb.org\/review\/5a026c2d92514111da008457","movie_id":11442}
{"author":"Gimly","content":"Sure, it's got nudity, but has it got value? Not so much.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5b9349450e0a261975001f8b","url":"https:\/\/www.themoviedb.org\/review\/5b9349450e0a261975001f8b","movie_id":14365}
{"author":"Andres Gomez","content":"Classical Woody Allen movie, script and performance. Funny at times, but not one of the best ones.","id":"54241be1c3a3680872003e88","url":"https:\/\/www.themoviedb.org\/review\/54241be1c3a3680872003e88","movie_id":9689}
{"author":"dgood826","content":"I’d say the movie holds up a lot better all these years later because 1. it’s not right after the first MIB and my expectations weren’t super high and 2. after years of seeing Will Smith either not care enough about the movie to try or try too hard to get an Oscar it was awesome to just see him having fun and doing what he does best again. You can read more of my review here: https:\/\/imdgflicks.wordpress.com\/2017\/06\/29\/throwback-thursday-movie-review-men-in-black-ii\/","id":"5956738fc3a3683526049709","url":"https:\/\/www.themoviedb.org\/review\/5956738fc3a3683526049709","movie_id":608}
{"author":"Gimly","content":"I don't know that _Men in Black II_ is really thaaat much worse than the rest of the trilogy, as most other people seem to think. I mean, in my opinion, it's actually better than the third. But these are all basically the same movie. So they can only go so right or so wrong from one to the other to the other. It's not awful (well, the faces on that poster are, my god), but it's not like... good.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5d2ea94627d9cc00127ca3d4","url":"https:\/\/www.themoviedb.org\/review\/5d2ea94627d9cc00127ca3d4","movie_id":608}
{"author":"John Chard","content":"Isn't sugar better than vinegar?\r\n\r\n**SPOILER ALERT - The last paragraph makes reference to a 1940s film that constitutes a spoiler. ** \r\n\r\nThere rarely seems to be anything in between where Brian De Palma films are concerned, cinematic lovers of all kinds by and large either trash or laud his films. Femme Fatale is no different, one critic - both professional or amateur - will have it as a 1\/10 movie, another will have it at the maximum rate available. Femme Fatale is high grade stuff if one is either a De Palma fan or a lover of film noir. Conversely if these two things don't tick your film loving boxes then the law of averages suggests you should have - or should - stayed\/stay away from it.\r\n\r\nDe Palma opens up the doors to his fun house and invites noir lovers to come on in and enjoy. It's difficult to write about the plot because it holds many twists and turns, it's a veritable supply of uppers and downers, twisters and benders, all sexed up and pumped full of De Palma's trademark tricks and devilish rug pulls. In truth the story and set-up is predictable, but the journey is what makes the pic ooze quality and bare faced cheek, with the director giggling away like a schoolgirl in the background.\r\n\r\nOpening up with a sequence that sees our titular fatale (Rebecca Romijn-Stamos) watching famed noir classic Double Indemnity, De Palma proceeds to homage and love the film noir world. As he uses split-screens, canted angles, up-tilt shots, shadow plays etc, the narrative pulses with eroticism and impending cruelty, this really is a femme fatale based movie of the grandest kind. As events unfurl, with hapless photographer Nicola Bardo (a fun packed Antonio Banderas) caught in the web, Ryuichi Sakamoto's magnificent classical based score swirls around like some sort of peeping tom. The latter of which finds a shifty accomplice in Thierry Arbogast's noir photography.\r\n\r\nIt's a picture awash with dupes, dopes and vengeful criminals, where the themes of identity, duality, sexuality and distorted perceptions gnaw away at those investing fully in the viewing experience. Some critics (prof and amat) have lazily likened the film to David Lynch's Mulholland Drive, as if De Palma in 6 short months watched Lynch's movie and then knocked this film out! The copy-cat charge as funny as the rug-pull that De Palma pulls here. Besides, as any film noir lover will tell you, this has more in keeping with Fritz Lang's 1944 noirer \"The Woman in the Window\" than Lynch's film, which is no bad thing at all, and De Palma knew that. 8\/10","id":"563f0353c3a36862da006ca5","url":"https:\/\/www.themoviedb.org\/review\/563f0353c3a36862da006ca5","movie_id":9280}
{"author":"DanDare","content":"Set in an Orwellian Dystopian future after a nasty world war 3 in the early part of the 21st century. The population are forced to take drugs that suppress their emotions. You see emotions causes conflict and war.\r\n\r\nHowever some people exhibit emotions by not taking the medicine. They want to listen to music, experience their senses by seeing artwork, read books or having pets.\r\n\r\nThese people are exterminated by clerics, an elite hit squad. Christian Bale is the best of the clerics but once he stops taking his medicine, he feels for the first time and gets into contact with a resistance group to overthrow the leader.\r\n\r\nFilmed in Berlin, Equilibrium comes across like an updated version of Fahrenheit 451 but feels too much like a knockoff of The Matrix with a rather a sterile narrative at the beginning which made it rather uninvolving.\r\n\r\nBale's behaviour is so odd once he stops taking the drugs, he should just had been caught and shot.","id":"5ad7e46fc3a3687189007ed7","url":"https:\/\/www.themoviedb.org\/review\/5ad7e46fc3a3687189007ed7","movie_id":7299}
{"author":"Gimly","content":"So there's a pretty decent chance that _Equilibrium_ doesn't have an original bone in its entire makeup, but I still just **love **it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5bd2920d9251415ad600436a","url":"https:\/\/www.themoviedb.org\/review\/5bd2920d9251415ad600436a","movie_id":7299}
{"author":"Zoro DPiece","content":"SPOILERS AHEAD!\r\n\r\nFrom Rob Marshall (\"Into the Woods\") and Bill Condon (\"Dreamgirls\") comes this charming satirical stab on celebrity criminals. Based on the 1975 stage play and starring Renee Zellweger, Catherine Zeta-Jones and Richard Gere.\r\n\r\nSet in the jazz age of Chicago, Illinois. \"Chicago\" tells the story of two women on murderess row who hope that fame and fortune will keep them out of the gallows. Velma Kelly (Zeta-Jones) is a vaudevillian performer who plugs her sister and husband right before a performance. Roxie Hart (Zellweger) is watching the performance while idolizeing Velma and hopes one day to be on the stage just like her. Convinced that with Fred Casely's (Dominic West) help she will get what she wants.\r\n\r\nBut, when Casely turns out to be an abusive lying womanizer Roxie is angered and betrayed. Causing her to kill him as revenge, she tries to convince her husband Amos (John C. Reilly) to take the blame. However, his story does not phase the Harrison (Colm Feore) and Roxie is arrested and learns that she could face the death penalty. Roxie later meets the corrupt but nurturing jail matron Mama Morton (Queen Latifah), who gives her some helpful advice on how to win the court's appeal. Roxie later finds herself being a client of the corrupt smooth-talking Billy Flynn (Gere), who is determined to help her win her case.\r\n\r\nBilly corrupts the press with a story about how Roxie killed Fred out of self-defense. At the same time she butts heads with Velma after the press starts putting her name in the headlines. Roxie's fame is almost short-lived until she fakes a pregnancy. Now with a swelled head, she fires Billy convinced she can win the case on her own. Unfortunately, she is forced to take Billy back after seeing that another inmate will be executed. At the same time Amos starts to wonder about Roxie's \"baby.\" Convinced that it is not his baby he decides to file for divorce. The day of the trial Billy turns the court room upside down and is able to convince the jury that Roxie is innocent, Amos learns that the pregnancy was a ruse and finally leaves her.\r\n\r\nNow that Roxie is free she tries to make her dream come true, but Velma explains to her that a one woman act is not what Chicago is looking for. Roxie rejects the offer because of Velma's resentment towards her and the lack of hospitality when they were on murderess row. Velma finally convinces her that they don't have to be friends in order to be partners. Roxie's dream becomes a reality as she and Velma are now the hottest act in Chicago.\r\n\r\nBut one question remains did it really happen or is it all in Roxie's head?\r\n\r\nHighly Recommended. This movie has some of the best singing and acting I have ever seen. It deserved all six of the awards.","id":"5b8630cb92514149f30066c8","url":"https:\/\/www.themoviedb.org\/review\/5b8630cb92514149f30066c8","movie_id":1574}
{"author":"Wuchak","content":"***Offbeat crime drama\/comedy\/thriller with Robin Tunney and Tim Blake Nelson***  \r\n\r\nA young woman from San Francisco (Robin Tunney) is abused by an obsessed stalker, which leads to an inadvertent crime and she is unjustly placed under house arrest in a glorified warehouse. The deputy who monitors her ankle bracelet (Tim Blake Nelson) becomes infatuated by her. Will the real criminal be discovered and prove her innocence?\r\n\r\n“Cherish” is a quirky dramedy\/thriller with similarities to Tarantino’s “Jackie Brown” (1997), although not as good. But it ain’t bad and hardly a rip-off. Tunney looks great and has the charisma to pull-off the lead role while Blake Nelson is effective as the besotted officer. The peculiar story, the eccentric characters and the soundtrack keep you entertained. Liz Phair has a small role and is delectable.\r\n\r\nThe film runs 1 hour, 39 minutes and was shot in San Francisco\/Berkley\/Oakland. Brad Hunt and Jason Priestley are also on hand.\r\n\r\nGRADE: B","id":"5c611033925141250af9c36d","url":"https:\/\/www.themoviedb.org\/review\/5c611033925141250af9c36d","movie_id":18408}
{"author":"Gimly","content":"It was pretty.... interesting, but I can't imagine it's the sort of thing I'd ever re-visit. Strong performances are forthcoming from Sam Jackson and Toni Collette, everyone else is sort of stale. There's not a lot of movies out there like _Changing Lanes_, so it's a shame that it didn't end stronger.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole_.","id":"5b960273925141433802ce37","url":"https:\/\/www.themoviedb.org\/review\/5b960273925141433802ce37","movie_id":1537}
{"author":"Wuchak","content":"Gazillions of babes frolicking around in showgirl costumes and lingerie\r\n\t\r\nIn mid-20’s Chicago Velma Kelly (Catherine Zeta-Jones) and Roxie Hart (Renée Zellweger) find themselves on death row for murdering their lovers and fan the fame that will keep them from the gallows with the assistance of a slick lawyer (Richard Gere). John C. Reilly plays Roxie’s likable but dimwitted husband while Latifah is on hand as the avaricious prison matron.\r\n\r\nPeople criticize this amusing satirical musical for being sleazy, but it would be hard to lampoon and ridicule the corrupt targets of the media and the legal (in)justice system without showing, um, sleaze. That's the point of the original 1926 play “Chicago” and all its successive incarnations, including this acclaimed 2002 movie: illustrating and sarcastically denouncing sleaze via a droll musical. “Chicago” without sleaze would be akin to “Apocalypse Now” without war.\r\n\r\nBelieve it or not, the movie is based on real women, Beulah Annan (represented by Roxie) and Belva Gaertner (Velma), who were imprisoned for killing lovers in spring, 1924, in two unrelated incidents. The actual accounts were salacious with loads of sex & violence; and both were ultimately acquitted. Maurine Dallas Watkins wrote the original play, which was intended as a stinging satire of the lack of morals in Chicago during the roaring 20s. Watkins was, interestingly, a reporter for the Chicago Tribune who covered the popular trials and is represented by Mary Sunshine (Christine Baranski) in the film. Several of the peripheral characters are also based on real-life individuals who played a part in the unfolding drama, e.g. journalists, attorneys, officials and convicts.\r\n\r\nI’m not big on musicals beyond ones like “Moulin Rouge” (1952) and “The Wizard of Oz” (1939), but “Chicago” works for me simple due to the scores of beautiful women prancing around in scanty showgirl apparel of the 20s. It’s the same reason I love figure skating. After the passage of the 19th Amendment, American women were basking in their newfound freedoms and “Chicago” depicts this euphoric emancipation.\r\n\r\nI also appreciate “Chicago” because Gere is great and there are some creative pieces, like the puppet one and the tap-dancing part. All the musical skits are in Roxie’s imagination, except for the opening “All that Jazz” performed by Velma at the club and the climatic one, which features both Velma & Roxie.\r\n\r\nThe film runs 1 hour, 53 minutes.\r\n\r\nGRADE: B","id":"5b7c4b6e9251413b89000080","url":"https:\/\/www.themoviedb.org\/review\/5b7c4b6e9251413b89000080","movie_id":1574}
{"author":"ColinJ","content":"A thoroughly charming combination of romantic comedy and a parody of the films of producer Wong Kar Wai.\r\n\r\nFaye Wong is just luminous and Tony Leung Chiu Wai shows he has significant comedic chops.","id":"58a53d31c3a3683dad0014bb","url":"https:\/\/www.themoviedb.org\/review\/58a53d31c3a3683dad0014bb","movie_id":45379}
{"author":"Wuchak","content":"***Lacks heart, but there are highlights and the compelling last act features a nice plot turn***\r\n\r\nA vengeful Los Angeles fireman (Arnold Schwarzenegger) goes to the jungles of Colombia to apprehend a terrorist (Cliff Curtis) where he meets the man’s dissenting wife (Francesca Neri) & their son. An angry CIA agent (Elias Koteas) also travels to Colombia to join with paramilitary allies to take down the same man. When the two teams learn of a planned terrorist attack at Union Station, Washington DC, they return to the USA.  \r\n\r\n\"Collateral Damage\" (2002) is an action\/adventure originally set to be released a few weeks after 9\/11, but due to that tragedy it was set back four months wherein an anti-CIA subplot was removed, as well as a plane hijacking. What we are left with is a by-the-numbers film with a couple of highlights that perks up in the final act with an unexpected twist.\r\n\r\nThere’s a spectacular waterfall sequence shot in southeastern Mexico, which takes place near the beginning of the second act. Another highlight occurs at the end of the second act where the movie drives home the problem with military attacks and the eventual revenge of the enemies: One nation’s military attacks a paramilitary organization wherein innocent civilians are killed, which is considered “collateral damage,” and so the paramilitarists attack the nation in question with more “collateral damage.” Who’s right and who’s wrong? And where does it end?   \r\n  \r\nThe film runs 1 hour, 48 minutes, and was shot in  Los Angeles & Burbank, California; Coatepec, Veracruz, Mexico (standing in for Colombia); Union Station, Washington DC; and New York City .\r\n\r\nGRADE: C+\/B-","id":"5dfe678d65686e001892f8b1","url":"https:\/\/www.themoviedb.org\/review\/5dfe678d65686e001892f8b1","movie_id":9884}
{"author":"John Chard","content":"Don't even look at those guys unless you can kill 'em.\r\n\r\nHmm. As with all action films, especially those that feature one of the action heroes we grew up with, there will be supporters of even the most turgid of productions. Collateral Damage was the point where the truest and honest of Arnold Schwarzenegger's fans knew it was the end of an era. \r\n\r\nFamously held back from release for a year due to the 9\/11 attacks on the twin towers, the film pitches Schwarzenegger as a L.A. fireman, who after his wife and child are killed by an act of terrorism, decides to take the law into his own hands. The focus here is Colombia, and the big guy goes off to Colombia on a one man crusade to kill those responsible for his grief. Cue explosions, kinetic action, bad effects, bad dialogue, mucho posturing and hissing villains.\r\n\r\nIt works on a very basic level for fans of such fare, in fact it's nice to see Arnie playing a vulnerable role where he quite often gets hurt - both physically and mentally. It's just that it feels tired, feels too long, while it wastes a cast that includes Elias Koteas, John Turturo and John Leguizamo. Decent enough as a time waster? Yes, just, but really if this wasn't on Schwarzenegger's CV then nobody would lose any sleep over it. 5\/10","id":"555f53e69251417e4d002e29","url":"https:\/\/www.themoviedb.org\/review\/555f53e69251417e4d002e29","movie_id":9884}
{"author":"tmdb47633491","content":"Couldn't believe Charlie Kaufman was the screenwriter. It has a million things going for it but the editing and tone are a mess. Then I saw Steven Soderbergh on the crew list and all the pieces fell into place","id":"5ac9361b92514162a40476be","url":"https:\/\/www.themoviedb.org\/review\/5ac9361b92514162a40476be","movie_id":4912}
{"author":"Wuchak","content":"***Effective low-budget rendition of the second book in the popular series***\r\n\r\nAfter millions of people all over the earth mysteriously disappear, the world turns to a charismatic man to lead them, the new president of the U.N. (Gordon Currie). A small band of believers in Chicago recognize him as the Antichrist and work together as the “Tribulation Force” to save as many as they can. The group includes a renowned reporter (Kirk Cameron), a formidable pilot (Brad Johnson), his daughter (Janaya Stephens) and the pastor of their assembly (Clarence Gilyard Jr.).\r\n\r\nReleased in 2002, \"Left Behind II: Tribulation Force\" is the follow-up to “Left Behind” (2000) with the same cast, which was remade in 2014 with a bigger budget and truncated plot.  \r\n\r\nThe story is based on prophetic accounts of end-time events from the Bible. I have studied eschatology (end-times prophecies) and do advocate the pre-Tribulation \"Rapture\" based on scriptures like 1 Thessalonians 4:13-18 and Luke 17:24,34-35. Of course the Left Behind series is a fictional story and you don't have to believe in the Bible whatsoever to enjoy the movie for what it is, a \"What if the Rapture really happened\" mystery\/drama\/thriller. I don't believe in powerful androids that time-travel from the future, but that doesn't prevent me from enjoying the Terminator flicks.\r\n\r\nThis sequel cost a little less than the 2000 film ($3.8 million) and is less busy story-wise. It has the confidence to take its time with convincing acting in challenging roles. I read the book and wondered how it could be made into a compelling movie because it’s more dramatic than the first one; in other words, there’s far less thrills until the last act, not to mention a considerable romantic subplot. The screenwriters did a great job of cutting out the fat and strategically adding some well-done evangelical bits, which aren’t overdone. The apocalyptic ending of the book was obviously omitted because it would’ve added 20-30 minutes to the runtime and would’ve cost significantly more. The filmmakers did a good job of finding the right place to close.    \r\n\r\nBeing shot in Toronto, I was wondering how they would pull off the Jerusalem sequences at the end, but they did a splendid job with the studio sets, particularly considering this is a low-budget flick.\r\n\r\nThe film runs 1 hour, 34 minutes. ADDITIONAL CAST includes Krista Bridges as the journalist’s assistant and Chelsea Noble (Cameron’s wife) as a flight attendant working for the Antichrist. \r\n\r\nGRADE: B","id":"5dcd9517b76cbb001674bb64","url":"https:\/\/www.themoviedb.org\/review\/5dcd9517b76cbb001674bb64","movie_id":29229}
{"author":"TopKek","content":"This was an entertaining and fun piece of film making from the ever-reliable Steven Spielberg. It is a bit of a depart from his usual full-blown and hugely epic pictures, yet this does not detract at all from the fascinating story of Frank Abagnale Jr. I was interested in this man before I'd seen the movie, and it only served to increase my interest. Although it is important to remember (as with any such film) that this is only 'inspired' by a true story and not told word for word from one, the plot is fascinating and keeps you laughing, crying and wondering until the end.\r\n\r\nFrank Abagnale Jr. is an astounding and interesting character. The real life Abagnale originally said that he did not believe DiCaprio to be 'suave' enough to play the role, but he certainly does pull it off. DiCaprio's acting is superb, and totally believable as a man who could lie to, deceive, and con everyone he met without once losing any of his charisma or charm. Hanks is also excellent, he plays the role of the obsessed FBI agent well, and also with a likable quality. The interaction between these two characters was great, it was interesting to see a budding relationship slowly build between two characters who were actually positioned against one another.\r\n\r\nI loved the look of the film. It was a refreshing blast to see the 60s portrayed in such a vivid and colorful way. The whole setting and atmosphere of the film gave it a wonderful and almost (I hesitate to use the word) 'magical' sense. This tone appealed to me much more than a darker tone might have.\r\n\r\nHowever, the film is rife with moral ambiguity. As much fun as it is to watch DiCaprio jumping from one place (and identity) to the next, forging checks and spending inordinate amounts of money at a whim, the film never really focuses on the morally bankrupt side of the story. The portion of the film devoted to this at the end still seems to skim over the fact that this man has stolen millions of dollars. It ends on a high note for Frank Abagnale Jr., never fully spelling out the wrongs he committed. Still, this would probably bring the whole film down, and sometimes it's fun just to enjoy a bit of escapism without being told off for desiring such things. I mean, it's hard to be totally strict and upright - you have to love it when DiCaprio's character swindles Jennifer Garner's prostitute for $400!\r\n\r\nOverall, this is a fun film and really enjoyable. Not as much of an epic masterpiece as some of Spielberg's other movies, but still a great film!","id":"5800ad579251414014004202","url":"https:\/\/www.themoviedb.org\/review\/5800ad579251414014004202","movie_id":640}
{"author":"AnAwe","content":"I managed to live so far without seeing this wonderful kickback from 90s style film. Felt like Christmas! Lovely humor, quirky overgrown outfits, VHS quality AND sexy <a href=\"https:\/\/ilarge.lisimg.com\/image\/2016812\/800full-interstate-60-screenshot.jpg\">Amy Smart<\/a> :D Good for couples - has fantasy\/sci-fi elements and romantic side for gentle gender :)","id":"5e3ed8e6ae36680019cb7519","url":"https:\/\/www.themoviedb.org\/review\/5e3ed8e6ae36680019cb7519","movie_id":20312}
{"author":"Wuchak","content":"Odd and insightful road movie fantasy with James Marsden, Gary Oldman and Christopher Lloyd\r\n\r\n“Interstate 60:Episodes from the Road” involves a confused college man, Neal Oliver (James Marsden), who wants to be an artist while his father pressures him to go to law school. He desperately wants answers and O.W. Grant (Gary Oldman) magically grants him his wish. Neal ends up on the non-existent I-60 traveling to the non-existent city of Danver where he hopes to meet his dream girl (Amy Smart). Along the way he meets many interesting people and learns several valuable lessons. Christopher Lloyd is also on hand along with glorified cameos by various notable actors (e.g. Michael J. Fox, Kurt Russell and Ann-Margret).\r\n\r\nThe plot starts out a little tortuous, but it morphs into a road movie before too long, broken up into several quirky segments, which is why the flick is subtitled “Episodes from the Road.” Critics deride the picture on the grounds that the messages are clunky, moralistically naive, and preachy. But it’s unique and intelligent with quality reflections about life, which are made simple so “stupid people” or teens can grasp them. In short, this is a fairly entertaining oddball road fantasy that’s distinctive and insightful.\r\n\r\nIf you like films like \"Michael\" (1996), \"City of Angels\" (1998), \"Holy Man\" (1998), \"Bruce Almighty\" (2003) and “Evan Almighty” (2007), “Highway 60” (2002) is cut from the same thematic cloth, except that the supernatural being is a magical Irishman.\r\n\r\nThe movie runs 1 hour, 56 minutes and was shot in Ontario (Sunderland, Cannington and Toronto) and Arizona (Phoenix).\r\n\r\nGRADE: B","id":"5bb27e300e0a2633b40209d0","url":"https:\/\/www.themoviedb.org\/review\/5bb27e300e0a2633b40209d0","movie_id":20312}
{"author":"Gimly","content":"Captures some human sentiment incredibly well, coupled with the unique setting and great acting, this makes Insomnia a good watch, worth every minute of its two hour runtime.\r\n\r\nThat said, I was not as enamoured by it as others might be. Perhaps if was unaware of what Nolan, Pacino or Williams are capable of at their highest levels, or if I didn't realise five minutes before the end that I'd actually seen it as a kid and could exclusively remember the ending, then it would have had a higher impact on me.\r\n\r\nBut even taken for me as is, _Insomnia_ is still a very solid bit of filmmaking.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","id":"59318630925141527300c97c","url":"https:\/\/www.themoviedb.org\/review\/59318630925141527300c97c","movie_id":320}
{"author":"John Chard","content":"A good cop can't sleep because he's missing a piece  of the puzzle. And a bad cop cant sleep because his conscience wont let him.\r\n\r\nInsomnia is directed by Christopher Nolan and written by Erik Skjoldbjærg and Nikolaj Frobenius (1997 screenplay). It stars Al Pacino, Robin Williams, Hilary Swank, Maura Tierney, Martin Donovan and Nicky Katt. Music is scored by David Julyan and cinematography by Wally Pfister. It's a remake of a 1997 Norwegian film of the same name.\r\n\r\nLAPD detective Will Dormer (Pacino) and his partner Hap Eckhart (Donovan) travel to the remote Alaskan town of Nightmute to aid the local cops investigating the savage murder of a teenage girl. But Dormer leaves behind an Internal Affairs Investigation that gnaws away at him, and when a potential bust of the murder suspect goes tragically wrong, his conscious gets attacked on two fronts. By lack of sleep and by the killer himself.\r\n\r\nIt's a House of Cards.\r\n\r\nViewing from afar it's easy to be cynical and suggest that Insomnia is just an American remake cash in. Bigger budget, bigger stars and directed by an indie darling of the critics moving into the big league. While on the surface the plot looks to be another in a long line of cops and villains thrillers where procedural unfolds and evil is ultimately brought down at the end. Yet Insomnia is so much more than that, it's a deep movie dealing in complex psychological issues, a blanc-noir of some character substance, a picture clinically put together around one mans descent into a private hell, with the beautiful Alaskan backdrop perversely claustrophobic and Anthony Mann like in being at one with Will Dormer's fragmented state of mind.\r\n\r\nKilling changes you. You know that.\r\n\r\nFrom the opening moments as we observe a biplane flying over the Alaskan glaciers, accompanied by David Julyan's nerve tingling score, there's a looming air of disquiet. Nolan knows his noir onions, mood is everything and the dense psychological atmosphere is never once breached for the entire movie. Much of the picture is dialogue heavy, gratifyingly so, with the hushed conversations between Pacino and Williams begging the viewer to hang on every word as cop and killer (no spoiler, it's revealed to us early as a necessity) jostle for control of each others soul. What action there is also comes with a side order of otherworldly delights, a chase across floating logs and a stalk through eerie fog being the two particular highlights.\r\n\r\nSleep comes at a cost.\r\n\r\nWith three Oscar winners in the cast Nolan had some serious quality to direct, that Pacino, Williams and Swank deliver excellence is high praise for the British director. Pacino actually gives one of his finest late career performances, utterly compelling as Dormer, his haggard face tells of a thousand sorrows, his sleep deprived gait befits a man staring into the abyss. Wally Pfister's photography is on the money, the blend of snow whites and green tinges sparkle from the vistas and the soft brown hues inside the hotel provide the rare moments of tranquillity available to Will Dormer. Across the board Insomnia is a cracker of a movie, a film that goes into the murky depths of the genre to reveal one of the best movies of 2002. 9\/10","id":"5ce3af4a0e0a262573ca2f33","url":"https:\/\/www.themoviedb.org\/review\/5ce3af4a0e0a262573ca2f33","movie_id":320}
{"author":"talisencrw","content":"Definitely not Nolan's best but probably my favourite (at least tied with 'Batman Begins') because I love the Norwegian original so much AND the subtle changes Nolan made with it, as well as what the three stars (Al Pacino, Robin Williams--in his first villainous role, I believe, and Hilary Swank--in probably my favourite performance of hers, next to the downright decadence and naughtiness she displayed in 'The Black Dahlia') bring to the table here. I greatly enjoyed the five short extras on my DVD (a double-sided disc I bought years ago that has 'The Devil's Advocate' on the other side, yet unwatched): a conversation\/interview of Nolan with Pacino; 'Day for Night: The Making of...'; 'In the Fog' (which interviewed cinematographer Wally Pfister); Nathan Crowley: production designer; and 'Eyes Wide Open' (which interviewed sleep disturbance experts), which thankfully I viewed before I watched the movie, to enhance my experience.\r\n\r\nGreatly recommended to fans of contemporary crime thrillers, regardless of whether you watched the Norwegian original or not. There are enough differences to still make it worth your while as a cinephile.","id":"573a4d039251417ad50007ab","url":"https:\/\/www.themoviedb.org\/review\/573a4d039251417ad50007ab","movie_id":320}
{"author":"joelbaby","content":"Classic Australian comedy. Selfish guy joins the bowling club just to take advantage of the free parking. Almost as good as The Castle.","id":"51d8219d19c295165c19a65c","url":"https:\/\/www.themoviedb.org\/review\/51d8219d19c295165c19a65c","movie_id":14672}
{"author":"Wuchak","content":"***Survival in the swamp creature feature***\r\n\r\nA nasty group of American bank robbers board a plane to Acapulco, but the craft crashes in a huge swamp. While the thugs and several captives try to make it back to civilization they are stalked by a large legendary crocagator that dwells in the bog. Meanwhile, the beau of one of the flight attendants hires a bush pilot to search for any survivors.\r\n\r\n“Crocodile 2: Death Swamp” (2002) may be a Grade B creature feature, but it’s surprisingly ambitious. The survival-in-the-swamp angle is refreshing and there’s an adventurous air. The criminals are really wicked and the desperate situation just makes ‘em worse. Although the budget is lower, it’s comparable to “Anaconda” (1997) and “Anacondas: Hunt for the Blood Orchid” (2004). It’s technically not as good as either of those, but it’s not far off. The main weakness is the sometimes weak CGI for the creature.\r\n\r\nUnfortunately, the better of the two women is gone by the halfway point (Anna Cranage as Julie). But Heidi Lenhart (as Mia) is a’right, I guess.\r\n\r\nThe film runs 1 hour, 20 minutes and was shot in India, with studio work done in Hyderabad.\r\n\r\nGRADE: B-","id":"5c20cd979251414c16c064d7","url":"https:\/\/www.themoviedb.org\/review\/5c20cd979251414c16c064d7","movie_id":39862}
{"author":"Rocketeer Raccoon","content":"It was a long time ago since I saw this and all I remember was how bored out of my mind I was having to watch this film in the cinema along with a cousin of mine who is a girl. For what I can recall as I vaguely remember it, the story was all over the place, actually it was more like a film about \"nothing\". You got these 3 friends (Britney included) going on a road trip together (I know I'm just reading off from the plot lines here) and then they come across this guy who is your typical handsome guy at which point is where the film becomes a load of nonsense with nothing interesting happening, this is where the film pretty much gives up trying to be a movie and goes into soap opera territory but is worse.\r\n\r\nWhat I actually find most baffling is that this film is supposed to be a \"romantic comedy\" film yet there was nothing in this film that was remotely funny. And Britney Spears thought she could have a good crack at movie acting, huh, I don't think so.\r\n\r\nAlthough I don't remember everything from the film since it was years ago since I last saw the film, but then again why would you want to remember an awful movie like this? Really bad movies such as this are best left buried away from the mind to be made forgotten forever.","id":"58ba047b925141606b0105c2","url":"https:\/\/www.themoviedb.org\/review\/58ba047b925141606b0105c2","movie_id":17130}
{"author":"John Chard","content":"You're real good at kicking them when they're down, aren't you?\r\n\r\nSly Stallone stars as an FBI Agent who turns to drink when the love of his life becomes the victim of a crazed serial killer who has been targeting cops for death. So struck by the tragedy, he is coerced into signing up for a rehab programme at a remote asylum facility, but soon it becomes clear that the serial killer is still in his midst.\r\n\r\nFamously delayed from being released for quite some time, D-Tox is like an itch on Stallone's CV that he will never be able to scratch. In truth it's quite serviceable as a formulaic thriller, but it's so derivative and, yes, dumb, it's hard to recommend with any sort of confidence.\r\n\r\nAny number of thriller films you have probably seen will spring to mind when viewing this, but in short it's like a \"10 Little Indians\" meets \"The Thing\", with a side order of \"Seven\" thrown in for good measure. The first half is actually well built by the makers, establishing Stallone's emotional chaos, his dive into the bottle, and then setting him up in an institution that is frighteningly monolithic in a grey and steely way. His co-patients are all troubled coppers in search of a dry run, and this also sets things up neatly for some rich characterisations, unfortunately it all descends into cliché hell and wastes what is a rather superb cast - while Stallone unfortunately shifts from a believable tortured soul into a muscle head with a gun. Cest la vie!\r\n\r\nGood moody atmosphere and some heart jolting deaths keeps the pic on the boil, but ultimately the pandering of the norm renders a promising thriller to being distinctly average. 5\/10","id":"55abf36cc3a3682d6300522b","url":"https:\/\/www.themoviedb.org\/review\/55abf36cc3a3682d6300522b","movie_id":10375}
{"author":"Gimly","content":"McTiernen takes a nearly Experimental Filmmaking approach to this _Rollerball_ remake. I mean, it totally doesn't work, but at least it's weird-dumb instead of regular-dumb. Weird-dumb enough to feature a live performance by Slipknot as a lynchpin of the movie.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5916940392514156f502adca","url":"https:\/\/www.themoviedb.org\/review\/5916940392514156f502adca","movie_id":11535}
{"author":"John Chard","content":"It started off as rioting. But right from the beginning you knew this was different...\r\n\r\n28 Days Later is directed by Danny Boyle and written by Alex Garland. It stars Cillian Murphy, Naomie Harris, Megan Burns, Brendan Gleeson and Christopher Ecclestone. Music is by John Murphy and cinematography by Anthony Dod Mantle.\r\n\r\nWhen animal liberation activists break into the Cambridge Primate Research Center, they come across a scientist who tells them that to release these chimps would be insane. They have been injected with a test serum known as \"Rage\", and it's highly contagious and spreads easily and quickly. Ignoring the warnings, one of the activists opens a cage and is attacked and bitten by a chimp and rage quickly spreads among the group...\r\n\r\n28 days later... \r\n\r\nThe amazing thing with Danny Boyles's 28 Days later is that although it owes a huge debt to the likes of George Romero's zombie films, and John Wyndham and Richard Matheson's writings, it still feels fresh and exciting. Film is quintessentially British, as evidenced by the rightly lauded use of a depopulated London for the starting point to the terror, yet there's an earthiness to our small band of survivors. These are flawed characters that are ill equipped to deal with the infected implosion, there's nothing remotely Hollywood about these people or the landscapes that frame them (CG is minimal, where hand-held digital cameras are the order of the day). \r\n\r\nThere's a realistic feel factor that is rarely seen in other films of this ilk. Yep, sure there's implausibilities, but with the infected creatures running at a fair old clip, becoming scary creations in a stark stripped back land, there's too much fun being had - and nervous tension being burnt - to even begin to start nit-picking. Besides, the last quarter alone is a lesson in energy fuelled horror as the survivors, having seemingly found a safe house, find that monsters aren't merely confined to the infected human kind. It's a cracker-jack of a finale, bloody and bloody frantic, all backed by Murphy's simple but totally potent musical arrangements.\r\n\r\nIt's easy to see why America made it a monster hit at the box office, after just making a small profit in the UK, film went to America and made it big. Americans, you have to feel, enjoyed watching something raw in a sub-genre of horror that was at the time reliant on Romero rediscovering his mojo. Worldwide the film made over $70 million in profit, and those are the kinds of figures that speak volumes. The success ensured a sequel would follow, where Boyle and Garland bowed out of the main chairs and into producers roles for \"28 Weeks Later\". It's not as raw as \"Days\", but it's gorier and itself also a fine \"infected\" horror movie, and certainly a worthy follow up to what Boyle and Garland clinically created in 2002.\r\n\r\nA great cast and premise get down and dirty In a sharply executed infected based horror. 8.5\/10","id":"5d9271990f5265001ac3baaa","url":"https:\/\/www.themoviedb.org\/review\/5d9271990f5265001ac3baaa","movie_id":170}
{"author":"Gimly","content":"_28 Days Later_ was made on a very small budget in the early days of digital cinema, so, yes, in retrospect, it does look a little bit like it was shot on a Nokia 3310, and yes, it is heavily responsible for the bilious deluge of zombie movies we got in its wake, which we are only now finally recovering from - but it's so **good**. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5e06ebad11386c0014caa337","url":"https:\/\/www.themoviedb.org\/review\/5e06ebad11386c0014caa337","movie_id":170}
{"author":"perelachaise","content":"**mild abstract spoiler ahead**\r\n\r\nMy feelings about this movie may very well be extended towards Boyle's movies in general : solid direction overall, but events did not fail to go from situational and behavioral realism to sudden heroical action nonsense.","id":"59393624c3a368783f00f92a","url":"https:\/\/www.themoviedb.org\/review\/59393624c3a368783f00f92a","movie_id":170}
{"author":"CRCulver","content":"<i>Ten Minutes Older<\/i> “The Trumpet” is a compilation of seven ten-minute films by various noted directors that all deal with the passing of time. This is one of such two 2002 projects produced by Nicholas McClintock, the other is subtitled \"The Cello\".\r\n\r\nIn Aki Kaurismäki's \"Dogs Have No Hell\", Markku Peltola is released from jail and has ten minutes to convince Kati Outinen to marry him and board a train to Siberia. There's little explanation of who these people are, why Peltola was in jail or why they must go to Siberia, but the film does compress the Finnish director's style into a short span with its deadpan humour, stony facial expressions and even a performance by a morose rock band.\r\n\r\nAs Víctor Erice's \"Lifeline\" begins, a baby's swaddling clothes are stained with blood because of a rupture. The film tracks the suspenseful minutes between the accident and the time that the large household discovers it and saves the child. The film is set in a Spanish village in 1940 and the silence (there's only a couple of lines of dialogue at the end) and clockwork-like buzz of rural life (reaping grain, sewing with a machine) make a real impression over the other films here.\r\n\r\nThe main character of Jim Jarmusch's \"Int. Trailer Night\" is an actress (Chloe Sevigny) on a ten-minute break in her trailer while shooting a film. Though these ten minutes are all the time she gets to herself the whole day, her break is constantly interrupted by costume and mic checks and ultimately her dinner is delivered too late for her to eat it. Jarmusch is apparently showing us that a star's life is not an easy one, though considering the enormous salaries that these professionals command, it's hard to really sympathize.\r\n\r\nWim Wender's \"Ten Minutes to Trona\" depicts an American businessman's desperate attempt to reach a hospital after unknowingly ingesting a plate of cookies dosed with some kind of hallucinogen. As he speeds down a desert road, various camera effects represent his warped perceptions, which range from horrible visions to moments of idyllic beauty. There's such a realism to this that one wonders if it is based on a personal experience by Wenders.\r\n\r\nWerner Herzog and Spike Lee chose to make short documentaries. Herzog's \"Ten Thousand Years Older\" visits a Amazonian tribe that had been contacted by the outside world in 1981 (thus being pulled millennia into the future in the blink of an eye). The first portion of the film consists of footage from the 1981 contact. In the years since, much of the tribe had been decimated by diseases to which they had no resistance, but Herzog captures an interview with two of the men two decades on.\r\n\r\nSpike Lee's contribution \"We Wuz Robbed\" deals with the 2000 presidential election and Al Gore's loss to George Bush in Florida. Lee interviews Democrat strategists about the agonizing wait for the figures to come in. As outraged as I was at the outcome of this election, I find this film to have little to no redeeming value and regularly skip it on rewatchings.\r\n\r\nFinally, Chen Kaige's \"100 Flowers Hidden Deep\" deals with the Chinese state's destruction of Beijing's traditional neighbourhoods in order to build skyscapers. A middle-aged Beijing man asks a removals team to help him take his things from his old home to his newly built highrise. When they arrive, they find only a vacant lot and it turns out the local man is quite mad. Through a computer-graphics overlay, Chen shows us what lovely buildings and streets were in this empty plot of land before the authorities demolished it all.\r\n\r\nIn spite of the talent enlisted for this project, the films here are generally not very deep. I would say that only the Herzog, Erice and Chen films are memorable, but it's hard to be enthusiastic even about these. I think it would appeal mainly to completists of one or more of the directors represented here, but it's hard to recommend it to more casual fans.","id":"5b938becc3a3685679005c16","url":"https:\/\/www.themoviedb.org\/review\/5b938becc3a3685679005c16","movie_id":23676}
{"author":"John Chard","content":"The worst kind of Teddy Bear.\r\n\r\nTricky. As always with serial killer films, you hope that the subject is handled in such a way so as to justify you having invested time in it. Matthew Bright’s instalment into the hall of shame legacy left by one Theodore Robert Bundy, is uncompromising and unforgettable. Could the charge of exploitation be levelled at Bright and his backers? No, I don’t think so.\r\n\r\nThe advent of time where film is concerned has seen film makers now be able to tackle difficult subjects for maximum impact. Bright, in the main, follows the real life of Bundy and his vile crimes. His home life and trail of destruction are covered graphically, so if anyone was in any doubt about the measure of Bundy’s evil via previous film, TV or literary interpretations? Then this is the gaping wound of Bundy tellings, with salt poured in.\r\n\r\nIt’s nigh on impossible to recommend as an essential viewing experience, I myself haven’t been able to get some of the images out of my head some 5 days after watching it. But that’s the point, surely? Some minor fabrications aside (we cheer the events just prior to the electrocution, but it didn’t happen), this is one of the best films of the bloody sub-genre of horror it sits in. For impact and Michael Reilly Burke’s bold and scary performance as Bundy, it has artistic merit. If you have the stomach for it that is. 8\/10","id":"547bb927c3a3685aed001267","url":"https:\/\/www.themoviedb.org\/review\/547bb927c3a3685aed001267","movie_id":34081}
{"author":"MichaelWilliams","content":"Was, still is, and will forever be one of my favorite childhood superhero movies!","id":"5e0102b665686e001597959a","url":"https:\/\/www.themoviedb.org\/review\/5e0102b665686e001597959a","movie_id":557}
{"author":"LarryAdams","content":"The greatest part about this is Toby Maguire's acting. He made everything so much more believable that it was hard not to be engrossed in the movie.","id":"5e0e47c568b1ea00157fd463","url":"https:\/\/www.themoviedb.org\/review\/5e0e47c568b1ea00157fd463","movie_id":557}
{"author":"JosephWilson","content":"Man, that scene with Uncle Ben broke my heart big time! Made me even think of my life choices.","id":"5e090413d236e60012a26d71","url":"https:\/\/www.themoviedb.org\/review\/5e090413d236e60012a26d71","movie_id":557}
{"author":"JosephWilson","content":"I've read the comics and I can say that this is truly the comic book come to life!","id":"5e09051bfea0d70016bb5d7b","url":"https:\/\/www.themoviedb.org\/review\/5e09051bfea0d70016bb5d7b","movie_id":557}
{"author":"Justin Lopez","content":"So many Spiderman movies out there but this will always be the original. Though the other ones have better CGI and maybe action sequences, none can match the plot this one has.","id":"5dc3308b470ead00158c8738","url":"https:\/\/www.themoviedb.org\/review\/5dc3308b470ead00158c8738","movie_id":557}
{"author":"DavidBrown1","content":"Definitely made the list of greatest comic book adaptations.","id":"5e0286889bcd0f001706ffb0","url":"https:\/\/www.themoviedb.org\/review\/5e0286889bcd0f001706ffb0","movie_id":557}
{"author":"WilliamJones","content":"Lot of respect for Tobey Maguire for doing well on this one. He didn't do well in his previous films but he was able to do justice to Spider Man on this one.","id":"5e011b890284200014af8973","url":"https:\/\/www.themoviedb.org\/review\/5e011b890284200014af8973","movie_id":557}
{"author":"SamuelSanchez","content":"I can't think of any reason why anyone would not fall in love with this film. Maybe they just have a bad attitude.","id":"5e12ce2dd64ac200146501de","url":"https:\/\/www.themoviedb.org\/review\/5e12ce2dd64ac200146501de","movie_id":557}
{"author":"BrandonEvans","content":"Normally I don't enjoy comic book adaptations, but this is one of the very few exceptions.","id":"5e12c61cd64ac2001464f89d","url":"https:\/\/www.themoviedb.org\/review\/5e12c61cd64ac2001464f89d","movie_id":557}
{"author":"JustinCampbell","content":"It has everything I expected for in a superhero film and more!","id":"5e0e52fd68b1ea00187f9dcc","url":"https:\/\/www.themoviedb.org\/review\/5e0e52fd68b1ea00187f9dcc","movie_id":557}
{"author":"MarkMartin","content":"Making superhero films is tricky in the sense that you have to have that balance of fight scenes to make it enjoyable and enough character back story to really give that character some depth.","id":"5e20d6a920af7700143764b9","url":"https:\/\/www.themoviedb.org\/review\/5e20d6a920af7700143764b9","movie_id":557}
{"author":"tmdb44006625","content":"Sam Raimi's Spider-Man captures the spirit of the comic book hero and it's still one of my all time favourite superhero movies. It lays out the perfect blueprint for a superhero origin story that I love revisiting every year or so. I've always been able to relate to Peter Parker growing up. Tobey Maguire and Co. delivered a great interpretation of the characters in a way that still can not be matched.","id":"5c8429f592514127691f8310","url":"https:\/\/www.themoviedb.org\/review\/5c8429f592514127691f8310","movie_id":557}
{"author":"MatthewJackson","content":"Sam Raimi is the true mvp on this one. He paid so much attention to even the little details on this move and because of that, we are all richly rewarded.","id":"5e12195cd64ac20018645d47","url":"https:\/\/www.themoviedb.org\/review\/5e12195cd64ac20018645d47","movie_id":557}
{"author":"JessieCollins","content":"You can take your Tom Holland and Andrew Garfield with you. Tobey Maguire is the best Spider-Man of all time and no amount of CGI can change that!","id":"5dc56f5a99259c00157e4640","url":"https:\/\/www.themoviedb.org\/review\/5dc56f5a99259c00157e4640","movie_id":557}
{"author":"LoganWright","content":"This is one of the few films that you can watch when you're bored and still be excited about what's going to happen (even though you've watched it over and over already and you've memorized almost all of the lines).","id":"5dc38a688d22fc00183d1510","url":"https:\/\/www.themoviedb.org\/review\/5dc38a688d22fc00183d1510","movie_id":557}
{"author":"Jane Hall","content":"Films from the 2000s really are way different from the ones we have now. I wish all origin stories could be as good as this one.","id":"5dc3999b7d2bc100173d1175","url":"https:\/\/www.themoviedb.org\/review\/5dc3999b7d2bc100173d1175","movie_id":557}
{"author":"DonaldHarris","content":"No other superhero origin film can match the story, the writing, and the soul this one has.","id":"5e12659a9020120018b696c4","url":"https:\/\/www.themoviedb.org\/review\/5e12659a9020120018b696c4","movie_id":557}
{"author":"John Smith","content":"It's 2019 and I still get chills every time I watch this film!","id":"5dc57a4099259c00137db72b","url":"https:\/\/www.themoviedb.org\/review\/5dc57a4099259c00137db72b","movie_id":557}
{"author":"Wuchak","content":"Cinematic chronicling of the Richard Speck nursing dorm murders\r\n\r\nRELEASED IN 2002 and directed by Keith Walley, “Speck” stars Doug Cole as the real-life mass murderer, Richard Speck, who savagely terrorized nine nursing students at a townhouse functioning as a dormitory in south Chicago, 1966. He murdered eight of them one-by-one. The ninth woman (Beverly Sotelo) only managed to survive by hiding under a bed while Speck was out of the room. In his drug-addled state the killer probably lost count. The woman’s witness was key in capturing the man with the crude forearm tattoo that read: “Born to raise hell.”\r\n\r\nThe topic is distasteful, to say the least, but the movie effectively chronicles the events of late night July 13, 1966. Although this is a low-budget independent flick, it’s competently made with quality actors. The score is one-note disturbing and haunting while the tone is dream-like, thoroughly austere and horrific. The murderer’s narration throughout by Cole is akin to Willard’s narration in “Apocalypse Now” (1979). It’s based on the real-life Speck’s blatherings combined with that of other renown murderers as well (e.g. Dahmer) and no doubt the writers' imagination. Regardless, the well-written sociopathic verbiage successfully puts you in the mind of the slayer and doesn’t cop-out in regards to psychological scrutiny. In short, the narration boldly unveils the awful truth and is expertly delivered by Cole; the movie should be commended for this.\r\n\r\nThe only thing that holds “Speck” back is the one-dimensional story itself. The first hour is comprised of the thug’s invasion of the townhouse, his terrorizing of the girls and their systematic murders. The compelling final act records the aftermath and ultimate apprehension. It’s all thoroughly convincing, but not entertaining in the manner of, say, the Friday the 13th flicks, probably because the producers intended “Speck” to be a wholly realistic account of the true murders; and it is. The Friday the 13th movies are sometimes fun and the murders can even be amusing; not so here.\r\n\r\nSpeck was finally electrocuted to death 25 years after his crime in 1991 (WAY too long of a wait for justice). Concerning his murderous transgressions, he said: “I had no feelings at all that night. They said there was blood all over the place. I can't remember. It felt like nothing ... I'm sorry as hell; for those girls and for their families, and for me. If I had to do it over again, it would be a simple house burglary.\" He was a thoroughly sick bastage who unfortunately descended into depravity in prison, a sad waste of human potential, but at least he honestly admitted that he was sorry for what he did.\r\n\r\nTHE MOVIE RUNS 79 minutes. The script was written by Don Adams & Aaron Pope.\r\n\r\nGRADE: B\/B- (6.5\/10)","id":"5b2bdd0092514164ce007762","url":"https:\/\/www.themoviedb.org\/review\/5b2bdd0092514164ce007762","movie_id":267441}
{"author":"JeffreyYoung","content":"It's not a surprise that this is considered one of the most successful superhero movies ever made.","id":"5e0e0cbefd4f8000155f3f44","url":"https:\/\/www.themoviedb.org\/review\/5e0e0cbefd4f8000155f3f44","movie_id":557}
{"author":"1RobertJohnson1","content":"Truly one of the most successful superheroes ever made!","id":"5e00ef0765686e0013988081","url":"https:\/\/www.themoviedb.org\/review\/5e00ef0765686e0013988081","movie_id":557}
{"author":"StephenScott","content":"Sam Raimi sure knows how to make a good superhero film. He was able to give so much depth to Spider-Man, a hero we only know from comic books.","id":"5e0e2b8a6dc6c000184d2a0e","url":"https:\/\/www.themoviedb.org\/review\/5e0e2b8a6dc6c000184d2a0e","movie_id":557}
{"author":"ThomasMoore","content":"This film is one of the reasons why 2002 was a great time to be alive!","id":"5e09beb8d35dea001120edc1","url":"https:\/\/www.themoviedb.org\/review\/5e09beb8d35dea001120edc1","movie_id":557}
{"author":"AnthonyWhite","content":"I just wish studios would start making great films such as this one again. Today it's just all about hype but no substance.","id":"5e124b42fc5f0600198f808c","url":"https:\/\/www.themoviedb.org\/review\/5e124b42fc5f0600198f808c","movie_id":557}
{"author":"ChristopherAndersen","content":"Tobey Maguire was made for this role. Gonna be hard for me to shake the image of Spider-Man when I see him on other films from now on.","id":"5e0f3dfc663b8700137efcc3","url":"https:\/\/www.themoviedb.org\/review\/5e0f3dfc663b8700137efcc3","movie_id":557}
{"author":"PaulThompson","content":"It may not have the best CGI effects, but for sure everything else - the plot, the script, and the acting - is on the same level as other great superhero films like Batman and Superman.","id":"5e20e027397df00012966999","url":"https:\/\/www.themoviedb.org\/review\/5e20e027397df00012966999","movie_id":557}
{"author":"NicholasLopez","content":"To sum it up, this is the first Spider-Man film with everything leveled up.","id":"5e0e211ac2f44b00172fa127","url":"https:\/\/www.themoviedb.org\/review\/5e0e211ac2f44b00172fa127","movie_id":557}
{"author":"CharlesTaylor","content":"Movie was very engrossing. All thanks to Tobey Maguire for delivering such a believable performance.","id":"5e0f0bb35907de0012d752cb","url":"https:\/\/www.themoviedb.org\/review\/5e0f0bb35907de0012d752cb","movie_id":557}
{"author":"BradleyStewart","content":"I keep telling people that this is the real Spider-Man and I will always stand by that. Tobey Maguire the real MVP!","id":"5dc393ac9d89390015350524","url":"https:\/\/www.themoviedb.org\/review\/5dc393ac9d89390015350524","movie_id":557}
{"author":"JacobKing1","content":"It's amazing how they were able to balance action and human element in this movie.","id":"5e0e16d3c2f44b00132fc6d0","url":"https:\/\/www.themoviedb.org\/review\/5e0e16d3c2f44b00132fc6d0","movie_id":557}
{"author":"richardmiller","content":"You know a film is good when you're able to quote something from it. \"With great power, comes great responsibility\"","id":"5e09237aeda4b70012305fe4","url":"https:\/\/www.themoviedb.org\/review\/5e09237aeda4b70012305fe4","movie_id":557}
{"author":"BenjaminCollins","content":"A comic-book adaptation that won't disappoint like Superman and Batman!","id":"5e12ca30fc5f0600179086b5","url":"https:\/\/www.themoviedb.org\/review\/5e12ca30fc5f0600179086b5","movie_id":557}
{"author":"DanielThomas","content":"When you realize it was only 2002 when this movie came out and even with that, this movie can be considered up to par with the movies of today, you realize that it's definitely one of the classics.","id":"5e107cf7663b87001581855e","url":"https:\/\/www.themoviedb.org\/review\/5e107cf7663b87001581855e","movie_id":557}
{"author":"RaymondMorris","content":"A great blend of action, adventure, humor, emotion, thrills and fiction - things you won't expect in a superhero film.","id":"5e12d29e8741c400123daef5","url":"https:\/\/www.themoviedb.org\/review\/5e12d29e8741c400123daef5","movie_id":557}
{"author":"Gimly","content":"_Slackers_ may very well be the best version of this exact idea (one that I've seen explored **multiple** times) but that's more a knock against the others than praise for _Slackers_.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._","id":"5bb854890e0a2634ef0061cf","url":"https:\/\/www.themoviedb.org\/review\/5bb854890e0a2634ef0061cf","movie_id":20009}
{"author":"Wuchak","content":"Dominance and submission at the office (um... no)\r\n\r\nRELEASED IN 2002 and directed by Steven Shainberg, \"Secretary\" is a romantic dramedy about a young woman (Maggie Gyllenhaal) who spent some time at a mental hospital for self-harm (e.g. cutting). She apprehends a job as a secretary to a quirky, arduous lawyer (James Spader) wherein their employer-employee bond turns increasingly sexual in a dominant\/submissive way.\r\n\r\nThis is the first mainline film in America to breach the difficult topic of BDSM, walking the balance beam between being either too amusing or too offensive. For those not in the know, BDSM is an overlap of acronyms: BD stands for Bondage and Discipline; DS for Dominance and Submission; and SM for Sadism and Masochism. I didn’t really know the movie tackled BDSM before viewing it; I thought it was simply a romance-in-the-office type flick with maybe some kinky elements. \r\n\r\nThe movie is polarizing, unsurprisingly. I read a few reviews by respectable critics and one was fascinated by it, giving it an incredible 10\/10 Stars (Why Sure!), while another wrote it off as a film for sick people, granting it 1\/10 Stars. Whilst I find the romance-at-the-office element interesting, I could care less about the BDSM angle. Regardless, the first half is amusing enough and Maggie is a winsome treat, but the second half gets a little too deviant and borders on porn. \r\n\r\nYet the movie ends well with a well-intentioned message: This is a story about two people who have an affinity for DS that find each other and their relationship may or may not work (no spoilers). I suppose the movie is trying to get across that pain can be therapeutic as long as it's applied by the right hand with the right intention. Thus two people with an affinity for BDSM can develop a relationship that works, for them. But not me; no thanks.                                       \r\n\r\nTHE MOVIE RUNS 1 hour 47 minutes and was shot in Los Angeles. WRITERS: Mary Gaitskill (short story) and Erin Cressida Wilson & Shainberg (screenplay).  \r\n\r\nGRADE: C-","id":"5ab7eaa9925141395501e8c7","url":"https:\/\/www.themoviedb.org\/review\/5ab7eaa9925141395501e8c7","movie_id":11013}
{"author":"talisencrw","content":"'No Blood No Tears' is the only film I've seen so far of Ryoo's (and I had never heard of it; I simply found it for $3 at a department store that was going out of business, thought it looked interesting and decided to take a chance on it). It was a very satisfying blind-buy, a contemporary and Asian spin on the 'Thelma and Louise' motif. The action and comedic touches are surefire, and the irony of who ends up with the loot was compelling. The friendship mix of the two women (older night owl taxi driver who's deadbeat ex-husband owes everybody money and makes her life miserable, and who desperately wants to find her daughter, with the young girlfriend of a ex-boxer hood who likes to beat her to a pulp) who desperately need each other is well-written and portrayed, and there is truly something for everybody in this successful entry in the legion of Quentin Tarantino\/Guy Ritchie-inspired films of the past generation...","id":"569aefab9251410cc60013d9","url":"https:\/\/www.themoviedb.org\/review\/569aefab9251410cc60013d9","movie_id":97531}
{"author":"Gimly","content":"I'm not gonna stand here and tell you that _Ali G Indahouse_ is a good movie, but I've gotta be honest, I watch this movie at least once a year. I really am not a fan of basically every single thing that Sacha Baron Cohen has done since this, but sometimes, when I'm having a bad day, I sit down, chuck on _Ali G_ and comfortably feel like an idiot for a little while. Very luxurious.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5b99c6219251410b2e0045df","url":"https:\/\/www.themoviedb.org\/review\/5b99c6219251410b2e0045df","movie_id":9298}
{"author":"tmdb27219454","content":"Probably the best movie of 2002 that nobody actually saw. A hard-hitting, realistic look at the undercover police world with a bitter taste of the cases that they work. Jason Patric and Ray Liotia play the parts of two Detroit police offers tasked with bringing the killers of a fellow undercover officer to justice.\r\n\r\nDark, gritty and overwhelming, Narc doesn't sugarcoat law enforcement but somehow keeps the experience real without turning the opinion of the viewer against the officers, who often bend the rules as far as they can without going over the edge.\r\n\r\nExcellent drama, along with some very realistic dialog and some top-notch acting brings this title to the forefront of its niche. I guarantee you won't figure out \"who done it\" until the very end. Definitely not a date night movie, or something to watch while the kids are around, but something perfect for a rainy afternoon flick with the guys.","id":"5d43a002ea7b0e00138953e3","url":"https:\/\/www.themoviedb.org\/review\/5d43a002ea7b0e00138953e3","movie_id":11022}
{"author":"Gimly","content":"I'm not exactly what one might call \"in to\" American comedies, and gross out humour\/romantic comedies are pretty much at the bottom of even that list. For a movie that most certainly contains both those two things (the latter in especially heavy doses), I actually didn't mind _Van Wilder_ that much. But it's all about context, if instead of comparing it to a list of similar things that I hate you compared it to, say, the entire history of cinema overall, then _National Lampoon's Van Wilder_ is pretty bad.\r\n\r\nOne additional note, the friend of mine who I put this on for told me that the movie was from the era of \"When Tara Reid was still hot\". Now personally I've never found any iteration of her attractive, but it did make me have a parallel thought, is Van Wilder from the era when Tara Reid was a better actor? I'm not saying she has been some sort of Oscar-worthy great at any stage, but if I compare her in this to her in, for example, _Sharknado 47_, despite the extra years of experience, she's definitely worse now, right?\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5aae2e7ac3a36846ba02354f","url":"https:\/\/www.themoviedb.org\/review\/5aae2e7ac3a36846ba02354f","movie_id":11452}
{"author":"Wuchak","content":"***Quietly amusing meditation on one’s life post 9:00-to-5:00 grind***\r\n\r\nWarren Schmidt (Jack Nicholson) retires from an insurance agency in Omaha and takes a road trip in his new RV, hoping maybe to reconnect with his daughter (Hope Davis) during her wedding in Denver. The distinguishing bracket for the story revolves around Warren honestly writing his new sponsor-child in Tanzania. June Squibb plays his wife, Dermot Mulroney his imminent son-in-law and Kathy Bates the latter’s mother. Howard Hesseman also shows up.          \r\n\r\n“About Schmidt” (2002) is a coming-of-old-age road flick, far superior to the similar “Everybody’s Fine” (2009) with De Niro. You can’t help but think of Thoreau’s observation “The mass of men lead lives of quiet desperation.” But, unlike the dull De Niro film, this one has a sense of humor amidst the melancholic-but-insightful proceedings.  \r\n\r\nIt’s a lesson on the negative side of giving up your life to the grind for a good paycheck and nice house in the ’burbs. Yet, also, that it’s never too late to live again, as well as realize & perhaps make up for your sincere, but sincerely wrong shortcomings.     \r\n\r\nThe movie runs 2 hours, 5 minutes, and was shot in Nebraska and surrounding points.\r\n\r\nGRADE: B","id":"5e893ed5d55c3d0017528089","url":"https:\/\/www.themoviedb.org\/review\/5e893ed5d55c3d0017528089","movie_id":2755}
{"author":"John Chard","content":"It didn't kill me softly. \r\n \r\nWill is self centered and has cast off all his responsibilities. But during one of his more dubious scams to date single mothers, he is forced to reconsider his moral fibre after coming into contact with a 12 year old outcast named Marcus.\r\n\r\nAdapted from the massively popular book written by Nick Hornby (\"Fever Pitch\" & \"High Fidelity\") About A Boy easily translates well to the screen without truly breaking free of the modest premise. Oddly enough for such a British picture, this is directed by an American, Paul Weitz, who along with his brother Chris, brought the world \"American Pie\". It works, largely to the undervalued comic talents of one Hugh Grant (Will). I would go so far as to say that without Grant leading the film, this would have been a flop, all the highlights on offer are when Grant is on the screen. Expressive with his face and delivering his lines with a natural high, Grant nicely lures the audience into the less than admirable Will's hands. Which is quite a trick considering that Will is a morally dubious scum bag!.\r\n\r\nNicholas Hoult (Marcus) is OK as child actors go, but here he is given far to much to do. Which is another reason why Grant is so important to the film being a success, he shoulders much of the emotional burden, letting Hoult breathe what life he can into poor young Marcus (worst hair cut on film ever). Solid support comes from Toni Collette and Rachael Weisz, and Weitz's direction is smooth and unobtrusive, with Badly Drawn Boy's score an integral part of the story. Yet as much as I enjoy the film myself, one still feels frustrated that it didn't turn out better than it did. A double handed narration from both lead characters intrudes on the flow of the plot, and the pay off is ultimately an \"oh\" moment. So to me it's an OK movie made into a good one courtesy of one of Britain's best light comedy actors. 7\/10","id":"5e777e742f3b17001152937a","url":"https:\/\/www.themoviedb.org\/review\/5e777e742f3b17001152937a","movie_id":245}
{"author":"Gimly","content":"Works more on the strength of Spielberg than of Cruise.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","id":"593d6eb3c3a3680f3301cf66","url":"https:\/\/www.themoviedb.org\/review\/593d6eb3c3a3680f3301cf66","movie_id":180}
{"author":"John Chard","content":"Spielberg does Tech-Noir!\r\n\r\nThe year is 2054 and the murder rate in Washington is zero, the reason? Three Pre-Cognitives (each named after a literary great) whose combined abilities witness murders before they actually occur. Apparently faultless, it's then something of a surprise to Pre-Crime chief John Anderton (Tom Cruise) when the Pre-Cogs predict he is to murder a man named Leo Crow. Forced to go on the run, and haunted by a family tragedy, Anderton must evade the system he so perfectly executed himself. Can he find a flaw? Or is he actually about to commit a murder?\r\n\r\nEverybody Runs! That was the tag line that accompanied the explosive trailer for Steven Spielberg's, Tom Cruise starrer, Minority Report. This marketing tool indicated that the great bearded one had adapted from the Phillip K Dick short story and created an action monster? He hadn't, he had in fact created something far far better than popcorn fodder.\r\n\r\nMinority Report was the next project for Spielberg following the equally dark and intriguing AI: Artificial Intelligence, both films serving to note that Spielberg was capable of thought provoking science fiction outside of the standard crowd pleasers that many critics love to decry. In fact, it's arguable that Spielberg may have hit his creative peak with Minority Report, for the messages and crawling dystopian bleakness on show paint a picture not so much as a future far away in our lives, but of one we live in now. Big thematic points of reference dot themselves throughout the piece. Such as the changing of eye balls, or that in these post 9\/11 years we yearn, and always will, to be safer.\r\n\r\nHere in this bleached shadowy world, a world of metallic tones and visual stings (ace cinematographer Janusz Kaminski on duty), we are safe under Pre-Crime. Yet still it's a world without soul, it has no heart, it's almost as if inhuman in itself, suggesting that the World's problems are not easily vanquished by technology - a total sacrifice of the World's inhabitant's souls. Spielberg of course is well served by the supreme professionals he has at his disposal, he has also managed to garner a great performance from Tom Cruise, something that critic and fan favourite directors have not managed to do previously. Believable grief, action work as strong as ever, it is however with his ability to imbue a tortured film noir protagonist where Cruise excels the most.\r\n\r\nAlongside Cruise and operating with great impact are Samantha Morton as Pre-Cog Agatha and Max Von Sydow, the latter adding that touch of experienced know how needed for his particularly important character. The odd casting choice appeared to be Colin Farrell as the meddling, almost vindictive Danny Witwer, but he plays well off of Cruise, this even if he veers dangerously close to comic book villainy at times (check out a holy smoke Batman scene). What action there is is first rate, from a jet back pack pursuit, to car jumping heroics, the sequences are crafted with Spielberg's deft eye for an action sequence. While the sick sticks (yes you read right) metal spiders and a brilliant Peter Stormare cameo should hopefully have you squirming and grinning in equal measure.\r\n\r\nWhich brings us to the finale, an ending that may not be a complete surprise (yet it still doesn't cop-out in context to Anderton's tragedy), but things are rounded off in true classic noir tradition, where it closes down a thinking man's tech-noir. Superb. 9\/10","id":"570e72de925141161800092c","url":"https:\/\/www.themoviedb.org\/review\/570e72de925141161800092c","movie_id":180}
{"author":"talisencrw","content":"This was very enjoyable and I especially loved the ambience, murkiness and palpable dread that coruscated throughout. This scared my son, a budding horror-film aficionado himself, surprisingly much more than I felt more horrific films he has watched did, and gave him nightmares for a while afterwards.\r\n\r\nAs much as I love Jennifer Connelly and Walter Salles' work, I will try and avoid the English-language remake simply on general principle.","id":"577811f9c3a3686d920019ff","url":"https:\/\/www.themoviedb.org\/review\/577811f9c3a3686d920019ff","movie_id":12205}
{"author":"John Chard","content":"A pact made with relentless fire that requires that, while some live, others die.\r\n\r\nA modern spin on the Leopold and Loeb case, directed by Barbet Schroeder and starring Sandra Bullock as a cop with emotional baggage trying to prove that two high school kids (Ryan Gosling and Michael Pitt) have committed what they think is the perfect murder - just for kicks, allegedly.\r\n\r\nThere's nothing exactly awful about the film, it's well performed by the principal players, engrossing in narrative, beautifully lensed by Luciano Tovoli and Schroeder layers the production with a suitable feeling of unease. Sadly there's no psychological depth given the two boys by writer Tony Gayton, which renders the whole motives and means, and the investigation of such, as being a shallow exercise in thriller film making.\r\n\r\nRunning at two hours in length doesn't help matters, because this further irritates that more meat was not written onto Gosling and Pitt's bones, while it also exposes just how hackneyed and clichéd the picture is. Which when the story should be psychologically profound, marks this out as a frustrating viewing experience. 6\/10","id":"53a2e3740e0a262271001640","url":"https:\/\/www.themoviedb.org\/review\/53a2e3740e0a262271001640","movie_id":11892}
{"author":"flabob257","content":"Come on you guys.  This is great. Werewolf,drama, comedy, etc.","id":"5af6e59cc3a36812630056be","url":"https:\/\/www.themoviedb.org\/review\/5af6e59cc3a36812630056be","movie_id":11880}
{"author":"Wuchak","content":"***Dirty Harry’s final case (not really, but seems like it)***\r\n\r\nRecovering from a heart transplant, a retired FBI profiler (Clint Eastwood) takes a case as a private investigator because of his amazing link to one of the victims. Jeff Daniels plays his amusing neighbor, a dock bum, while Wanda De Jesus appears as his potential girlfriend.\r\n\r\n“Blood Work” (2002) was based on a Michael Connelly novel and his corresponding protagonist, Terry McCaleb, but the movie comes across as Dirty Harry’s final case after retirement, sorta like “Gran Torino” (2008) was akin to “Dirty Harry, the Golden Years.” \r\n\r\nEastwood was 71 during shooting, but his character is roughly eight years younger and he pulls it off. I point this out to stress that he’s no longer kick-axx Dirty Harry. This is an aged, retired and recovering detective working on what is likely his last case. A lot of dialog is devoted to emphasizing how over-the-hill he is and how horrible he looks.\r\n\r\nSo, while this is a gritty big city detective flick in the mold of Dirty Harry, it’s way more subdued and mature. It’s more dramatic and less compelling. If you can roll with that, it’s a decent detective movie. It’s relatively realistic until the ending, which features a twist that I didn’t foresee (although others say they did). The climax is unlikely and smacks of a typical Hollywood ending. “A Simple Plan” (1998) did the same thing: a believable story that takes a “Yeah, right” turn at the close.\r\n\r\nThe film runs 1 hour, 50 minutes and was shot in the Los Angeles area. Anjelica Huston also appears as a doctor while Paul Rodriguez is on hand as a cranky Hispanic detective.\r\n\r\nGRADE: C+\/B-","id":"5c814acf92514127691b1988","url":"https:\/\/www.themoviedb.org\/review\/5c814acf92514127691b1988","movie_id":9573}
{"author":"tmdb44006625","content":"Blade II is the perfect marriage of fanboy and filmmaker. Everything you'd want out of a Blade movie - gore, martial arts, gunplay, clever quips, and techno music - is here to the nth degree. Best of all, it's filmed and choreographed with absolute mastery (thanks Donnie Yen!)\r\n\r\nGuillermo del Toro never forgets to include his more artistic side. Detailed creature anatomy, amazing creature design, an understanding of where to put the camera, and great characters. It's all here.\r\n\r\nBlade II is an incredible action picture and even though some of the CGI looks dated (it really just adds to the charm), Blade II is as exhilarating today as it was in 2002.","id":"5c84288f0e0a26430a636a5b","url":"https:\/\/www.themoviedb.org\/review\/5c84288f0e0a26430a636a5b","movie_id":36586}
{"author":"Gimly","content":"The second piece of this vampire hunter trilogy blurs the lines between Action, Super Hero and Horror, which personally I'm kinda liking.\r\n\r\nThis time around, Blade (Wesley Snipes; New Jack City, Chaos), Abraham Whistler (Planet of the Ape, Provinces of Night) and new arrival Scud (Norman Reedus; The Boondock Saints, Pandorum) must team up with the Blood Pack, made up of Dieter Reinhardt (Ron Perlman; Hellboy, Outlander), Nyssa Damaskinos (Hell Ride, Wrong Turn at Tahoe), Chupa (Matt Schulze; The Transporter, The Fast and the Furious), Asad (Danny-John Jules; Red Dwarf, Lock, Stock & Two Smoking Barrels), Snowman (Donnie Yen; IP Man, Highlander: Endgame), Verlaine (Marit Kile; Doctors, Blue Murder), Priest (Tony Curran; The Midnight Meat Train, Underworld: Evolution), and Lighthammer (Daz Crawford; Hammer of the Gods, Game Over) in order to defeat UberVamp Jared Nomak (personal favourite Luke Goss; Death Race 2, Hellboy II: The Golden Army, Tekken) and his army of Reaper Strain Vampires.\r\n\r\nWith me so far? No? Then go watch the damn movie! It's very fucking good. The opening is almost as strong as the original, and pretty much everything else about it is better. Not to mention the fact that I'm a total Luke Goss fanboy. All of the characters are so much better. They interact and everything. And even though Wesley Snipes has never really impressed me as an actor, the character of Blade was a little less cheesy, which always helps, and basically just better all 'round.\r\n\r\nSPOILERS FOR BLADE, BLADE II and TRINITY: An interesting point, without ruining anything about the trilogy is that in all three films, vampires fight vampires. Not in the whole \"Blade's half a vampire so he kills full-on vampires\" way, although there is most certainly that, but in Blade, Frost kills the Elder vampires to become La Magra. In Blade II, The Blood Pack and Blade team up to take down a new, much more dangerous breed of vampires. And in Trinity, Dracula goes around killing vampires, pretty much for fun. Just food for thought. I've never read the comics much myself, so I don't really know if that's something that's been going on for a while, or if it just turned out that way.\r\n\r\nThere were a couple of lame bits. Some very stupid lines like \"they took all of our weapons. Even your sword.\" Even your sword! Man, the single weapon for which you were named after that has killed more vampires than any other thing on the planet, and the vampires took it away from you? The audacity! And there's this whole thing where Whistler is alive again, they went most of the way to explaining it, and then sort of forgot. It would have been so simple to have a four second flashback cover the lot of it. Oh well.\r\n\r\nStill though, I'm very, very fond of this one.\r\n\r\n77%\r\n\r\n-Gimly","id":"5d6232f16dea3a0011951350","url":"https:\/\/www.themoviedb.org\/review\/5d6232f16dea3a0011951350","movie_id":36586}
{"author":"pancine","content":"Meh, overkill on the stereotypes, machismo and ever present empowerment from saying \"fuck\". Predictable all the way through although Manny's situation at the end is easily the best part of this average movie, I give it an extra star for that. Overall weak FM release.","id":"5c60985c0e0a267deb94cec9","url":"https:\/\/www.themoviedb.org\/review\/5c60985c0e0a267deb94cec9","movie_id":185465}
{"author":"John Chard","content":"Sigh Another Way. \r\n\r\nDie Another Day is directed by Lee Tamahori and written by Neil Purvis and Robert Wade. It stars Pierce Brosnan, Halle Berry, Toby Stephens, Rick Yune, Rosamund Pike, John Cleese, Judi Dench and Michael Madsen. Music is scored by David Arnold and cinematography by David Tattersall.\r\n\r\nBond 20 and 007 is captured and tortured by the North Koreans after being betrayed by an MI6 mole. After being exchanged for a deadly enemy operative, Bond has his 007 status revoked and is forced to go rogue to find who the mole is.\r\n\r\nAs the Bond franchise celebrated 40 years of being, the film to mark the occasion, ironically, forgot the subtle ingredients that make up the best Bond movies. What we get is a chaotic movie, excess is the order of the day, with Eon allowing Tamahori to stack up scene after scene of video game standard ideas. There is no lack of effort here, the heart is full of good intentions, but some big cheese in a suit should have reined the director in. It's also a sad day in the Bond universe when a Bond film uses homage's to homage itself, only for that idea to tire itself out as well. There is barely any time for reflective silences, for a show of character depth, on the odd occasion the film slows down, gasping for air, Tamahori rushes into the next bit of noise annoys. While the action is often as laughable as the dialogue. This may have made a pot load of cash, but few serious Bond fans would have returned to see this again at the cinema. It's Bond for the non Bond fans, a lazy popcorn no brain for the gamers who just want crash, bang and wallop with no substance. Ssshh, did someone say Batman & Robin?\r\n\r\nAs the film unfolds in a blur of sledgehammer editing and lack of restraint, not to forget CGI that is shameful, the cast struggle to keep the good ship Bond afloat. Brosnan is on smug auto-pilot, this film proving to be a sad farewell for him from a role he had previously graced with some distinction. Berry is gorgeous but looks awkward with the action scenes and can't carry off the chirpy aspects of the script, though in her defence she's not done any favours by the writers and Tamahori is more concerned with showcasing her twin assets. Pike is OK, sexy and feisty, if a little difficult to accept as a MI6 agent. Stephens, who went on to do very good acting work later in his career, hams it up for all he is worth. Meant to be a shadow characterisation of Bond, Stephens plays Gustav Graves as some posh cartoon character from a Brit sit-com, a world away from the much needed dastard villain opposing Bond. His motives unclear and a victim of one of the film's more berserker twists. Yune is fun with his diamond studded face and old pros Cleese and Dench at least come out of it with reputations still intact. While Madsen is criminally underused.\r\n\r\nElsewhere on a technical front there's also not much to shout about. Madonna's title song, the worst in the series by far, is only beaten in awfulness by her cameo in the film. Tattersall's photography barely registers above the ordinary, with sub-standard location filming not helping either, and Arnold's score is about as far removed from Bond flavours as it can get. There are some good scenes within, a machismo pumped sword fight between Bond and Graves and a laser beam (hello Goldfinger my old friend) dodging fist fight stand tall above the messy quagmire, but the memory of the good sequences are quickly vanquished once the \"invisible car\" is put to field duty use! And with that there really is no more to say about the \"quality\" of Die Another Day. For Bond fans it's about a 5\/10 movie, for casual blockbuster fans after a cheap thrill it will no doubt score higher.","id":"5e6fcc87cabfe4001516a617","url":"https:\/\/www.themoviedb.org\/review\/5e6fcc87cabfe4001516a617","movie_id":36669}
{"author":"talisencrw","content":"Most definitely the worst 'official' James Bond film I have ever seen (haven't seen 'The World Is Not Enough', 'Quantum of Solace' or 'Spectre' yet) but still has its moments, and like The Rolling Stones or Pink Floyd, even the bad stuff is better than 80% of the other stuff out there. Still I wish it wasn't Brosnan's last one--and though Craig was truly a refreshing change in his realistic tone that hearkened back to the great days of Connery, that too got old, even for the actor himself.","id":"57ae40269251411c6700047d","url":"https:\/\/www.themoviedb.org\/review\/57ae40269251411c6700047d","movie_id":36669}
{"author":"Gimly","content":"I remember thinking this was good as a child... I was wrong.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"592ee96192514130eb00fcce","url":"https:\/\/www.themoviedb.org\/review\/592ee96192514130eb00fcce","movie_id":9645}
{"author":"Wuchak","content":"Ghostly happenings on a decades-lost lost ocean liner \r\n\r\nRELEASED IN 2002 and directed by Steve Beck, \"Ghost Ship\" revolves around salvagers finding a mysterious ship in the Bering Sea that's been lost for four decades and they intend to claim it, but things go from strange to worse as they board the eerie vessel and try to tow it to harbor.\r\n\r\nThe cast is strong, headed by Gabriel Byrne. Emily Brown appears as a 12 year-old girl. Julianna Margulies looks fine but they don't do enough with her. Francesca Rettondini is also on hand. Let's just say the low-budget \"Ghost Voyage\" (2008) is better in the area of women.\r\n\r\nStill, the ship sets are excellent and it certainly seems like they shot the film on a real vessel. Interestingly, the Antonia Graza of the movie is a replica of the Andrea Doria.  Other positives include: The refreshing score with “Not Falling” by Mudvayne thrown in for good measure; a nice haunting atmosphere at sea with one creepy scene reminiscent of the excellent “Dead Calm” (1989); potent visuals of the formidable vessel looming over the tugboat; plus some good thrills, notably one of the greatest horror scenes in the history of cinema in the prologue, no kidding. There's also a decent revelation thrown in at the end.\r\n\r\nIf you like this one be sure to check out the aforementioned \"Ghost Voyage,\" which is a TV movie. \"Ghost Ship\" was released to theaters and obviously had a bigger budget, but that doesn't mean it's better, just that it's more polished.\r\n\r\nTHE FILM RUNS 91 minutes. WRITERS: Mark Hanlon and John Pogue.\r\n\r\nGRADE: B","id":"5b2e95ec0e0a2657d4007a61","url":"https:\/\/www.themoviedb.org\/review\/5b2e95ec0e0a2657d4007a61","movie_id":9645}
{"author":"John Chard","content":"Wetter than a fishes bathing costume.\r\n\r\nIt’s a pretty unadventurous title that matches the content of the film. Directed by Steve Beck and starring Gabriel Byrne, Desmond Harrington, Ron Eldard and Julianna Margulies, plot finds a salvage crew discovering a long lost passenger liner out in the remote Bering Sea. With the laws of the sea stating that they can keep what they find, they are delighted to find gold on board. But it’s not long before strange things start to happen.\r\n\r\nIt starts of real well with a bloody and gruesome prelude, the production design is super and everything is in place for a chiller out there in the foggy waters. Unfortunately what we actually get is a predictable series of clichés cribbed from better movies of the past, none of which capable of eliciting a genuine scare. The makers think that having a bombastic techno score accompanying the dramatic moments will make them appear more shocking. It doesn’t, while the cast are ill served by direction and writing.\r\n\r\n\r\nHorror 101 for beginners. 3\/10","id":"53d11134c3a368776700a432","url":"https:\/\/www.themoviedb.org\/review\/53d11134c3a368776700a432","movie_id":9645}