{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nI always struggle to find reasons to dislike a Pixar film. One of the most annoying preconceived notions about genres is the one about animated movies. \"They're for children, how can you enjoy stuff like that, you're so childish\", people say. Little do they know that animated flicks have as much or more emotionally compelling narratives and characters than live-action films. The score is usually more important in the former genre, and the visuals always look stunning. The partnership Disney-Pixar is probably the best thing that could have happened to Hollywood.\r\n\r\nDan Scanlon delivered a surprisingly good sequel to Monsters Inc. back in 2013 with Monsters University. Making an efficient sequel twelve years after its original is a challenging task, and Scanlon succeed, so I had good expectations going in. Onward might not be one of Pixar's best movies, and I doubt that a lot of people will place it as one of their favorites when comparing with the studio's films of the same type. However, it still carries the trademark emotional narrative with relatable characters that Pixar always delivers.\r\n\r\nI grew up with a father, mother, and two older brothers. Just with this information, I know that I'm luckier than a whole bunch of people all around the world. Onward focuses on the relationship between two siblings (Chris Pratt and Tom Holland), and I love their adventure together. It made me recall my childhood and the awesome moments I shared with my brothers. If you're a fan of Dungeons & Dragons or other quest-based games, the main plot's structure will definitely please you as it did me, but it's connected to my biggest gripe...\r\n\r\nThe concept is pretty neat, but its execution lacks a little bit of more... magic, as ironic as it might be. For example, Frozen II isn't about a \"world full of magic\", but Elsa (Idina Menzel) alone has more magical scenes than Onward in its entirety. In the former, the actual magic feels the screen with stunning animation and chill-inducing music. Onward feels like a diminished version of its true potential. While it's true that the world where the main characters live in has lost its overwhelming magic from the past, their adventure is filled with obstacles which they deal with... you guessed it, magic.\r\n\r\nI don't want to sound like that guy who only wants \"action for the sake of action\". I hate when people dislike a movie simply because they didn't see enough stuff exploding or something. It's a bit about expectations and about what I know Pixar can do. Obviously, I'm expecting more from them now more than ever. It's not that the story isn't interesting or captivating because there's definitely an entertaining vibe throughout the whole runtime. It's well-paced, there's always something going on, and the humor is pitch-perfect. It's GOOD. Simple as that.\r\n\r\nThe voice acting is fantastic. Tom Holland and especially Chris Pratt really incorporate their characters' spirit, and it's almost palpable that the actors had tons of fun behind-the-scenes. Julia Louis-Dreyfus and Octavia Spencer are also quite good, but their characters' respective arcs aren't near as compelling as the primary narrative. Every moment I spent with them is every moment I wanted to go back to the brothers. However, the fun and entertainment never go away. The story never fails to be exciting, it just goes increases and decreases its level ever so slightly.\r\n\r\nI saved the best for last. Even though the second act feels a tad repetitive, the ending is incredibly satisfying. Predictable? Yes. Will it be underwhelming\/disappointing for some people? Surely. But it delivers the most beautiful of messages in the most emotional way possible, as Pixar always manages to do. A lot of nice, small morals are learned throughout the story, but the final one is absolutely perfect, and it left some tears in my eyes. The ending is heartfelt and genuine for everyone, but it will have a tremendous impact on families that lost a member way too soon.\r\n\r\nAll in all, the Disney-Pixar's partnership continues to provide the world with the best animated films of each year. Onward is the most recent success, even though it lacks a bit of magic and creativity when compared to the studio's movies of the same genre. Boasting a talented voice cast, the two brothers go on a fun, quest-based adventure that concludes with a wonderful, heartfelt message to every family out there. Some people might find the ending too predictable and underwhelming, but the climax is emotionally powerful, and it will unquestionably cause an impact on everyone (tissues, anyone?). Its second act feels a bit repetitive, but the entertainment never fades away. Hilarious and clever humor, compelling main characters, not-that-interesting secondary characters, and gorgeous animation as always. The end credits song is pretty cool too. Can't wait for Soul...\r\n\r\nRating: B+","id":"5e5d3685357c0000192c1b79","url":"https:\/\/www.themoviedb.org\/review\/5e5d3685357c0000192c1b79","movie_id":508439}
{"author":"Louisa Moore - Screen Zealots","content":"Unicorns, pixies, elves, and wizards have lost the magic of the past in “Onward,” a formulaic animated adventure from Pixar. Set in a suburban world of fantasy, the film tells the story of two teenage brothers who embark on a quest to find a magic gem that could hold the key to a little familial enchantment.\r\n\r\nIan (Tom Holland) and his older brother Barley (Chris Pratt) are still mourning the death of their father several years ago. Ian was just a baby when he died, and Barley barely has any memories of his dad. When mom (Julia Louis-Dreyfus) gives Ian a gift that his departed pop left for his 16th birthday, it turns out to be a wizard’s staff with instructions for a visitation spell that can bring the patriarch back for one day only. Something goes wrong, and the two siblings must set out on a danger-filled journey to find the missing piece of the puzzle before the sun sets.\r\n\r\nOnscreen adventures are supposed to be exciting, but this one is considerably dull. The story feels very personal yet unfortunately sanitized for broader audience appeal. It works best when the story leans on the theme of reconnecting with your family, especially as the two brothers use their road trip as a way to bond over their differing ways of dealing with grief and regret. It’s poignant, and the film’s sincerity is a heartwarming reminder that we shouldn’t waste what precious time we have left.\r\n\r\nThe movie has a weird “Weekend at Bernie’s” vibe as the two teens drive around in a rock n’ roll van with the bottom half of their reanimated dad in tow. It’s not very funny, and the heavy themes of loss and the meaning of family will likely resonate with those who’ve lost a loved one and still yearn for one more day. It’s a strange film with and unsatisfying ending that doesn’t really pay off.\r\n\r\n“Onward” doesn’t make the most of its solid premise, which is a real shame. The plot is repetitive and predictable; the story sentimental and drawn out. It’s one of the weakest films in the Pixar catalog, but it does meet the studio’s basic checklist for acceptable quality (great animation, good voice performances, mediocre story). It could benefit from a little extra sprinkling of magic.","id":"5e7d5b58fea0d710f5c933bd","url":"https:\/\/www.themoviedb.org\/review\/5e7d5b58fea0d710f5c933bd","movie_id":508439}
{"author":"SWITCH.","content":"Animation has such an important job. The messages I was talking about earlier are not just intended to teach kids things - we learn from them too. I think that's what made 'Onward' a little disappointing: I didn't come out having learned something new in the context of my adult life. Nonetheless, it's still a lovely allegorical tale that promotes brotherhood, adventure and generosity. Animation's got a big duty of shaping up future generations from a young age, and they can't always deliver the goods for all. With that, I sign off - eagerly awaiting Pixar's next drop where, fingers crossed, I get to discover something new too... don't forget the big kids, Pixar.\r\n- Lily Meek\r\n\r\nRead Lily's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-onward-not-the-fairytale-pixar-film-we-wanted","id":"5e5f4a42357c0000132f80e0","url":"https:\/\/www.themoviedb.org\/review\/5e5f4a42357c0000132f80e0","movie_id":508439}
{"author":"Brandon","content":"Onward is a family quest that delights (Boom Bastia!) and pulls at your heartstrings along the unpredictable Path of Peril. There is a delicate balance between tear-jerking moments and comic relief that Pixar and Disney have been known to master throughout many of their films. If you can look past the Pixar and Disney blueprint of the missing family member tragedy you’ll find many successful attempts to modernize the film to relate to many ages and families. \r\n\r\nRead the full review at FeaturedAnimation.com.","id":"5e6aedae55c926001966fdd6","url":"https:\/\/www.themoviedb.org\/review\/5e6aedae55c926001966fdd6","movie_id":508439}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nFirst of all, no, I have no knowledge of the TV series this film is based upon, and after watching Jeff Wadlow's adaptation, I'm definitely not watching anything related to this story. I always follow this principle: the two pillars of any movie are its story and characters. It doesn't matter if everything else is absolutely perfect. If the two central pieces fail to convince the audience, then the whole movie falls to the ground. Sometimes, there are some crumbles that remain intact. Very rarely, there's a big segment that has no scratches whatsoever, which can help the film to survive and, even more rarely, actually make it \"okay\".\r\n\r\nFantasy Island has two little crumbles named Portia Doubleday (Sloane) and Maggie Q (Gwen), who deliver good performances, especially the former who everyone knows from one of the best TV shows of all-time, Mr. Robot. Everything else is completely destroyed. The Grudge still has a couple of redeeming moments, but Fantasy Island is undoubtedly the worst movie of the year, so far. The before-mentioned two pillars are built with the most annoying, cliche characters, as well as a ridiculous narrative that ultimately brings the whole thing down.\r\n\r\nThe third act possesses some of the most nonsensical, irrational, and illogical plot twists I've ever witnessed. This is 2020's version of Serenity, also a movie with an absurd twist that only turns the film even worse than what it was. The big difference between the two plot twists is that Serenity's was predictable from the get-go. Fantasy Island's last twenty minutes are profoundly unexpected because no sane soul would have thought of such a baffling narrative decision.\r\n\r\nThe best way to describe the twist without spoiling a thing (and I won't) is through the editing. During the exposition-heavy revelation, the editing is so awkwardly choppy that it made me think it was all fake. I genuinely thought the plot twist was a false sequence. When I realized it wasn't, I simply laughed like a maniac because I couldn't believe someone thought this made logical sense. Usually, a plot twist carries some sort of build-up, even if it's literally a couple of minutes before the explicit revelation.\r\n\r\nThis one just happens. Without any preparation, a character just shows up on the screen and begins explaining everything. It simply doesn't make any logical sense. It generates so many incongruencies with the whole story that I lost count of the plot holes I was able to point out. The film starts with establishing a few rules, only for an hour later to ignore or change them completely. A particular character acts a certain way without any plausible reason as to why. If the screenplay wasn't messy and confusing enough, the characters are also horribly-written.\r\n\r\nI never enjoy writing that an actor failed to do its job, but Ryan Hansen (JD Weaver) is the weak link of the cast, even if every single script is dreadful. Even the casting doesn't make sense: Michael Peña as a dramatic Mr. Roarke? A character supposed to be serious and mysterious? It's Michael Peña! I don't want to insinuate that he can only do comedy, but making him the villain (if I can call him that) is another addition to the list of questionable production decisions. Lucy Hale (Melanie) is fine as the protagonist, but it all comes down to the lazy, unimaginative scripts. Everything is so unbelievably messy that I don't even have any sort of technical remarks... Maybe that the beginning of the film and the actual concept look interesting. That's the only compliment I can think of: it wasn't a bad idea (different fantasies, different genres, it could have been a fun mix of styles).\r\n\r\nFantasy Island is undoubtedly the worst film of the year until now. Consider it 2020's version of last year's Serenity, but with a third act's plot twist that is so unexpected, everyone will have their jaws on the floor due to how nonsensical it is. The story wasn't close to being decent until the revelation, and it only turned into something a lot worse after it. Dozens of incongruencies and massive plot holes are generated due to the ridiculous attempt at a Shyamalan-like twist. If the absurd narrative decisions aren't enough, the horrible character scripts don't help the not-that-great acting, with the exception of Portia Doubleday and Maggie Q, the only good aspects of the whole movie. In the end, the two pillars of any movie (story and characters) are a total failure, making everything else fall apart with no possible salvation.\r\n\r\nRating: F","id":"5e458dbedb8a0000179b3137","url":"https:\/\/www.themoviedb.org\/review\/5e458dbedb8a0000179b3137","movie_id":539537}
{"author":"jackcarlin18","content":"> _**Review on Horror Focus_**\r\n\r\nBlumhouse is a strange one to predict when it comes to pumping out quality horror films. Jason Blum cleverly orchestrates a plethora of films on a tight-string budget, allowing some breathing space in the (un)likely case that one of his films is a flop. Normally, this is not the case as Blumhouse is prone to releasing the odd PG-13 horror movie every now and again, and strapping that age restriction on any horror already racks in the doe.\r\n\r\nThis, however, has no accounting for taste, as fans like myself can often be left puzzled by the fodder that is pumped out of the Blumhouse canon a few times a year. With quite the eclectic resume of films under its belt, we were treated to the likes of Halloween, Get Out and debatably The Purge, and with the brilliant The Invisible Man coming out so recently, it's truly baffling how a film like Fantasy Island is also the product of the same company.\r\n\r\nNo production company or director is perfect, as we are often exposed to some atrocious pieces of work from our most-trusted filmmakers (with the exception of Jordan Peele duh!). Blumhouse is not to be excluded as it isn't uncommon for them to pump out at least one absolute stinker a year, films that could easily go down as some of the worst the genre has to offer. Blumhouse itself is largely successful overall, and very rarely releases an all-out disaster; but if you see that dreaded brand stapled onto the start of a film title ie. Blumhouse's Truth or Dare, and Blumhouse's Fantasy Island, know that what you're about to endure will be 100 minutes of mind-numbing torture.\r\n\r\nImage result for fantasy island\r\n\r\nLet's make one thing crystal clear, Fantasy Island is camp as tits. The problem here however is that it doesn't realise, which is ridiculous given its boistrous bravado. What we have is a half-baked, often muddled experience that is so oblivious to its own unique charm and goofiness that such comments end up becoming a serious negative. If Fantasy Island capitalised on its own brand of silly then this would be an entirely more enjoyable experience from that alone, but instead it takes itself far too seriously and often gets lost in its own waffle.\r\n\r\nSome elements here are promising, with the overall plot being somewhat intriguing, but its the sheer execution and over-crammed production halts any above average element from being anything more than ill-conceived and inept. The biggest problem lies in the fact that it never knows what it is, nor understand what it's trying to be. It never fully lands on being a jumpy scare-centric horror, nor does it fully execute its trippy Midsommar-esque sci-fi rife that it tries so desperately to juggle.\r\n\r\nFantasy Island is first and foremost a generically dull experience, one that feels like three extremely underwhelming scripts stitches together like the knock-off Leatherface mask. The final product is actually quite puzzling, one that has a troubled time trying to establish its own identity which inevitably leaks out onto its viewer, resulting in a nonsensical, head-scratchingly hollow experience that is as dense as it is naff.\r\n\r\n VERDICT \r\nWord to the wise; like Truth or Dare, if Blumhouse attach their name onto the front of a film title like they're Clive Barker, save yourself time and avoid it. This is one getaway you definitely want to cancel","id":"5e949496ccb15f001371204a","url":"https:\/\/www.themoviedb.org\/review\/5e949496ccb15f001371204a","movie_id":539537}
{"author":"SWITCH.","content":"'Fantasy Island' is a surprisingly fun, undemanding, slickly-filmed diversion that will keep its target audience entertained.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-fantasy-island-a-suprisingly-fun-horror-tinged-adventure","id":"5ea666dfec45520021413ef5","url":"https:\/\/www.themoviedb.org\/review\/5ea666dfec45520021413ef5","movie_id":539537}
{"author":"Benjamin Moran","content":"<b>WORLD PREMIERE (with Director Q&A - Grand Gerrard Theatre)<\/b>\r\n<i>Grade:<\/i> 5\/10\r\n\r\nAnyone can look at <i>Ouija Shark<\/i> and tear every aspect apart. It’s a low budget movie about a shark that is summoned out of an Ouija board. Everyone knows it’s stupid. Even the movie knows, and the movie embraces it. That’s what makes <i>Ouija Shark<\/i> a genuinely enjoyable film to watch. As Brett Kelly (also known as Scott Patrick), the director of <i>Ouija Shark<\/i>, said during the Q&A, it was “made just for a laugh.”\r\n\r\nEveryone should take a step back and ask themselves what ideology they have going into <i>Ouija Shark<\/i>. The person who takes this movie seriously is only making a fool of themselves. Keep an open mind and don’t waiver the chance to have fun. If that is really too hard, then what is the point of watching this movie?\r\n\r\nSurely there’s one question on everyone’s mind: <b>why?<\/b> Why make <i>Ouija Shark<\/i>? What was the inspiration? Before this review formally starts, let’s dive into some information received during the director Q&A. There’s a simple answer to the question. Brett Kelly states that the “[concept] wasn’t my idea.”\r\n\r\nFor those unfamiliar with Brett Kelly’s previous work, one notable title that may stick out is his 2012 action-thriller <i>Jurassic Shark<\/i>. The movie took the internet by storm, becoming the lowest-rated title on IMDB for a period of time. <i>Jurassic Shark<\/i> was Brett Kelly’s earnest attempt to get hired by The Asylum. When he realized what his movie had become, he had one reaction: “what the <b>fuck<\/b> just happened?!”\r\n\r\n“If they think that’s stupid…” Brett Kelly says in reaction to the angry babbling of the internet, “...[I’ll make] something even stupider.” Three years later Wild Eye Releasing, the distribution company, released <i>Raiders of the Lost Shark<\/i>. The film was directed by Scott Patrick, a pseudonym Brett Kelly adopted for his lower-budget films.\r\n\r\nWild Eye Releasing wanted another Brett Kelly shark film. While discussing his thought process, Brett Kelly mentions how he almost recommended <i>The Invisible Shark<\/i>, which would be a great way to mess with the easily-triggered audiences. As it turns out, it was Wild Eye Releasing that suggested the title <i>Ouija Shark<\/i>, not Brett Kelly. He decided to roll with it, David A. Lloyd wrote the screenplay, and they made the movie.\r\n\r\nIn due time, <i>Ouija Shark<\/i> will release for all to see. So, just how good is it? Nothing in the movie is going to blow audiences away. You have a very simple plot with flat characters. The green screen is noticeable and the writing is subpar. However, as Brett Kelly said, “we knew exactly what we were making.”\r\n\r\n<i>Ouija Shark<\/i> doesn’t hold back on its absurd concepts. “[The] aim was to be ludicrous.” And ludicrous it was. <i>Ouija Shark<\/i> is hilarious. It’s the type of humour you’d get from <i>The Room<\/i> or <i>The Fanatic<\/i>. Only this movie knows it’s bad and it rams it to 1,000! Jon Migliore, who worked on the screenplay and visual effects, plays a character named <i>Jill’s Dad<\/i>. Migliore implements a sorcerer element to the film and steals the show with his hysterical scenes. The best part is how last-minute his scenes were. Had the movie not needed a runtime boost, we would not have this legendary character.\r\n\r\nAs enjoyable as this movie is, and while it understands itself very well, there are still some basic filmmaking elements that all films are judged on. Whether it’s a blockbuster or a direct-to-video shark attack feature, they all follow some basics. With <i>Ouija Shark<\/i>, the characters are extremely underdeveloped, the pattern of the shark attacks is unclear, the camerawork breaks the 180-degree rule, and the climax is slightly underwhelming. That doesn’t make the film any less enjoyable, but it does restrict a higher grade.\r\n\r\nBefore this review is wrapped up, here are a few facts learned from the director Q&A:\r\n\r\n<blockquote><i>Ouija Shark<\/i> was filmed over the course of five days with a ~$300 budget. It was originally intended to film across five consecutive days, but due to a scheduling conflict with one of the actors, filming was spread out across three months.<\/blockquote>\r\n<blockquote>The film was scheduled to release during Shark Week 2018. Instead, the movie sat unreleased until the trailer dropped on January 23rd, 2020. This was surprising to Brett Kelly, who had no idea his film was finally releasing.<\/blockquote>\r\n<blockquote>The shark hand puppet, which was made of real enamel, cost $200 and was originally intended to be used for <i>Raiders of the Lost Shark<\/i>.<\/blockquote>\r\n<blockquote><i>Ouija Shark<\/i> was filmed in Ottawa and Hamilton (Ontario, Canada). The camera primarily used was a Canon T2i. A Canon T4i was also used.<\/blockquote>\r\n<blockquote>When asked about a potential sequel to <i>Ouija Shark<\/i>, Brett Kelly stated it is “never gonna happen.” He is burned out on shark movies and will be retiring from features after his next film.<\/blockquote>\r\n<blockquote>As the film progresses, perceptive eyes might notice a stain on the Ouija board prop. This was caused when orange juice was accidentally spilled on the board.<\/blockquote>\r\n<blockquote>Belly Kelly states that filmmakers need “thick skin” to make shark movies due to the internet. Apparently, the director has received death threats after his previous work on <i>Jurassic Shark<\/i> and <i>Raiders of the Lost Shark<\/i>.<\/blockquote>\r\n<blockquote>Brett Kelly believes that people pretend to hate shark movies. People actually enjoy them and crave the feeling of superiority they get when they prove they’re smarter than the film.<\/blockquote>\r\n\r\n<i>Ouija Shark<\/i> is everything it needed to be. No one expected an award-winning classic to birth from <i>Ouija Shark<\/i>. It’s just a cheesy low-budget shark movie. On top of all this, <i>Ouija Shark<\/i> has one of the greatest endings of recent years. Audiences looking to have a good laugh should definitely check out <i>Ouija Shark<\/i> when it releases on May 26, 2020.","id":"5e655ef6459ad600135a115f","url":"https:\/\/www.themoviedb.org\/review\/5e655ef6459ad600135a115f","movie_id":674482}
{"author":"SierraKiloBravo","content":"Click here for a video version of this review: https:\/\/youtu.be\/97siFgwBwiU\r\n\r\nI'm a sucker for a good dive down a rabbit hole, and when I began to hear about a documentary called _Out of Shadows_ on a few different podcasts my spidey senses got a-tingling. \r\n\r\nNow, I'm not gonna lie, first of all I think their marketing team should be fired, because if you look at the poster for this, it has little if nothing to do with the contents of the documentary. The poster has a cross and a scripture quote on it so anyone looking in passing would probably think this was some sort of Christian thing, maybe an examination of churches, or the child abuse that happens within them. But no, this, as the official description says, is \"an exposé on how Hollywood and the mainstream media manipulate the multitudes by spreading propaganda throughout their content.\"\r\n\r\nHollywood conspiracies are nothing new and the documentary sets out to package some key items from this deep catalogue. This is a little difficult to talk about because your reaction to this will largely depend on your views prior to going into it. If you are the sort of person that rolls your eyes at the mention of conspiracies, you will see this as nothing more than another tin foil hat pile of woo hoo trash. If you have a healthy skepticism about what is presented to us in the media and think that it is good to question how much of an influence the media and entertainment industries have over us, you'll find a lot here that is very intriguing. If the CIA Satanic infiltration of Hollywood run by pedophiles is your wheelhouse, this will be right up your alley. This won't convince anyone at one end of the spectrum, and will only confirm what those at the other end believe. Those somewhere near the middle will likely get the most out of this.\r\n\r\nThat said there was some really interesting information presented here. There was not a lot here that I hadn't already heard on podcasts or read in books. I think it serves best a compressed introduction to the influence of media over our everyday lives. My main takeaway was the good reminder that only a handful of companies own the entertainment and media industries. There are a myriad sub-companies, but tracing things up leads to only a few that have overarching control. It's pretty scary when you think about how a small number of companies and boards have control of the majority of what is consumed by the general public.\r\n\r\nThe most intriguing thing about this is that it was released by the film-makers on YouTube and at the time I'm writing this has as over 11.4 million views on YouTube but when you search for the documentary by name, it does not appear in the search results, and I have never seen it on Trending.\r\n\r\nNow, I'm not saying there is a conspiracy out there to down rank this documentary, but it sure makes you wonder...","id":"5eb27740cdbaff0021b548ea","url":"https:\/\/www.themoviedb.org\/review\/5eb27740cdbaff0021b548ea","movie_id":691930}
{"author":"Louisa Moore - Screen Zealots","content":"The dead of winter is the time studios like to shove their bottom-basement junk into theaters, bringing us movies that are instantly forgettable and brimming with mediocrity. The female-driven buddy comedy “Like A Boss” is a great example. This tolerable movie is perfectly fine for a mindless girls’ night out, but it never sets its standards high enough to achieve much more. But why would it?\r\n\r\nBest friends Mia (Tiffany Haddish) and Mel (Rose Byrne) are living their best lives running a makeup company they’ve built from the ground up. Things haven’t been going so well on the financial front, and the women find themselves over their heads in debt. When cosmetics industry titan Claire Luna (Salma Hayek) presents them with a huge buyout offer, it puts a strain on their friendship that the two may not ever be able to repair.\r\n\r\nIf you’re looking for a fun and insightful view at the real-life experience of female business owners, you won’t find it here. What you will find is yet another male-written movie that feeds the narrative that the beauty industry equals female empowerment. It’s not offensive, but it’s a stale idea. How many movies can you count that use the old “you need makeup to feel pretty, but also never forget to be yourself!” narrative? It’s not offensive, but it’s another Hollywood rubber stamp on what the industry thinks are the ingredients necessary for a movie that’s supposed to be made for women.\r\n\r\nThe comedy is sometimes funny but mostly strained, as Haddish and Byrne are constantly struggling in an effort to sell the lousy one-liners. Their chemistry is terrific, but there’s only so much these two talented ladies can do with such a lackluster script. Hayek is an over-the-top caricature who is given very little to do. Her shtick can be amusing in the right place at the right time, but it isn’t here.\r\n\r\nThis isn’t a terrible movie, but it’s light years away from being an instant classic. In fact, this tired effort wouldn’t even orbit the general conversation. But “Like a Boss” is still just barely good enough if you are a fan of the two leads or if you’re looking for easy-to-swallow entertainment.","id":"5e7d577feec4f30547aa3d18","url":"https:\/\/www.themoviedb.org\/review\/5e7d577feec4f30547aa3d18","movie_id":526019}
{"author":"Screen-Space","content":"\"In the compassionate, steady hands of debutant director Beuca, D-love...proves precisely the tonic these toxic times need.\"\r\n\r\nRead the full review here: http:\/\/screen-space.squarespace.com\/reviews\/2017\/12\/6\/d-love.html","id":"5a27100d92514103390f494e","url":"https:\/\/www.themoviedb.org\/review\/5a27100d92514103390f494e","movie_id":490929}
{"author":"SWITCH.","content":"Instead, 'The Rhythm Section' is a middling but serviceable time-waster that would be instantly forgettable... if it didn't currently hold the box-office title for worst opening weekend of all-time, that is.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-the-rhythm-section-watchable-but-completely-unmemorable-espionage-thrills","id":"5ea661886d1bb2001da552b9","url":"https:\/\/www.themoviedb.org\/review\/5ea661886d1bb2001da552b9","movie_id":466622}
{"author":"SWITCH.","content":"Liberal snooty types lashing out at conservative cronies and their right-wing leanings should have made for some enjoyably edgy satire, but 'The Hunt' is merely a by-the-numbers comedy-horror-suspense thriller that has a few punchy moments. But, if production company Blumhouse wants to remake a bunch of 90s Jean-Claude Van Damme action movies with Betty Gilpin in the lead role, I think I'd be down with that. I'd watch them, not in the theatres obviously, but late at night after a few beers.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-the-hunt-blunt-lazy-and-undeserving-of-controversy","id":"5e7e7e1726677800184c8087","url":"https:\/\/www.themoviedb.org\/review\/5e7e7e1726677800184c8087","movie_id":514847}
{"author":"SWITCH.","content":"While 'The Call of the Wild' is ultimately a weak adaptation of the novel - it may be impossible to ever adapt it faithfully - it's still an okay family flick hampered by an over-reliance on CGI.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-the-call-of-the-wild-a-mild-journey-into-the-uncanny-valley","id":"5e9ceb4bf6fd18001de5d785","url":"https:\/\/www.themoviedb.org\/review\/5e9ceb4bf6fd18001de5d785","movie_id":481848}
{"author":"SWITCH.","content":"While 'The Invisible Man' isn't perfect, it is (like 'Upgrade') a thoughtful take on the genre, cleverly using on- and off-screen space and delivering each big scare like an effectively-timed punchline.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-the-invisible-man-paranoia-gaslighting-and-spookiness","id":"5e54c720a76ac50016a85750","url":"https:\/\/www.themoviedb.org\/review\/5e54c720a76ac50016a85750","movie_id":570670}
{"author":"JPV852","content":"Despite a fine cast, this latest entry (and quasi reboot) is pretty dull. I did like some of Pesce's direction and shots, but far too many of the cliched zingers from these supernatural-horror films. Probably won't remember very much about this in a few days (if not less)... **1.75\/5**","id":"5e7fc2541d6c5f00181ba81c","url":"https:\/\/www.themoviedb.org\/review\/5e7fc2541d6c5f00181ba81c","movie_id":465086}
{"author":"JPV852","content":"Generally I like these crime-dramas, which I is why I also watched CSI and Criminal Minds when they were on. However, this adaptation of the James Patterson\/Liza Marklund novel has some editing problems and sloppy dialogue. There were a couple okay scenes that did surprise, otherwise it kind of plods along at a slow pace. If not for Jeffrey Dean Morgan, this would've been tough to sit through. **2.75\/5**","id":"5ebf00628e2e000021168365","url":"https:\/\/www.themoviedb.org\/review\/5ebf00628e2e000021168365","movie_id":449756}
{"author":"SWITCH.","content":"Although handsomely shot, with several good actors doing their best and a small handful of unsettling visuals, 'The Grudge' is ultimately a dull, disjointed mess that is riddled with cheap “boo!“ moments. I hope Pesce rebounds quickly from this failed effort in franchise-building and gets back to making the kind of idiosyncratic films he's clearly capable of.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-the-grudge-the-movie-reboot-curse-claims-another-victim","id":"5ea8ecbf07291c0025eb8b2f","url":"https:\/\/www.themoviedb.org\/review\/5ea8ecbf07291c0025eb8b2f","movie_id":465086}
{"author":"Trazbor O'Gukguk","content":"This is a film that tries to be smart and clearly isn't. It has more holes than a colander containing Swiss cheese being held by Christ. This film thinks it's so edgy when it couldn't be further from it. It's a low budget, badly acted, dire attempt to contemporise a classic story. Do yourself a favour and don't bother.","id":"5eae02800b7316001c3ebd15","url":"https:\/\/www.themoviedb.org\/review\/5eae02800b7316001c3ebd15","movie_id":570670}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nI’m not the greatest fan of inspirational sports dramas, but I also never disliked one. They all follow this storytelling formula that everyone recognizes, but it’s always successful. The protagonist is a miserable human being due to some tragic past. He gets another shot at life, usually an underdog situation, and he ultimately overcomes whatever challenge is thrown at him, including his addictions if he has any. Everyone lives “happily ever after”, and the viewer leaves the theater with a smile because that’s how it makes us feel.\r\n\r\nIt’s incredibly easy to root for an underdog trying to raise its level and to reach something it never believed in. In The Way Back, the basketball team is awful, but Jack teaches them not only how to play better, but how to be a better *team*. Then, it’s just like the synopsis: a win here and there gets everyone back on track, and it’s very entertaining to watch these young kids “grow up” in every possible way. As a sportsman myself, several little details help me enjoy this type of movies even more.\r\n\r\nHowever, it’s a straightforward variation of the same cliche, predictable story… until one point. There’s one genuinely surprising development I didn’t see coming. I don’t know if it was due to my “defenses being down” or if Gavin O’Connor and Brad Ingelsby really did a great job at hiding it until the right moment, but it definitely worked.\r\n\r\nThe lack of character-building regarding the secondary ones is probably my biggest issue aside from the formulaic screenplay. There’s one young kid that still has some sort of an arc, but it never gets the deserved consideration. It’s a very protagonist-centered film, and there’s nothing truly wrong with that, especially when Ben Affleck delivers one of his career-best performances. I left him for last because I do believe the whole movie succeeds due to his impressively captivating display.\r\n\r\nA lot of people talk about how Affleck’s own life and his past struggles with addiction make this a personal interpretation in the sense that he’s just portraying himself. Some people even diminished his performance by saying that “it’s easier to represent ourselves than a fictional character”, which I couldn’t disagree more. It’s an arduous task interpreting a version of our personality, let alone a very somber, sad part of it. It’s not only an enormous acting challenge but also a terrifying personal test.\r\n\r\nI digress. Honestly, I couldn’t care less about Affleck’s personal life, or anyone’s for that matter. People should stop trying to bring external themes to reviews, it’s one of the first principles film critics learn (but have unfortunately forgotten with time). I don’t know if his experience with addiction helped him with his performance or not, but he looks incredibly committed to his role. He elevates his character, and he carries the whole movie on his shoulders. Brilliant, emotional, and very realistic interpretation of someone dealing with depression, frustration, anger, and an addiction issue.\r\n\r\nAll in all, The Way Back is an inspirational sports drama that follows the genre’s stereotypes and formulaic storytelling, but it’s still very successful in its execution. The secondary characters lack development, but there’s nothing wrong with a protagonist-centered story as long as the main actor delivers an exceptional display. Something Ben Affleck does in an emotionally powerful manner, delivering a genuine portrayal of someone with a tragic past and lots of personal issues. I believe it’s one of his career-best performances. Jack might follow every storyline that ever existed in this genre, but Ben Affleck is reason enough to give Gavin O’Connor’s flick a go.\r\n\r\nRating: B","id":"5e836d5d04b5960017935cae","url":"https:\/\/www.themoviedb.org\/review\/5e836d5d04b5960017935cae","movie_id":529485}
{"author":"Gimly","content":"The fact that this is how my 2020 film-watching career starts seems like a **REAL** bad omen for this year.\r\n\r\nUpdate: Oh boy.\r\n\r\n_Final rating:★ - Of no value. Avoid at all costs._","id":"5e74c30bb7d35200137643cc","url":"https:\/\/www.themoviedb.org\/review\/5e74c30bb7d35200137643cc","movie_id":465086}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nI... am... in shock. The Turning had tons of development issues, switching directors (Juan Carlos Fresnadillo was the first choice), cast, producers (Steven Spielberg was once responsible for the project), and who knows what else. It's yet another adaptation of the famous ghost story, Turn of the Screw by Henry James, so it was always going to be a challenging task to bring a horror flick with something unique that the others didn't possess. After so many changes, the film finally decided on Mackenzie Davis as the adult protagonist, and Finn Wolfhard and Brooklynn Prince as the young kids.\r\n\r\nThey replaced everything and everyone, except the people who are behind the main reason why this movie fails so miserably: the screenwriters. With all due respect to the Hayes brothers, but this is the worst kind of a bad film. It doesn't have a single redeemable quality about it. It's a movie about... nothing! It has no message, no purpose, no structure, and last but not least: there's no ending. I'm not joking, The Turning doesn't have an ending. It's like someone abruptly shouts \"roll credits\" way before any sort of payoff is delivered.\r\n\r\nThe whole film is a collection of repetitive, dull scenes that only vary in location. Scareless and predictable jump scare sequences spread throughout the entire runtime with no meaning or objective underneath. Close to ninety minutes of build-up to utterly nothing. This isn't one of those cases where the ending is just ambiguous, and people can interpret it in several ways. As baffling as it might sound, this monotonous, cliche, boring horror movie doesn't possess an ending. I have to repeat it, so you actually believe what I'm writing.\r\n\r\nEven if I simply ignore that last (nonexistent) act, the rest of the film is still awful. As the viewer, knowing more than the main character about what's happening or what's about to unravel is almost always a lousy aspect concerning the horror genre. Not only there's a lack of a scary or eerie environment, but the narrative raises dozens of logical questions that eventually get no answer. The movie actually starts reasonably okay, it got me slightly invested in Davis' character, but it quickly becomes one of the most yawning-inducing experiences I've had this year.\r\n\r\nUsually, I can turn to the acting to help me get through the hardest portions of the film. However, Mackenzie Davis (who I liked a lot in Terminator: Dark Fate) gradually starts to become uninteresting, and Finn Wolfhard delivers the worst performance I've ever seen from him. Brooklynn Prince is good for her age, but she's still a 9-year-old kid, so... you know. Barbara Marten is probably the best as Mrs. Grose, but just like the movie itself, she has no real impact on anything. Technically, the score is weird, and instead of elevating the scary sequences, it turns them into a rock concert. The editing also lacks consistency.\r\n\r\nHonestly, I thought that Fantasy Island was a safe bet for the \"Worst Movie of 2020\" prize, but The Turning just entered the race. As logically absurd as the former might be, at least it has an ending. It's a ridiculous one, but it's, in fact, an ending. The latter not only lacks a payoff to the ninety minutes of build-up, but it has absolutely no redeeming quality. Describing a film in a one-word sentence was never this easy: \"nothing\". It's a movie about nothing! No meaning, no message, no purpose, no logical sense. An extremely boring journey through a mansion with predictable jump scares, an awkward score, and disappointing acting. It's an emotionless story packed with unanswered questions, and no, it's not one of those \"ambiguous narrative\" cases. I definitely don't recommend it, unless you desire that frustration of watching an incomplete film.\r\n\r\nRating: F","id":"5ea5a82da2d2e90021de124c","url":"https:\/\/www.themoviedb.org\/review\/5ea5a82da2d2e90021de124c","movie_id":492611}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nIn case you don't know, I'm from Portugal. Why does this matter? Well, The Hunt was delayed after a massive shooting in the USA, and since the movies' themes are extremely sensitive, the producers decided to postpone the film. At the time, I felt frustrated that, once again, movies have to suffer from real-life situations. Going to the theater is supposed to be an \"out of this world\" experience. The audience is transported into a fictional place where real-world problems can be forgotten for a couple of hours. So, I never handled these constant controversies surrounding films very well...\r\n\r\nWith that said, I believe The Hunt not only benefited from that delay, but its satirical story has even more impact now. There's no way around this. Craig Zobel's movie is meant to be one of the most divisive films of the last few years. I know it's a pretty basic analogy, but it's just like a dark humor standup show. If you don't have any issues with jokes about topics like racism, stereotypes, immigration, refugees, religion, politics, and every sensitive theme that your mind can imagine, then you'll find The Hunt a brilliant allegory of society's most extreme people. If you do have problems with this type of comedy, then stay away from this movie because Damon Lindelof and Nick Cuse go all out!\r\n\r\nWhen I write that every remotely sensitive taboo subject or activity is unrestrainedly addressed, I mean EVERY SINGLE theme. This is a narrative completely packed with extreme, over-the-top cliches and stereotypes of both right and left political sides. At first glance, The Hunters feel like the \"bad guys\", in the sense that they're hunting innocent people for pure pleasure. Once the audience understands the reasons behind the selection of the people being hunted, one small but tremendously effective thought enters everyone's mind: \"you know what... the world would actually be a better place without this kind of people\".\r\n\r\nSuddenly, not a single character is worth caring about. To clarify, I don't mean \"caring about\" in the common, emotional way. No character is written with the purpose of making the audience worry about it. In fact, almost every character (maybe except Betty Gilpin's) is a despicable human being. Their view of the world is clouded by ideologically outdated mentalities. I love how the screenwriters use each character to represent a particular type of ... extreme personality, let's call it that. One of the best compliments I can give the film is that it didn't pick a side. Everyone gets blasted with jokes.\r\n\r\nIt's a dark yet hilarious satire of today's society with a special focus on the close-minded people that go online to try and spread their conspiracy theories and immoral beliefs. Everything that I just wrote so far resembles the movie's impact on the viewer: either you're okay with this type of screenplay and you'll be incredibly entertained; or you'll get extremely triggered by all this. It's one of those films that will end up on a bunch of \"Worst Movies of 2020\" lists simply due to its narrative's nature.\r\n\r\nHowever, the story isn't the only aspect that can make people give up on watching this movie. The actual hunt is as over-the-top as everything else. There's blood everywhere, ridiculously disgusting deaths, and absolutely no limits whatsoever in killing people in the most insanely entertaining way possible. Action-wise, The Hunt is better filmed than a lot of blockbusters. Beautiful wide shots when something (or someone) explodes, exceptional (and hilariously long) choreography for the \"final fight\", and excellent editing overall. It's genuinely a well-made, well-produced, and well-filmed movie. The score is also pretty cool.\r\n\r\nObviously, it's one of those films that's easy to pinpoint flaws. Every single paragraph that I wrote above can be interpreted as some of the worst aspects of the entire movie, depending on each person's perspective. In my opinion, I think the ending would have benefited from a more serious tone, but at the same time, it would probably clash with the widespread satirical one, so it's an inevitably difficult ending to completely get right. The cast is a bit hit-and-miss when it comes to each actor's performance (some are very bland), but Betty Gilpin delivers an outstanding display and seamlessly carries the whole film. Finally, there's a small part of the movie that involves military characters who don't belong to either side of The Hunt, and that portion didn't really work for me.\r\n\r\nAll in all, The Hunt is a brilliantly dark satire on today's political views of the world. It's meant to be one of the most divisive films of the last few years, and it undoubtedly succeeds in its mission. Just like dark humor, either you're okay with it, or you're not. If you can't take a joke about the most extremely sensitive taboo themes (and I mean ALL of them), then stay away from this movie or you'll be triggered for a whole week. However, if you can see the fun side of this type of comedy, The Hunt is the most entertaining, witty, hilarious, bloody, over-the-top action thriller you'll see for a long time. Damon Lindelof and Nick Cuse go all out, and they don't forget to approach a single topic. It's a well-made film all-around: well-written, well-produced, and well-filmed. A few minor issues regarding its ending and a small subplot don't diminish Craig Zobel's exceptionally captivating concept and Betty Gilpin's compelling performance. I definitely recommend it depending on how much you enjoy dark humor.\r\n\r\nPS: everyone knows the tale about the rabbit and the turtle, right? How the rabbit races the turtle, and all that? Well, The Hunt's version of that story just became my all-time favorite.\r\n\r\nRating: A-","id":"5e8c9e6c3a340b001403e7d7","url":"https:\/\/www.themoviedb.org\/review\/5e8c9e6c3a340b001403e7d7","movie_id":514847}
{"author":"John Smith","content":"If you want to watch this, don't. If you want to watch an 'invisible man' movie, watch the original 'The Hollow Man'. I actually had to rewatch 'The Hollow Man' just to wash my eyes after this. The manlet of a woman in this movie that they call an actress is 100 times worse than Rhona Mitha's performance in 'The Hollow Man'.","id":"5e81ea3b9a643500184e26ab","url":"https:\/\/www.themoviedb.org\/review\/5e81ea3b9a643500184e26ab","movie_id":570670}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @ https:\/\/www.msbreviews.com\r\n\r\nI couldn't catch The Call of the Wild when it premiered. Therefore, I didn't remember a single thing about it when I went to watch it yesterday at an empty screening (yei). Once again, I stayed away from trailers, but a few images popped up at the time. The CGI dog didn't look good at all. With reviews coming out and weeks passing by, I couldn't avoid concluding that most of the negative opinions are due to the \"distracting animation\". Knowing that the visuals would probably be disappointing compared with the story, I still watched it with moderate expectations.\r\n\r\nI'm genuinely surprised by so much negative feedback. I really enjoyed it, and it's one of my favorite films of the year, so far. Yes, it doesn't mean much, having in mind it's only March, and it will very likely not even receive an honorable mention by the year's end. Nevertheless, the supposedly distracting CGI dog (Buck) didn't bother me in the slightest. Buck might not be a perfect animated animal, but as long as people go in with the right mindset, the chances of enjoying the story are much higher.\r\n\r\nIt's an animated dog. Accept it, move on, and everything will flow a lot easier. I believe it belongs in that \"uncanny valley\" category. Something weird might work well for some people, and horribly for the rest. I didn't mind it at all, and I go as far as saying that a few moments are elevated exclusively due to the dog's expressions. I also defend that this movie needed the CGI dog instead of a real one. It's not an ordinary dog: Buck is stronger, bigger, taller, and he has a special wild instinct that home dogs lack.\r\n\r\nTo be clear: Buck isn't visually perfect. Sure, there are a few scenes where the CGI becomes too overwhelming and awkward. However, it doesn't detract from the heartfelt narrative. Buck is undoubtedly the main character. He has emotional conflicts, personal motivations, a distinct personality that changes along with his adventures, and a part of him that he needs to explore. The first half of the film is packed with action, fun, and a clear purpose. It's extremely captivating and entertaining, even if it follows the usual, predictable storylines. Good performances from Omar Sy (Perrault) and Cara Gee (Françoise) during this portion.\r\n\r\nThe second half is when Harrison Ford's character (John Thornton) finally comes in (he scarcely shows up until then). From now until the end, the movie employs a slower pace, focusing on Ford's reflection about his life, and Buck's journey to find the place where he ultimately belongs. Harrison Ford delivers such a subtle, emotional performance. I can't remember the last time I saw Ford so committed to a role. John possesses a devastating, tragic past, and Buck is able to bring some joy and fulfillment into his life. For a dog lover like myself, it's such a tear-inducing, genuine, heartwarming story.\r\n\r\nThe only aspect I truly dislike is, unfortunately, Dan Stevens's character (Hal). He's just an incredibly cliche, despicable \"villain\", who doesn't fit with the rest of the film. I love the actor, but his over-the-top display doesn't always work, and Hal suffers a lot from his exaggerated manners and expressions. In my opinion, he could have been completely removed from the movie, and it would have been a lot better. Totally unnecessary, and lazily written subplot, to be honest. Oh, and Karen Gillan (Mercedes)? I literally just discovered she was in the film as well...\r\n\r\nThe Call of the Wild is one of those movies that suffer from bad trailers. People either skip it or go in with a pre-defined negative mindset. It proves that the best (and only) way to judge a film is to simply watch it. CGI Buck isn't an animated work of art, sure, but he's far from being distracting or annoying. To be honest, I feel that he elevates a lot of emotional moments. Buck is exceptionally well-written, standing out as a complex and emotionally compelling protagonist. I laughed, I cried, and I felt entertained by all of his crazy adventures. Harrison Ford delivers his best performance of the last couple of years in a slower-paced second half of the movie, after a frenetic, action-heavy first half. Dan Stevens' character is definitely the worst aspect of the story. An unnecessary, cliche, horrible \"villain\" with no place in the narrative. All in all, I highly recommend giving this film a chance! Avoid its trailers, accept the fact that Buck is, indeed, an animated dog, and try to enjoy the genuinely heartfelt story at its core.\r\n\r\nRating: B+","id":"5e6bcccc031a1d001338ff09","url":"https:\/\/www.themoviedb.org\/review\/5e6bcccc031a1d001338ff09","movie_id":481848}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nAs you should know by now, I avoid trailers at all costs, especially for highly anticipated movies. I'm careful enough already, but once I heard the massive complaints about the trailer for The Invisible Man, I made sure to not even listen to it, let alone see something from it. My expectations got higher as the release date approached, and the overwhelmingly positive reactions reached my attention, so obviously, I couldn't help but get excited. I love The Handmaid's Tale, and I always thought it was a matter of time until Elisabeth Moss brought her phenomenal acting skills to the big screen. She just needed a big film to do it...\r\n\r\nAnd this is the one. Elisabeth's performance is yet another horror display for The Academy to ignore when the year comes to a close. In comparison to Hereditary's Toni Colette or Us' Lupita Nyong' o, I admit that I would give an Oscar to one of these two over Moss. However, this is one of the main issues I have when people compare things from different years: it's extremely unfair and a bit irrational. Something \"great\" in a specific year can be just \"okay\" in the next one. It depends on each year's quality regarding movies and their cast's performances.\r\n\r\nIf Moss truly ends up delivering the best interpretation of the year, she should receive recognition independently of other year's injustices. With that said, based on my experience, I firmly believe Elisabeth Moss should be one of the contenders for the respective category during the awards season. I'm not saying she should be nominated or not, I'm saying that she should be one to think of when it's time to fill the ballot with the nominees. She is relentlessly exceptional during the whole runtime. There isn't a single moment where she drops her level. Impressive!\r\n\r\nRegarding the story, it's probably the best adaptation of The Invisible Man to the actual world that they could have done. Of all the meaningful and sensitive real-world themes, Leigh Whannell chose the very best to insert in his film. Domestic violence and abuse is a tremendously serious topic, and Whannell addresses it perfectly. It's a remarkably clever screenplay, with tons of tiny little details that relate in some shape or form to the real-life situations a lot of people (women AND men, let's not pretend this is an exclusively female problem) go through.\r\n\r\nIt's one of the best horror movies I've seen lately when it comes to creating a suspenseful, scary environment, mostly based on something that feels incredibly realistic. Taking the sci-fi aspect of, well, dealing with an invisible person, the menacing silence and haunting score work as well as they do because I'm able to feel the protagonist's fear. Stefan Duscio's cinematography is one of the main reasons why this film is filled with so much efficient suspense. The camera constantly pauses on one side of the room the character's in, lingering on for some seconds, creating a certain doubt if something's moving or if someone's there.\r\n\r\nThis point-of-view (POV) shot works exceptionally well for the whole movie. Being able to see what the main character is seeing, it's also possible to think what she's thinking and feel what she's feeling. That awkward, frustrating, unnerving, uneasy feeling that something's not right. Then, Whannell proves he knows his film's own weaknesses. When it starts to lose a bit of its entertainment value, and when the audience begins to get used to the long, suspenseful sequences (of which probably half, nothing happens), he hits the narrative with an unexpected, shocking turn of events in the most jaw-dropping way possible.\r\n\r\nThis particular decision got the blood heavily pumping again, and it delivered the energy I needed to be at the edge of my seat until the very end. However, the ending is a tad underwhelming, and maybe a bit over-the-top concerning some character's decisions. I can't really get into spoiler territory, so I'll just write I don't really think that the last scene is very coherent with everything the movie showed until that point. Even though I understand and respect this narrative decision, I don't believe its message is the one the film wanted to transmit. Good performances from the rest of the cast, a few character's decisions are a bit hard to believe, but I don't want to be nitpicky.\r\n\r\nIn the end, The Invisible Man deserves all the hype it's been getting. Leigh Whannell crafted a genuinely scary and extremely suspenseful horror movie, based on a traumatic real-life situation that a lot of people, unfortunately, go through. Elisabeth Moss delivers an emotionally powerful performance, demonstrating all of her impressive acting abilities which are probably going to be ignored when the awards season comes around (the usual horror genre bias). Incredibly well-written, intelligent screenplay, supported by some terrific camera work by Stefan Duscio. The haunting score from Benjamin Wallfisch is also a standout, especially when it chooses to be completely silent. I'm not a fan of the slightly incoherent ending since some character\/narrative decisions seem hard to believe, and the final message didn't really have the meaning it should. Nevertheless, it's one of the best films of the year so far, so don't miss it!\r\n\r\nRating: A-","id":"5e5e6a7787e63e001a75dc1b","url":"https:\/\/www.themoviedb.org\/review\/5e5e6a7787e63e001a75dc1b","movie_id":570670}
{"author":"Louisa Moore - Screen Zealots","content":"It seems that you can teach an old dog new tricks, at least when it comes to classic Universal monster movies. Writer \/ director Leigh Whannell‘s suspenseful reboot and reimagining of “The Invisible Man” is smart, well-acted, and full of thrills. It’s a surprisingly fresh take on dated source material.\r\n\r\nCecilia (Elisabeth Moss) is trapped in a violent, controlling relationship with her wealthy scientist husband Adrian (Oliver Jackson-Cohen). After drugging him one night, the terrified woman escapes and disappears, hiding at a policeman friend’s (Aldis Hodge) house. Overcome with loneliness, Adrian commits suicide — but Cecilia suspects his death is a hoax. After a series of creepy coincidences that eventually turn lethal, Cecilia’s sanity begins to unravel as she tries desperately to prove she’s being haunted and hunted by an invisible force that happens to be her departed ex.\r\n\r\nBy telling the story from the woman’s point of view, Whannell has given the film a contemporary feminist spin that makes it all the more haunting and effective. It’s scary because the details of mental abuse by a partner feels so real, as the manipulation and controlling behavior feeds Cecilia’s paranoia. It’s one of the more chilling horror films (or rather, monster movies) that’s come along in quite a while.\r\n\r\nMoss makes her performance look effortless as she wrestles with an empty corner of a room or throws punches into the air. Casting a talented actor in the lead role makes all the difference and prevents this from becoming just another hokey Blumhouse production.\r\n\r\nAlthough serious themes like domestic abuse and mental illness are tackled in an honest way, “The Invisible Man” is so entertaining because it achieves the right mix of terror and female empowerment.","id":"5e7d5b6cf794ad0015ef2d2d","url":"https:\/\/www.themoviedb.org\/review\/5e7d5b6cf794ad0015ef2d2d","movie_id":570670}
{"author":"flagpoonage","content":"Terrible Movie!","id":"5ead3fa760c51d002091def9","url":"https:\/\/www.themoviedb.org\/review\/5ead3fa760c51d002091def9","movie_id":560044}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nIt's a brand new year, which means January gets to be the traditional \"trash month\" once again. In Portugal, it's actually one of the best months of the year since all of the Oscar-contender films are released (late) during these first few weeks. However, it still contains the formulaic action and\/or horror movies. The Grudge, a reboot of a remake (because why not?), is the most recent addition to the group of horror flicks that no one really understands why they were produced.\r\n\r\nI was never a fan of the film series, so obviously, I wasn't expecting much from a reboot of a franchise that always looked like a lazily cheap way of filming a few jump scare sequences with no remarkable storytelling. Nicolas Pesce shows some hints of talent regarding his filmmaking skills with some efficiently suspenseful scenes, but the aspect to blame in this type of movies is always the same: screenplay. I can't remember the last film I saw that treated the audience like the dumbest people alive. It truly becomes disrespectful. It's like the producers thought that the target audience for a horror flick was 5-year-old children.\r\n\r\nIt reaches a point where the movie itself feels like it's being very intelligent in the way it shares plot information. It creates this tense build-up, filled with characters almost dropping a big twist, and then... it's something so evident since the first few minutes of the film. This process repeats throughout the entire runtime. \"Here comes a big twist! Are you ready? Watch out! Here it goes... BAM! You didn't saw that coming, did you?!\"\r\n\r\nYes. We did. Everyone did. Even the theater supervisor who only shows up for a couple of seconds each half an hour was able to figure out everything that was happening. During the screening, I didn't know if I should laugh due to the ridiculously explicit plot points or if I should be frustrated for being treated like I was totally brainless. Everything about The Grudge feels painfully obvious. I try my best not to think too far ahead. I try not to predict what's going to occur or when a jump scare is going to happen. But this movie is so incredibly generic that I couldn't avoid knowing everything instinctively.\r\n\r\nStory-wise or jump scares, it doesn't matter. Everything that Pesce tries to do, it's surrounded by such an aura of predictability that makes this horror film extremely dull. I mean, that's one of the worst feelings one can have while watching a horror movie, right? How can someone feel bored by a film constantly throwing jump scares and \"massive\" plot points every five minutes? Well, The Grudge was able to accomplish this miracle.\r\n\r\nI don't know why The Grudge, as a film series, continues to exist. The first installment, which was itself a remake of the Japanese original, was a surprising box office success. Still, the majority of the audience and critics didn't really like the movie. The consequent theater releases were a disappointment. So, let's do a reboot of the remake, right? Nicolas Pesce seems to be a great filmmaker, he's able to easily generate tension and a dark environment, but such a huge misstep like this can hurt his career. The talented cast tries their best to bring this film to safe harbor, but the absurdly obvious, generic, formulaic, cliche story sunk the movie pretty hard. Its lack of surprising features, the extremely predictable jump scares, and the complete disregard for the audience, treating the viewers like the dumbest people ever, make The Grudge one of the worst horror films of the last few years.\r\n\r\nRating: D","id":"5e1614f266565a00160fc685","url":"https:\/\/www.themoviedb.org\/review\/5e1614f266565a00160fc685","movie_id":465086}
{"author":"Stephen Campbell","content":"**_Starts brilliantly but ultimately undermines itself with plot contrivances and genre foolishness_**\r\n\r\n>_I went over the heads of the things a man reckons desirable. No doubt invisibility made it possible to get them, but it made it impossible to enjoy them when they are got._\r\n\r\n- H.G. Wells; _The Invisible Man_ (1897)\r\n\r\nH.G. Wells's original _The Invisible Man_ (1897) suggests that rather than something as powerful as invisibility being used for the betterment of mankind, it would instead be used to fulfil private desires, ultimately leading to the moral corruption of otherwise good men. In probably the best cinematic adaptation, Paul Verhoeven's _Hollow Man_ (2000), this is taken much further, with the suggestion that the results of invisibility would be nothing less than sexual violence, evil, and madness. However, despite the centrality of this theme in the core story, reframing the template as a modern tale of domestic abuse and PTSD, as happens in this latest adaptation, is a fascinating idea. Reorienting the narrative so it no longer focuses on the male scientist but on a female victim of his machinations creates the potential for some timely #MeToo social commentary, particularly as it relates to issues of not believing women who accuse powerful men of gaslighting. But potential only gets you so far, and what could have been a really insightful film eventually proves itself relatively incapable of using issues of domestic abuse as anything other than plot points to get from one predictable scare to the next. It tries to have its cake and eat it – it wants to be an allegory for the problems women face leaving abusive relationships but it also wants to be an effective monster movie. And, ultimately, it ends up as neither.\r\n\r\nThe film begins as Cecilia Kass (Elisabeth Moss) is putting into motion a plan to leave her domineering and abusive boyfriend, Adrian Griffin (Oliver Jackson-Cohen), a wealthy pioneer in optics. Having drugged him, she leaves their high-tech home in the middle of the night and is picked up nearby by her sister Emily (Harriet Dyer), who takes her to stay with their childhood friend, James Lanier (Aldis Hodge), a policeman living with his daughter Sydney (Storm Reid). Although assured that Adrian can't find her, Cecilia is clearly suffering from agoraphobia and paranoia. That is until Adrian commits suicide. Contacted by his brother Tom (Michael Dorman), who's handling his estate, Cecilia learns that Adrian has left her $5 million. However, despite her best efforts to move on, she just can't shake the feeling that Adrian is still around, watching her, sometimes even in the same room as her. And the surer she becomes that he's not dead, the more everyone else becomes worried about her mental well-being.\r\n\r\nWritten and directed by Leigh Whannell (co-creator of the _Saw_ franchise and creator of the _Insidious_ franchise), this latest adaptation of Wells's original is not actually about the invisible man. Indeed, short of a background shot of him lying in bed, a shot showing only his torso as he runs through a forest, and a close-up of his hand, actor Oliver Jackson-Cohen doesn't even appear on screen prior to his apparent suicide. Adrian is not only the invisible man of the plot, so too is his character ideologically invisible. Which makes its own statement, and it's a statement worth making – men like him don't need to be present to continue to cause harm; years of abuse will carry on their work even if they're no longer around. In this sense, at least initially, the film is more concerned with the fear Adrian has instilled in Cecilia; in the early stages, Cecilia's main enemy isn't Adrian so much her inability to move on from him. Along the same lines, the film looks at issues of how women who accuse powerful men of gaslighting are often ignored or openly disbelieved. It is, of course, allegorical insofar as Cecilia isn't claiming that Adrian is just gaslighting her, she's claiming that he's literally turned himself invisible to drive her insane, but some of the best allegory works by exaggeration, and\/or rendering something abstract as something more tangible.\r\n\r\nAesthetically, the film looks terrific. Designed by Alex Holmes (_Wish You Were Here_; _The Babadook_; _The Nightingale_), Adrian's house is a modernist maze of glass, mirrors, sliding panels, and open space, and the ultra-high-tech nerve centre from which he controls his kingdom is one of the film's only overt nods to science fiction (aside from the whole invisibility thing, of course). The real aesthetic strength, however, is the cinematography by Stefan Duscio (_Jungle_; _Upgrade_; _Judy & Punch_), into which is built Cecilia's paranoia. For example, countless scenes involve the camera panning away from her, moving across the room, showing us nothing at all, and then panning back. Ordinarily, this would be textbook unmotivated camera movement, but here it conveys how Cecelia fears there may be something in the corner to which we panned. And now, thanks to that camera pan, so do we. There are also many shots which in another film would be awful framing; isolating Cecilia in the frame and filling up so much of the screen's real-estate with empty negative space. Except, again, in this film, such negative space has an ominousness not applicable to regular thrillers. In this way, Whannell can instil fear and dread simply by pointing the camera at an empty room without the need for any FX, VFX, makeup, elaborate props etc (which no doubt played a significant role in keeping the budget down to a minuscule $7 million). And I'd be remiss if I didn't mention Moss's performance, which is excellent, especially given that so much of it is her on her own reacting to nothing whatsoever, having to communicate confusion, fear, anger etc through little more than her expression.\r\n\r\nBefore talking about why I didn't like the film, however, I want to reiterate that I honestly can't say how much I admire the idea to reconstitute the genre template as a story about domestic violence. And it's an especially timely reconstitution, coming as it does in the era of #MeToo, when so many powerful men, once considered invisible in everything but name, able to perpetrate their crimes with impunity, have been revealed as the monsters they are. So I have no problem with the ideological paradigm shift. My problem is with the execution. \r\n\r\nFor one thing, we know from the get-go that Cecilia isn't imagining things, that Adrian faked his suicide and is now stalking her whilst invisible. This isn't a twist, and the film makes no attempt to hide it. Granted, this is kind of unavoidable given how well-known the property is, but had the film allowed for even a little bit of ambiguity, it could have done wonders for emotional complexity, turning a story about invisibility into a story possibly about mental collapse. This would have effectively placed the audience in the same position as the other characters, doubting Cecilia's state of mind, which would, in turn, have enhanced the potency of the socio-political allegory. Another thing that bothered me is that in a film so focused on surveillance and privacy, there are several scenes where if there is even one functioning CCTV camera, the movie ends. A pivotal scene in a restaurant is an especially egregious example of this – one grainy image from a camera, and Cecilia can prove she's not going nuts and the whole plot unravels. Also, if you were so convinced that you were being stalked by someone invisible, might it not occur to you to invest in a pair of IR glasses for a few hundred bucks on Amazon? Just a thought.\r\n\r\nHowever, my biggest problem is that what starts as a fascinating study of the lasting ramifications of domestic violence ultimately descends into genre stupidity, with a ridiculously over-the-top final act that says nothing of interest about anything. True, _Hollow Man_ has a pretty over-the-top final act too, but _Hollow Man_ never saw itself as anything other than a schlocky genre affair, whereas _The Invisible Man_ clearly does. The fact that Whannell ultimately undermines himself in this way, deploying such important themes merely to get him to the gory _dénouement_, is especially frustrating insofar as he genuinely did originally seem to have some interesting things to say. Tied to this is that Adrian is introduced as such an abhorrent character from the start; he's essentially a comic book villain, void of nuance or subtlety. Domestic abusers aren't monotone evil-doers, otherwise everyone would see through then. Oftentimes, they're very charming on the surface, and any film claiming to be a serious examination of this topic would make room to address this.\r\n\r\nAlthough _The Invisible Man_ was very well reviewed and a huge box-office hit, it left me disappointed and frustrated. Initially positioning itself as an insightful allegory for the difficulty victims of domestic abuse have in moving on with their lives even after the abuser is gone, it eventually privileges genre beats and cheap thrills over emotional complexity. Which is a huge shame and a massively missed opportunity.","id":"5e6c52b6a9b9a400149f732d","url":"https:\/\/www.themoviedb.org\/review\/5e6c52b6a9b9a400149f732d","movie_id":570670}
{"author":"JPV852","content":"Decent enough thriller that's not terribly memorable but I did like Blake Lively in the lead and some of the action\/stunts were alright, including the car chase sequence done in a one-shot like take. More or less another time-waster but maybe in a couple of years, willing to revisit. **3.0\/5**","id":"5eb84b48b7d3520022e6e087","url":"https:\/\/www.themoviedb.org\/review\/5eb84b48b7d3520022e6e087","movie_id":466622}
{"author":"jackcarlin18","content":"> **_Review on Horror Focus_**\r\n\r\nDirector Leigh Whannell had a crisp and clear vision when adapting this classic Universal monster The Invisible Man, into a modern re-telling that taps into the relevantly dark dangers of a domestic relationship, exploring such a theme with the upmost intensity and craft. This is a classic horror tale adapted with a contemporary twist, focusing more on the psychological mayhem we're forced to endure, much like our protagonist Cecilia, who's tormented in chilling manners. Already within 2020 this is the sleeper-hit of the year, one that on paper looks a lot more naff than what we are actually presented with.\r\n\r\nMoss is the core of the movie here, playing as the heartbeat of the entire duration. Through Whannell and Moss' talent combined we are forced to endure emotional and brutal intensity, throwing its audiences and main protagonist through nerve-wrecking intensity, tapping into the fear of the unseen that worked so well with the likes of It Follows. \r\n\r\nMoss' performance as Cecilia is superb, as her portrayal of unhinged woman broken from domestic abuse is both unsettling and devastating, already leading to one of strongest female lead performances of the year so far. Whilst the portrayal of constant angst is unforgettable, it's her balanced likability that keeps Cecilia so fascinating, without the character ever compromising her morals or intelligence. A character like this is refreshing to see, especially when they ultimately get their moment to redeems themselves, which she absolutely does.\r\n\r\nImage result for the invisible man 2020\r\nThe most successful element of The Invisible Man is undoubtately the chilling, ice-cold intensity, delivering an unshakable tautness that will have your cage rattles until the closing credits. Whannell's lever use of cinematography with large concrete open spaces and a washed-out colour palette enhances the presence of the Invisible Man himself, allowing paranoia and angst to trickle through bit by bit until it reaches an un-palpable level of tension. Even though we can't see him, his presence is truly unsettling, and once we do, like a bucket of paint to the face, we are then treated to more than a few effective jump scares. Less is more, and The Invisible Man surely capitalises on this, rinsing its novelty for everything its got, for maximum fear factor.\r\n\r\nBehind this creepy facade is an intelligent thriller, that after the half-way mark begins to toy with the narratives origins, often hoodwinking the audience until credits role. There is flare to Whannell's direction here, as some of the themes being juggled around here could very easily have resulted in a cheesy and half-baked result, which to my surprise wasn't the case. In fact, the entire film and premise could have so easily been a disaster, and on paper shouldn't really hold up. To my surprise and probably yours, it's way more effective and haunting than I ever would have given it credit for.\r\n\r\nWith a runtime of nearly two hours, it's surprising how The Invisible Man never feels like it's dragging, nor does it ever let up on the tension. In fact, the movie progressively get more and more unhinged and intense as the movie goes on, and only until the very end do we ever get a second to settle or breathe.\r\n\r\nThis is what great horror movie experiences are about, and like every great horror experience it is easy to forgive and forget its mishaps. Moss' depiction of Cecilia is fantastic, there is no denying that, however it's perhaps the character itself who could have benefited slightly from more depth. More details on exactly what she would have endured or more clarity in her mental decay could have packed a stronger emotional punch overall. In saying this, when we witness her ultimate and long overdue redemption, it is superbly satisfying. Ask the girls who cheered in the audience, they'll agree with me.\r\n\r\n\r\nVERDICT\r\nWelcome to the horror sleeper-hit of 2020. The Invisible Man delivers unpalatable tension like no other, also boasting a stellar cast with slick delivery. Universal Monsters have never looked so good.","id":"5e94951d2cde980014c5e95c","url":"https:\/\/www.themoviedb.org\/review\/5e94951d2cde980014c5e95c","movie_id":570670}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nProduced by the same company that works on the James Bond films, The Rhythm Section went through tough production issues. Blake Lively injured herself on set, consequently delaying the movie until the end of 2019, and then again to the well-known \"trash month\", so obviously, my expectations were quite low. It's the first time I watch a feature film directed by Reed Morano, as well as Mark Burnell, who makes his debut as a screenwriter. As usual, the only thing I knew about the movie was its synopsis and crew, but I also caught the overwhelmingly negative feedback from critics and audiences alike...\r\n\r\nWhile its flaws are undeniable (and I'll get there), I don't find Reed Morano's film to be worthy of belonging in January with so many worse movies. Sean Bobbitt's cinematography is a technical standout, by delivering two fantastic one-take action sequences (one of which is edited to feel like one take), and some wide shots look genuinely stunning. I always love when a film is set in actual cities or remote locations since these offer a realistic atmosphere, and given the right treatment in post-production, the tone can be better controlled by the environment surrounding the characters.\r\n\r\nThe cast is also really good. Blake Lively delivers one of the best performances of her career, definitely the most somber one. Her character is constantly placed in challenging situations, physically and emotionally. Blake incorporates Stephanie's state of mind seamlessly, carrying the narrative forward even when the latter fails to captivate the viewer. Jude Law is Jude Law, and Sterling K. Brown offers a notable display as well. However, the positives end here.\r\n\r\nStory-wise, The Rhythm Section lacks creativity and uniqueness. Besides being way too straightforward and predictable for an action-drama with a central mystery, it's edited (Joan Sobel) in such an uncommon manner that makes the movie feel incredibly tiresome. Tons of moments are drawn out for extra seconds or even minutes. Almost every scene weirdly goes on for far too long. There's no new information to transmit to the viewer, nothing is happening... The whole film is edited like this, consequently ending with almost fifteen\/twenty minutes of nothing. Also, some dialogue scenes are intercut with something that's going to happen after that particular conversation, which is confusing in the sense that the viewer doesn't know where the focus is supposed to be on.\r\n\r\nThen, the actual narrative raises tons of logical questions. I hate to be \"that guy\" who nitpicks character decisions or plot points like CinemaSins (even though this channel makes so for comedy purposes), but this movie really makes the viewer wonder \"how\/why the hell is she able to do this?!\" Stephanie is trained to be an agent, and while a specific part of her training is straight-up impossible, I believe that the character possesses the required skills. My issue is that she barely uses anything that she learned: she continuously runs away from everyone and everything and she gets other innocent people dead in her partially failed missions.\r\n\r\nIn addition to her, there are other characters with either unclear motivations or questionable lifestyles, having in mind that this film deals with secret intelligence, terrorism, and stuff that very few people have access to or knowledge of. The score also feels extremely awkward. Similar to the editing issue, the song selection doesn't fit the dark, depressing tone that the movie carries. Sometimes, Stephanie is about to go on a serious mission, and upbeat pop music is playing... Why?\r\n\r\nAll in all, The Rhythm Section isn't as awful as most January films, it certainly doesn't deserve the record of the worst opening weekend of all-time, but it still carries tons of issues. The editing (Joan Sobel) is weirdly unconventional, drawing out scenes for extra seconds or even minutes where absolutely nothing happens and intercutting dialogue sequences with unnecessary flashbacks or flashforwards. Reed Morano isn't able to bring creativity or anything remotely original to her movie, and Mark Burnell writes a predictable screenplay packed with questionable plot points and logical issues, not helping the already dull pacing. Steve Mazzaro's score doesn't fit the tone of the film, but Sean Bobbitt's cinematography delivers a couple of surprising action sequences and some neat wide shots. The cast is really good, and if not for an outstanding Blake Lively, this movie would have been a lot worse.\r\n\r\nRating: C-","id":"5eb444f4f3e0df001e2b97de","url":"https:\/\/www.themoviedb.org\/review\/5eb444f4f3e0df001e2b97de","movie_id":466622}
{"author":"jackcarlin18","content":"> Review From **_Horror Focus_**\r\n\r\nGaining its momentum back in mid 2019, The Hunt stirred up quite a bit of controversy prior to its initial release, branding it too brutal for release due to the mass shootings in Ohio, Texas last summer. This Blumhouse picture was later rescheduled, and was at one point never to see the light of day, which would have been a crushing blow knowing how relevant this actually turned out to be. Luckily for us, Blumhouse soon caught on and realised movies like The Hunt are exactly what our cruel audience’s need right now, something with a sharp satirical bite with a gut-punching narrative reflective of modern society. Welcome to my favourite horror movie of the past few years.\r\n\r\nImagine a Twitter thread was made into a movie, this is The Hunt. What we have here is a film that functions on the confliction that exists in the real-world between liberals and conservatives, as they take chunks out of each other when discussing politics online, spilling blood on each side as opinions and views are torn to shit by the opposing party. What is depicted is literal death and carnage, which is representative of how the different identities and political views that are one person's beliefs, but another’s infuriating joke.\r\nImage result for the hunt 2020 film\r\nThe beauty here (which is addressed as a massive concern to most reviewers) is the lack of depth to these characters within The Hunt, and to their lifestyle choices and political standpoints. What works best is that it never takes a stance when mocking both sides of the political spectrum, and allows us as an audience to identify which whatever our political views lead us to, even if one side is draped in murderous overtones. I admire how we are left to decide where we would stand, and if what is happening is something we can sympathise with. To most, what I’m saying sounds ridiculous, but this lack of depth to these characters is very much reflective on the current state of our social media, having people who we know nothing about spreading their views which are toxic to half and relatable to others.\r\n\r\nIt’s that online façade that is at play here, as we witness comments and statements daily that tear down others, ruin people’s professional statuses or simply to spread offensive and insensitive comments online to troll others. This is the world we live in, and the characters in The Hunt exist within our real world. The characters within this may not be fleshed out, but to the online profiles with nothing but a name, a picture and a flurry of controversial tweets neither are they, and that certainly looks like modern day humanity to me.\r\n\r\nMuch of The Hunt’s satirical sting comes from its reliance on our current climate and political correctness, which leans on its accurate depiction of society to get its laughs in when it can. It’s understandable that this particular sense of humour might to a little too one-note for some, but it firmly has its own tongue planted in its cheek when openly mocking our current way of thinking, juxtaposing these characters with opposing mind-sets to create a genuinely clever and on-the-nose depiction on humanity’s contemporary views. Aside from the intelligent links to modern society, it’s also really enjoyable and highly entertaining when utilised to its full potential. One could be offended by some of the humour here, but when the film itself jokes on our own generation of snowflakes, it begs the question if The Hunt is pointing the finger at you, and calling you out for being said snowflake. It all really works for me on a sharply pungent level, one that had me tickled pink until the final credits. The Hunt ultimately holds up a darkly comedic mirror up to the political divisions in a way that hasn’t been explored to this stature.\r\nImage result for the hunt 2020\r\nThe action here is outstanding, with the violence being the appropriate level of over the top to match its exuberant premise. Betty Giplin is undeniably outstanding as she delivers a powerhouse of a performance in her portrayal of Crystal, a tough as nails heroine who easily establishes herself in the ranks next to such genre greats as Erin from You’re Next and Alien’s Ripley. Her level of badass is contagiously ferocious, making every scene she’s in an absolute blast to witness. Each fight scene is crafted brilliantly, looking seamlessly effortless with its high-energy intensity, most notably when we reach our final act in which our Million Dollar Baby Hillary Swank comes head-to-head with Giplin, which can only be described as one of the most entertaining fight scenes in recent horror memory.\r\n\r\nNothing is ever fully dripping in suspense, but you soon realise it doesn’t need to be when you’re watching enigmatic fight scenes that are as vicious as they are diverting. The film also works its best when it plays at its most unexpected, knocking familiar faces off like Drew Barrymore in Scream level of unexpected in ways so gleefully gory it will have you laughing with sheer shock. The Hunt may split audiences right down the middle, but there is one thing that is universal, and that’s that Betty Giplin’s Crystal is already this decades best Final Girl.\r\n\r\nVERDICT \r\nProving to be one of the strongest contemporary social and political horror movies in recent memory, The Hunt is a lean, mean, fighting machine that is as sharply satirical as it is viciously violent. Make room for Betty Giplin, our new final girl is in town.\r\n\r\n★★★★★","id":"5e94881eccb15f001371155e","url":"https:\/\/www.themoviedb.org\/review\/5e94881eccb15f001371155e","movie_id":514847}
{"author":"Louisa Moore - Screen Zealots","content":"In 2018, the film world was introduced to exciting new director Carlos López Estrada and his best-of-the-year movie, “Blindspotting.” Expectations for filmmakers as talented as Estrada can feel insurmountable, but “Summertime,” his sophomore feature film, is a wildly successful storytelling experiment of performance art and spoken word poetry. On the surface it sounds like an arduous undertaking, but somehow it turns out to be the epitome of indie cinema: an ego-less artistic collaboration with zero phoniness.\r\n\r\nOver the course of a summer day in Los Angeles, the lives of 25 teenagers intersect. There isn’t much plot to speak of, as a loose narrative weaves all of the stories together. The story is told through spoken-word poetry, all written and performed by the amateur cast (including Tyris Winter, Marquesha Babers, Mila Cuda, Austin Antoine, Gordon Ip, Maia Mayor, and Walter Finnie Jr.). These aren’t actors but artists, and the film a vehicle to share their authentic voices.\r\n\r\nThe cast is appealing with big personalities and even bigger lyrical talents, and their poems are deeply rooted in place and experience. These diverse young artists are all from and live in Los Angeles, and they offer an unfiltered, unpolished, and raw perspective that comes from the soul. It’s deeply meaningful how they interconnect art with their city, and their vibrant voices are ones that the world needs to hear.\r\n\r\nSurprisingly, the movie flows seamlessly and doesn’t feel gimmicky (despite a choppy start and a brief lag in the middle). This experiment could’ve (and likely should’ve) gone the wrong way fast, but somehow all the pieces come together and the cast and crew manages to pull it off. It’s a winning combination of a visionary director paired with young artists speaking their truth, and the film’s flaws make it all the more powerful.\r\n\r\nThe film unmasks the impassioned cries of hope and frustration from a young generation through their urban poetry, and it’s as inspiring as it is complicated. “Summertime” is what effective art is all about.","id":"5e7d590bab1bc70f27c363c2","url":"https:\/\/www.themoviedb.org\/review\/5e7d590bab1bc70f27c363c2","movie_id":653715}
{"author":"Louisa Moore - Screen Zealots","content":"“You wanna hear a story about why me and this b--ch here fell out? It’s kind of long but full of suspense.”\r\n\r\nOn paper (or on an iPhone screen), “Zola” sounds like one of the worst ever ideas for a feature-length film. Based on a real-life Twitter thread between a Hooters waitress and a stripper, this stranger than fiction story played out over social media in 2015 — and damn if it doesn’t make for a wildly original, outrageously entertaining movie.\r\n\r\nZola (Taylour Paige) meets Stefani (Riley Keough) at a restaurant in Detroit, where the two begin chatting about their common interest: pole dancing. Soon after they meet, Stefani invites Zola on a cross-country road trip to Tampa, where they hope to make thousands of dollars dancing in the swanky Florida strip clubs. What starts out as a promising business venture turns into an absolutely crazy (and dangerous) outing with violent pimps, prostitution, attempted suicide, and murder. You have to see it to believe it. It’s crazy.\r\n\r\nThe story is (mostly) true, and writer – director Janicza Bravo focuses on Zola’s side of the story (although Stefani has a chance to present her version in one of the most hilarious bits in the film). You could say it’s all about individual perspective, but Zola is presented as the lone truth teller. Will we ever know the full truth? It’s unlikely.\r\n\r\nThe performances are as sensational as the story, with challenging and risky roles for all of the actors involved. Paige and Keough (in what was my favorite performance at Sundance this year) are particularly fearless as they go all-in on Zola and Stefani, Nicholas Braun is sympathetic as a kind, long-suffering boyfriend, and Colman Domingo is downright frightening as an intimidating, violent pimp. The cast takes the script and runs wild with it, and it works.\r\n\r\nBravo has achieved something incredible here, as she literally takes tweets and has crafted them into a saucy screenplay. The film has an appealing eccentricity to it, and it’s directed with a tongue-in-cheek style that fits the material like a glove. Her attention to detail is stellar, and the look of the film is perfectly matched to its source material.\r\n\r\n“Zola” has a few missteps and feels overly long, but the confidence from Bravo and her cast makes the majority of its flaws disappear. It manages to stay funny, even when things get very, very dark. This is one of those wacky movies that is sure to be talked about, if only for the sheer insanity of the story.","id":"5e7d58706c74b94e95cb3d30","url":"https:\/\/www.themoviedb.org\/review\/5e7d58706c74b94e95cb3d30","movie_id":539565}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nSonic the Hedgehog was one of my Most Anticipated Movies of 2020, not because I expected it to be one of the best films of the year, but due to the controversy that surrounded it. The original design of Sonic was awful, and a lot of people still blame the VFX artists\/animators unfairly. These people work extra hours, they're underpaid, and they were given an impossible schedule to deliver a masterful work. Fortunately, most people now recognize that the studio and all of its execs are the ones to blame.\r\n\r\nThe Internet voiced its opinion in a very polite manner (as usual), but this time, an unprecedented event occurred: the studio actually listened and decided to delay the movie until Sonic received a better treatment visually. Now, I firmly believe that, in any other case, this would be extremely dangerous. I don't think the audience should have this much power over the studios, especially through social media. I mean, if studios changed their films every time people criticized a design or an adaptation decision, movies would be constantly delayed. However…\r\n\r\nIn this particular case, I'm super glad they did it. One question a lot of people might ask is, \"how would this film perform with the old design?\". It would be horrible. There's absolutely no chance of people enjoying this movie with the previous Sonic. This new design not only honors the character's visuals, but it complements the film's tone. Jim Carrey delivers an incredibly cartoonish performance, which would become way too out-of-place if Sonic looked (awfully) real. Having both the hero and villain being\/acting like a cartoon, that awkwardness doesn't exist.\r\n\r\nSonic truly is the best part of the whole thing. If you've played the games and if you carry an emotional connection to this character, there are tons of scenes for you to enjoy. Sonic looks wonderful, sounds fantastic (excellent voice work from Ben Schwartz), and best of all, his personality resembles the videogame character. Everything that's directly Sonic-related is perfectly faithful to the source material, which will definitely please every Sonic fan. That's pretty much my main message: if you're a fan of the little blue guy, I can't imagine anyone being disappointed.\r\n\r\nUnfortunately, he's honestly the only great aspect of the movie. It's really cool to watch Jim Carrey going back to his roots and having so much fun with his role. However, he's very hit-and-miss. When he's condescending someone, he's quite funny, but Carrey's mannerisms don't always work. Still, once again, I believe he's very faithful to the original Dr. Robotnik, who was by no means a \"normal\" person. James Marsden is really good as Tom, but his character never goes beyond \"Sonic's pal\".\r\n\r\nMy main issues are regarding the screenplay. No, I never expected it to be an Oscar-worthy narrative. I just wanted a simple story that allowed Sonic to shine, and in the film's defense, it's indeed a basic plot. However, the sheer abundance of cliches, the lack of any surprises, and the logical questions raised by some narrative decisions are too much to handle, in my opinion. There are three product placement scenes that are some of the laziest, obvious, cringe-worthy examples since the Transformers' movies. It feels like the film stops to have a few commercials.\r\n\r\nSubplots that serve as tension-building during the movie fail to have a resolution by the end. Storylines that were once important are entirely forgotten and never addressed again. Every single character serves as comic-relief, everyone gets to be the \"clown\". I repeat: I never expected a brilliant screenplay. But is it too much to ask the writers to have as much dedication and creativity as the VFX artists who handled Sonic? The latter group worked like crazy to deliver a perfect design. Why can't the writers try harder to offer a more compelling, unique, and rational story?\r\n\r\nThe way Dr. Robotnik comes into play and the level of permission he has to do whatever he desires to is laughable. Everything human-related raises too many eyebrows and rolls too many eyes. I've commented about the film online, and some people addressed me by saying, \"you're overanalyzing \/you're expecting too much from it\". I wholeheartedly understand these observations, I genuinely do. The thing is: I don't believe I'm overthinking, let alone expecting it to be a masterpiece. Why should people simply accept that a movie \"can't be better than what it is\"? Why can't people ask for the potential that a Sonic film has? Why should I be content that it's \"not bad\"?\r\n\r\nI'm completely honest: I wanted to like this movie way more than most people. The whole controversy concerning Sonic's design and the unfair blame that the VFX artists received, left me with an overwhelming desire to absolutely love this film, so I could support the massive work that these people went through. I love everything that's Sonic-related in the movie. His design, voice, and personality are spot-on, and I can't imagine a single fan of the little blue hedgehog being disappointed. However, even with a really good cast and a 90s' Jim Carrey, Sonic the Hedgehog is packed with extreme cliches and narrative decisions that roll too many eyes. Some of the most obvious and cringe-worthy product placement since Michael Bay's Transformers. Characters built from Hollywood's recycling box and side stories are thrown away with no resolution. It's a fun adventure that any family can enjoy on a Sunday afternoon, but I can't lie to myself: I wish it could have been more entertaining and less frustrating story-wise.\r\n\r\nRating: C+","id":"5e89f7656c74b9001597a16f","url":"https:\/\/www.themoviedb.org\/review\/5e89f7656c74b9001597a16f","movie_id":454626}
{"author":"Louisa Moore - Screen Zealots","content":"In what could only be a dead-of-winter miracle in the Upside Down, I just saw an inspired-by a video game movie that wasn’t absolutely terrible. There is nothing about “Sonic the Hedgehog” that seems like it will be watchable, much less actually good, but I’ve been proven wrong by this lively, wacky, and campy family film. There’s oodles of fun to be had here by both adults and kids.\r\n\r\nThis live action adventure comedy is based on the blockbuster SEGA game that centers around a speedy bright blue hedgehog named Sonic. Basing a movie on a flimsy gaming character will be ill-advised at least 95% of the time, but this movie finds the ideal balance between a lively (if basic) original story and well-placed Easter eggs for fans. Here, Sonic (voiced by Ben Schwartz) has a series of misadventures on Earth with his newfound human friend Tom (James Marsden), a small-town police officer. The two have to work together to stop the villainous Dr. Robotnik (Jim Carrey) from capturing Sonic for his evil experiments.\r\n\r\nThe themes of friendship and loneliness are at play, and the cast does a great job keeping things fun. Marsden is ridiculously likable and goofy as an everyman, and Schwartz brings an empathy that carries the majority of the film with his voice performance. Best of all is Carrey, hamming it up with a manic stamina that’ll remind you why you always loved him in the first place.\r\n\r\nThere are plenty of action scenes and rude humor (and a couple of strange, over-the-top scenes that read as advertisements for Olive Garden), which are all entertaining enough to recommend “Sonic” for a fun family night out at the movies.","id":"5e7d5ae7109dec1ebb02fd1c","url":"https:\/\/www.themoviedb.org\/review\/5e7d5ae7109dec1ebb02fd1c","movie_id":454626}
{"author":"teamelitedev","content":"The world needed a hero -- it got a hedgehog. Powered with incredible speed, Sonic embraces his new home on Earth -- until he accidentally knocks out the power grid, sparking the attention of uncool evil genius Dr. Robotnik. Now, it's supervillain vs. supersonic in an all-out race across the globe to stop Robotnik from using Sonic's unique power to achieve world domination.","id":"5e90f04537b3a9001b8b0b8f","url":"https:\/\/www.themoviedb.org\/review\/5e90f04537b3a9001b8b0b8f","movie_id":454626}
{"author":"aardwark69","content":"Jim Carrey as a bad guy... great bad guy, full of zeal for being the worst bad character ever, and not being his usual self. Sonic - the main character is fun, even if his backround story sucks when compared to other characters. Still, it is fun, full of energy, and a good movie to share with kids.","id":"5e911f08180dea0011163b63","url":"https:\/\/www.themoviedb.org\/review\/5e911f08180dea0011163b63","movie_id":454626}
{"author":"JPV852","content":"Cute, family-friendly, comedy that's entertaining enough and sees Jim Carrey back in whacky, over-the-top form that's been missing the past decade plus it seems, and he works so well in this kind of film. Nothing innovative and the visual effects are hit or miss, however Sonic's design was well done (so thankfully the initial version was scrapped and redone from scratch). **3.5\/5**","id":"5ebd92103d3557001ddc7fc0","url":"https:\/\/www.themoviedb.org\/review\/5ebd92103d3557001ddc7fc0","movie_id":454626}
{"author":"BrandonEvans","content":"GOOD Biblical twist to a sci-fi adventure. Time travel, The Cross & saving lives - Heroes & Villians in scientific revelation","id":"5e33376098f1f10012010384","url":"https:\/\/www.themoviedb.org\/review\/5e33376098f1f10012010384","movie_id":582306}
{"author":"LoganWright","content":"This movie has everything - action, comedy, science fiction, history & a little romance... but most importantly, it has faith. Great message it sends to the audience!","id":"5e34208676eecf00178dac0d","url":"https:\/\/www.themoviedb.org\/review\/5e34208676eecf00178dac0d","movie_id":582306}
{"author":"EricHill","content":"This movie was right on the details in the Bible. I liked how they integrated history, the present, and the future. I enjoyed the action, comedy and drama. Most of all, the \"end\" wasn't changed and Jesus Christ is Risen!","id":"5e33510b4ca67600174eee32","url":"https:\/\/www.themoviedb.org\/review\/5e33510b4ca67600174eee32","movie_id":582306}
{"author":"CharlesTaylor","content":"A wholesome fiction movie with an awesome Christian theme. This has an awesome undertone and is a fun family film with many great themes throughout!","id":"5e344a3b76eecf00158ddce9","url":"https:\/\/www.themoviedb.org\/review\/5e344a3b76eecf00158ddce9","movie_id":582306}
{"author":"JasonAllen1","content":"Fun movie, great energy, and keeps you on the edge of your seat,","id":"5e2b529d688cd00017c7950b","url":"https:\/\/www.themoviedb.org\/review\/5e2b529d688cd00017c7950b","movie_id":582306}
{"author":"BrianLewis","content":"Plot was awesome and entertaining to watch ! Great passage as well Great job!","id":"5e2b39c41685da0017e5bded","url":"https:\/\/www.themoviedb.org\/review\/5e2b39c41685da0017e5bded","movie_id":582306}
{"author":"SamuelSanchez","content":"TIME TRAVEL MOVIES ARE ALWAYS AN INTERESTING AND CHALLENGING ENDEAVOR AND ASSASSIN MANAGES TO SUCCESFULLY INTEGRATE THE CONCERT WITH BIBLICAL THEMES, THE OVERALL CONCEPT IS UNIQUE AND THE FINAL PRODUCT IS CAPTIVATING.","id":"5e333cd7c56d2d001a524c3d","url":"https:\/\/www.themoviedb.org\/review\/5e333cd7c56d2d001a524c3d","movie_id":582306}
{"author":"Justin Lopez","content":"What a unique plot! What other way to create a huge impact in history than to go back to the time of Jesus’ crucifixion? Imagine having the chance to walk amongst the son of God, Himself? What would you do? The storyline certainly gets the viewers’ minds going. Time-traveling has always been a fascination for many, and this movie captures the concept wonderfully. This is one movie where you really need to pay attention and keep up!\r\n Some of the lines in the movie are notable too, where one may question his\/her religious beliefs or the lack thereof. I didn’t think this movie will affect me, but it did. It has a profound way of tapping into your faith in humanity, in God (if you’re religious), and in yourself. Don’t miss the end credits!!!","id":"5e1f90c90102c900113a4dd6","url":"https:\/\/www.themoviedb.org\/review\/5e1f90c90102c900113a4dd6","movie_id":582306}
{"author":"TimothyHall","content":"I really enjoyed this movie. The message is there and it is definitely a different and cool wayof presenting it.","id":"5e2b4c70532acb0019514bb4","url":"https:\/\/www.themoviedb.org\/review\/5e2b4c70532acb0019514bb4","movie_id":582306}
{"author":"1RobertJohnson1","content":"The movie was great! We laughed, we cried, and were on the edge of our seats in suspense!","id":"5e3443f876eecf00158dd382","url":"https:\/\/www.themoviedb.org\/review\/5e3443f876eecf00158dd382","movie_id":582306}
{"author":"RonaldWalker","content":"A wholesome fiction movie with an awesome Christian theme. This has an awesome undertone and is a fun family flm with.... Many great themes throughout","id":"5e2b4249688cd00015c77e59","url":"https:\/\/www.themoviedb.org\/review\/5e2b4249688cd00015c77e59","movie_id":582306}
{"author":"RyanHernandez","content":"This movie was very thought provoking, followed scripture, and showed the grace and mercy of Jesus. It was a rollercoaster ride of emotions and thoroughly enjoyed the movie.","id":"5e33477ac56d2d001a5259d1","url":"https:\/\/www.themoviedb.org\/review\/5e33477ac56d2d001a5259d1","movie_id":582306}
{"author":"EdwardLee","content":"I enjoyed the plot and the story didn't make it feel preachy and I think it will reach many believers and non-believers The plot twists was amazing and had me thinking","id":"5e2b3e911685da0011e560ed","url":"https:\/\/www.themoviedb.org\/review\/5e2b3e911685da0011e560ed","movie_id":582306}
{"author":"MichaelWilliams","content":"I loved the theme of forgiveness and the reminders of God's sovereignty is in everything - even time travel.","id":"5e3446d776eecf00158ddad1","url":"https:\/\/www.themoviedb.org\/review\/5e3446d776eecf00158ddad1","movie_id":582306}
{"author":"BradleyStewart","content":"Thrilling movie with twists and turns to keep you on the edge of your seat, all while pointing towards the gospel. I thoroughly enjoyed it.","id":"5e3426f676eecf00158dbb8c","url":"https:\/\/www.themoviedb.org\/review\/5e3426f676eecf00158dbb8c","movie_id":582306}
{"author":"Justin Lopez","content":"I loved it!","id":"5e34754915376c0017a78f98","url":"https:\/\/www.themoviedb.org\/review\/5e34754915376c0017a78f98","movie_id":582306}
{"author":"KevinRodriguez1","content":"I loved the theme of forgiveness and the reminders of Gods sovereignty in everything - even time travel","id":"5e2b3220688cd00015c76991","url":"https:\/\/www.themoviedb.org\/review\/5e2b3220688cd00015c76991","movie_id":582306}
{"author":"LarryAdams","content":"Very thought provoking. Brings sci-fi and time travel to the Christian context. Shows how God is always in control of history and the world.","id":"5e3331bc0f0da500190eb441","url":"https:\/\/www.themoviedb.org\/review\/5e3331bc0f0da500190eb441","movie_id":582306}
{"author":"Louisa Moore - Screen Zealots","content":"I am absolutely head over heels in love with writer-director Miranda July‘s “Kajillionaire,” a quirky, tender film that explores the longing for human connection wrapped up in a story about a family of down-on-their-luck con artists. The project has July’s signature style all over, and it’s one of the very best works of her career.\r\n\r\nTheresa (Debra Winger) and Robert (Richard Jenkins) are life-long grifters. They’ve trained their only daughter, Old Dolio (Evan Rachel Wood), well. The trio are well-versed in every scam, swindle, and opportunity for thievery, from lifting mail from adjacent post office boxes to demanding a reward for finding “lost” jewelry. While on a mission to defraud a travel insurance company, they meet kind stranger Melanie (Gina Rodriguez), who is intrigued by the family. Melanie casually mentions that she has a crackerjack idea to trick her elderly customers into gifting her valuable antiques, which she can subsequently sell for cash. Desperate for rent money, the family invites Melanie to join them on their next heist, which turns Old Dolio’s world upside down.\r\n\r\nThe story is original, touching, very funny, and it goes places you won’t expect. Wood is fantastic as Old Dolio, a stoic, lonely, and strange young woman who is obsessed with the fact that she was never held as a baby. She longs to be shown affection, and it’s a heartbreaking character that Wood wholly embodies. All of the performances are fantastic, but she stands out.\r\n\r\nThe dry, wry humor is an acquired taste, but if you appreciate July’s previous work, you’ll likely love this. There are moments of greatness (including a beautiful scene about loneliness that takes place in a dying man’s apartment), and heavy themes about learning to love yourself and the joys of friendship and salvation are laid out in non-conventionally delicate but effective ways. I adored every single moment of this film.\r\n\r\nThe story turns from a generic tale of grifters into a lively portrait of self discovery, and it’s beautiful when Old Dolio begins to experience a true connection with Melanie as they devise a plan to free her from a life of petty crime.\r\n\r\n“Kajillionaire” is uplifting and charming, and has a lot of original, insightful things to say about the world we all live in.","id":"5e7d5847109dec1ebb02fc6c","url":"https:\/\/www.themoviedb.org\/review\/5e7d5847109dec1ebb02fc6c","movie_id":541305}
{"author":"yankeesfan","content":"> The boy part 2 is the worst sequel that has ever been made to a movie?","id":"5e536f47f48b340015726b0e","url":"https:\/\/www.themoviedb.org\/review\/5e536f47f48b340015726b0e","movie_id":555974}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nSince Wonder Woman that the DCEU has not missed a beat. Even though the latter is still my favorite of the universe, I have mostly a positive opinion about Justice League, Aquaman, and Shazam! Yes, these are not the greatest comic-book movies of all-time, but I would be lying if I denied that I was entertained. Birds of Prey follows the same path: it's fun, action-heavy, and it boasts a phenomenal cast. It has some issues regarding the actual plot and a few characters, but I'll get there.\r\n\r\nFirst of all, let me get the mandatory compliments to Margot Robbie's performance out of the way. If there's a DC character better than Harley Quinn for Robbie to portray, please let me know, because I think she's absolutely perfect as a lunatic, over-the-top psychiatrist-turned-psychopath. Suicide Squad might be a total mess, but I doubt anyone denies how Robbie fits seamlessly into the Harley persona. From her looks to the way she speaks and from her physical movement to her facial expressions, there's just no better casting.\r\n\r\nShe embodies the whole film's chaotic vibe and even contributes to the (very) colorful set design. However, she's not the only one who delivers a spectacular performance. Jurnee Smollett-Bell offers a surprisingly captivating display as Dinah Lance \/ Black Canary. Even though Harley Quinn is the main character, I found myself caring a lot about Dinah. Her way of living suits the character's personality like a glove, and she's undoubtedly the best-written secondary character of the movie. Unfortunately, I can't say the same about the others, and this is one of my biggest issues.\r\n\r\nIt's a film packed with cliches and attempts of making the characters aware of those cliches, which is also, well, something pretty overused. What's more generic? Having the bad guy telling the hero their masterplan or having the hero stating how the bad guy is incredibly dumb by thinking of doing that? At first, I laughed, and I thought it was funny the way Christina Hodson was avoiding to write straight-up cliche characters by making everyone else aware of the way these talk or move.\r\n\r\nBut the whole \"I know you're cliche, so you can get away with saying or doing cliche things\" only works for a couple of scenes, not an entire movie. This is why I wasn't able to connect with Renee Montoya or care about her narrative at all. Mary Elizabeth Winstead is one of my favorite actresses, but she has the least screentime of the entire cast. I never criticize a film for not giving an actor\/actress I like a more important role (unlike other people, I believe it would be unfair to do so). Still, I do complain if I think a particular character should have been given more screentime, which is the case of Huntress.\r\n\r\nI find her backstory way more exciting and emotionally investing than Rosie Perez's character, but sadly Huntress' personal story serves only as a not-that-surprising third act twist. There are several past-present transitions in the storytelling, most work, but some feel extremely abrupt. Nevertheless, Winstead is outstanding every single time she's on camera! Ewan Mcgregor offers a good performance as the villain, but he leads me to my other major issue: the central plot. Trivia time: a MacGuffin is an object, device, or event necessary to the narrative and the motivation of the characters, but insignificant, unimportant, or irrelevant in itself.\r\n\r\nThe thread that connects every single character is based on one of the most overused MacGuffins ever. Now, don't get me wrong: a MacGuffin is NOT a synonym of bad writing or of a bad plot! It's merely something that leads to nothing. Having in mind that Birds of Prey is a character-driven movie, a plot centered around a MacGuffin is not unusual. As long as every character works, the primary story can simply be a passenger (Quentin Tarantino's Once Upon a Time in Hollywood applies this method). However, in Birds of Prey, not every character has an interesting story...\r\n\r\nBasically, Christina Hodson's screenplay isn't exactly bad, but it isn't great too. Just like the film, it has its ups and downs, and I saved some of the ups for last because I do want to end this review on a positive note. Finally, a DCEU movie where the action isn't overwhelmed with CGI, but with detailed choreography and long takes instead! Thank you, Cathy Yan, for bringing some of the best action sequences in this universe. Even if the third act gets a little sloppy due to the amount of characters, it's still a very satisfying ending. The score beautifully accompanies the action, and the visuals are truly gorgeous to look at. The comedy bits are on-point, I laughed quite often, but my final remark goes to a topic I rarely address...\r\n\r\nBirds of Prey is a filmmaking lesson on how to produce an incredibly diverse movie without it feeling forced or unnatural. Only AFTER leaving the theater, I acknowledged the fact that the cast and characters are from various races, cultures, and have different sexual preferences. Why? Because this film doesn't waste its runtime by having its characters mention how black, white, Latinas, Chinese, gay, or whatever they are. They simply are what they are, and we all have eyes to see them. Congrats to Yan, Hodson, and everyone else who decided to treat the characters as if they're humans like every one of us.\r\n\r\nIn the end, Birds of Prey (and the ridiculously long subtitle) continues DCEU's streak of (at least) good movies since Wonder Woman came out. With a phenomenal cast led by an outstanding Margot Robbie as Harley Quinn, Cathy Yan delivers some of the best action of the entire universe in a genuinely entertaining superhero flick. A colorful, chaotic, and fun vibe is present throughout the whole runtime, as well as a pretty neat score. However, Christina Hodson's screenplay lacks creativity. The main plot revolves around the most overused MacGuffin ever, and some characters are straight-up taken from the book of cliches. It's a generic comic-book film with a formulaic narrative, but one that possesses enough fun and entertainment to overlook the typical story.\r\n\r\nRating: B-","id":"5e3df0ce98f1f100140de70c","url":"https:\/\/www.themoviedb.org\/review\/5e3df0ce98f1f100140de70c","movie_id":495764}
{"author":"Adishake","content":"**Very refreshing and funny**, The movie is very different from like any team-up movie I've ever seen, it will make you forget that it's a superhero movie entirely it feels like it's just a crazy movie with criminal minds all over the city moving quite freely in fancy dress until one scene of Black Canary where you realise yeah you're watching a super-hero movie they gota show their powers. **It's violent and humorous and Margot Robbie's Harley Quinn is Fantastic and I really loved the Crossbow Killer**,\r\nDCEU has come up with really great works since the Justice League (ignoring the Aquaman) and if you're counting the upcoming DCEU movies then you'll see a very great future for DC with Batman, Shazam 2 and Wonder Woman sequel.","id":"5ea0427ddd2589001fd177af","url":"https:\/\/www.themoviedb.org\/review\/5ea0427ddd2589001fd177af","movie_id":495764}
{"author":"TalisBriedis","content":"Garbage.\r\nNothing, and I REALLY MEAN NOTHING good to say about this.","id":"5e6685d2357c0000193a2151","url":"https:\/\/www.themoviedb.org\/review\/5e6685d2357c0000193a2151","movie_id":495764}
{"author":"thetoerag","content":"I am afraid to say,, but after watching Suicide Squad which was pretty good.\r\nThis is a let down and I was looking forward to watching it.\r\nAfter watching this I think if there was a plot\/story behind the movie, I couldn't see it it was all over the place and nothing seemed to follow.\r\nAll I can say about this movie is the Actors\/Actresses were paid to be stupid and not funny, I hoped for better things and got trash.","id":"5e92333dd55e4d001317fb50","url":"https:\/\/www.themoviedb.org\/review\/5e92333dd55e4d001317fb50","movie_id":495764}
{"author":"SWITCH.","content":"'Birds of Prey' its absolute thrill ride. It's unapologetically fun and crude and violent. To quote Saoirse Ronan from 'Little Woman'... \"Women.\"\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-birds-of-prey-im-here-to-report-a-terrible-crime-dc-has-saved-cinema","id":"5e7e783190dde00013a22b50","url":"https:\/\/www.themoviedb.org\/review\/5e7e783190dde00013a22b50","movie_id":495764}
{"author":"kmai01","content":"Pretty good Movie, I did not expect Harvey Quinn can kick ass like that. I can see some guy can be turn off this movie because all women hero team. I find it very entertaining and well made.","id":"5e483ee5676ce20015fddb51","url":"https:\/\/www.themoviedb.org\/review\/5e483ee5676ce20015fddb51","movie_id":495764}
{"author":"Louisa Moore - Screen Zealots","content":"I really dug “Birds of Prey (And the Fantabulous Emancipation of One Harley Quinn)” because it is unlike any movie I’ve seen before. There are the conventional-minded and flashy action scenes that accompany most superhero characters, but this is a violent, R-rated, naughty-joke, potty-mouthed comic book tour de force made for women over 25. It’s a boisterous good time for feminists and girl nerds everywhere.\r\n\r\nThe film is told from the twisted and deliciously sarcastic point of view of Harley Quinn (Margot Robbie), ex-girlfriend of the Joker. When the evil Roman Sionis (Ewan McGregor) puts out a hit on a young petty thief (Ella Jay Basco), the most nefarious villains turn Gotham City upside down looking for her. When Harley crosses paths with Huntress (Mary Elizabeth Winstead), Black Canary (Jurnee Smollett-Bell), and cop Renee Montoya (Rosie Perez), the women learn they have no choice but to team up in order to take Sionis down once and for all.\r\n\r\nThe heartbeat of the film lies in Robbie’s iconic character interpretation of Harley Quinn. She is terrific in making her naughty character with a mean streak easy to love. Harley isn’t exactly a woman you want to emulate, but it sure would be fun to hang out and be friends with her.\r\n\r\nAll of the supporting performances here really are first-rate too. McGregor chews scenery with audacious glee, and his villain is truly terrifying. With the addition of a diverse, kick-ass female supporting cast playing equally bad-ass superheros, the film takes a multicultural feminist slant that thankfully doesn’t seem forced by committee.\r\n\r\n“Birds of Prey” is the type of scrappy mayhem that gives a sparkle of excitement to the mostly bland and boring DCEU. It’s colorful and chaotic, reckless and energetic, and I am surprised that I enjoyed this movie as much as I did. This is a really, really fun spectacle that could bring new fans to the genre.","id":"5e7d5b33109dec213c02b68d","url":"https:\/\/www.themoviedb.org\/review\/5e7d5b33109dec213c02b68d","movie_id":495764}
{"author":"Louisa Moore - Screen Zealots","content":"I left the screening of “Horse Girl” with a deep dissatisfaction, a film that is an odd misstep from director Jeff Baena (“Life After Beth,” “Joshy”). The first half of the film is awkwardly charming, but then it becomes something completely different in the worst possible way. The goodwill earned from the oddball sensibility of the story is derailed when things go in a completely “WTF?!” direction. This is a dark movie that gets weird for no good reason, and it feels like the project becomes a victim of writers (Baena and Alison Brie) who can’t figure out the ending to their story so they take the weird route. It’s lazy, sloppy, and super disappointing.\r\n\r\nThe goofy and sweet Sarah (Brie) has a quiet and fairly simple life. She spends her days working at a crafts store, her afternoons visiting an equestrian center, and her evenings in from of the t.v. watching her favorite supernatural crime show. When her coworker Joan (Molly Shannon) gives her a DNA testing kit for her birthday, it sparks a curiosity about her family history that leads to a pattern of sleepwalking episodes and disturbing dreams. These visions begin to seep into her daily reality, making the fine line Sarah walks between what’s real and what’s fake even more blurred. Is she a clone? Is it the work of extraterrestrials? Or is her family history of paranoid schizophrenia finally starting to affect her?\r\n\r\nThe mystery aspects of the story are interesting, and Baena treats his characters with tenderness and respect. The film is at its best when it presents as a quirky character study and its worst when it becomes too abstract. It isn’t the serious and depressing plot points that ruin the film, but it’s the outlandish finale that honestly makes no sense whatsoever. The ending feels like a slap in the face to those dealing with mental illness as much as it does to the audience.","id":"5e7d57f8109dec1ebb02fc05","url":"https:\/\/www.themoviedb.org\/review\/5e7d57f8109dec1ebb02fc05","movie_id":653601}
{"author":"itsogs","content":"Another action packed movie for fans of  bad boys.","id":"5e8bbac63e09f30012a33ee9","url":"https:\/\/www.themoviedb.org\/review\/5e8bbac63e09f30012a33ee9","movie_id":38700}
{"author":"SWITCH.","content":"The list of what's wrong with 'Bad Boys For Life' is long and varied, but it's not all bad. There were some good lines, and the scenes where Mike and Marcus were together obviously shine in an otherwise dull film. Fans will also go nuts when a character from a previous 'Bad Boys' film makes a return cameo appearance. Look - 'Bad Boys 2' was one of those rare films where the sequel was better than the original, so there were a lot of high hopes riding on #3, especially given the exceptionally long period between drinks. But I'm afraid all those expectations have been crushed, and what's left is a mediocre offering that will go down as the third best 'Bad Boys' film... possibly until 'Bad Boys 4' arrives.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-bad-boys-for-life-whatcha-gonna-do-when-theres-nothing-new","id":"5e1f061b5c071b001663faeb","url":"https:\/\/www.themoviedb.org\/review\/5e1f061b5c071b001663faeb","movie_id":38700}
{"author":"Louisa Moore - Screen Zealots","content":"While audiences are thankfully seeing more female-driven horror films in the movie world, black female horror is even more of an anomaly. That’s why writer \/ director Justin Simien‘s “Bad Hair” is so damn interesting. The story of one woman’s ambition and her (literal) killer weave is an absurd yet astute satire of popular culture with a meaningful message. This is one you’ll be talking about long after the final credits roll.\r\n\r\nSet in Los Angeles circa 1989, Anna (Elle Lorraine) prefers the au naturel look after a traumatic childhood hair accident left her with a burned scalp. She’s a hardworking assistant on a music video show for the Culture television network, but struggles to get a promotion due to the way she looks. When Anna’s supportive boss is fired and a former supermodel (Vanessa Williams) is brought in as a replacement, Anna is scared of being let go and decides to do something about her appearance. She gets a gorgeous new weave and learns her flowing locks may just be the key to success that she was missing — until her hair gets a taste for blood.\r\n\r\nThe hair-raising (snort!) story is cleverly based on fictitious slave myths and superstitions that weave in (pun intended) the idea of mystical African folklore in relation to what the horror of everyday life feels like (including the pain some endure in pursuit of beauty) for black women in America.\r\n\r\n“Bad Hair” is a nontraditional horror film that’s presented in a traditional way. There are jump scares and a silly finale, but Simien blends humor with horror in this campy thriller.\r\n\r\nIt’s also a pensive style of social horror that will likely be more meaningful to women as well as people of color. The film tackles the absurdity in everyday life and in particular, the system of oppression that preys on African-American women the most. The women in the film are tricked into becoming their own oppressors, all in the name of fitting in with what society defines as beautiful.\r\n\r\nThis movie is super smart, brutally honest, sometimes scathing, and highly uncomfortable, but it’s also really funny.","id":"5e7d57c46c74b95757cb3d7b","url":"https:\/\/www.themoviedb.org\/review\/5e7d57c46c74b95757cb3d7b","movie_id":530351}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nI was never a big fan of the Bad Boys films. Firstly, I'm not too fond of Michael Bay as a director (as a producer, he's fine). The way he directs his action sequences is incredibly choppy, filled with questionable CGI, very hard to follow, and we all know his passion for exploding everything. Oh, and I can't forget about the constant product placement (amazing how in a brutal explosion, everything is destroyed except a gorgeous-looking Audi car that remains intact). Secondly, the storytelling always felt extremely generic and unsurprising. So, obviously, my expectations weren't very high…\r\n\r\nMaybe that's why I enjoyed Bad Boys For Life way more than I anticipated. This movie should be a lesson to the Fast and Furious franchise. To make a mindless entertaining action flick, the lighthearted tone has to be well-established from the get-go. Despite the fact that the third act deals with absurd emotional twists worthy of a Mexican soap opera, the screenwriters are able to find just the right amount of harmless fun. I didn't watch a single clip before the film, and ten minutes in, I acknowledged that its goal was to simply be entertaining without taking itself too seriously.\r\n\r\nAdil El Arbi and Bilall Fallah balance the more dramatic family issues with the ludicrous action very well. The latter sequences are much better than Bay's. The car chases, even when containing a few too many cuts, are relatively easy to follow, and they pack that necessary adrenaline rush. There are a few surprising shootouts that are filmed to make them look like one take, which definitely brings something pretty uncommon to this kind of formulaic action movies. Technically, I think both directors did an excellent job, especially considering that this was their debut feature film.\r\n\r\nHowever, the story brings everything down. I believe Mexican soap operas might have better scripts. The dialogue reaches such a cringe-worthy level. Every essential plot information is given either through lazy character interactions or by that magical computer that every generic action movie possesses with which the main characters can basically know everything about everyone at the click of a few buttons. The comedy is quite hit-and-miss to me, a lot of the jokes didn't land, but some did make me chuckle. Overall, the screenplay is as cliche as it could be, and that last shot… I hate it. In the end, it's the cast who saves the boring narrative.\r\n\r\nWill Smith and Martin Lawrence share fantastic chemistry, and their banter is always entertaining to watch, even if it isn't as hilarious as it could be. I liked Lawrence more than Smith, maybe due to the non-action, family comedy bits that worked seamlessly. Nevertheless, it's dumb fun, and it's plainly visible that the actors had a blast shooting this movie. The whole cast transfer the joy that they had on set to the screen, and it's pretty noticeable. Watching Alexander Ludwig (Dorn) outside Vikings is always a pleasure (I so wish that he gets more important roles in the future), and the whole AMMO team (Vannesa Hudgens, Charles Melton, Paola Nunez) is all compelling enough, even if the characters are two-dimensional.\r\n\r\nIt's simple: whether you enjoy the Bad Boys saga or not, this is undoubtedly the best installment of the franchise. If you go to the film theater with basic expectations of having fun, Bad Boys For Life gives you that, so I recommend it. It's a pure popcorn-entertainment action flick with recognizable actors who all share great chemistry. With Michael Bay out of the director helm, Adil El Arbi and Bilall Fallah deliver surprisingly good action sequences, considering this is their debut feature film. The formulaic, cliche, soap opera story is straight-up ridiculous at some points, and it carries such an aura of predictability that when it tries to introduce an emotional twist, it merely becomes absurd. The last shot feels like a call to Hollywood to make more sequels, which sort of ruins the whole \"Bad Boys one last time\" tagline… I'm extremely undecided on which side this review should fall, so I'll base my decision on the answer to the following question: \"Am I going to (want to) see this movie again or another sequel?\" Honestly… no.\r\n\r\nRating: C+","id":"5e2099dc0102c900163d1076","url":"https:\/\/www.themoviedb.org\/review\/5e2099dc0102c900163d1076","movie_id":38700}
{"author":"norin_yous","content":"This is a great movie. I love this movie so much. This movie is my favorite movie forever.","id":"5eb91c57c3514c00205e5aa6","url":"https:\/\/www.themoviedb.org\/review\/5eb91c57c3514c00205e5aa6","movie_id":678314}
{"author":"pakhilp","content":"Good film to watch in malayalam. \r\nLoopholes are there stil worth watching","id":"5ea8737cb7fbbd001c3972c8","url":"https:\/\/www.themoviedb.org\/review\/5ea8737cb7fbbd001c3972c8","movie_id":657593}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nEmma. is Autumn de Wilde's feature film directorial debut, as well as Eleanor Catton's screenwriting debut. I never watched any previous adaptations and period movies aren't exactly \"my thing\". This doesn't mean I can't appreciate them! The Favourite and Little Women are the most recent examples of films belonging to said genre that I absolutely love. The main reason why I felt the need to watch this adaptation was Anya Taylor-Joy's first time as the sole protagonist.\r\n\r\nI genuinely believe she'll become one of the greatest actresses of her generation, along Florence Pugh, Chloë Grace Moretz, Hailee Steinfeld, Kaitlyn Dever, Saoirse Ronan, and a few others. Her performance in this movie is yet another argument to validate my prediction. She's phenomenal as Emma! It took me a while to get used to her voice since she applies a much higher tone than her usual one. Seeing actors doing different accents is pretty common, but changing their voice as Anya does, even if it's a simple modification, it still shows how committed she was to her role.\r\n\r\nAs cliche as it might sound, she carries the whole story on her shoulders. She's the link that connects all storylines and characters. Without her, the film doesn't work, so her display had to be near-perfect. Anya demonstrates her range and emotional ability, as well as a seamless control of the complex and rich script. Most dialogues possess long sentences with sophisticated vocabulary, something only the best actors can deal with effortlessly.\r\n\r\nAnya shines, but her character does too. Emma's arc is quite interesting. Besides being \"handsome, clever and rich\", she has no respect for the poor, manipulates her friend's romantic decisions, and sometimes acts in a very selfish, arrogant manner. Her transformation into a better person is the most captivating arc of the screenplay, but it also demonstrates my main issue with the movie as a whole. Ten minutes in, and I knew everything that was going to happen.\r\n\r\nNow, I always try to avoid thinking too much ahead. But when it comes to relationships between characters, it's all so predictable and obvious to me that I can't help but guess the whole story. The same screenplay trick is used throughout to twist certain relationships, becoming repetitive and a bit dull. I never felt truly invested in the film until the one-hour mark. It's mostly well-paced, but when nothing is surprising, innovative, or creative regarding the overall narrative, there's not that much that can keep me captivated.\r\n\r\nThe first act is a tad confusing, with too many characters getting introduced too fast. Honestly, I just discovered while writing this review that a secondary character is supposed to be blood-related to one of the main ones. Story and characters are the two pillars of any movie. I've always written this. If these two don't work, then everything else crumbles. It's far from collapsing, it's actually very well-structured, but it's like these two pillars are just like thousands of others. There's no distinct characteristic that makes these unique.\r\n\r\nWeirdly enough, I never felt bored. The cast really does a nice job of keeping me entertained by every remarkable performance. Bill Nighy (Mr. Woodhouse) and Miranda Hart (Miss Bates) are quite funny. The costume design is gorgeous besides being extremely important since it actually elevates the story by clearly identifying who's rich and poor. Production and set design are fantastic. Great cinematography (Christopher Blauvelt), and an enjoyable score (Isobel Waller-Bridge and David Schweitzer). Nevertheless, as outstanding as the technical achievements might be, the film still lacks a unique directing style, which is normal, having in mind it's the director's first feature.\r\n\r\nAll in all, Emma. doesn't reach the latest period movies' level like The Favourite or Little Women, but it's a fine start for debutants director Autumn de Wilde and screenwriter Eleanor Catton. Anya Taylor-Joy delivers an exceptional performance as a very well-written Emma Woodhouse, carrying the film on her shoulders until the very end, cementing her place in Hollywood as one of the greatest actresses of her generation. The rest of the cast is also pretty great. The costume design steals the \"technical show\", but the production level in this movie is impressive. However, the narrative lacks surprising elements, making the existence of this new adaptation a bit questionable. Why make another film if there's nothing unique about it? Predictable from the get-go, confusing first act, and very hard to feel invested before the one-hour mark. If you enjoy period comedy-dramas, I recommend it. Otherwise, the two movies mentioned above are probably a better choice...\r\n\r\nRating: C+","id":"5e7775d0cabfe400182258d4","url":"https:\/\/www.themoviedb.org\/review\/5e7775d0cabfe400182258d4","movie_id":556678}
{"author":"SWITCH.","content":"If you doubt the need for another Austen, let this gorgeous film change your mind. Instead of ignoring the offers made to the period film genre by great films like 'Anna Karenina' and <a href=“\/article\/review-the-favourite-a-delicious-work-of-magnificent-insanity“>'The Favourite'<\/a>, 'Emma.' runs with them, finding a new language for approaching the great works of one of the great writers, realising her wit and humour in new and exciting ways while honouring the deep intelligence and generosity within them. I spent the entirety of Autumn de Wilde's wonderful film with the dumbest smile on my face, mixed with peals of laughter and gushing tears of joy. This is how we must approach the great classics - a celebration of what we love about them and an engagement with how they can speak to us here and now. That's how and why they can continue to matter so much.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-emma-a-dazzling-new-adaptation-of-jane-austens-classic","id":"5e44ae0a0c2710001383cb3c","url":"https:\/\/www.themoviedb.org\/review\/5e44ae0a0c2710001383cb3c","movie_id":556678}
{"author":"SierraKiloBravo","content":"Click here for a video version of this review: https:\/\/youtu.be\/5VSDwYyxjsA\r\n\r\n_Extraction_ has just been released on Netflix and stars Chris Hemsworth as Tyler Rake, a former Special Forces soldier who now works as a mercenary. He takes on a high risk job rescuing the kidnapped child of a drug lord. Sounds pretty much like every other action movie doesn't it? Well it kinda is, and it kinda isn't.\r\n\r\nIt is a fairly standard action movie from the point of view of having a simple story, a clichéd hero with a tragic past, lots of fights, car chases, and explosions. But what steps this up somewhat is the quality of the action. This movie was put together by Sam Hargrave and the Russo brothers, who of course all made huge contributions to the Marvel cinematic universe, and are therefore people who understand how to string action sequences together. \r\n\r\nThis experience shows in brilliantly choreographed fight scenes that echo John Wick but which have a more real world feel like Jason Bourne. There’s fights that take place in a single room, others across multiple floors in an apartment block, and others out in the open street. Wherever the action needs to be the film-makers take you there and make you feel like you’re part of the action. \r\n\r\nThis is most evident in a car chase sequence that we paused and rewatched because it was so well put together. Shot to look like one like 15-ish minute take, the camera goes from outside the car to inside the car then out again and around the car and then back in and out the back window, it was excellent. I’ve seen some footage of how they filmed the externals and Hargrave literally strapped himself to the hood of a car to get the shots - a benefit of having a Stunt Co-ordinator as a Director, I guess. The end result was that it just added another level of intensity to an already balls-out sequence. \r\n\r\nSo yeah, this movie is one heck of a ride from start to finish, and while it might be light on story, the real reason to watch it is for its incredible action. ","id":"5eaa1c74945d36001f855c02","url":"https:\/\/www.themoviedb.org\/review\/5eaa1c74945d36001f855c02","movie_id":545609}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nwww.msbreviews.com\r\n\r\nA lot of times, people can’t figure out who was really in control of a particular movie. Was the director truly the person in charge of every creative and technical choice? Were the producers the ones responsible for most of the film? Or was the cast that carried the whole thing? Extraction might be Sam Hargrave’s directorial debut, but he’s been a stunt coordinator in Marvel films, working with the Russo brothers in Captain America: Civil War and Avengers: Endgame. The complexity of each choreography screams their names all the way through.\r\n\r\nNow, I don’t want to take any credit from Hargrave! He has a clear vision of how the film should be like, and he delivers the best Netflix original action movie ever. While it’s true that this last sentence doesn’t really mean that much, it’s genuinely great and far better than every other original action flick distributed by the streaming network. Two key components make Extraction a success: its unbelievable, jaw-dropping action, and Chris Hemsworth’s extraordinary physical (and emotional) performance.\r\n\r\nI’ll start with the actor. Chris Hemsworth is one of the most underrated actors working today. Everyone looks at his portrayal of Thor in the MCU, and think that he can’t do anything else. First of all, Thor is one of the characters that changed the most within that universe. Chris has demonstrated both his dramatic and comedic range interpreting this superhero. However, in Extraction, not only his physical display and stunts are out of this world (he actually does quite a lot of them), but he’s able to slow down and really delve into an emotionally compelling state. Brilliant performance!\r\n\r\nNevertheless, the action steals the show. Joe and Anthony Russo help Sam Hargrave in bringing their Marvel’s experience of having to balance dozens of characters at the same time, and the impressive choreography elevates the film so damn much. During the promotion campaign, people kept talking about a stunning oner (one-take sequence), which Chris Hemsworth himself described as “the most complicated action sequence” he’s ever done… They were not joking nor overselling their movie. It’s genuinely a work of art.\r\n\r\nI was so surprised by those (approximately) twelve minutes that I stopped the film, went back, and watched them again. I believe it’s one of the pros that home viewing has against theaters. Just to be clear, it’s not actually just one take. It’s a collection of long takes “stitched” together to make it seem (and feel) like a oner. However, it doesn’t diminish this incredibly technical achievement in any way, much on the contrary! The long takes are packed with all kinds of action: car chases, shootouts, knife fighting, hand combat, running, jumping, crawling, you name it.\r\n\r\nI’m going to put myself at risk and state that it’s one of the best oners of an action flick in the last few years, especially if we don’t count the two best action sagas of today (Mission: Impossible, John Wick). Throughout the whole runtime, the action is exceptionally filmed. The editing is impeccable, the excitement is always there, and the sense of urgency is never lost. It rarely gets over-the-top, every time our protagonist gets hit, cut, or even shot, it never feels like he should be down and dead. It’s that base of realism inside an action movie that can make it become an outstanding success or a massive fail, and Extraction built a very solid one.\r\n\r\nThis film has all the ingredients of popcorn-entertainment, and I’m confident it will get huge praise from, at least, the general public. However, it’s evident that the Russo brothers and Hargrave didn’t offer the screenplay the same care that they had with the action. Even though it’s a pretty simple premise, the attempts at making secondary characters important or emotionally resonant fail its target completely. Even Tyler Rake gets a pretty cliche backstory that everyone has seen hundreds of times. I struggled to care for a single person or a relationship.\r\n\r\nThe reason behind the whole extraction procedure being due to some drug warlords is so formulaic that it’s honestly becoming annoyingly unimaginative. There isn’t even a logical reason for them to be fighting each other over one’s son. The movie also wraps up by leaving tons of questions unanswered regarding its plot, and with a ridiculous try at either being philosophical or actually ruining the entire thing. Finally, I was never a fan of films starting with a flashforward of the protagonist, especially in this genre. It takes away tension and suspense during the actual movie since the viewer knows the flashforward scene hasn’t happened yet.\r\n\r\nIn the end, Extraction is going to be remembered by its insane action and a fantastic lead performance by Chris Hemsworth. The latter is one of the most underrated actors working today, and he delivers not only a phenomenal physical performance but also an emotionally powerful display. The action is jaw-dropping at every level. The outstanding choreography plus the seamless editing are able to elevate the action into some of the best I’ve seen in the last few years, including a technically mind-blowing oner. The excitement levels are super high throughout the entire runtime, credit not only to the Russo brothers but also to the debutant director Sam Hargrave (who definitely leaves his mark action-wise) in making a great film. However, the focus went all to the action, making the actual story and characters suffer from formulaic storytelling, cliche backstories, and an overall lack of emotional attachment. Still, Extraction is the best Netflix original action movie of its history, so don’t miss it!\r\n\r\nRating: B+","id":"5ea08d8401757f001ed1b460","url":"https:\/\/www.themoviedb.org\/review\/5ea08d8401757f001ed1b460","movie_id":545609}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nA lot of times, people can’t figure out who was really in control of a particular movie. Was the director truly the person in charge of every creative and technical choice? Were the producers the ones responsible for most of the film? Or was the cast that carried the whole thing? Having in mind that Extraction is Sam Hargrave’s directorial debut, I have no doubt that the Russo brothers helped him achieve the spectacular action that this movie possesses. The complexity of each choreography screams Russo all the way through.\r\n\r\nNow, I don’t want to take any credit from Hargrave! He has a clear vision of how the film should be like, and he delivers the best Netflix original action movie ever. While it’s true that this last sentence doesn’t really mean that much, it’s genuinely great and far better than every other original action flick distributed by the streaming network. Two key components make Extraction a success: its unbelievable, jaw-dropping action, and Chris Hemsworth’s extraordinary physical (and emotional) performance.\r\n\r\nI’ll start with the actor. Chris Hemsworth is one of the most underrated actors working today. Everyone looks at his portrayal of Thor in the MCU, and think that he can’t do anything else. First of all, Thor is one of the characters that changed the most within that universe. Chris has demonstrated both his dramatic and comedic range interpreting this superhero. However, in Extraction, not only his physical display and stunts are out of this world (he actually does quite a lot of them), but he’s able to slow down and really delve into an emotionally compelling state. Brilliant performance!\r\n\r\nNevertheless, the action steals the show. Joe and Anthony Russo bring their Marvel’s experience of having to balance dozens of characters at the same time, and the impressive choreography elevates the film so damn much. During the promotion campaign, people kept talking about a stunning oner (one-take sequence), which Chris Hemsworth himself described as “the most complicated action sequence” he’s ever done… They were not joking nor overselling their movie. It’s genuinely a work of art.\r\n\r\nI was so surprised by those (approximately) twelve minutes that I stopped the film, went back, and watched them again. I believe it’s one of the pros that home viewing has against theaters. Just to be clear, it’s not actually just one take. It’s a collection of long takes “stitched” together to make it seem (and feel) like a oner. However, it doesn’t diminish this incredibly technical achievement in any way, much on the contrary! The long takes are packed with all kinds of action: car chases, shootouts, knife fighting, hand combat, running, jumping, crawling, you name it. \r\n\r\nI’m going to put myself at risk and state that it’s one of the best oners of an action flick in the last few years, especially if we don’t count the two best action sagas of today (Mission: Impossible, John Wick). Throughout the whole runtime, the action is exceptionally filmed. The editing is impeccable, the excitement is always there, and the sense of urgency is never lost. It rarely gets over-the-top, every time our protagonist gets hit, cut, or even shot, it never feels like he should be down and dead. It’s that base of realism inside an action movie that can make it become an outstanding success or a massive fail, and Extraction built a very solid one.\r\n\r\nThis film has all the ingredients of popcorn-entertainment, and I’m confident it will get huge praise from, at least, the general public. However, it’s evident that the Russo brothers and Hargrave didn’t offer the screenplay the same care that they had with the action. Even though it’s a pretty simple premise, the attempts at making secondary characters important or emotionally resonant fail its target completely. Even Tyler Rake gets a pretty cliche backstory that everyone has seen hundreds of times. I struggled to care for a single person or a relationship.\r\n\r\nThe reason behind the whole extraction procedure being due to some drug warlords is so formulaic that it’s honestly becoming annoyingly unimaginative. There isn’t even a logical reason for them to be fighting each other over one’s son. The movie also wraps up by leaving tons of questions unanswered regarding its plot, and with a ridiculous try at either being philosophical or actually ruining the entire thing. Finally, I was never a fan of films starting with a flashforward of the protagonist, especially in this genre. It takes away tension and suspense during the actual movie since the viewer knows the flashforward scene hasn’t happened yet.\r\n\r\nIn the end, Extraction is going to be remembered by its insane action and a fantastic lead performance by Chris Hemsworth. The latter is one of the most underrated actors working today, and he delivers not only a phenomenal physical performance but also an emotionally powerful display. The action is jaw-dropping at every level. The outstanding choreography plus the seamless editing are able to elevate the action into some of the best I’ve seen in the last few years, including a technically mind-blowing oner. The excitement levels are super high throughout the entire runtime, credit to the Russo brothers, who definitely helped the debutant Sam Hargrave in making a great film. However, the focus went all to the action, making the actual story and characters suffer from formulaic storytelling, cliche backstories, and an overall lack of emotional attachment. Still, Extraction is the best Netflix original action movie of its history, so don’t miss it!\r\n\r\nRating: B+","id":"5ea061eff1b571001a8f36a4","url":"https:\/\/www.themoviedb.org\/review\/5ea061eff1b571001a8f36a4","movie_id":545609}
{"author":"Louisa Moore - Screen Zealots","content":"Thanks to a recent surge in female-driven horror, the concept of women in genre films no longer feels like a novelty. So when a director chooses to make a scary film that’s centered around the female experience, it better be daring and disruptive. Such is the case with “Run Sweetheart Run,” a wild, twisted tale of female empowerment that is as political as it is terrifying.\r\n\r\nAfter a bad breakup, hardworking single mother Cherie (Ella Balinska) is set up on a blind date with the handsome Ethan (Pilou Asbæk). He’s sophisticated, magnetic, and ever the charmer. When Cherie agrees to return to his house for an after-dinner nightcap, Ethan brutally attacks her. She manages to escape the grasp of this lethal predator, but only temporarily. Alone on the streets of Los Angeles with a torn dress covered in blood and without a cell phone or shoes, bystanders refuse to help because they assume she’s a junkie. But once the police finally arrive, it becomes clear that Ethan is very connected and everyone is against her. Turns out her date is a hunter, and he delights in spending the rest of the evening stalking his female prey.\r\n\r\nWriter – director Shana Feste has created a literal date from hell scenario. Cherie is already creeped out by an unsettling Uber ride on the way to her date, and things get worse from there. It’s a story that will resonate with many women, as Feste accurately captures what many single ladies would deem their worst nightmare. It raises the “what would I do in this situation?” question as the leading lady calls on all of her will, ingenuity, and intellect to survive.\r\n\r\nThis story confronts toxic masculinity head-on like an atomic bomb full of social and political horror. There is a not-so-subtle, chilling commentary about people of color, particularly when it comes to minority women who are assaulted. It’s repeated that “nobody cares” about women like Cherie because people like her don’t matter when they go missing — and their police cases are shuffled to the bottom of the pile.\r\n\r\nThe commentary on rape culture and gender politics is strong too, especially because Ethan is a dominant male who thinks he’s in control. He snarls how he must “keep girls like you in their place,” even blaming Cherie for his predatory behavior because she dressed too sexily for a first date.\r\n\r\nThe end result is violent and bloody, but Feste’s choice not to show the worst of the violence onscreen may disappoint hardcore fans of the genre. But it’s scarier because of what you don’t see than it being necessary to show a man brutally attacking a woman. The sounds alone are chilling, and it’s just as horrifying (if not more so) to hear the attacks rather than witness them.\r\n\r\nThe film takes a sobering walk along patriarchy and gender lines, but it evolves into an empowering tale of a strong, badass heroine who refuses to be a victim and fights back. The story is simple and not particularly memorable, but the themes are where this film shines. Everything, down to the smallest details, are steeped in a deeply critical and political view of modern society. In a moment of blink-or-you’ll-miss-it cleverness, the gritty landscape of L.A. is dotted with inappropriate, sexist billboards that convey the hurdles (and minor horrors) females face in everyday life.\r\n\r\n“Run Sweetheart Run” is a liberating, spirited, and inspiring thriller that will resonate with women everywhere. Power to the people, but especially the ladies.","id":"5e7d5821f794ad0015ef2972","url":"https:\/\/www.themoviedb.org\/review\/5e7d5821f794ad0015ef2972","movie_id":532870}
{"author":"Stephen Campbell","content":"**_A well-made creature-feature; it may not be original, but it is entertaining_**\r\n\r\n>_I cast indeed my net into their sea, and meant to catch good fish; but always did I draw up the head of some ancient God._\r\n\r\n- Friedrich Nietzsche; _Also sprach Zarathustra: Ein Buch für Alle und Keinen_ (1885)\r\n\r\n>_The most merciful thing in the world, I think, is the inability of the human mind to correlate all its contents. We live on a placid island of ignorance in the midst of black seas of infinity, and it was not meant that we should voyage far. The sciences, each straining in its own direction, hav__e hitherto harmed us little; but some day the piecing together of dissociated knowledge will open up such terrifying vistas of reality, and of our frightful position therein, that we shall either go mad from the revelation or flee from the deadly light into the peace and safety of a new dark age._\r\n\r\n- H.P. Lovecraft; _The Call of Cthulhu_ (1926)\r\n\r\nThe last film distributed by 20th Century Fox before they were rebranded as 20th Century Studios by Disney, _Underwater_ was shot in early 2017 for $50 million and then sat on a shelf for over two years. Now that it's finally seeing the light of day, there's a real sense of Disney just wanting to be rid of Fox's clutter, and they either didn't know how to promote it or didn't want to promote it, as the marketing campaign has been next to invisible (and the bland title certainly doesn't help), with the film grossing a paltry $7 million in its opening weekend. From Disney's perspective, of course, releasing it in the January release window makes sense, as it's a period traditionally dominated by duds and cast-offs – films the studios don't care about for one reason or another. A recent high-profile example is _Blackhat_, Michael Mann's underrated 2015 cyber-terrorism drama, which was released with little to no advertising, grossing only $20 million at the North American box office against a $70 million budget. However, much like _Blackhat_, _Underwater_ is considerably better than most January releases. Sure, it's clichéd and predictable, and it shamelessly borrows from a litany of superior genre films, but it's also a very entertaining and enjoyable aquatic creature-feature.\r\n\r\nAt an unspecified point in the future, Tian Industries, the largest drilling company in the world, are attempting to drill into the ocean floor at the bottom of the Mariana Trench, almost seven miles down, with atmospheric pressure over 1,000 times that at sea-level, strong enough to crush a human body so completely that there aren't even any remains. As the film begins, Kepler Station, the crew quarters of Tian's massive drilling rig, is hit by a series of unexplained vibrations, causing a cascading pressure breach. Norah Price (Kristen Stewart) and Rodrigo Nagenda (Mamoudou Athie) are the only ones to escape, sealing off the area so as to slow, but not prevent the inevitable implosion of the whole rig. Heading first to the escape pod dock, they find no pods left, and in the control base, they're unable to contact the surface. Meanwhile, they encounter some other survivors – Cpt. Lucian (Vincent Cassel), Paul Abel (T.J. Miller), Liam Smith (John Gallagher, Jr.), and Emily Havisham (Jessica Fenwick). With their situation grim, Lucien says the only hope they have is to use pressurised suits to walk the one-mile distance to the Roebuck Drilling Station and use the escape pods located there. And so they descend to the dark ocean floor. However, as if their task wasn't daunting enough, they soon discover that they aren't alone.\r\n\r\nWritten by Brian Duffield (_The Babysitter_; _Jane Got a Gun_) and Adam Cozad (_Jack Ryan: Shadow Recruit;_ _The Legend of Tarzan_), and directed by William Eubank (_Love_; _The Signal_), Underwater walks a very fine line between rip-off and homage. The most obvious touchstones, both narratively and aesthetically, are Ridley Scott's _Alien_ (1979) and James Cameron's _The Abyss_ (1989), but one can also see the influence of films such as George P. Cosmatos's _Leviathan_ (1989), Paul W.S. Anderson's _Event Horizon_ (1997), Barry Levinson's _Sphere_ (1998), and Danny Boyle's _Sunshine_ (2007). I even detected a slight nod to Neil Marshall's _The Descent_ (2005). In short, the set-up is your classic \"group of isolated people getting picked off one by one\". When someone as talented as Boyle turns his hand to this template, the result is a near-masterpiece. And although Eubank is most certainly no Boyle, Underwater is a lot better than its lack of advertising, clichéd premise, bland title, and generic trailer suggest.\r\n\r\nSure, it isn't really _about_ much of anything. There's a vague ecological theme that's brought up a couple of times, with Emily talking about how humans have drilled \"_too deep_\" and are now suffering the consequences, but really, it never amounts to anything even half-way substantial. In all fairness though, who would be expecting thematic complexity anyway? You know what you're getting with a film like this, and the best you can hope for is that it looks good and is entertaining. And _Underwater_ is both.\r\n\r\nKicking into high-gear immediately, the film wastes no time whatsoever in getting to the action. The opening scene is the Kepler implosion, and it's a good five minutes before things calm down. In _Alien_, Scott takes his time getting anywhere, introducing us to the aesthetic of the _Nostromo_, then the characters and their relationships and milieu before it all kicks off. In essence, _Underwater_ is the inverse of that, with all hell breaking loose before we know much of anything about anyone. Indeed, the only character we even see, let alone get to know, before the implosion is Norah. I certainly wouldn't want every film to open this way, but it has an undeniable kineticism and appealing volatility, which Eubank does a decent job of maintaining throughout the next 95 minutes.\r\n\r\nAesthetically, there's a lot to like here. Production design is absolutely paramount in films like this (think of how important design elements are in building tension and establishing tone in _Alien_ or _Event Horizon_), and designer Naaman Marshall (_The Visit_; _Don't Breath_; _Stuber_) does a fine job, with the world feeling lived-in and authentic. Making especially good use of tunnels and low ceilings, there's a real sense of claustrophobia, which only lets up, ironically enough, when the characters are outside the safety of the rig and exposed to multiple dangers. This claustrophobia is aided immensely by Dorotka Sapinska's costume design, with the bulky pressurised suits looking like astronaut rigs or something out of the _Gears of War_ video games. Also vitally important to the claustrophobic tone is the photography by the great Bojan Bazelli (_Mr. & Mrs. Smith_; _Pete's Dragon_; _A Cure for Wellness_). During scenes outside, Bazelli often shoots from within the characters' helmets, and even when the characters are inside, he often shoots in tight close-ups, simultaneously anchoring us to their perspectives and heightening the sense of enclosure and pressure (both literal and figurative). When outside, the film uses the limited visibility to its advantage in establishing a tone of ominous danger. Some will probably find these scenes too dark, but I'd argue that that is precisely the point; the characters can't see much of anything, and neither can we.\r\n\r\nElsewhere, obviously inspired by H.P. Lovecraft, particularly Cthulhu, the creature design by Abner Marín (_The Dark Tower_; _The Predator_) is suitably creepy and grotesque. Even the props are impressive, especially when the crew are forced to arm themselves, à la the Dead Space video games, with non-combat industrial tools such as saws and bolt guns. The aesthetic element that really stood out for me, however, was the sound design by Wayne Lemmer (_Kick Ass 2_; _Deadpool_; _Logan_). The implosion scenes are accompanied with some bone-rattling LFE, whilst the ominous ambient sounds of the Kepler are a constant reminder that the station is on its last legs. The scenes outside are equally as impressive, with some excellent use of directional sound as the action shifts location on screen - it's a film that I would imagine will sound incredible on a 7.1.2 Atmos system, particularly at the crossover frequencies.\r\n\r\nIn terms of problems, there's a rather unjustified use of voiceover to bookend things, explaining the moral of the story; it's wholly unnecessary and has the effect of making the film feel like an episode of _The Outer Limits_. There's also next to no characterisation. We learn bits and pieces about Norah and Lucien's backstories, whilst Emily and Liam are dating, but apart from that, the film is peopled by perfunctory cardboard cut-outs with no sense of interiority. Eubank also seems somewhat confused as to whether he's making a disaster movie or a monster movie, with certain scenes and elements suggesting one or the other. However, he never really finds a middle-ground, giving the film a slightly schizophrenic tone.\r\n\r\nAlthough _Underwater_ never manages to rise anywhere near the heights of films such as _Alien_ and _Sunshine_, it deserved better treatment than it received from Fox and Disney. Given the January release, the clichéd setup, the two-year limbo, and the bland title, I wasn't expecting much from this, but I was pleasantly surprised. It won't change your life, but it's an entertaining and well-made creature-feature.","id":"5e51e118be7f3500117333b5","url":"https:\/\/www.themoviedb.org\/review\/5e51e118be7f3500117333b5","movie_id":443791}
{"author":"SWITCH.","content":"Tense and fun, with cool creatures and jump scares that aren't too obnoxious, 'Underwater' is disposable in the long run. But it's also an entertaining and unpretentious true Hollywood B-movie that is worth a visit to the cinema.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-underwater-a-solid-subaquatic-monster-mash","id":"5e23dbd91bf2660014f9f6a9","url":"https:\/\/www.themoviedb.org\/review\/5e23dbd91bf2660014f9f6a9","movie_id":443791}
{"author":"Mex5150","content":"What a terrible movie, I just gave up halfway through. It might have been OK with a decent script, a competent director, and not having a plank of wood in the lead role, but as that's something very different to what we actually got, we'll never know.","id":"5e80f12d498ef90017c91433","url":"https:\/\/www.themoviedb.org\/review\/5e80f12d498ef90017c91433","movie_id":443791}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nI was surprisingly interested in and even optimistic about this movie. Why \"surprisingly\"? Well, first of all, the cast doesn't really have a big name attached to it even though I actually enjoy some of Kristen Stewart's performances (who, like Robert Pattinson, has a few blind haters that haven't seen anything else other than Twilight), as well as a few other actors (Jessica Henwick, particularly). Then, no director or screenwriter caught my attention. William Eubank hasn't done anything exceptional yet. Brian Duffield co-wrote Insurgent (awful) but delivered a surprisingly fun horror screenplay with The Babysitter. Finally, Adam Cozad helped to create some underwhelming narratives (The Legend of Tarzan, Jack Ryan: Shadow Recruit).\r\n\r\nIn addition to this, I'm not in favor of films written by more than two people since these usually disappoint, and... it's a January movie. So, why was I slightly excited to watch Underwater? For the same reason a lot of people probably avoided it: its formulaic horror-thriller story deep at the bottom of the ocean. If a sci-fi film has a premise based on a team that works on a claustrophobic location and some sort of entity \"disrupts\" their job, I'm instantly drawn into these movies. There's something about them that makes me enjoy them more than most people. Usually, this type of film has a low-budget and really requires a talented director who's able to generate genuine tension and suspense.\r\n\r\nUnderwater is 2020's big surprise. January movies are known to be Hollywood's trash bin, so I'm honestly dumbfounded that this film is far from being bad. It's very, very good! The set and production design are impressive, and they help create that isolated, suspenseful atmosphere. The first few minutes are nail-biting. The next twenty minutes are fantastic. The following twenty minutes continue to be a blast of entertainment. I felt continuously surprised by how good the movie actually is. I still can't believe what I just witnessed!\r\n\r\nDon't twist my words, it's not a masterpiece or even a \"great\" film. It still follows a plot-driven narrative that countless other movies did better. It borrows inspiration from Alien, Cloverfield, 20000 Leagues Under the Sea, and every other film involving an alien-like form threatening a crew. Plus, it lacks characterization of pretty much every character. There's no real attempt at deeply developing a single character to make the audience care about it, but this doesn't mean the movie can't succeed. Like I wrote above, there's a whole lot of plot-driven films that went on to be phenomenal.\r\n\r\nThe difference between those and Underwater is that the latter doesn't truly bring anything new to the genre. It just uses the known cliches and executes them really well, which is itself a massive surprise. I can't deny that I had a lot of fun watching this thriller. I expected messy action with way too dark lighting making it impossible to see anything. I received surprisingly visible, well-filmed sequences, packed with tension, tons of panic, and a palpable sense of urgency. There aren't that many moments to breathe and relax.\r\n\r\nThe VFX team and Bojan Bazelli (cinematographer) deserve a lot of credit because the \"aliens\" not only are visually captivating, but they are shown just in the right spots for the exact right amount of time. Underwater doesn't possess a huge budget, so the creatures need to be shown \"in the shadows\" to make them look and feel \"realistic\". It might seem like an obvious technical decision to be made, but its execution it's far from being an easy task, so kudos to everyone that participated in making the monsters a genuinely menacing threat.\r\n\r\nThe cast is excellent. Kristen Stewart continues to break out of the Twilight shell, proving again and again that she's a wonderful actress. Jessica Henwick is pretty great, as well as Vincent Cassel. Everyone delivers fairly decent performances, even T.J. Miller, who portrays the always divisive comic-relief character that will surely be extremely annoying to some, and quite funny to others (I stand in the middle, I think his character is fine).\r\n\r\nIt's definitely a good sci-fi horror-thriller, way better than most January flicks (Underwater is one of the last 20th Century Fox's movies, which probably means that Disney had no clue what to do with it, hence dumping it in the worst month of the year). I just added William Eubank to my list of directors to follow. His commitment to actually make a good film is demonstrated on screen, so I really hope that his movie gains some sort of following when it reaches people's homes.\r\n\r\nUnderwater is 2020's (first) massively positive surprise. A January film far better than most of the month's competition. William Eubank delivers a remarkably well-filmed sci-fi horror-thriller filled with great tension, surprisingly visible (!) action, fantastic production design, and some really captivating VFX work. It's by no means a brilliant movie! It takes inspiration from better films of the same genre, and it follows a straightforward, plot-driven narrative with close to zero character development. It simply uses the known cliches but executes them really well. An underrated cast led by Kristen Stewart offers some notable performances, but it's the claustrophobic atmosphere surrounded by incredibly well-generated suspense that turns this movie into a success. Technically, I still can't believe how surprised I am. I just wish that it had a little bit of more characterization, so I could recommend it even more. As it stands, do watch it at the highest quality when you get the chance.\r\n\r\nRating: B","id":"5e972d7530f79c0014d8b68d","url":"https:\/\/www.themoviedb.org\/review\/5e972d7530f79c0014d8b68d","movie_id":443791}
{"author":"DathBotyTheJedi","content":"I'm so tired of Marky Mark, Jason Statham, Gerald Butler and all those old mfs doing the same \"ex-cop\/cop that takes on the corrupt on his own\" movies. Don't watch this garbage.","id":"5ea7a93c2d1e4000248323c3","url":"https:\/\/www.themoviedb.org\/review\/5ea7a93c2d1e4000248323c3","movie_id":581600}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nAs surprising (and shameful) as it might be, I didn't know the original tale of which the film is based on. Maybe I just couldn't remember because once I learned the story, it did seem familiar. Either way, not knowing anything before-hand is my favorite way of \"preparing\" myself to watch a movie. I was moderately interested in this horror take of Gretel & Hansel, and I was genuinely excited to see Sophia Lillis as the lead actress. I feel very divided about it. It's a super captivating film production-wise, but it lacks some emotionally compelling storytelling, especially in the last third of the narrative.\r\n\r\nFirst of all, Sophia Lillis is excellent as Gretel. I really enjoyed her performances in It and It: Chapter Two, and I knew she had something special. It was a matter of time until she got the right role at the right movie, and Oz Perkins can thank her for carrying most of the story on her shoulders. With a well-balanced display, Lillis beautifully incorporates Gretel's persona, offering a good range of emotions, and proving that she has a future under horror projects.\r\n\r\nGretel's love for her brother is demonstrated both through affection and cold interactions, making their relationship feel less fairytale and more realistic. Sam Leakey is a pleasant surprise as Hansel, considering this is his acting debut. While it's noticeable that he's still green, he didn't annoy me at all, and he actually delivered a couple of great lines. Alice Krige offers a cliche yet weirdly captivating performance as the evil witch.\r\n\r\nNevertheless, it's through its beautiful visuals and addictive original score (very 80s-like) that Gretel & Hansel got me invested until the end. Its production and set design create such an immersive environment, and its score (Robin Coudert) elevates basically every single scene. Galo Olivares' cinematography features an unusual style, but one that easily generates tension and suspense. Technically, it's honestly a fantastic surprise, I was not expecting such a high-level film in these regards.\r\n\r\nHowever, it all comes down to the two main components of every movie: screenplay and characters. Even if Gretel is well-developed, the other characters could have received a bit of more care. The screenplay is the main issue, though. It starts with narration and heavy exposition. Something that takes too much out of the runtime, and it seems partially unnecessary since some of the information is somewhat repeated later on. It also spoils (well, it heavily hints) the connecting dots to the second half's mystery, turning that half too predictable and, to be completely honest, a tad boring.\r\n\r\nThe ending is also underwhelming. By not being able to properly close the narrative, the feeling of disappointment is tricky to avoid. It's one of those films that will definitely divide critics and audiences all around the world. The first group still has the technical aspects that can captivate anyone until the very end. However, audiences simply want to be entertained, and the purposefully slow pacing won't help, so I do understand if this group has an adverse reaction to this adaptation.\r\n\r\nAll in all, Gretel & Hansel is a pretty uncommon horror flick. It possesses technical features worthy of the very best movies of the same genre, but its screenplay lacks creativity and overall quality. A predictable narrative with slow pacing is (almost?) never a good attribute. Nevertheless, Sophia Lillis is an outstanding lead, giving a great performance. Galo Olivares' cinematography is pretty unique, the production and set design make the whole environment very immersive, but it's the addictive score from Robin Coudert that steals the spotlight. Oz Perkins shows excellent directing skills, but a less appealing second half with a disappointing third act doesn't let this film reach its true potential.\r\n\r\nRating: C+","id":"5e502612a93d250013469f0a","url":"https:\/\/www.themoviedb.org\/review\/5e502612a93d250013469f0a","movie_id":542224}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nWe have all watched the Dolittle movies starring Eddie Murphy. I'm not going to lie, I was never a fan of these films. Yes, they're purposefully dumb, innocent, and feature that basic level of comedy. They never annoyed me, but they also never did anything remarkably surprising. 2020's version of the known tale is the first post-MCU role of Robert Downey Jr., it boasts an A-list cast, and… it's one of the worst movies of the year, without a single doubt. A complete disaster in every area of filmmaking.\r\n\r\nI don't even know where to start. Maybe with RDJ since he's the most significant negative surprise. I can't believe such a charismatic and now iconic actor like him could deliver a performance this awful. His Welsh (?) accent is not only a terrible choice character-wise, but I doubt that any children can understand what he's saying. RDJ acts like a baffling caricature of himself, not helping an already flawed film. The voice work from the remaining cast might be the only positive of the whole movie, but the CGI animals are way too unconvincing.\r\n\r\nHowever, as always, the most impactful issues belong to the actual story. Instead of being an entertaining and fun adventure, it's an incredibly boring, nonsensical, structure-less journey into one of the most ridiculous third acts of cinema. Even placing myself in a child's mind, I don't think I would be able to enjoy this mess of a screenplay. Like I wrote above, not even the animals look great…\r\n\r\nCertain characters possess these unknown relationships that the audience is supposed to care about, but no background is given to any of them. Tons of plot points lack a logical explanation. The entire narrative is void of any creativity or uniqueness whatsoever, looking simply like a lazy, unimaginative piece of work. The \"young queen who falls gravely ill\" is just a woman sleeping in bed, not looking ill at all, which proves that not even the makeup department was interested in making an effort.\r\n\r\nBut all of the issues above are nothing compared to the film's climax. I don't want to spoil anything, so I'll just write that I still can't believe what I witnessed. Around ninety minutes of build-up lead to the most shocking, hilarious, utterly absurd moment. The humor is a level below childish. Dozens of fart jokes (including one during the climax), over-the-top reactions, and I don't even know what else. Between Bloodshot, Fantasy Island, and The Grudge… Let the devil come and choose!\r\n\r\nAll in all, Dolittle is a massive fail at all levels. It was meant to be one of the worst movies of the year, and it undoubtedly accomplished this goal. From the surprisingly awful performance from Robert Downey Jr. to one of the most shockingly terrible climaxes in the history of cinema, Stephen Gaghan delivers a structure-less screenplay, filled with nonsensical narrative decisions, and featuring an extremely dull adventure. The CGI animals are far from being remotely impressive, the characters lack personality (bringing an A-list actor doesn't guarantee anything), and the comedy is so astonishingly basic that I doubt kids will laugh at some of the jokes, and they laugh at everything. With a budget of 175M (!!!), it's not understandable how and why a studio would waste this much money on such an obvious flop. The voice work from the cast is good… and it genuinely could have been worse. This is the closest I can get to a positive.\r\n\r\nRating: D-","id":"5e8f5cf9197de4001b05a2fa","url":"https:\/\/www.themoviedb.org\/review\/5e8f5cf9197de4001b05a2fa","movie_id":448119}
{"author":"SWITCH.","content":"Altogether forgettable, 'Downhill' is an avalanche of its own - starting off more than a little rocky, it accelerates towards its destination as it wipes out everything in its path, whitewashing what was there beforehand. This is an adaptation not only unworthy of the original, but unworthy of the cast it enlisted. Just go hunt down 'Force Majeure'.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-downhill-a-slippery-slope-for-julia-louis-dreyfus-and-will-ferrell","id":"5e5de8fa1108a800130b47f9","url":"https:\/\/www.themoviedb.org\/review\/5e5de8fa1108a800130b47f9","movie_id":560391}
{"author":"Peter89Spencer","content":"The dry humour in this film is dryer than dry ice!","id":"5e624596357c00001933ad62","url":"https:\/\/www.themoviedb.org\/review\/5e624596357c00001933ad62","movie_id":560391}
{"author":"Louisa Moore - Screen Zealots","content":"In one of the most mediocre movies so far this year, “Bloodshot” squanders every last positive thing it has going for it. Based on the bestselling sci-fi comic book, the film tells the story of recently killed soldier Ray Garrison (Vin Diesel) who is brought back to life as a super-assassin. Ray has an army of nanotechnology in his veins, making him an outrageously strong, unstoppable force who has the ability to instantly heal any injuries he sustains in combat. When his memories begin to contradict what’s reality and what’s fiction, Ray starts to suspect lead scientist Dr. Harting (Guy Pearce) may have sinister intentions — and he does everything in his superhuman power to stop him.\r\n\r\nThe film lacks enough material for a feature length film, and it feels like the story has been stretched out from the get-go. The plot is far-fetched but interesting, yet the best elements are dismissed in a rushed fashion. The film could’ve gone one of two ways, and it chooses the path of greatest disappointment, which leaves it in this weird limbo. It’s not quite smart enough and not quite dumb enough to work. Like when director Dave Wilson gets the sense that things are lagging, he inserts a not-so-subtle explosion or dick joke to keep things moving along. Yeah, it’s that kind of bad.\r\n\r\nEven the action scenes fall victim to rapid-fire editing that is intended to disguise the bloodless PG-13 action flick. There’s an almost-satisfying extended fight sequence involving elevators and a skyscraper, but it comes late in the film when most audiences will likely have already lost interest. Even worse, there are no consequences because Ray can’t be hurt or killed, and the special effects look like they were created in a couple of hours by a pre-teen boy on the family room laptop.\r\n\r\nDiesel is not a great actor, but that’s never been a job requirement to bring the charismatic, cinematic muscle to the big screen. He’s a perfectly acceptable action star, but here he turns in a laughably bad performance. His poor acting hogs the spotlight, especially when he shares scenes opposite the talented Pearce.\r\n\r\nThis movie is absolute junk that will die a quick death at the box office. Please, audiences: do your part to put “Bloodshot” out of its misery.","id":"5e7d5b7d6c849200146add17","url":"https:\/\/www.themoviedb.org\/review\/5e7d5b7d6c849200146add17","movie_id":338762}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps:\/\/www.msbreviews.com\r\n\r\nFirst of all, no. I've never read the comic book, so I didn't know a single thing about the superhero Bloodshot going in. What I did know was that Jeff Wadlow was in command of the screenplay, and we all know how extremely horrible his latest movies are (Truth or Dare, Fantasy Island). Add Vin Diesel as the protagonist and a first-time director (David S. F. Wilson), it's impossible to have high expectations for such a film, no matter how good the source material is. Maybe it could surprise me and end up being a reasonably decent flick...\r\n\r\nIt didn't. Bloodshot is even worse than I expected. I genuinely thought that the action would be the movie's savior. I didn't watch any trailers, as usual, but I did see an image here and there of that red smoke, as well as a couple of glances at the regenerating CGI. Honestly, it's the most disappointing aspect of the whole film. Simply because it's the only thing I was expecting to be decent, at least. The \"final battle\" has some of the worst CGI of the century, and it goes on for way too long. There's an abundance of shaky-cam, the editing is truly awful at times, a lot of action sequences are barely understandable, and even the slow-motion is overused.\r\n\r\nHowever, the reason why the movie ultimately fails is, once again, due to Wadlow's screenplay (which he co-wrote with Eric Heisserer, but Wadlow is the main one). As always, his narrative is a total mess. Confusing, lacks creativity, raises tons of logical questions, and the real past of Ray Garrison is empty of any explanation. The ending is not only predictable and formulaic, but it also generates even more questions, leaving the viewer frustrated with so many unanswered plot points. David Leitch and Chad Stahelski (both have Deadpool and John Wick in their filmography) left the project right after being hired as the directors... I wonder why?!\r\n\r\nThe first minutes are probably the best of the entire runtime. I mean, excluding a not-sexy-at-all scene featuring Vin Diesel and Talulah Riley (Gina Garrison). That was cringe-worthy. Nevertheless, the story's concept is really captivating, to say the least (or the comic book wouldn't have its remarkable success). It's one of those action flicks that could easily turn into a successful franchise if the people involved in the project are more talented. With this, I transition to another of my main issues: Vin Diesel.\r\n\r\nVery rarely, I negatively criticize an actor's performance. I admit that I'm easily pleased by any cast. If you ask me \"what's an actor\/actress you don't like?\", I would probably be stuck for an answer. Diesel's display is so emotionless that even someone like me can be affected by it. Besides being a rock throughout the whole film, Diesel has this weird habit of TALKING VERY LOUD AND CLEAR, only to instantly lower his volume so much that he's almost whispering. He does this consecutively and repeatedly in almost every dialogue.\r\n\r\nThere's no care for developing a single character, not even the protagonist. Everyone is just a stereotype of some secondary action character: the funny IT guy, the hot girl who develops feelings for the hero, the male teammate who gets jealous that his alpha territory gets invaded, and the \"motivation-less bad guy who's made look like a good guy in the beginning, but we all know who he truly is\"... Literally, the two most talented actors (Toby Kebbell and Talulah Riley) are the ones with the least amount of screentime.\r\n\r\nIn the end, Bloodshot is even worse than I expected. The messy, formulaic, and logically questionable screenplay by Jeff Wadlow and Eric Heisserer is the worst aspect of the movie, but the action is undoubtedly the most disappointing one. The \"final fight\" is one of the worst CGI sequences of the century, and the action throughout the runtime is filled with an uncontrollable shaky-cam, an excess of slow-motion, and some poor editing, making most of these scenes incredibly hard to follow. Vin Diesel delivers as much emotion as a rock, and while the rest of the cast is fine, the characters follow every single stereotype ever written for an action flick. It also doesn't help to put a first-time director in charge of the whole thing, but David S. F. Wilson is far from being the one to blame. Occasionally good action moments and a great concept just barely keep the film breathing. It's one of the worst movies of the year.\r\n\r\nRating: D","id":"5e85f055da10f00014ee8e23","url":"https:\/\/www.themoviedb.org\/review\/5e85f055da10f00014ee8e23","movie_id":338762}
{"author":"SWITCH.","content":"If you're a fan of the video games, stick to them - the visuals and narrative that they deliver are still at a much higher level of sophistication than 'Mortal Kombat Legacy: Scorpion's Revenge'.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps:\/\/www.maketheswitch.com.au\/article\/review-mortal-kombat-legacy-scorpions-revenge-an-animated-gorefest-for-aggressive-preschoolers","id":"5e9aa1d3e22d2800225f1830","url":"https:\/\/www.themoviedb.org\/review\/5e9aa1d3e22d2800225f1830","movie_id":664767}
{"author":"ayaa1977","content":"This was a very entertaining and enjoyable film, filled with funny vignettes and some hilarious jokes and visual gags. Too bad it was all strung together in a weak plot with a bad guy who is non-entity, and surrounded in way too much gratuitous product-placement. The final showdown especially did not make any sense, but it paid off with a surprise and hilarious punchline. The animation is to be commended design-wise and in concept, but of course this kind of art is still in its infancy in the country, therefore we can't expect pristine animation out of the gates. \r\nOverall, I really enjoyed it, and the crowd I was watching it with ate it up, so I wish the filmmakers all the best hoping for a better and a stronger follow-up.","id":"5e1acef9e194b00012b52913","url":"https:\/\/www.themoviedb.org\/review\/5e1acef9e194b00012b52913","movie_id":659676}