{"author":"John Chard","content":"For the first time in my life, I got people respecting me. Please, don't ask me to give it up.\r\n\r\nThe film is based on a real case and is about real people so to that ends it is obviously simple in structure, and nagging away as you watch it is the fact that the ending is never in doubt, it \"is\" all too predictable. However, what made Erin Brockovich the success it was is that the title character is not only interesting but also, importantly, intriguing. A foul mouthed hard bitten, twice divorced mother of three has to fight her corner just to get an honest days pay. It's a fabulous story backed up by a simply incredible performance from Julia Roberts. Here Roberts has let her hair down, puts on a push up bra and a short skirt, she is clearly enjoying the freedom of the role, and the results are real effective.\r\n\r\nI have no doubt that working alongside Albert Finney helped Roberts no ends, but it is her show all the way, and she alone masks over what really is an ordinary film, there is nothing we haven't seen before here, it's just a more modern take on the good versus evil corporate company scenario. It's steadily directed by Steven Soderbergh, emotional scenes are not overstretched to treacle point, and all in all it's good solid story telling. Repeat viewings prove to dilute the uplift factor of the finale, but Roberts' performance certainly holds firm for evermore.\r\n\r\n8\/10 for the film, 10\/10 for Roberts' ballsy show. If only we could have had more of these performances from her.","id":"55b33897925141788b003e49","url":"https:\/\/www.themoviedb.org\/review\/55b33897925141788b003e49","movie_id":462}
{"author":"Gimly","content":"I don't like American Comedies, and I especially don't like Adam Sandler, but for whatever reason, I love _Little Nicky_. Maybe it's A) because I was big into the heavy-metal-heavy Satanic themes when I first saw it at a mere 7 years old, or maybe it's B) because of how young and therefore unrefined my taste was I was when I first saw it, or maybe C) it's just... Actually good?\r\n\r\nAlmost certainly a combination of A and B.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5bb598679251410dc60061ec","url":"https:\/\/www.themoviedb.org\/review\/5bb598679251410dc60061ec","movie_id":9678}
{"author":"Wuchak","content":"***Innovative premise for a 'Dead Teenager Movie,' but the last act isn’t compelling***  \r\n\r\nThis first \"Final Destination\" movie from 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, the Grim Reaper. A group of people escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying those who cheated Death in various creative ways. The opening tragedy in this case is a plane crash; in the second film it's a horrible highway pile-up; in the third it's a roller-coaster mishap and so on.\r\n\r\nI've seen (and own) the first four of the currently five-film franchise, but they all tell the same basic story with different characters and a different location and are all of the same high quality of technical filmmaking. Whether you prefer one or another depends on whether you like the cast and the death sequences (and the locations) because, other than these factors, they're all basically the same.\r\n\r\nThis first one has a quality heroine or 'final girl' in Ali Larter. Amanda Detmer is also on hand as a fellow student while Kristen Cloke plays a freaked-out teacher. They coulda done better showcasing these women IMHO. On the opposite side of the gender spectrum there’s Devon Sawa, Kerr Smith, Seann William Scott and Chad Donella. Their importance to the story is in that order. Meanwhile Tony Todd makes his first of four appearances in the series as a mortician who curiously knows more than he should.\r\n\r\nFor me, what makes these movies kinda dull is the fact that it's impossible to cheat Death. Sure, you can escape it here or there, but Death's been in business for millennia and expertly knows what he's doing. As such, everyone's gonna die except maybe the 'final girl,' who will most certainly die in the sequel.\r\n\r\nThe script began as an X-Files teleplay and, indeed, the movie was made by two veterans of that series. And you can tell due to the basic feel of the movie and the inclusion of two government agents. I’d give “Final Destination” a higher grade because I love the concept, but this one curiously gets dull in the final act (despite all the ‘exciting’ things going on) and they coulda done more with the women.\r\n\r\nThe film runs 1 hour, 37 minutes and was shot in the Vancouver, British Columbia, area (although the events take place around New York City).\r\n\r\nGRADE: B-","id":"5bd89132c3a368213d00e4e6","url":"https:\/\/www.themoviedb.org\/review\/5bd89132c3a368213d00e4e6","movie_id":9532}
{"author":"John Chard","content":"I'll see you soon!\r\n\r\nBefore taking off for Paris, Alex Browning has a vision that the plane is going to explode. Pannicking he gets off the plane and in the mêlée a teacher and a group of his class mates are forced off the flight, the plane goes on to explode in mid air, killing everyone on board. But pretty soon after the disaster strange accidents start to befall those who got off the plane, it seems that death is out to get them.\r\n\r\nWith the number of hugely disappointing teens in peril movies that were made post the success of Wes Craven's hugely successful Scream, it's refreshing to find one that was, well, refreshing. Not purporting to be anything other than a wickedly entertaining piece of horror based nonsense, Final Destination is inventive, funny and above all else, shock laden.\r\n\r\nFrom the opening, and terrifying air crash sequence to the clever and gross way that our protagonists shake hands with the grim reaper, this film is gloriously proud of its horror intent. One peak at the surnames of the characters will tell you just how into their horror roots the makers are here, whilst not a homage movie as such, James Wong and his team clearly know what makes a modern horror picture work.\r\n\r\nIf you find yourself complaining about the writing then you clearly are missing the point of Final Destination's existence, either that or you are in fact dead yourself! Four fun but vastly inferior sequels would follow, but really this is the one to watch, as good a 100 minutes of horror fun as you could wish to have. I dare you not to jump out your seat at least once! 9\/10","id":"55acc12cc3a3682ff40098c3","url":"https:\/\/www.themoviedb.org\/review\/55acc12cc3a3682ff40098c3","movie_id":9532}
{"author":"John Chard","content":"Just because you wear those sergeant's stripes doesn't mean you ain't gonna die.\r\n\r\nTigerland was the name of a U.S. Army training camp located at Fort Polk, Louisiana. Tagged as the second worst part of the Earth, it was a recreation of the Vietnamese jungle and was used to prepare American soldiers for the hellish terrain they were soon to be fighting in. \r\n\r\nDirected by Joel Schumacher, Tigerland stars Colin Farrell as Private Roland Bozz, a reluctant recruit to the war effort who upsets his superiors by having a canny knack for exploiting loop holes in the rule book. However, it's evident that Bozz has leadership qualities, but can the officers convince him he is born to lead? \r\n\r\nBy the time of Tigerland's release, the Vietnam movie had apparently run its course. The announcement that Joel Schumacher was to delve into the conflict for his next movie was met with less than enthusiastic responses. This was after all the director who had not too long prior reduced the once darkly watchable Batman franchise to comedy campy ham overdrive. Alarm bells were further starting to go off when it was revealed that it was to be a short low budget shoot of 28 days, with a cast of unknowns and filmed in grainy 16 millimetre. Yet two things were forgotten by his many detractors. One was that Schumacher had showed himself capable of guiding a young vibrant cast to high levels of watch-ability (The Lost Boys), and two, that he had made Falling Down in the early 90s, thus tricky and darker edged material was not beyond him. \r\n\r\nTigerland is a fine film, there is no actual conflict to observe other than the interactions between Bozz, his fellow squadies and his superiors. This is more boot camp drama than a film about military engagements. But the impact is much the same as our group of young men prepare for a fate that doesn't exactly have favourable odds; their respective reasons for being there in the first place containing varying degrees of bravado or disbelief. To which, much to his initial bemusement, Bozz simultaneously becomes a beacon of hope to many and a figure for revilement. The out-shot of this is that Tigerland winds up an expertly crafted movie, one that is propelled by great acting and one that quietly sneaks up on you and cloaks you in sadness. \r\n\r\nSchumacher is not the sole reason for why the film works so well though, he had some quality help. Ross Klavan and Michael McGruther's screenplay rises above the character clichés that exist in every army training camp based movie. Helped enormously by Klavan drawing on his real life experiences in the army, Tigerland doesn't hurtle towards its climax (a climax that is understated and poignant), it takes its time, characters are formed and with the then unknown Farrell on stupendously bewitching form, it's as engaging as a Vietnam film gets. This in spite of the grim look of the piece as Matthew Libatique's cinematography strips away vibrant colours and uses murky greys and greens to put the viewer right in there with them at boot camp. The look, the feel and the story all pull together nicely, making Tigerland fit to be mentioned in the same breath as those popular Vietnam movies from the previous decades. 8\/10","id":"55abdb1ec3a368648e0060a4","url":"https:\/\/www.themoviedb.org\/review\/55abdb1ec3a368648e0060a4","movie_id":10687}
{"author":"John Chard","content":"You're not yourself today are you?\r\n\r\nClaire and Norman Spencer's marriage starts to fall apart when she believes there is a ghost in the house. Things gather apace when Claire is convinced that the spirit is trying to tell her something. Something that could be too close to home for comfort.\r\n\r\nRobert Zemeckis does Hitchcock? Well yes, the influence is obvious, unashamedly so. But the trouble with that, is having the maestro as a benchmark renders all other modern day attempts as folly. However, casting aside that gargantuan issue, What Lies Beneath is an effective creeper come thriller that boasts star credentials.\r\n\r\nDirected by Zemeckis, formed from an idea by Steven Spielberg (from the story by Sarah Kernochan) and starring Harrison Ford and Michelle Pfeiffer as the fragmenting Spencer's. That's a pretty tidy bunch from which to launch your movie. What follows is a mixture of genuine unease and mystery, red herrings and standard boo jump moments, all of which almost gets lost on a saggy middle section as Zemeckis plays Hitchcock one too many times and loses sight of the supernatural heart of the piece, not helped by Clark Gregg's meandering script I might add. None the less, the picture gets pulled around for the finale as the spooky combines with thriller to produce some quality edge of the seat stuff. But it's only then that you totally realise that the makers here have tried to cram too much in to one film. In eagerness to manipulate the audience for the fine ending (though you probably will have it worked out at the half way point) the film just ends up as being confused as to what it mostly wanted to be.\r\n\r\nPfeiffer is excellent and looks stunning and Ford gives it gusto when the script allows. Support comes from Diana Scarwid, Joe Morton, Miranda Otto and James Remar. The house is suitably eerie with its waterside setting and Alan Silvestri's score is perfectly in tune with the creepy elements of the piece. It's a fine enough film in its own right, regardless of the Hitchcockian homages. It's just that it should have been a far better horror picture than it turned out to be. 7\/10","id":"55a05863925141296e00029c","url":"https:\/\/www.themoviedb.org\/review\/55a05863925141296e00029c","movie_id":2655}
{"author":"Wuchak","content":"***Ghostly happenings in northern Vermont with Ford & Pfeiffer***\r\n\r\nA couple living on Lake Champlain (Harrison Ford & Michelle Pfeiffer) face the empty nest syndrome as the wife experiences increasingly spectral happenings. Diana Scarwid, James Remar and Miranda Otto have peripheral roles. \r\n\r\n\"What Lies Beneath\" (2000) is a Hitchcockian drama\/mystery with a bit o’ horror. It starts by borrowing from \"Rear Window\" (1954), but thankfully veers from there. At a little past the hour mark I was starting to get restless. The story was progressing too slowly with too many doors inexplicably opening. I suppose it didn’t help that Pfeiffer doesn’t trip my trigger, although she’s serviceable (I wouldn’t say I DON’T like her); and Harrison’s character seems unjustifiably gruff and impatient. \r\n\r\nHowever, the Upstate Vermont\/ New York locations are fabulous and a mysterious mood is effectively established. The way things pan out is unexpected, unless you saw the trailer first, which outrageously spoils it. The concluding F\/X sequence is beautiful in a ghostly way and satisfyingly brings closure. What didn’t make sense earlier is elucidated. At the end of the day, the movie’s underwhelming, but not altogether unworthy if you’re in the mode for a flick of this sort.    \r\n  \r\nThe film runs 2 hours, 10 minutes, and was shot in the Lake Champlain region of Vermont\/New York (Burlington, D.A.R. State Park, Waterbury & Westport) with other stuff done in Southern Cal (Los Angeles, Playa Vista & Culver City).\r\n\r\nGRADE: C+\/B-","id":"5e025e0e75110d0018dae407","url":"https:\/\/www.themoviedb.org\/review\/5e025e0e75110d0018dae407","movie_id":2655}
{"author":"John Chard","content":"In Greek mythology, the Titans were greater even than the gods.\r\n\r\nBased on real events in 1971, where T.C. Williams High School, a now hot bed integrated school, becomes a beacon of unification via their mixed race football team.\r\n\r\nAs is normally the case with films of this ilk, it quickly comes to pass that certain artistic licence has been taken with the truth. In reality the issues of race, integration and the near powder-keg atmosphere portrayed in the picture, were long past their worst in Virginia 1971. However, that should in no way detract from the thematics and truthful aspects of this Disney production. As is told in the film, the Titans did have what became known as the perfect season, whilst the bond formed between the black and white members most definitely existed. All told, the film soars high as an inspirational piece, not only for the mixed race community coming together plot's essential being, but in the crucial tale of one Gerry Bertier.\r\n\r\nThat this film urged me to seek out the story of Bertier is a testament to the power of film, regardless of any sort of sentimental prodding from the film makers. It's hoped that this film also prompts newcomers to research further the topics within the story.\r\n\r\nThe cast list is impressive, Denzel Washington and Will Patton find instant chemistry as the head coaches thrust together by outside influences, with both guys beautifully doing credit to the real life friendship that would be born from the situation. Ryan Hurst, Wood Harris, Ethan Suplee, Donald Faison, Kip Pardue, Craig Kirkwood and a pre-fame Ryan Gosling fill out the integrated football team. While two important female family roles are nicely portrayed by Hayden Panettiere and Nicole Ari Parker. The soundtrack is nicely put together, with the core offering of Marvin Gaye and Tammi Terrell's thumping rendition of \"Ain't No Mountain High Enough\" particularly potent and uplifting. \r\n\r\nThough not primarily offering up anything new in the pantheon of race and sport related movies, Remember The Titans does have so much good going for it. It's hard to be picky, even churlish about the little faults (are these actors really the age of high schoolers for example?), so hopefully come the end, after the credits roll, you will be suitably inspired and perhaps a touch more better off for having spent time with this particular football team. 8.5\/10","id":"55be2d45c3a3686539004760","url":"https:\/\/www.themoviedb.org\/review\/55be2d45c3a3686539004760","movie_id":10637}
{"author":"John Chard","content":"Here comes a billion dollar campfire. At least it's good for something.\r\n\r\nThe second of the Mars based box office bombs released in 2000, Red Planet is maybe - just maybe - worth a revisit by some who were irritated by it back on first viewing. Once knowing that this is not going to be some action packed alien movie, that it's a survivalist drama that tips its hat to 1950s sci-fi schlock, that cares about its characters, then there's a decent popcorner experience to be had here. \r\n\r\nThis is not to say it's a genius entry in the sci-fi pantheon, because it's not, the same problems still exist; Terence Stamp is woefully under used (seriously they could have got any low paid character actor to play his role), some things either don't make sense or are left unanswered, and of course it still drags in the middle as the boys chatter away on Mars whilst Carrie Anne-Moss is up at base station fretting and suffering erectus nippleus.\r\n\r\nYet there's fun to be had here, some nutty science marries up with nice photography and splendid set design, and the makers know what sort of picture they want to make. Where Mission to Mars sunk under the weight of its own pretensions - trying to go all elegiac and important, Red Planet nudges and winks and asks you along for the ride. So get on board and take it for what it is, a pretentious free zone with good human drama at the core. 6.5\/10","id":"55880401c3a36837e9006290","url":"https:\/\/www.themoviedb.org\/review\/55880401c3a36837e9006290","movie_id":8870}
{"author":"Wong","content":"Denzel Washington leads the team on a charge until the final whistle in Remember the Titans, a grand and inspirational football film. This Walt Disney classic is a primitive display of adversity and courage. The amount of chemistry from the then-segregated gridiron warriors was remarkable and helped propel this film as a truly great and heartfelt sports movie for every generation to experience. 5\/5","id":"56b4b72692514114eb004e60","url":"https:\/\/www.themoviedb.org\/review\/56b4b72692514114eb004e60","movie_id":10637}
{"author":"John Chard","content":"Shattering expose of the fallible human condition.\r\n\r\nWhat to say about Darren Aronofsky's Requiem for a Dream that hasn't been said already? Without doubt it's a film, that in spite of its high standing on the main movie sites, polarises opinions. It's a film that in simple terms follows four people through their addictions until the shattering denouement, but the journey is made more bleak by offering tantalising snatches of hope, the dreams of the protags offered up as some sort of goals for the addicts to cling on to - only for the narrative to stick in its rusty serrated blade to draw the lifeblood from the hapless hopefuls.\r\n\r\nArononfsky brings a multitude of technical skills to the party that emphasise the emotional discord on show. Standard split-screening is married up with rapid cutting, isolated framing, close ups, long tracking and Snorricam, all of which is sound tracked by Clint Mansell's haunting musical composition. All told it's an assault on all the senses and terrifying with it, boosted no end by Aronofsky getting top performances from his cast of actors. Love it or hate it, it's a film that simply can't be ignored, unsparing cinema produced by a most gifted director. 9\/10","id":"557c9680c3a368632300242e","url":"https:\/\/www.themoviedb.org\/review\/557c9680c3a368632300242e","movie_id":641}
{"author":"Wuchak","content":"***“X-Men” laid the foundation for all the great Superhero flicks to come***  \r\n\r\nI think the X-Men films have been so popular because the X-Men dare to be different. The concept of the X-Men strays far from superhero conventions. If you approach the X-Men films thinking you're getting something akin to Superman, Spider-Man or Batman, forget it.\r\n\r\nThe unique concept of the X-Men is that humanity is starting to evolve to the next level and a small percentage of humans all over the globe are starting to manifest superhuman powers from the mutant \"X\" gene. Two mutant leaders, who are old friends, take totally contrasting positions: Charles Xavier starts a school for mutant youths in upstate New York. His attitude is positive and his goal benign. Eric Lensherr or Magneto, on the other hand, is fed up with the paranoia of non-mutants. He starts a \"Brotherhood of Mutants\" with an attitude of superiority. Unfortunately, power corrupts and absolute power corrupts absolutely.\r\n\r\nYou could say that Xavier takes the approach of Martin Luther King Jr. while Magneto goes the route of Malcolm X, an interesting comparison.\r\n\r\nAlthough everybody has their favorite, I feel all three films in the original trilogy are of the same general quality: \"X-Men\" (2000), \"X2: X-Men United\" (2003) and \"X-Men: The Last Stand\" (2006).\r\n\r\n\"X-Men\" naturally lays the foundation by introducing the principle characters and the plight of the mutants. Wolverine and Rogue are introduced and slowly develop an interesting big brother\/little sister type relationship. They come into contact with both Magneto's Brotherhood and Xavier's school and nobly opt for the latter. Magneto's bunch includes Sabertooth, Toad and Mystique, while Xavier's team includes Cyclops, Jean Grey and Storm, as well as adolescents Iceman and Pyro. Both groups of mutants meet and tussle at Liberty Island in New York Harbor, which is the weakest part of the film, but not bad.\r\n\r\nWhen \"X-Men\" debuted in 2000 it was easily the best comic-to-film adaption since \"Superman\" (1978) and \"Superman II\" (1980). It was the precursor to all the great superhero films that came out in the 2000s and has only lost some of its allure due to the quality of many of those films.\r\n\r\nThe movie runs 1 hour, 44 minutes with several interesting deleted scenes available.\r\n\r\nGRADE: A-","id":"5ba26d0a92514168fb00196d","url":"https:\/\/www.themoviedb.org\/review\/5ba26d0a92514168fb00196d","movie_id":36657}
{"author":"tmdb44006625","content":"X-Men is a milestone in cinema history. Without it being actually good and such a smash success, we wouldn't be enjoying the comic book movie world that rules the box office today.\r\n\r\nThe approach of X-Men was the right one. It told a relevant human story about prejudice, treating the source material respectfully and seriously. It's legacy may be greater than the actual movie, but X-Men is x-cellent!","id":"5c842a16c3a36839d4d28994","url":"https:\/\/www.themoviedb.org\/review\/5c842a16c3a36839d4d28994","movie_id":36657}
{"author":"John Chard","content":"Here's Mel to give the Brits an inaccurate historical thrashing, again... \r\n\r\nThe Patriot is based around one Benjamin Martin, an ex-soldier, who now happily living as a family man finds himself thrust into conflict at the break of the American Revolution.\r\n\r\nHe loves the Brits does Mel Gibson, \"Gallipoli\", \"Braveheart\" and here with \"The Patriot\", see the pattern anyone? As with the aforementioned \"Gallipoli\" and \"Braveheart\", certain liberties have also been taken with events in \"The Patriot\" so as to glossy up for the eager Hollywood contingent. It's not my want to scribble about the facts of Benjamin Martin (Re: Francis Marion), or William Wallace for that matter, information as such is but a mere click away on the world wide web.\r\n\r\nSo casting aside the artistic licence factors, is \"The Patriot\" any good? Well nearly it is -- nearly. Gibson is fine, he shoulders the burden of the film with great gusto and no shortage of emotional depth. It's very easy to accept him as a staunch family man who transforms into a blood thirsty warrior. The problems, acting wise, lay away from Gibbo's central performance. Surrounded by caricature villains (though Jason Isaacs' Tavington is deliciously vile) and underwritten characters (Chris Cooper wasted and Joely Richardson is but a mere prop), Gibson has no choice but to hog the screen. So much so it ultimately turns into a one man star vehicle, which for a costume war epic isn't a great thing really.\r\n\r\nRoland Emmerich (\"Independence Day\" and \"Godzilla\") directs and handles the battle sequences very well, there's lashings of blood as men line up to shoot and dismember one and other. While cannonball's whizz, bang and tear off body parts, it's grim, yet oddly rousing stuff. Not even the overtly flag waving and sloganeering on show can off set the impact of the well constructed battles. There is of course lots of tragedy to be found in the film, and these are some what surprisingly, tenderly handled by Emmerich, but mostly it's via an on song Gibson, who remains one of the few modern day male actors capable of believable grief. All of this is given a John Williams score that suitably flits between rousing and ethereal, and things are further boosted by the sumptuous photography from Caleb Deschanel.\r\n\r\nThere should have been more thought given to the racial (slaves) aspects in the conflict, and this coupled with the bad errors of under developed characters hurts \"The Patriot\" as a filmic exercise, not so as to stop it being entertaining, but more to stop it being a one man show. But as it is, thanks in the main to Gibson, and in spite of the overtly evident faults, it's an above average drama. 6\/10","id":"5e557b46a93d2500174fcd83","url":"https:\/\/www.themoviedb.org\/review\/5e557b46a93d2500174fcd83","movie_id":2024}
{"author":"John Chard","content":"The Casterbridge Claim. \r\n\r\n\"Thy Kingdom come, thy will be done, on earth as it is in heaven\" \r\n\r\nMichael Winterbottom directs what is in essence a Western version of Thomas Hardy's The Mayor of Casterbridge. It's Sierra Nevada, California, 1867 and the pioneer town of Kingdom Come is thriving under the strict but effective rule of Daniel Dillon (Peter Mullan). Dillon came by way of a gold claim many years earlier by way of a trade, the barter? His wife and child. But now the past is about to catch up with him and Kingdom Come could well turn out to be his burning hell... \r\n\r\nRight off the bat it has to be said that The Claim is a difficult film to recommend, even to Western movie lovers. It's deliberately slow and purposely elegiac and ethereal. The literary aspects of the narrative positively sparkle, yet still this doesn't make the story any more vibrant, because Winterbottom and screenplay writer Frank Cottrell Boyce want to keep things in perspective. In a film that is awash with untold beauty, the snowy mountainous landscapes (Calgary standing in for California) stunningly photographed by Alwin H. Küchler, it's perpetually cold and bleak, the ice and snow a constant that marries up with characters who are deliberately hard to like. \r\n\r\nTechnically this is one superior piece of work. Küchler and Winterbottom's panoramas are sublime, the town is strikingly designed by the art department, all wooded angles and smoking chimneys that are magnificently framed by the mountains, while the sound-mix thunders the ears and adds another dimension to the grubby realistic feel. Interior sequences are filmed in low lights, making the lamps spectral in sight, the costume design and the narrative strength of the town whorehouse (which is the fulcrum of proceedings) have a class about them that shines bright in the pantheon of modern era produced Westerns, while Michael Nyman's musical score is evocatively strong. \r\n\r\nThe cast respond well to Winterbottom's requirements, Mullan, Wes Bentley, Sarah Polley, Milla Jovovich and Nastassja Kinski (how nice to see the latter twin euro beauties stripped of make up to show a natural era sexiness) all turn in charismatic and heartfelt performances. Narratively the film is driving towards Dillon's day of reckoning, his shoulders heavy with regret and his soul in desperate need of purging. In the interim we are privy to the lives and loves of the townsfolk, their foibles, faults and fancies, this while the town is alive with the arrival of the railroad company, who it is hoped by Dillon will make Kingdom Come prosper still further... \r\n\r\nUnfair comparisons have been drawn with Robert Altman's McCabe & Mrs. Miller. Yes, this is similar in style and execution, but why not just see it as the perfect companion piece to Altman's movie? Because it is. How about we instead look at the finale? Which draws a favourably thematic link to the brilliant Boetticher\/Scott Western, Ride Lonesome. When push comes to shove, and in honest terms, The Claim is a film that for sure may be hard to love, but it sure as heck fire is a film that is easy to admire. Western fans should see it because they \"will\" take something positive from the experience. 8\/10","id":"55ae5ac09251411e0b00a824","url":"https:\/\/www.themoviedb.org\/review\/55ae5ac09251411e0b00a824","movie_id":44853}
{"author":"Gimly","content":"Either one of the two stories might have been engaging on their own, if they hadn't shown their hand from the very start. A disappointment to know this comes from Kathryn Bigelow.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5937a1669251417f89000fe5","url":"https:\/\/www.themoviedb.org\/review\/5937a1669251417f89000fe5","movie_id":13526}
{"author":"tmdb27219454","content":"If you are a wanna-be, a has-been or a never-have, THIS is the movie for you. Celebrating the Everyman who never got his shot, The Replacements takes the Mediocre and gives them their chance in the spotlight.\r\n\r\nThe movie starts out with the professional football players going on strike, mid-season, to demand even more money to play a kid's game. The league owners decide to finish out the season with whatever players they can acquire (mirroring the 1987 NFL strike). The Washington Sentinels' owner goes a completely different direction by re-hiring one of his old coaches and giving him complete control of the team. Coach McGinty then goes about putting together his Dream Team of Wanna-Be's and Never-Were's who, if the stars aligned just right, might just reach their full potential.\r\n\r\nAn EXCELLENT popcorn movie that would have received 5 stars if there had been more football in the football movie. Nevertheless, it is packed full of great one-liners (He's Wiry) and will have you tossing off non-sequiturs the next day all day long. That'll do pig. That'll do.","id":"5d43a101ea7b0e0012894b30","url":"https:\/\/www.themoviedb.org\/review\/5d43a101ea7b0e0012894b30","movie_id":10393}
{"author":"John Chard","content":"The art of political film making in all its glory.\r\n\r\n\"Communicate with the Soviets? We can't communicate with the Pentagon - and it's just across the goddamn river!\"\r\n\r\nOctober 1962, for 13 days the American government fought to avert a nuclear war when it was discovered that the Soviet Union had deployed nuclear missiles in Cuba. This is that story.\r\n\r\nMany superlatives can be chucked at Thirteen Days, and all are viable. In simple terms it's an intelligent and gripping political thriller, superbly scripted and performed by a cast firing on all cylinders. It's a treat to find a film of this type that educates while it pitches you into a world of political intrigue, to provoke real life thoughts even as the suspense takes a hold. Yes it's talky, of course it is, but these conversations are real and riveting. And while there's not a duff performance in the acting pack, Bruce Greenwood deserves special praise. He is the leader, the fulcrum, there's not a false note by him, JFK becoming the role he was born to play.\r\n\r\nSuperlatives were invented for films like Thirteen Days. Assuredly so. 9.5\/10","id":"55b3409ac3a3682ff40143d5","url":"https:\/\/www.themoviedb.org\/review\/55b3409ac3a3682ff40143d5","movie_id":11973}
{"author":"Erin Taylor","content":"I was actually surprised by this movie... most often a sequel will not live up to the first movie, however, in this case it actually surpassed the previous title. I really enjoyed the storyline, and the cast was excellent. I loved how it showed the way Barney and Fred met the girls, and that it even included the little Alien form the actual Cartoon. A great movie for kids and families!","id":"55702818c3a36801870011e8","url":"https:\/\/www.themoviedb.org\/review\/55702818c3a36801870011e8","movie_id":889}
{"author":"John Chard","content":"Do you believe? \r\n\r\nThere's Only One Jimmy Grimble is a very simple film of whimsy and football, a tale of a young 15 year old Manchester misfit who learns some life lessons when he encounters a strange old homeless dear who gives him a pair of magical old football boots. So yes, boys own fanciful stuff for sure, but it has such a warm heart, is loaded with dry Lancastrian wit, and threaded together with such an affection for the sport and teenage growing pains, that's it's impossible to dislike. The cast list is impressive, with Ray Winstone, Robert Carlyle, Gina McKee, Ben Miller and Jane Lapotaire keeping the ball up for the adults, while in the youngsters half we have Lewis McKenzie as Jimmy scoring well by being naturally uneasy in front of the camera, and Samia Smith has the required charm and feistiness to make the tricky \"girlfriend\" role work very well.\r\n\r\nJimmy Grimble versus The Psychopaths!\r\n\r\nThere's good football action for the footie loving fan, with serious tension filled sequences sitting next to some truly funny ones - anyone who played for their school football team will identify with the \"different\" sort of teams Jimmy and co have to play against. Some of the young characterisations will definitely strike a chord with most British folk who played sport at school. The drama is well played, with director John Hay letting his actors imbue the narrative with the right amount of emotional weight, the soundtrack is contains ideal poundings from bands up North and John De Boorman's cinematography is suitably bleak and beautiful at the requisite junctures.\r\n\r\nIt has flaws for sure, any film fan could pick holes in this without really trying, and familiarity of the sub-genre undoubtedly stops it blooming with freshness. But why gripe? Film achieves its aims, it wants to leave you with a feel good glow and delivers on that promise. High art it's not, perfect British footie pick me up? Indeed. All together now, \"there's only one Jimmy Grimble, one Jimmy Grimble\". 7\/10","id":"5e94d7fe66a7c30016035499","url":"https:\/\/www.themoviedb.org\/review\/5e94d7fe66a7c30016035499","movie_id":1609}
{"author":"John Chard","content":"If you really believe that then you should clone yourself while you're still alive.\r\n\r\nVilified when it was released, one of the small handful of films that came at the end of Arnold Schwarzenegger's film career before he went into politics, The 6th Day, it was argued, was a good cause for Arnold to retire from film. Yet viewing it now on its own chaotic sci-fi terms, it's a surprisingly brisk and enjoyable picture.\r\n\r\nDirected by Roger Spottiswoode, it's a futuristic collage of outrageous set-pieces and thought provoking thematics. Plot has Arnie as an ex-fighter pilot who discovers he has been illegally cloned, and thus he embarks on a mission of carnage and high paced machismo in a bid to get his identity back whilst exposing the evil corporation at the core of such nastiness. So, two Arnie's for the price of one then!\r\n\r\nIt's not a plot that would hold up under close scrutiny, but then is that what we go into a Arnold Schwarzenegger action movie for? Quite. With some nifty surprises, kinetic action and an ending of some considerable chilling substance, The 6th Day is classic popcorn munching fodder. No it's not in the top tier of Arnie movies, and no it's hardly shaking the foundations of sci-fi cinema, but sometimes comfort food sci-fi has its own rewards for an undemanding occasion. 6.5\/10","id":"534983a1c3a3682dd10002cb","url":"https:\/\/www.themoviedb.org\/review\/534983a1c3a3682dd10002cb","movie_id":8452}
{"author":"Gimly","content":"I can't... I can't call _The Cell_ good... But it's artistically spectacular, features one of D'Onofrio's best roles ever, and though it has unoriginal concepts, it uses them in originally thematic ways. I can't call _The Cell_ good... But I can tell you to watch it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5bd2944f0e0a2616d80049a1","url":"https:\/\/www.themoviedb.org\/review\/5bd2944f0e0a2616d80049a1","movie_id":8843}
{"author":"Wuchak","content":"***The beginning and end of a boom town in the Sierra Nevadas***\r\n\r\nDuring the California gold rush of 1849 a desperate man establishes a boom town in the Sierra Nevadas. Eighteen years later his abandoned wife & daughter (Nastassja Kinski & Sarah Polley) ride into town and turn his life (Peter Mullan) upside down. Milla Jovovich plays his singing saloon babe while Wes Bentley is on hand as a surveyor for the railroad that’s coming through.   \r\n\r\n“The Claim” (2000) is a top-of-the-line Western that inexplicably fell through the cracks when it was released. It has similarities to “McCabe & Mrs. Miller” (1971), but with more interesting characters, a more compelling story and spectacular locations, not to mention less focus on a house of ill repute. \r\n\r\nIf you appreciate grim, realistic Westerns like “The Great Silence” (1968), “Bad Company” (1972), “The Missouri Breaks” (1976), “Heaven’s Gate” (1980), “Unforgiven” (1992) and “North Star” (1996), you’ll like this one. It’s as good or, in most cases, better. I should add that it’s not all grim; there are glimmerings of light.    \r\n\r\nThe film runs 2 hours and was shot at Fortress Mountain, Kananaskis Country, Alberta, with the train sequences filmed in Durango and Silverton Narrow Gauge Railroad, Colorado.\r\n\r\nGRADE: A-\/B+","id":"5d585bfcdbf1440015c216cc","url":"https:\/\/www.themoviedb.org\/review\/5d585bfcdbf1440015c216cc","movie_id":44853}
{"author":"zombieakacris","content":"VIVA ROCK VEGAS... VIVA ROCK VEGAS... VIVA.. VIVA... ROCK VEGAS!\r\n\r\nDescription:\r\nIn this live-action prequel to the 1994 comedy hit, the Flintstones and the Rubbles go on a trip to Rock Vegas, where Wilma is pursued by playboy Chip Rockefeller.\r\n\r\nReview:\r\nThe Flintstones in Viva Rock Vegas is a straight to video prequel\/sequel comedy directed by Brian Levant who also directed the first Flintstones film as well as the Arnold Schwarzenegger classic Jingle All The Way. Unfortunately the original cast did not sign on for this sequel so it was recast and turned into a prequel and I have to say I'm a little angry at myself for not seeing it sooner. Aside from the terrible casting the movie itself makes for an interesting story for these beloved characters that equally matches up to the original. Do yourself a favor and watch this one first and then the original and relive some childhood memories.","id":"5dd0f04fb76cbb00117ad2a6","url":"https:\/\/www.themoviedb.org\/review\/5dd0f04fb76cbb00117ad2a6","movie_id":889}
{"author":"Kewl Kat","content":"The Cell is a forgotten classic. Way ahead of its time, it is a cinematic delight. It could be best described as a psychological thriller but it is so much more. Don't hesitate to enjoy this gem. It is visually stunning with a gripping story. JLo is good in this despite her booty never being the focus. Yes, it makes an appearance in a side view but it doesn't overwhelm. For serious, this is a 10-star film. Have fun!","id":"5bd39a16c3a36820e900b4a2","url":"https:\/\/www.themoviedb.org\/review\/5bd39a16c3a36820e900b4a2","movie_id":8843}
{"author":"Gimly","content":"_The Convent's_ inclusion of a single character seen only at the beginning and end of the film is basically all that separates it from being a shot-for-shot remake of _Night of the Demons_. Which I gues doesn't sound so bad in theory, I mean, I like that movie, so ripping it off isn't the worst idea. But if you're gonna steal the entire concept, maybe **don't** steal some of the other stuff. Like I think it would've even been easier to swallow if it was just something as straight forward as making the \"demons\" look different from how they do in _Night of the Demons_, you know, just for that little bit of originality. But I guess that's too much to ask. I honestly did still kind of enjoy this though. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5d789e81069f0e000d3321d2","url":"https:\/\/www.themoviedb.org\/review\/5d789e81069f0e000d3321d2","movie_id":12724}
{"author":"John Chard","content":"The Perfect Storm, I just love it so much. \r\n\r\n\"The fog's just lifting, you throw off your bow line, you throw off your stern-you head out to South Chanel past Rocky Neck...Ten Pound Island, past Niles Pond where I skated as a kid-and you blow your air horn and throw a wave to the lighthouse keepers kid on Thatcher's Island - then the birds show up, black backs and herring gulls, big dump ducks - the sun hits you, head North, open up to 12, you're steaming now, the guys are busy, you're in charge - you know what? You're a god damn sword boat captain, is there anything better in the world?\" \r\n\r\nOrdinarily I would write a review that is fair minded and as honest as I can call it, something that hopefully would interest the readers either side of the fence. But here with The Perfect Storm I just want to write why I love this particular picture, and what a most divisive picture it has turned out to be. I'm aware of the complaints about the movie, even the ones from the family of the real Captain Billy Tyne {played by Alpha Male regular George Clooney}, but as an entertaining spectacle with huge slices of emotional fortitude, The Perfect Storm will forever be hitting my spots. \r\n\r\nThe character build up is just wonderful, people with things to prove, fractured and blossoming romances, loyalties on the line, grudges carried over from previous encounters, the lives of sea fishermen fully formed in the films first quarter. Then there is a sequence as George Clooney says the monologue that I have opened this review with, beautifully recited, but it's the emotion in Linda Greenlaw's face (Mary Elizabeth Mastrantonio) as she watches and listens to him speak it, just wonderful. Then the boys go out to see, heading off into dangerous waters to hopefully make a killing in the fish market, tensions run high, accidents happen, heroes are born and rivalries quickly overturned, but the boys must go further if they are to corner the market, the Grand Banks are evil at this time of year. \r\n\r\nA three pronged hostile weather front is heading their way, they are, as Linda tells Billy on the radio, heading into the belly of the monster, and what a monster it is. Here the makers excel, director Wolfgang Petersen, his cinematographer John Seale and his S\/E maestro John Frazier do literally put me right there in a amongst the waves and derringdo bravado. Then it's the final couple of reels, the emotional mangler, even a spiritual coda that is hated by so many can't make me dislike the film any less, and I'll wager right here and now that as funeral eulogies go, few if any have been delivered with as much heartbreaking emotion as the one read by Mastrantonio here. All of which is backed by a truly involving score by James Horner, shades of Braveheart's emotional swirls in there. \r\n\r\nIt's a personal opinion you know, but The Perfect Storm is a magnificent film that I enjoy three times a year, every year, and nobody will ever be able to take that away from me. \r\n\r\n\"There's no goodbyes Christina, only love,\" damn straight! 9\/10","id":"5575c744c3a368246a003d16","url":"https:\/\/www.themoviedb.org\/review\/5575c744c3a368246a003d16","movie_id":2133}
{"author":"obiden","content":"Inspired by the expedition of professor Hubert Gillet to the Ennedi Plateau fifty years ago the movie follow his steps searching for sources of water and remains of nature in this region before it was a desert. It is also an opportunity to learn more about the Bideyats, an nomad group that breeds camels and know the routes to hidden sources of water. It is a movie with a modest production and a simple script, but very poetic!","id":"5c60f49e9251412fc6fa09d4","url":"https:\/\/www.themoviedb.org\/review\/5c60f49e9251412fc6fa09d4","movie_id":581080}
{"author":"John Chard","content":"Getting away from it all may not be perfection paradise after all?\r\n\r\nI first viewed this film upon its release and felt that the final third did the film down - and that the voice-over took away from the essence of the story, thus it's average. My subsequent viewings over the years would see me lament about an arcade game sequence and bemoaning that Robert Carlyle wasn't given a more extended role, yet it has become a film that sees me totally on board with director Danny Boyle's production and it's now that I think it puts the story together with poignant precision.\r\n\r\nLeonardo DiCaprio is Richard, a backpacker searching for a bit more in life, after a meeting with pot smoking loony Daffy (the wonderful Robert Carlyle), he learns of an island paradise that is everything he has yearned for in his life. Getting there will give him the adventure and danger he craves, because once there it apparently will be the thing of dreams, the perfect paradise cut off from civilisation...\r\n\r\nThe film is very much split in two, the first half introduces us to Richard and the people he would convince to travel with him to this island paradise, we then follow their journey that is perfect in fleshing out the characters, they come up against obstacles and learn about each other on the way. The second half is well worth waiting for because it's here that the story kicks in to make the viewer think, it's idyllic, it's gorgeous, it's near perfect, but wherever there is a community, there will be personal hang ups, jealousies, power seekers and etc, in short, the surroundings may be perfect but the human condition is far from flawless.\r\n\r\nI love this film now, I love DiCaprio's performance, a cocky smart-arse thrill seeker about to get a wake up call is tailor made for him, and he delivers it with a  skillful array of emotions. Director Danny Boyle does a great job of juggling the joys of paradise with the uneasy distortion of the various characters in the community, and the cinematography from Darius Khondji is truly beautiful (Thailand locales). The film suffers with the inevitable comparisons to Lord Of The Flies & Hearts Of Darkness, and yes these are fair comparisons, but it doesn't take away from the fact that it's a fine film for the modern generation in its own right, with the core point of the story relevant to all and sundry.\r\n\r\nFans of the novel would prove to be very ambivalent towards this filmic adaptation, but in my book it gets better on repeat viewings. 8\/10","id":"559194c7925141757a001c45","url":"https:\/\/www.themoviedb.org\/review\/559194c7925141757a001c45","movie_id":1907}
{"author":"Gimly","content":"_The 6th Day_ is a **great** title for a movie about man-made lifeforms. The movie never really lives up to that, I 100% understand the criticisms it received when it was released, but I actually did enjoy watching it. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5e07042b26dac100126fce1e","url":"https:\/\/www.themoviedb.org\/review\/5e07042b26dac100126fce1e","movie_id":8452}
{"author":"John Chard","content":"Can you forgive the film makers their sins?\r\n\r\nOnce in a while there comes a time when a film lover has their patience snapped, that we can't surely accept in this instance that poetic license is OK as an excuse purely for Hollywood to make a piece of entertainment. U-571 pretty much rips up the history books for its own ends, something that would see even the film makers themselves bow their heads during the years that followed. However... \r\n\r\nAs a drama - cum - thriller, Jonathan Mostow's film is top end. There's some iffy acting in the support slots, but the production is still excellently put together. Suspense down below in the submarine is high anxiety, the tactics of war in the Atlantic superbly written, while the finale face off is edge of the seat gripping. It's these things that has let U-571 gain decent ratings on the main internet movie sites. \r\n\r\nTaken as a piece of Hollywood guff, it's a rocking war movie, one that also sounds absolutely tremendous through home cinema systems. As long as you accept it as guff - regardless of your nationality, then there is a great time to be had. But just as with films like Braveheart, do familiarise yourselves with the facts afterwards. 6\/10","id":"55891b05925141525c000212","url":"https:\/\/www.themoviedb.org\/review\/55891b05925141525c000212","movie_id":3536}
{"author":"John Chard","content":"In the quiet words of the Virgin Mary... come again?\r\n\r\nSnatch seems to be one of those spunky British gangster films that critics are divided on, yet it's loved by the target audience. Guy Ritchie has done a Sam Raimi, he has remade the first film that put him on the cinematic map. Where Raimi remade The Evil Dead, and just called it Evil Dead II, Ritchie cheekily tries to get away with remaking Lock, Stock and Two Smoking Barrels and calling it Snatch. Sure the circumstances in plotting are different, and there's a big American star brought in to beef things up for the global market, but it's the same movie and without doubt it's lazy film making. But it still - like Evil Dead II - Rocks!\r\n\r\nSnatch in story terms is concerned with a big diamond that stitches together a number of threads involving the London underworld. Some rough and tough Romany types join in the fun, headed by a purposely illegible Brad Pitt, while Dennis Farina, Benicio Del Toro and Rade Serbedzija add more cosmopolitan meat to the crooks and gangster stew. The British cement holding the building up comes in the twin forms of Jason Statham and Stephen Graham, with Vinnie Jones once again turning up to frighten the masses. Everything from bare knuckle fighting to bumbled robberies - to dog fighting and shifty arcade empires - are here, with Ritchie writing characterisations that positively boom off of the screen. \r\n\r\nAs with \"Lock-Stock\", the beauty is in the way violence and humour are deftly blended. Scenes are often bloody but also bloody funny, a pearl of dialogue is never far away from a perilous situation. The comic tone is more close to the knuckle here, Ritchie having fun toying with ethnic and machismo stereotypes, while he brings his bag of visual tricks before it got boring. The narrative is deliciously complex, but much credit to Ritchie for the way he pulls all the threads neatly together in a whirl of scene splicing and cocky literary assuredness.\r\n\r\nSo it's \"Lock-Stock 2\" then! No bad thing if you happen to be a fan of that sort of wide boy malarkey. If you don't like it? Then jog on sunshine. 8\/10","id":"5599973cc3a3685ee000222f","url":"https:\/\/www.themoviedb.org\/review\/5599973cc3a3685ee000222f","movie_id":107}
{"author":"Reno","content":"**The world can't change by itself, we must bring it.**\r\n\r\nAfter watching this film I just remembered the quote from 'Sullivan's Travels' which says 'film's the greatest educational medium the world has ever known'. Indeed, cinema's for entertainment as well acts as a message deliverer. This was an inspirational movie, and everybody must see it. I know I'm a bit late to see it, better late than never, right? I'm really glad for having it at the right time because 15 years ago I did not have this blog to write about it.\r\n\r\nOK, the name of the movie represents the theme of the story. No matter its a developed or developing country, society needs something like the idea this movie talks about. Carrying a good social message, the movie slightly lags behind the too much on the emotions, especially the end part. There won't be a problem if you like melodrama. Other than that, I feel the conclusion was smart and strong, a better solution which would appeal for certain group rather alternate finale.\r\n\r\nThe film was based on the novel of the same name, crafted by a fine director with the wonderful cast. Haley Joel Osment had a great career as a child-star, you should check some of his films if you love children's movies including this title on the top of that list. As a middle aged actor, Helen Hunt's one of the last best performances before turning into a senior artist. It's not a usual role for Kevin Spacey, but he nailed it with the good dialogues. Especially his talk about the topic 'child abuse' was a great thing from the movie. Overall, the actors get more credit for the first- class acts as the script demanded for their respective roles.\r\n\r\n> What did you ever do to change the world. \r\n\r\nA movie about a man who achieved in science gets the Oscar, not that real man. A movie about a man escapes from the war prison camp and slavery gets the award, and again none of those real persons. But a movie with the original, intelligent, inspiring, specially designed for a movie was not even a contender of the Oscars. Of course, it was transformed from a book, though there are\/were no real people behind these great characters, all are imagined\/created for the book and the movie. I never understood the American Academy Awards.\r\n\r\nBy now you would know that I hate critics badly if you are a regular reader of my blog. Once again they failed to recognise how great the morality of the story is, rather they have concentrated to criticise the writing and the technical aspect of the film. Although, it was not a box office flop or earned beyond, but got a lot of praise from the families. It's a wonderful family drama, but still too far from being a masterpiece. Intelligent enough one to get motivated towards the social issues. Being practical in the real world is a concern as it is risky, depending on the situation and the person, just like this movie's ending. Rare to find a movie like this, you must check it out.\r\n\r\n8\/10","id":"5575f5c6c3a36856060023e7","url":"https:\/\/www.themoviedb.org\/review\/5575f5c6c3a36856060023e7","movie_id":10647}
{"author":"John Chard","content":"Heal thyself, doctor.\r\n\r\nThe back story to Supernova is actually more interesting than the studio cut of the film that is available to view. Director's coming and going, one (Walter Hill) taking his name off the credits, butchery by studio interference, different endings, different planned thematics, shelved for two years and etc. Supernova was a messy production and sadly it shows, making Walter Hill's original cut (unavailable) the \"Magnificent Ambersons\" of the sci-fi genre.\r\n\r\nPlot, in the skew-whiff edited version we are fed here, is basically a riff on Ridley Scott's Alien. Space dudes up in space take on board a too good to be true hitch-hiker dude, which is a bad idea. Sadly it's all very dull, yet strangely you can see that in amongst the mess, and the often used diversion tactic of Robin Tunney's breasts, there was a very good film here. Brains and effects work to light up the screen, some sexy sizzle marrying up to the tension up there in the galaxy, James Spader on wonderfully broody and heroically damaged form, and some belting deleted scenes on the DVD. But, it's not to be, so the studio should be ashamed of themselves, even if it isn't quite the ultimate stinker it has been painted as. But! Super it is not, in any shape or form. 5\/10","id":"557defe3c3a36821a100041b","url":"https:\/\/www.themoviedb.org\/review\/557defe3c3a36821a100041b","movie_id":10384}
{"author":"John Chard","content":"Come not between the dragon and his wrath.\r\n\r\nBilly “Shiner” Simpson (Michael Caine) is building up to his big boxing promoting night, the headline of which is his own son, Eddie “Golden Boy” Simpson (Matthew Marsden). But family troubles begin to weigh heavy, a police investigation closes in on him and a rival American promoter is breathing down his neck. It’s going to get messy.\r\n\r\nSurprisingly for a Michael Caine British gangster movie, Shiner is a little under known. A shame because it’s really rather good. Caine himself felt that by 2000 the cinema loving public had had enough of British films of this type, hence why it did poorly at the box office and quickly disappeared into the retail chain of things.\r\n\r\nIt’s basically a reworking of King Lear, in London and with Caine on super form. Billy Simpson is a grade “A” noir protagonist, the world he inhabits is ultimately too much for him, there’s treachery and dishonesty – violence and disappointments, all around him, but still he ploughs on as if he will eventually become the king of the castle. Yet this is the noirville area of London, of grubby bars and grey landscapes, the hall playing host to Billy’s big night is a place of stale cheese sandwiches and blocked toilets.\r\n\r\nOn either side of Billy are his two henchman played by Frank Harper and Andy Serkis, two sides of the same coin they are, though they menace in different ways. Billy’s two daughters played by Claire Rushbrook and Frances Barber, also two sides of the same coin, but conversely they have different love for their father. Martin Landau is the smooth American promoter with a dame on his arm and a grudge for Billy, and Gary Lewis and Kenneth Cranham fill out important roles as characters caught in Billy’s soon to be maelstrom. \r\n\r\nCaine did say that he considers Shiner to be part of a trilogy that comprises Get Carter and Mona Lisa. Shiner isn’t close to being as good as those two movies, especially the sublime Get Carter, but it holds its head up high in such company and fans of those movies should seek it out. 8\/10","id":"547beb78c3a3685b00001cdf","url":"https:\/\/www.themoviedb.org\/review\/547beb78c3a3685b00001cdf","movie_id":28943}
{"author":"John Chard","content":"I know cats who'd take out whole zipcodes for that kind of cheese.\r\n\r\nRemakes do work occasionally, case in point Shaft, John Singleton's update of the 1971 Blacksploitation movie that starred Richard Roundtree as the title character. Roundtree gets a part in this one as well, playing the uncle of Samuel L. Jackson's title character, John Shaft.\r\n\r\nIt's the perfect role for Jackson, lashings of cool and menace, on his bulky shoulders dose the film easily rest. Plot finds Shaft turning in his badge after the law proves useless to let racist murderer Walter Wade Junior (Christian Bale a sneering villain but awesome looking in a tux) out on the streets. Shaft vows to bring Wade to justice, by any means necessary. Though he also has other things on his plate, namely Latino drug lord Peoples Hernandez (Jeffrey Wright a riot) and some less than honourable police officers.\r\n\r\nThe screenplay is a little trite, but as an action movie, one with the coolness and sparky humour, it really hits the required spots of those just after such easy minded fare. The support cast is a roll call of sound performers with the likes of Vanessa Williams, Dan Hedaya and Toni Collette fronting up, while the awesome ebullience of Busta Rhymes is very infectious.\r\n\r\nIsaac Hayes gloriously famous theme tune is still in place, pumped up by composer David Arnold, which ensures the feel of the original isn't lost, and Donald E. Thorin's photography is pin sharp and in turns gorgeous (night shots) and streetwise gritty. Shaft, the 2000 version, still bad-ass and sadly under appreciated. 7\/10","id":"559a837a9251413d99004b2e","url":"https:\/\/www.themoviedb.org\/review\/559a837a9251413d99004b2e","movie_id":479}
{"author":"John Chard","content":"Did I kill one of your people, Murnau? I can't remember.\r\n\r\nF.W. Murnau (John Malkovich) is filming Nosferatu (1922), but isn't reclusive star Max Schreck (Willem Dafoe) taking his role of the vampire way too seriously?\r\n\r\nIn some ways it's a curate's egg of a film. It certainly helps if you are a lover of old classic film and have some knowledge of the source material at the film's core. It's a fabulous concept that the screenplay is based around, that the star of the film may actually be a real vampire, and the whole production is executed with consummate skill (Dafoe was deservedly Oscar nominated as were make-up artists Ann Buchanan & Amber Sibley). But come the end it fizzles out and proves to not have delivered on its devilishly intriguing premise. Fun, though, and tech credits all round keep one well involved. 6\/10","id":"561b6ec69251415a620003ee","url":"https:\/\/www.themoviedb.org\/review\/561b6ec69251415a620003ee","movie_id":10873}
{"author":"Gimly","content":"One of those few movies that most people don't care for, but I personally think is **criminally** underrated.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._","id":"5b92026d0e0a26609c005caa","url":"https:\/\/www.themoviedb.org\/review\/5b92026d0e0a26609c005caa","movie_id":2787}
{"author":"John Chard","content":"All you people are so scared of me. Most days I'd take that as a compliment. But it ain't me you gotta worry about now.\r\n\r\nPitch Black is directed by David Twohy and collectively written by Twohy and Ken and Jim Wheat. It stars Vin Diesel, Radha Mitchell, Cole Hauser, Keith David, Lewis Fitz-Gerald, Claudia Black and Rhiana Griffith. Music is by Graeme Revell and cinematography is by David Eggby. \r\n\r\nThe year 2000 was awash with sci-fi movies, not all were stellar of course, but siting at the top end of the scale was this, Twohy's super slice of action\/horror\/sci-fi cake. \r\n\r\nRight from the off we are thrust on board the cargo ship Hunter-Gratzner, which as it happens is plummeting through space. The ship has been hit by meteorite debris and junior officer Caroline Fly (Mitchell), after coming out of hyper sleep, manages to crash land on a nearby planet. Only a handful of passengers survive the crash, including infamous convict Richard B. Riddick (Diesel), but as the survivors struggle to cope with the threat from within the group, it becomes apparent that there's a bigger threat soon to join the party, a deadly alien species, a species that can only operate in the dark. Pity, then, that an eclipse is due... \r\n\r\nOkies, so lets get the obvious out in the open right away, Pitch Black is a variant of Alien, one of a ream of films that grabbed the coat tails of Ridley Scott's game changer. Yet this is still a fresh movie, a lesson in low budget film making with grace, style, blood, brains and balls - the execution grade \"A\" from those involved. \r\n\r\nIt's maybe surprising given the synopsis, to find that it's a very character driven piece, with Twohy continually building his characters even as the carnage and terror is unleashed - and these are a very diverse bunch of characters. One of the universe's baddest criminals, a spunky lady officer having to take command, a morphine addicted bounty hunter, an Islamic priest and his young companions, a camp alcoholic and a couple of strays. It's the not so wild bunch, but everyone of them are afforded chance to impact on the story before and during the inevitable picking off one by one at the claws of the beasts. \r\n\r\nThe narrative strength comes via Diesel's hulking convict, he's double jointed and has had optical surgery so he can see his enemies in the dark! The group must come to rely on him for he is clearly their best hope of survival, but can he be trusted? What is his ultimate ulterior motive? Riddick is the épée to Fry's foil, it's at times like a devil and angel trying to become one in the simple name of survival. These crux characters lift the simple premise to greater heights, that Mitchell (sexy\/vulnerable\/hard\/smart) and Diesel (moody\/beefy\/gravelly\/menacing) are bang on form helps no end. As does the work of the tech department. \r\n\r\nThe setting created here is a splendid veer from one of the curses of sci-fi films, that of an unbelievable world. Twohy, Eggby and the art department achieve a world of 3 suns, of a scorched barren landscape, with the photography switching between bleached and metallic filters for maximum sci-fi impact. While the effects work belies the budget, check out the pre-eclipse sequence. What of the creatures themselves? They are legion, a sort of pterodactyl nightmare who let out high pitched bleats, they smell blood and move at high speeds, and like Riddick they have special vision in the dark, it's the light that they are afraid of, thus this gives our survivors a glimmer (ahem) of hope in how to stave them off... \r\n\r\nThe science and logic is hokey, but so what? This is a classy and taut sci-fi film brought about by a very under valued director, one that puts many a bigger budgeted Hollywood production to shame. Come the finale, where there's still time to have your draw dropped, you may be minus nails and on the edge of your seat. 9\/10","id":"5570c897c3a368709c000bca","url":"https:\/\/www.themoviedb.org\/review\/5570c897c3a368709c000bca","movie_id":2787}
{"author":"ScottishKnight","content":"Tho' most would consider this a \"Lower Budget\" movie, both Brenda Blethyn & Craig Ferguson are hilarious in this flick!\r\n\r\nGrace [Blethyn] is so prim & proper in the beginning, however, the death of her husband, & loss of everything, she gives into Matthew's [Ferguson] grand scheme. Both decide to use her talent for horticulture and hatche a plan to grow potent marijuana in a 2 week time frame which can be sold at an astronomical price, thus solving her financial crisis.\r\n\r\nThere are many twists, turns, & romance along the way...The townspeople know a wee bit of Matthew & Grace's plan, but never expected it to turn into the huge amount grown. Grace's first expierience with marijuana is so hilarious, that you can't help but laugh,...just as the entire town becoming stoned when Matthew & Grace are forced to destroy it all before getting caught by the authorities, as well as the huge drug lord that ends up on their tail.\r\n\r\nI've watched it many times, & even my teenagers get a kick out of it, as they think that \"Grandma would be just too funny, if in Grace's position!\"\r\n\r\nKudos to Craig Ferguson, as well as Brenda Blethyn; cast & crew, on an excellent laugh out loud performance!  ","id":"50c2b664760ee31a5300647c","url":"https:\/\/www.themoviedb.org\/review\/50c2b664760ee31a5300647c","movie_id":2360}
{"author":"LastCaress1972","content":"Mad-as-a-bag-of-badgers Japanese Yakuza\/zombie\/Highlander hybrid (I think), made on a micro-budget by Ryûhei Kitamura, the guy who would go on to direct enjoyable gore-fest The Midnight Meat Train. Honestly, if they spent more than two hundred quid on this thing, then I can't see where the money went. I kind-of liked it though, in a bizarre way.\r\n\r\nSo what's it all about then? Hm. Fecked if I know, to be truthful. We're informed early on that there are apparently 666 portals to \"the other side\" on Earth, all hidden from man. Our story takes place in the \"Forest of Resurrection\" in Japan, the 444th portal. We open with a medieval Japanese warrior, in said forest, surrounded by what appears to be similar Japanese warriors, but undead ones. Anyway, no sooner has our man cut down these ghoulies with a swish and a slash, than he himself is cut in half by what appears to be some sorcerer\/warrior fellow, who in turn is already (I think) facing off against some other mean-looking samurai-type. Then, title card, then, um, a pair of modern-day escaped prisoners running through what I suppose must be the same forest, en route to a rendezvous with a bunch of Yakuza hoodlums sent to... what? help them? Not sure, since the meeting degenerates quickly into a stand-off between the Yakuza and the prisoners (along with a girl the Yakuza had captive in their car), which turns into a chase through the woods, but not before a prisoner and a Yakuza are killed and reanimated as zombies. Off go the girl and the other prisoner (finding our prisoner fellow some sexy leather duds on some previously-slaughtered poor sod; the place is choc-full of dead\/UNdead Japanese criminals, by the looks of things) and off go the remaining Yakuza in hot pursuit, needing to recapture them before \"He\" shows up. \"He\"? Who? Erm, the Yakuza bossman I think, Except that as soon as \"He\" shows up, his gang (along with a few more members who were just hiding in the trees) mutiny, and shoot him to pieces. Except he stands straight back up and attacks them. And he ISN'T a zombie. He's... what? Immortal? Hang on, isn't he that sorcerer-y fellow from the first scene? Oh, he's just bitten someone's neck. So, he's a vampire? And who are these cop types who've shown up and keep bickering? Um...\r\n\r\nOh, sod it. Here are the tweets I took to posting when I probably should've been paying attention:\r\n\r\n-Currently watching a Japanese film called Versus. Looks like it was made out in the woods for a tenner. And it is utterly demented.\r\n\r\n-I went for a poo for ten minutes near the start of it and I can't pick up the thread of what's going on. It's just mad craziness.\r\n\r\n-It's just a rabid succession of people who may or may not be alive, immortal, dead or undead, fighting, in a forest. I think.\r\n\r\n-NOW what's happening?!? Why's everyone suddenly dressed like feudal Samurai? Are they different people to the other people? Where am I?\r\n\r\n-Unh? WTF? Where did those power rangers go? Everyone's dressed modern again. Why's that woman tied to a tree?\r\n\r\n-Why's that bellend screaming about \"gates\" and \"power\"? Isn't he that Samurai guy? No? Yes? Is that a zombie up that tree there?\r\n\r\n-Why's that zombie doing a lizard\/jaguar impression? He looks like a ****... who are these, now? Where's that bloke's hand gone?\r\n\r\n-Is it a comedy? A screwball comedy? Oh, he's just blown up that zombie doing the lizard face and scratchy hands. Good. Knob, he was.\r\n\r\n-It's a big sword-off now between the two leather-jackety guys. Were they the main good\/bad guys all the way through, then?\r\n\r\n-Oh, his head's off. That other fella's off on his motorbike. So, where were those samurai types then? What was that all about?\r\n\r\n-\"99 years later\"? Eh? Who are those baldies? Isn't that yer man who's head fell off? What's that silly bitch moaning about?\r\n\r\n-Oh, it's finished. Ha! I definitely need to watch that again, I've never been so lost. Made Eraserhead look like Gavin & Stacey.\r\n\r\nSo there you have it. If two hours of ceaseless kicky-slashy fighting between alive\/dead\/undead\/immortal Japanese types, in a forest, set to an arcade game-standard techno-rock soundtrack appeals, then this is the film for you. I can't rate it very highly at this point - I'm just too overwhelmed, really - but I'm tempted to look at it again. As I said, I kind-of liked it, for all its mentalness. 6\/10.","id":"5207b12a760ee362fc234599","url":"https:\/\/www.themoviedb.org\/review\/5207b12a760ee362fc234599","movie_id":5842}
{"author":"JPV852","content":"Some parts were dumb (the nitro bombs for instance) and the CGI not always the best (albeit this was 20 years ago, so some forgiveness) but I liked the cast, Bill Paxton, Robin Tunney and Scott Glenn especially, and thought all in all was an entertaining enough survival-thriller. **3.25\/5**","id":"5eaf98d8cdbaff001ab2a7a8","url":"https:\/\/www.themoviedb.org\/review\/5eaf98d8cdbaff001ab2a7a8","movie_id":11678}
{"author":"John Chard","content":"We're out of miracles.\r\n\r\nRussell Crowe would of course come to be better known elsewhere (filmicly) in this year, but what of his other release in 2000? Proof of Life is a blender, a picture that is in part thriller, part romance, part drama and part observation on a very real life problem - that of kidnapping for ransom. So many genres to tackle means that invariably Taylor Hackford's film feels over stuffed, pushing the running time to two hours and fifteen minutes, it is this that hurts it. A shame because if trimmed of the pointless filler and drawn out sequences then there is a very efficient (ok, maybe routine is a better word here) and well acted piece on show. The drama and tension (sexual and perilous threat) is all building towards the action packed finale, which, while well mounted, doesn't seem an adequate pay off for the number of extended chatty scenes we have had to tolerate to get there. Nice tip of the hat to a classic at the end, though. 6\/10","id":"55850046c3a368502e00224e","url":"https:\/\/www.themoviedb.org\/review\/55850046c3a368502e00224e","movie_id":11983}
{"author":"John Chard","content":"What came first - the music or the misery?\r\n\r\nHigh Fidelity is directed by Stephen Frears and adapted to screenplay by D.V. DeVincentis, Steve Pink, John Cusack and Scott Rosenberg from the Nick Hornby novel. It stars Cusack, Jack Black, Iben Hjejle and Todd Louiso. Music is by Howard Shore and Cinematography by Seamus McGarvey.\r\n\r\nRecord store owner and compulsive list-compiler Rob Gordon (Cusack), embark's upon a what does it all mean mission when his latest girlfriend leaves him.\r\n\r\nCusack and Pink take Hornby's hugely popular novel and redirect it to Chicago, with joyous results. High Fidelity is a tale of human love and a love of music, a sort of battle of the sexes with a soundtrack of masculine life. Rob's voyage of self discovery is highly amusing, the trials and tribulations of relationships bringing out a number of scenes and scenarios that ring true, not just tickling the funny bones, but also tugging the heart and cradling the brain.\r\n\r\nAway from the doomed love angles it's the music threads that literally strike the chords. Rob and his two co-workers Barry (Black) & Dick (Louiso) worship music and continually indulge in making top 5 lists whilst bickering with sarcastic glee in the process. All three actors are superb, a trio of odd balls bouncing off of one and other with a zest that's infectious, though it's decidedly Cusack's show. A perpetual miserablist who addresses us the audience at frequent intervals, Rob in Cusack's hands garners sympathy, pity and laughs in equal measure.\r\n\r\nIn the support slots is a ream of talent well in on the joke, beauties like Catherine Zeta-Jones (dropping F-Bombs like they are going out of fashion), Lisa Bonet & Joelle Carter are complimented by the comic skills of Joan Cusack, while Hjejle turns in a wily and womanly performance as the girlfriend who kicks starts Rob's search for meaning. Elsewhere the sight of Tim Robbins as a new age hippy type - with a black belt in martial arts - is so much fun it reminds of what a good comic actor he can be as well. \r\n\r\nAs with Grosse Point Blank, another Cusack\/Pink production, sound tracking is everything, and naturally given the setting of the story there is an abundance of classic tunes to delight in. All told it's a special movie, for all sexes and for all music lovers, but especially for anyone who has had relationship problems. Now what did come first, the music or the misery? Priceless. 9\/10","id":"559a6ea4c3a36855db004b34","url":"https:\/\/www.themoviedb.org\/review\/559a6ea4c3a36855db004b34","movie_id":243}
{"author":"Josh","content":"Brewster McGee is a hilarious black comedy, written and directed by Ross Munro who does a great job capturing the eccentric low rent mood of the film. With a simple story about Brewster McGee (Brent Neale) a profane loser who sits outside in a Chicken Hut parking lot with his gentle hippie accomplice Malcolm (Reid Edwards) trying to turn his big plans into reality. Brent Neale who plays Brewster McGee does a good job in letting the audience feel a twisted compassion for his unlikeable character as he takes advantage of pathetic, heartbroken Oliver and thinks up impracticable get rich quick schemes. The film which was shot in 16mm black and white and with such a low budget (50,000 dollars Canadian) this small independent film did what it could with money restraints and yet still has more heart and soul than most blockbuster movies. Though it's not perfect, I assure you its worth while to see and entertains the open eye with its intense dialogue and creative plot.","id":"53efe6600e0a2675a9001fd6","url":"https:\/\/www.themoviedb.org\/review\/53efe6600e0a2675a9001fd6","movie_id":286976}
{"author":"John Chard","content":"Maybe we should join the team.\r\n\r\nTorrance is the newly appointed captain of cheerleader champions the Toros. After one of the team suffers an accident, the Toros recruit gymnastics star Missy Pantone, but upon witnessing the Toros first routine Missy is disgusted and points out that it has been stolen from another team called The East Compton Clovers. This opens up a whole can of worms that not only brings the Toros into conflict with the Clovers, but also means that they must come up with an original routine if they are to win the American championship honestly.\r\n\r\nSpirited picture about cheer leading? Well yes it is, it's witty, smart and ever so amiable. Tho the film loses some of its sharpness in the final quarter (a brave ending would have made all the difference), Bring It On clearly touches on race and class issues whilst bringing to the fore the competitiveness of cheerleader teams. The usual formula's of bitching and back stabbing are naturally in here, and of course no film of this type would be complete without some strand of treacle plot love, but the mix is fine and the exuberance of the routines is hugely enjoyable cinema. Kirsten Dunst, Eliza Dushku, Gabrielle Union and Jesse Bradford fill out the cast and all offer something in the way of watch ability.\r\n\r\nIt could have been so much better for sure, but Bring It On is very entertaining film about a subject that until this picture came out (subsequent sequels would follow) was hardly tackled with this sort of vigour and intelligence before. 7\/10","id":"53aeacc20e0a26598c00453a","url":"https:\/\/www.themoviedb.org\/review\/53aeacc20e0a26598c00453a","movie_id":1588}
{"author":"Charles","content":"An intelligently adult passing-of-time drama, with well-drawn characters and plenty of food for thought, Roly Santos’ feature debut, “How Silly We Are to Grow Up,” fuses an emotional-triangle tale to a less successful thriller subplot with predictably mixed results. Commercial prospects outside home territory are slim, but Roly Santos is a talent to watch.\r\n\r\nMarcos (Gustavo Garzon), an existentially bored university lecturer, gets a grant to return to his birthplace to carry out biochemical research. There he meets old buddy Raul (Leo Masliah), who is now a priest. The story opens out to bring in their schooldays 20 years earlier, during Argentina’s politically active ’70s, when Raul was going out with Tamara (Victoria de Elizalde), who now lives in Paris with husband Paul (Ginger Poujoulet). The mature Tamara (Laura Melillo) returns to be with her sick mother, and Marcos unwittingly stumbles across some high-level politico-economic corruption on the part of the lab’s owners, led by Dr. Castembacher (Jean Pierre Reguerraz). In a piece in which perfs win out over plot, Garzon is satisfyingly nuanced as the disillusioned Marcos. Technically, pic’s restricted budget makes itself felt. (By Jonathan Holland for Variety Hollywood Reporter)","id":"5d1289a39251411ac6b9f108","url":"https:\/\/www.themoviedb.org\/review\/5d1289a39251411ac6b9f108","movie_id":611150}
{"author":"John Chard","content":"It's amazing what you can do... when you don't have to look at yourself in the mirror any more.\r\n\r\nIt was the film that convinced director Paul Verhoeven to leave Hollywood and take a break from film making. His reasoning being that any Hollywood director could have made Hollow Man, a big effects led movie that made a lot of cash at the box office. It's this that is the main problem with the picture, it lacks some of the director's bite and satirical savagery, even the souped up sex (natural or deviant) that often comes with his productions. Yet devoid of expectations of a Verhoeven masterpiece, and the crushing realisation that it basically wastes its potential and plays out as a haunted house stalk movie - it's a good enough energetic popcorner.\r\n\r\nIt quickly becomes obvious that we are entering special effects extravaganza, the opening credits are dynamite, sci-fi sexy, then the opening gambit sequence literally grabs us - and a rodent - by the throat. From here on in we are treated to grade \"A\" effects and some genius ways of exposing \"the invisible\" Sebastian Caine (Kevin Bacon) to us and the prey he soon comes to hunt. Unfortunately the whole cast performances are a much of a muchness, and playing a roll call of sci-fi stereotypes. All involved here have done much better work in their sleep, but they put the bums on theatre seats and ultimately this works as one of those movies designed to thrill and awe the senses - but sadly not the brain. 6.5\/10","id":"5594548ac3a36869d1003b44","url":"https:\/\/www.themoviedb.org\/review\/5594548ac3a36869d1003b44","movie_id":9383}
{"author":"Charles","content":"Marcos (Gustavo Garzon), an existentially bored university lecturer, gets a grant to return to his birthplace to carry out biochemical research. There he meets old buddy Raul (Leo Masliah), who is now a priest. The story opens out to bring in their schooldays 20 years earlier, during Argentina’s politically active ’70s, when Raul was going out with Tamara (Victoria de Elizalde), who now lives in Paris with husband Paul (Ginger Poujoulet). The mature Tamara (Laura Melillo) returns to be with her sick mother, and Marcos unwittingly stumbles across some high-level politico-economic corruption on the part of the lab’s owners, led by Dr. Castembacher (Jean Pierre Reguerraz). In a piece in which perfs win out over plot, Garzon is satisfyingly nuanced as the disillusioned Marcos. Technically, pic’s restricted budget makes itself felt.An intelligently adult passing-of-time drama, with well-drawn characters and plenty of food for thought, Roly Santos’ feature debut, “How Silly We Are to Grow Up,” fuses an emotional-triangle tale to a less successful thriller subplot with predictably mixed results. Commercial prospects outside home territory are slim, but Santos is a talent to watch.(By JONATHAN HOLLAND for Variety)","id":"5d121faf0e0a267635ca62ae","url":"https:\/\/www.themoviedb.org\/review\/5d121faf0e0a267635ca62ae","movie_id":611150}
{"author":"Per Gunnar Jonsson","content":"I have been unusually lucky with my SyFy-channel movie watching lately. I had no idea what this movie was really but there was nothing else on last night and I also noticed that it was directed by Paul Verhoeven which have directed quite a few movies that I really liked so I decided to give it a try. As it turned out, this is another movie that is somewhat above the usual standard for movies given on SyFy.\r\n\r\nIt has a rating on 27% on Rotten Tomatoes which is just bullshit. But then, the so called “professional critics” used by the Rotten Tomatoes are dimwits who trash every movie that is not “intellectual” enough for their self-imagined refined tastes. I do not know why they continue to use these clowns for their official rating system instead of the real audience? On IMDb it holds a 5.6 out of 10 rating which is more realistic. I was hesitating between 7 and 6. In the end I gave it a 6 because, as I said in the title, it is a quite okay movie but not a fantastic one.\r\n\r\nThe story of the movie is a fairly standard one. Scientist experiments on himself, experiment goes wrong, scientist goes mad, hack hack, chop chop, scientist dies, happy ending for the remaining survivors. Thus the movie pretty much relies on its special effects which are indeed quite good. The various invisible effects, not to mention the scenes where Caine is partially visible due to smoke or water effects, are quite enjoyable to watch. \r\n\r\nKevin Bacon is making quite a performance as a very disagreeable fanatic scientist. He is doing a remarkably good job of it even when he is covered by a latex mask which of course is quite a feat being deprived of any facial expressions. The rest of the cast was fairly standard Hollywood fare, that is, fairly bland.\r\n\r\nOn the whole I found the movie quite enjoyable. It was perhaps a bit slow at the beginning and Cain’s show of megalomaniacal attitudes was indeed becoming a bit tiresome after a while. As I said, his roles was a very disagreeable one. Once he became invisible things started to become more interesting although it took a wee time for things to speed up even then.\r\n\r\nIt was certainly not a wasted movie evening and the movie is worth at least 6 out of 10 stars.","id":"518b3ca819c29568a504a762","url":"https:\/\/www.themoviedb.org\/review\/518b3ca819c29568a504a762","movie_id":9383}
{"author":"Kowalczyk","content":"Ridley Scott's Gladiator is a real masterpiece of its genre. With its unique battle scenes, cinematography, acting and directing. It's a real must-watch. Shame on you if you haven't watched this movie!","id":"5b70826fc3a368188f17ec5e","url":"https:\/\/www.themoviedb.org\/review\/5b70826fc3a368188f17ec5e","movie_id":98}
{"author":"Eky","content":"Gladiator has been my most favorite film of all time. It is an epic masterpiece in many ways and it really explains why despite the numerous viewings, Gladiator still amuses me with its powerful imageries and many other crucial aspects so that it won five Academy Awards. This film is very well written, the well-ensemble casts, the A-class acting (especially Russell Crowe and Joaquin Phoenix), the stunning cinematography and definitely a strong character of Maximus (magnificently portrayed by Russell Crowe) whose life, struggle, disappointment and anger really move the audience, as if the world attention centers on him. Gladiator is not a historical film, because it only used the history of the ancient Roman Empire merely as the time setting.\r\nAll other aspects namely those gorgeous shots, the great storyline\/plot, the fantastic cinematography, the vividly lavish colors, detailed production design and digital imaging (that successfully rebuilt the stunning beauty of the ancient Roman Empire) and all sell really well, making the 170 minute-long running time definitely worthwhile. The visual of great battle in the first 15 minutes really stole my heart. The gruesome pictures, the blood and violence just to beautiful to abandon. Everything in this movie seems perfectly balanced, Ridley Scott as the film director really did his homework well in redefining and revitalizing the big battle sequence once considered masterpiece from Spartacus and Ben Hur. In the end, once again, I would say that Gladiator perfectly combines some crucial elements such as good, moving story, dazzling visual, beautiful scenery, filming techniques, direction and touching music score into one harmonious, action-packed film about heroism and its true meaning.","id":"4fffcd60760ee3192a000934","url":"https:\/\/www.themoviedb.org\/review\/4fffcd60760ee3192a000934","movie_id":98}
{"author":"John Chard","content":"They said you were a giant. They said you can crush a man's skull with one hand.\r\n\r\nRidley Scott's Gladiator is not a perfect film, I would think that the hardiest of fans, of which I'm firmly one, know this deep down. Yet just like Commodus in the film is keen to point out that he himself has other virtues that are worthy, so does Gladiator the film. Enough in fact to make it an everlasting favourite of genre fans and worthy of the Academy Award acknowledgements it received.\r\n\r\nIn narrative terms the plot and story arc is simplicity supreme, something Scott and Russell Crowe have never shied away from. There has to my knowledge as well, never been a denial of the debt Gladiator owes to Anthony Mann's 1964 Epic, The Fall of the Roman Empire. Some folk seem very irritated by this, which is strange because the makers of Gladiator were not standing up bold as brass to proclaim they were unique with their movie, what they did do was reinvigorate a stagnant genre of film for a new generational audience. And it bloody worked, the influence and interest in all things Roman or historically swashbuckling of film that followed post Gladiator's success is there for all to see.\r\n\r\nWhat we do in life echoes in eternity.\r\n\r\nSo no originality in story, then. While some of the CGI is hardly \"Grade A\" stuff, and there's a little over - mugging acting in support ranks as some of the cast struggle to grasp the period setting required, yet the way Gladiator can make the emotionally committed feel, actually overrides film making irks. Crowe's Maximus is the man men want to be and the man women want to be with. As he runs through the gamut of life's pains and emotionally fortified trials and tribulations, we are with him every step of the way, urging him towards his day of revenge splattered destiny - with Crowe superb in every pained frame, winning the Academy Award for Best Actor that he should have won for The Insider the previous year.\r\n\r\nBacking Crowe up is Joaquin Phoenix giving Commodus preening villainy and Connie Nielsen graceful as Lucilla (pitch Nielsen's turn here against that of Diane Kruger's in Troy to see the class difference for historical period playing). Oliver Reed, leaving the mortal coil but leaving behind a spicy two fold performance as Proximo the Gladiator task master. Olly superb in both body and CGI soul. Richard Harris tugging the heart strings, Derek Jacobi classy, David Hemmings also, while Djimon Hounso gives Juba - Maximus right hand man and confidante - a level of character gravitas that's inspiring.\r\n\r\nI didn't know man could build such things.\r\n\r\nDialogue is literate and poetic, resplendent with iconic speeches. Action is never far away, but never at the expense of wrought human characterisations. The flaming arrows and blood letting of the Germania conflict kicks things off with pulse raising clarity, and Scott and his team never sag from this standard. The gladiator arena fights are edge of the seat inducing, the recreation for the Battle of Carthage a stunning piece of action sequence construction. And then the finale, the culmination of two men's destinies, no soft soaping from Scott and Crowe, it lands in the heart with a resounding thunderclap. A great swords and sandals movie that tipped its helmet to past masters whilst simultaneously bringing the genre alive again. Bravo Maximus Decimus Meridius. 10\/10","id":"53e7fe77c3a3683995002406","url":"https:\/\/www.themoviedb.org\/review\/53e7fe77c3a3683995002406","movie_id":98}
{"author":"Gimly","content":"It really does seem as if maybe, at one point, in the days of yore, there was a really interesting psychological thriller at play, now buried deep within the layers of garbage that _Blair Witch 2_ ended up being. I mean, hey, props to you, _Book of Shadows_ tried something totally different to the original. It's just a shame that it failed abysmally.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"59a38f80c3a36821dc0088cb","url":"https:\/\/www.themoviedb.org\/review\/59a38f80c3a36821dc0088cb","movie_id":11531}
{"author":"John Chard","content":"We all lie to ourselves to be happy.\r\n\r\nIt's not until a film like Memento comes along, or that you personally have to deal with someone close who suffers a form of this subject to hand, that you get jolted to remember just how your memory is such a prized and treasured thing - and crucially that it's one of your key safety devices.\r\n\r\nChristopher and Jonathan Nolan crafted one of the best films of 2000 based on those facets of the human condition. Their protagonist is Leonard Shelby, played with stupendous believability by Guy Pearce, who is suffering from a memory amnesia caused by a trauma to the head as he tried to aide his wife who was raped and murdered. He can remember things before the incident, but anything post that and he can't form a memory. So who can he trust? Does he know any of the few people who appear to be in his life at the present time? He tattoos his body to help him remember, constantly writes notes to keep him alert in his now alien world, while all the time he is on the search for the man who ruined his life.\r\n\r\nChristopher Nolan plants the audience right into Leonard's world. By using a reverse story telling structure it's deliberately complex and ingenious given that it opens with the ending! It has been argued that it's trickery for trickery sake, style over substance, but the way each scene is built upon in the narrative is a thing of high quality, it's all relevant and demands the closest of attention from the viewer, where cheekily we are ourselves asked to form memories of prior narrative passages. Mystery is strong throughout, the characters currently in Leonard's life may have different means and motives, it keeps us alert, with the confusion, lies, manipulations, enigmas and amnesia angles booming with neo-noir vibrancy. And the Nolan's know their noir of course, adding a narrator who is hard to define or trust himself!\r\n\r\nThe reverse structure wasn't new in 2000, but Christopher Nolan picks up the idea and adds new strands to it, simultaneously bringing his visual ticks as David Julyan's musical score shifts from elegiac forebodings to pulse pounding dread, and as evidenced by the darling easter egg option that allows one to watch it in chronological order, it's a damn fine thriller without the reverse trickery anyway. Super. 9\/10","id":"55a2e0f3c3a3681ce7003ef2","url":"https:\/\/www.themoviedb.org\/review\/55a2e0f3c3a3681ce7003ef2","movie_id":77}
{"author":"talisencrw","content":"Excellent. I can't believe I've finally gotten around to watching all of Christopher Nolan's films (I have 'The Prestige' on DVD, but have yet to see it), but it's been well worth the wait. There are a couple of handful of English-language directors operating right now that I will make sure I watch every single film of, and Nolan has become one of those for me, and rightfully so. A very fine twist on the noir framework.","id":"5737757fc3a36840ec002af0","url":"https:\/\/www.themoviedb.org\/review\/5737757fc3a36840ec002af0","movie_id":77}
{"author":"mattwilde123","content":"‘Memento’ is director Christopher Nolan’s tribute to classic film noir tales of revenge and mystery. By adding a new twist to traditional conventions, Nolan is able to consume and grip the viewer throughout the entire film and for years after. The aspect that differentiates this neo-noir from its competitors today is its jumbled and complex narrative which continually moves backwards in time. The viewers first see the main character complete his revenge murder (a triumphant scene we usually associate with the ending of film noirs). We then begin to see events unfold backwards and the reason for this becomes clear.\r\n\r\nLeonard Shelby (Guy Pearce) and his wife are attacked in their home. His wife is murdered but Guy Pearce is left with a brain condition that disables him from creating anymore short-term memory. Constantly being reminded of the horror of the situation, he is relentlessly spurred on to get his revenge on his wife’s killer. As the viewer progresses through the film, they begin to feel more and more like Lenny. The audience have no idea of what has happened prior to the scene currently showing and so we are left feeling the same confusion as our protagonist. To cope with his condition, he maintains a system of notes, photographs, and tattoos to record information about himself and others, including his wife's killer. He is aided in his investigation by \"Teddy\" (Joe Pantoliano) and Natalie (Carrie-Anne Moss), neither of whom he can really trust (both of the latter actors starred together in ‘The Matrix (1999)’ in which Pantoliano was not to be trusted, disorientating the informed viewer more).\r\n\r\nThe film's events unfold in two separate, alternating narratives—one in colour, and the other in black and white. Leonard's investigation is depicted in five-minute colour sequences that are in reverse chronological order, however, the short black and white scenes are shown in chronological order and show Leonard on the phone to a mysterious stranger having a conversation that the viewers cannot understand (these sequences are more direct references to the film noir genre that Christopher Nolan is embracing). This style of directing makes the audience completely empathise with Leonard’s situation as you never know more than he does, but also it creates huge comedic and emotional moments which rely heavily on the notion of dramatic irony.\r\n\r\nWith Nolan’s use of handheld camera work, an overtone of pink colouring, and sharp editing (the only transition effects in use are occasional fade outs) the viewer is made to feel disorientated and is therefore able to empathise more with Leonard’s character. The original idea was a short story by Nolan’s brother, Jonathan who also helped with the screenplay. The dialogue in the film is its best feature with its insightful, powerful and heart-wrenching speeches about the nature of memory. As we learn how we rely upon memory for our sense of reality, we begin to question reality itself.  The idea of faith and constant references to the bible can make the entire film a metaphor for people’s faith in Christianity or any other religion at that.\r\n\r\n★★★★★","id":"58c14e39c3a368265b0097d4","url":"https:\/\/www.themoviedb.org\/review\/58c14e39c3a368265b0097d4","movie_id":77}
{"author":"warren23","content":"Men of honor what a film it is in my top 10 films","id":"5e4300cb3dd1260014588e91","url":"https:\/\/www.themoviedb.org\/review\/5e4300cb3dd1260014588e91","movie_id":11978}
{"author":"John Chard","content":"I need a kid like I need a bad heart. A pretty kid is a ticket to trouble... and I'm too old to ask for that.\r\n\r\nThe prison genre of film has a very chequered history, and the number of films are many, very much so, both good and bad. It has gotten to the stage where in this day and age we yearn and need more from our prison based films, something more substantial away from rape and violence, away from father figures, or of redemption and friendship bonds. Unfortunately Animal Factory relies on all the clichés of the genre to tell its tale, which is actually at odds with how good a film it is. Deftly performed by the principal cast members, mounted with a keen eye by director Steve Buscemi, and played with an authentic vibe that lures you in and keeps you hooked, but there is unfortunately nothing remotely new here. However, if you are not over familiar with the prison based arc of cinema? Then this delivers rewards, and such is the quality of production, it doesn't deserve to be marked down. 7\/10","id":"5570d2fb925141086600311d","url":"https:\/\/www.themoviedb.org\/review\/5570d2fb925141086600311d","movie_id":9791}
{"author":"talisencrw","content":"A guilty pleasure for me personally, as I love both 'The Great Escape' and most of the works I have seen, over the years, from this rightfully-esteemed British animation company. Highly recommended both for children and for adults who enjoy animation.","id":"57086ff5c3a3681d29001512","url":"https:\/\/www.themoviedb.org\/review\/57086ff5c3a3681d29001512","movie_id":7443}
{"author":"John Chard","content":"I thought losing your cherry was meant to be more fun than this?\r\n\r\nThe town of Cherry Falls, and students are being targeted by a deranged serial killer. The modus operandi appears to be only virgins are being selected.\r\n\r\nCompromised in production, Cherry Falls, while not exactly pushing itself forward as a top line slasher, still shows some devil may care attitude and cheeky propositions. Flipping the standard formula of teens having sex then getting murdered on its head, the screenplay instead has the kids needing to have sex to stay alive! The script has some absolute zingers in it, so keep your ears open, and a solid cast headed by Michael Biehn, Jay Mohr and an adorable Brittany Murphy keep tongue in cheeks as the blood does flow. You wont be taxed to work out who the killer is, and come the final quarter as the flashbacks reveal all, death in Cherry Falls loses its impact. But still there's enough teenager stalk death fun to keep it watchable. 6\/10","id":"55c7f0acc3a3682496002f9d","url":"https:\/\/www.themoviedb.org\/review\/55c7f0acc3a3682496002f9d","movie_id":12619}
{"author":"The Movie Diorama","content":"Charlie’s Angels is a heavenly paradise for inexcusably camp charades. Adapting classic television series into a feature film was becoming a common trend in the early part of this century. But maintaining the aesthetic appeal of its source material is often blurred with the requirement of targeting mass mainstream audiences. Would viewers of the original Charlie’s Angels watch a film continuation? Most likely not. So the legendary (and I use that adjective lightly...) McG decided to go full Hollywood, embracing action spy thrillers that came before, and produced one of the campiest guilty pleasures of all time. \r\n\r\nCan I describe the plot? Absolutely not. It’s thinner that Diaz’ lip fillers and needless botox. Three “Angels” who privately work for a millionaire are assigned a task in investigating technology giant Red Star. Stuff happens, a predictable plot twist unravels and the booming soundtrack of The Prodigy and Fat Boy Slim illuminate my ears. \r\n\r\nLet me start by saying I love Charlie’s Angels. I love it! It’s a film I hold very close to my heart, and a crucial element to my childhood. Probably a reasoning for my raging homosexuality, let’s be honest. I mean Barrymore, Diaz and Liu kicking a “creepy thin man” repeatedly wearing tight leather costumes in ‘Matrix’-stylised slow motion whilst working together as a cohesive unit of female empowerment!? Just lay me to rest, now! Give me a slice of that angel cake and let me never lose that heavenly flavour. \r\n\r\nYet, the amateur critic inside me just cannot classify this film as “good”. Why? Well, because it’s not. And it’s that ever-growing conflict between biased favouritism and legitimate critiquing that has me torn inside. Firstly, the plot is a mess. To the point where the story is a secondary product to the action set pieces and humorous dance sequences. When talented actors, such as Rockwell, are crucial aspects to this afterthought, it unfortunately wastes their efforts. The frantic editing prevents a natural flow of events, including the extravagant action, that anchors these angels. They are unable to spread their wings and fly.\r\n\r\nA dire shame considering the undeniable chemistry between the lead actresses, each harnessing a unique personality that allows their characters to connect as a team. Diaz is the ditzy dance queen, shaking her tush on Soul Train. Barrymore is the rebellious punk, sticking her middle finger up to everyone. Liu is the intellectual well-mannered lady, riding horses and piloting space rockets. They each add enough humour to come together seamlessly. Essentially, I live for them. The dialogue is cheesy and contagious, if ridiculously vacuous in subject matter. And the constant use of the same songs, namely “Heaven” and “Smack My B**** Up!”, lacked variety. Despite my internal love for The Prodigy and Fat Boy Slim. \r\n\r\nAs far as guilty pleasures go, Charlie’s Angels is up there for me. It’s poorly directed and woefully written, but I cannot deny my adoration for this campy beast. Unfortunately it doesn’t surpass the ultimate guilty pleasure ‘Lara Croft: Tomb Raider’, even after all these years...","id":"5e206879f04d0100150fc6e5","url":"https:\/\/www.themoviedb.org\/review\/5e206879f04d0100150fc6e5","movie_id":4327}
{"author":"Gimly","content":"Made my roommate who hates stop-motion animation watched this in 2018 and even he had a good time. It's maybe not as great as I remember thinking it was when I was a little kid, but it still holds up to some degree.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5bb5ac829251410dcb00810c","url":"https:\/\/www.themoviedb.org\/review\/5bb5ac829251410dcb00810c","movie_id":7443}
{"author":"DoubleUK","content":"I managed to see this movie on it's first day of screening in New York, back in 2000, just before I went back to Europe.\r\n\r\n'Coyote Ugly' is a nice romantic comedy, perfectly fit for the generation who didn't grow up with 'Flashdance', Saturday Night Fever etc.\r\n\r\nPiper Perado plays the young aspiring song-writer who wants to get a major record-deal, write songs and then safely watch others perform her music. But then there's this little snag, called reality. Although the story is not very surprising it is solid and consistent told. We understand why she ends up on the bar dancing (no spoiler here). And at the same time we understand why her father is disappointed. A fine part played by John Goodman. At times their relationship reminded me of the one Madonna and Danny Aiello had in the 'Father Don't Preach' music-video. Father reluctantly sees his daughter grow up. And she only wants him to be proud of her.\r\n\r\nAfter I saw the trailer on television I immediately went to the REAL Coyote Ugly Saloon on 1st Avenue on which this film was based (unless there's another one, of course). The real bar is not nearly as flashy as it's celluloid counterpart. But they DO hose down annoying customers with beer and there IS dancing on the bar. However by the female customers, rather than the waitresses. But they do get fresh with you if you happen to order something they don't serve. (anything besides beer and Jack Daniels) And they do drink shots with the costumers. Funny detail is that in the movie is explained why they don't get drunk.\r\n\r\nI know, I know, we already have Flashdance. (Also from Bruckheimer) but I don't mind if this type of story is being updated now and then, right? Although the soundtrack could sound a bit more contemporary.","id":"589d75319251412cd2005462","url":"https:\/\/www.themoviedb.org\/review\/589d75319251412cd2005462","movie_id":6282}
{"author":"John Chard","content":"We live and we die by time. And we must not commit the sin of losing our track on time.\r\n\r\n*** This review may contain spoilers ***\r\n\r\nJetting off on yet another important task, FedEx whizzer Chuck Noland leaves his girlfriend Kelly Frears (Helen Hunt) behind just before Christmas. Disaster strikes during the flight and the plane crashes into the ocean. Managing to free himself from the sinking jet, Noland is washed up on an uninhabited island. Without basic modern comforts and fighting solitude daily, Noland must live in hope that one day he might be saved before he loses his mind or the will to live.\r\n\r\nTom Hanks (Noland) re-teams with director Robert Zemeckis after their hugely successful collaboration on 1994 awards stealer, Forrest Gump. Though Cast Away didn't win any awards (the usual cry of it being Oscar bait had preceded it) it can be argued to be Hanks' best performance. Few actors in the modern era could carry the film the way that Hanks does. Beguiling and drawing us into his loneliness, Hanks, with minimal dialogue (his only company being a volleyball that washed up with a few other FedEx parcels) excels with facial and bodily acting. Zemeckis, who should be applauded for the middle section and the terrifying plane crash that precedes it, puts Hanks' Noland through the mangler. The convenience of said parcels washing ashore aside, Noland is bumped bruised and dentally challenged, the Robinson Crusoe clichés exist of course, but Zemeckis and a heartfelt Hanks put us there on the island as well, with a pat on the back due for the excellent work by the sound department I might add.\r\n\r\nSadly Cast Away is bookended by not so great work. The opening character introductions are unremarkable but just about good enough for the plot set up, but the ending lacks emotional punch and defies what has been built up. Things aren't helped by Helen Hunt's lack of chemistry with Hanks, but that in turn is not helped by the writing from William Broyles Jr. since it's only really now that it's Noland that we care about. It's a bit churlish to complain too much though, because Zemeckis kept us on the island with Chuck, there was no cutting back to grieving family or fruitless rescue attempts. With that it was a truly fine one man show, even if that is something that ultimately renders the ending something of a let down. 7.5\/10","id":"5591911cc3a36807fd001c0f","url":"https:\/\/www.themoviedb.org\/review\/5591911cc3a36807fd001c0f","movie_id":8358}
{"author":"talisencrw","content":"Easily my favourite of Lee's films, plus this was a no-brainer for me to watch, since I love martial arts films and the three stars. Peter Pau's cinematography and Dun Tan's soundtrack deservedly won two of the four Oscars, amidst its ten nominations, but even though the production values and story were the reason that this, rather than more significant martial arts classics, such as 'The 36th Chamber of Shaolin' and other Shaw Brothers' masterpieces of the genre is that it stepped outside the box and became mandatory viewing for both genders and all cultures with its love story, in the same way that 'Rocky' isn't simply a boxing movie. Still fascinating watching today, and the scene in which the restaurant is destroyed is one of the most fascinating set-pieces I have yet seen.","id":"5738c50b9251412070000489","url":"https:\/\/www.themoviedb.org\/review\/5738c50b9251412070000489","movie_id":146}
{"author":"CRCulver","content":"Béla Tarr's 2000 film <i>The Werckmeister Harmonies<\/i> deals with troubling events in a small town in Hungarian's eastern plains. After an opening scene showing simpleton postman János demonstrating to a bar full of drunks how the Earth and moon rotate around the sun with the help of three of the old geezers, he does his rounds in the early morning. Posters put up advertise the arrival of a giant whale with special guest, the Prince. This traveling circus, however, fills the townspeople not with eager anticipation but with dread. Indeed, when the Prince does appear, all hell breaks loose.\r\n\r\nBased on the novel The Melancholy of Resistance by László Krasznahorkai, the plot of this film is a transparent allegory for Hungary in the 1930s and 1940s: unable to keep its house in order, and falling for the demagoguery of fascism, Hungary brought on itself its long nightmare of Soviet domination. Tarr has curiously stated, however, that he is not offering us a historical allegory. By that I can only imagine that he is turning the allegory into a parable, using a reference to mid 20th-century Hungary as way of exploring more universal themes. Perhaps the central tension in the film is between a natural order, the ecstatic cooperation of free human beings, and an order dictated by a manipulative leader. I don't want to spoil anything that happens here, but Tarr's depiction of a mob let loose is harrowing.\r\n\r\nI was very moved by this film the first time I saw it, and on repeat viewings there has been much to appreciate. I feel, however, that the film is greatly weakened by Tarr's decision to use German actors for two main roles. Lars Rudolph, who plays János, and Fassbinder mainstay Hanna Schygulla as the sinister \"auntie Tünde\" give physically commanding performances, but they were presumably speaking in German while acting, and Tarr has had them clumsily dubbed into Hungarian, no synchronization between their mouths and the voices.","id":"5b8ad7070e0a261d7001e7fd","url":"https:\/\/www.themoviedb.org\/review\/5b8ad7070e0a261d7001e7fd","movie_id":23160}
{"author":"donovanhill27","content":"I remember loving this film as a kid. Rewatching the film as an adult, the film does not hold up. I really remember the third act of the film before rewatching the film and it is going to be the only thing I will remember about the film. There are two fun scenes in my opinion: the ending and Cruella De Vil transformation back into her evil self. Glenn close is the only great thing from the film. This is not one you need to seek out if you have not seen it.","id":"5c83e502c3a36839d4d212f6","url":"https:\/\/www.themoviedb.org\/review\/5c83e502c3a36839d4d212f6","movie_id":10481}
{"author":"Gimly","content":"If your the sort of person who won't enjoy a thing because it is \"problematic\" then I'd recommend giving _100 Girls_ a wide, wide berth.\r\n\r\nIf that's not an apt description of your tastes, then I'd... Probably still recommend you miss _100 Girls_. Even if you don't take into account the film's **bizarre** level of obsession with gender dichotomy, the saccharine moments of \"heroism\" that are at best dated and at worst genuinely damaging, and even if you discounted the weird, uncomfortable roles characters' relationships take, then all you're left with is a bland, hackneyed plot without any real character development and a **massive** disconnect between message and arc.\r\n\r\nI'm not saying that _100 Girls_ could never have worked (although for some viewers I'm sure that will be the case), I'm just saying it doesn't.","id":"594a248b92514145a80097c8","url":"https:\/\/www.themoviedb.org\/review\/594a248b92514145a80097c8","movie_id":10035}
{"author":"John Chard","content":"Oh the irony of it all...\r\n\r\nAfter surviving the second wave of ghostface killings, Sidney Prescott has retired to the mountains to live in peace and work as a phone call therapist. Sadly for her she is about to be dragged back into the nightmare because the production of Stab 3 is rocked by murder and the killer is leaving pictures of Sidney's dead mother at the crime scenes.\r\n\r\nI have to admit that I once never gave this film much love, I loved the first two to such a degree that I felt this third and final instalment was way off being a fitting closure to what was at the time a trilogy. Yet as time has wore on I have really grown fond of the film, Parker Posey no longer annoys the hell out of me, the once jarring itch of watching the makers kill off a fave character of mine in the opening sequence is something I now view as a masterstroke, and the twisty ending that was once an irksome pest has moved on to be the perfect \"trilogy\" closure.\r\n\r\nScream 3 has its tongue firmly in its cheek, it's aware of its number and it's aware of its formulaic root, so in spite of treading familiar ground (I mean come on gang, have you not learnt nothing from your previous experiences), the returning characters still have our undivided attention. While the transporting of the story to Hollywood, with its movie within a movie structure, is fresh and adds a new dimension to proceedings. New additions to the scary fun are Patrick Dempsey, Emily Mortimer, Lance Henriksen and the afore mentioned Parker Posey, and all of them add greatly to the mysterious plot unfolding.\r\n\r\nThe death quotient is still high, and the Wes Craven school of whodunitry is well and truly open, and I personally feel that this one is easily the funniest film of the three, witness Jay & Silent Bob turning up, a Carrie Fisher sequence that once heard will never be forgotten, and a video appearance by passed on geek god Randy Meeks. Scream 3 closes the \"trilogy\" just fine, it's got bags of energy and a glint in its eye, now if only I could get a copy of the uncompleted Stab 3 off the internet - and if only there wasn't to be a part 4 further down the line... 7\/10","id":"55abdf1fc3a3682ffc00797c","url":"https:\/\/www.themoviedb.org\/review\/55abdf1fc3a3682ffc00797c","movie_id":4234}
{"author":"Gimly","content":"Not The Shamhammer's best, but certainly of the era when he was still making \"good\".\r\n\r\nFinal rating:★★★ - I personally recommend you give it a go.","id":"58985a18c3a368771200782f","url":"https:\/\/www.themoviedb.org\/review\/58985a18c3a368771200782f","movie_id":9741}
{"author":"John Chard","content":"Soon found out had a heart of glass.\r\n\r\nIt often gets forgotten just what an exciting talent M. Night Shyamalan was during the early part of his film making career. True that Unbreakable, with its deliberate slow pacing and left-field narrative, would (and has) proved to be not everyone's cup-o-tea, but there's a film making craft here, and a genius idea brought to vivid life, that makes a spectrum of film lovers lament how his career nose dived, how his ideas quickly got as stupid as his acting...\r\n\r\nUnbreakable challenges the thought process, spinning a story that's of a adult comic book heart, but also of a clinical human examination. The narrative is consistently ambiguous, holding the patient viewers in enthral as the cosmic conundrums come tumbling off of the screen. It's refreshing to find a story like this that is so devoid of cliché, where the wonderfully reflective Bruce Willis and the brilliantly fascinating Samuel L. Jackson feed off each other, their character's destinies superbly steered by cast and director. Unbreakable is a complex movie, but not needlessly so, its strengths are numerous for those of a keen eye and ear. It represents Shyamalan's most clever cinematic offering, to which the sad realisation comes to pass that he would never, as yet, be this smart and vibrant again. 10\/10","id":"55bae9c3c3a3684afb0059d0","url":"https:\/\/www.themoviedb.org\/review\/55bae9c3c3a3684afb0059d0","movie_id":9741}
{"author":"msbreviews","content":"If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWhat a movie! This is one of the most underrated films out there, and it was unfairly compared to The Sixth Sense at the time the former was released. These are two very different movies, but both of them have a lot of twists, which was what brought fame to Shyamalan's films, especially The Sixth Sense.\r\n\r\nUnbreakable follows that same methodology. It has a lot of twists throughout the runtime, and they are quite diverse: some are very technical twists, related to our point of view of a particular scene that, as it progresses, we always find ourselves tricked (these ones, most people either don't catch them or just don't care ... For me, it's proof of brilliant writing); the others are the prominent plot twists, where something unpredictable happens to the overall story.\r\n\r\nThis movie has all of that and much more. The story itself is incredibly captivating since the main plot holds a lot of mystery and suspense, but these only work as well as they did thanks to Shyamalan, both director and screenwriter. His very unconventional way of storytelling and the anxiety that he's able to convey to some fantastic scenes, elevate the film while delivering a perfect narrative. It's even more mind-blowing the fact that this movie still makes so much sense and it didn't lose its replay value after 17 years!\r\n\r\nIn fact, I bet it would be a striking success nowadays, where the superhero genre is over-saturated. Each year, we get more and more movies following the excessively used genre's formula that makes almost every blockbuster an instant box office hit. Unbreakable is nowhere near that formula, and I genuinely think that any fan of comic-book films must watch this one so everyone can understand what a \"grounded superhero movie\" actually means. M. Night Shyamalan wrote a story that everyone can appreciate, without all of those big CGI fights and overwhelming visual effects. Comic-book fan or not, Unbreakable is the closest to what reality would be if superheroes really existed.\r\n\r\nRegarding the cast, Bruce Willis probably has his career-best dramatic performance in this film. He's terrific as David and I can feel all of the emotions which he wants to transmit to the screen. Samuel L. Jackson brilliantly plays Elijah, who has a real-life disease which SLJ portrayed beautifully and respectfully. The supporting cast is also worth praising since both Robin Wright (Audrey Dunn) and Spencer Treat Clark (Joseph Dunn) play magnificent roles as the wife and son of David, respectively.\r\n\r\nEveryone helped Shyamalan direct exquisite dialogue sequences that extended for minutes without end. The editing and production of this movie are unbelievable ... and it was filmed in 2000! There are so many long, one-take scenes that explain in just a few minutes, everything you need to know about a character or a specific place or event ... Even a full action sequence is filmed in just one-take (the stunt work is also pretty efficient)! The soundtrack is so important, especially in the last act where everything comes to a conclusion. It's inspirational and even epic, I dare calling it. It's just perfect! Throughout the runtime, you can barely notice it due to how subtle it is. However, when it is needed to deliver a new layer of feelings, it always raises the moment.\r\n\r\nAs discussed above, this is a M. Night Shyamalan film, so a very powerful twist right at the end needs to happen ... and it does. It gives the audience an unpredictable perspective about the whole story. I risk myself in saying that it isn't exactly necessary, but the truth is that it makes sense and it does bring the movie to a whole other level, so very, very well done! Finally, I just wish that this film had been released now. It is so much different than what we are used to watching and experiencing, that I dare to say it is one of the best movies inside this genre.\r\n\r\nOnce again, Shyamalan shows the audience why was he becoming one of the most popular directors\/screenwriters and proves that his rather unconventional storytelling, unpredictable twists and excellent direction are skills to praise more often. Bruce Willis and Samuel L. Jackson have great chemistry, but the former has his career-best dramatic performance. The editing, production, soundtrack and even the pacing of this film are entirely flawless, as well as the ending twist that leaves us with our jaws dropped. Unbreakable is one of the most underrated superhero movies ever, but it sits way on top as one of my favorites.","id":"5c3cd0a7c3a36859f53d4b8b","url":"https:\/\/www.themoviedb.org\/review\/5c3cd0a7c3a36859f53d4b8b","movie_id":9741}
{"author":"slayrrr666","content":"Attempting to finish film school, a director doing her film about a serial killer killing his victims on urban legends starts to realize that a serial killer is running around behind the scenes killing off the crew, and must stop the madman before killing off everyone on the film.\r\n\r\nThis here was a pretty surprising entry. One of the things it does well is that it really features a lot of suspenseful work at times as this makes a hard time of determining if what's being seen is real or just being shot for the movie. It plays the movie-within-a-movie trick to nice effect, since it features enough to make hard to distinguish one from the other including it's wonderful opening sequence that takes a while before realizing after the fact it's been faked, a sequence where the assembled cast watch the dailies only for a strange cut-shot to play where one of the cast is viciously stalked and killed is screened where all but one thinking it to be shot for the film but the other positive that it's real and a later scene where a murder done during the recording of a scream-test loud enough to drown out the victim's own being great scenes. Even going away from that formula, there’s some rather fun stalking here from the bathroom chase featuring the woman trying to escape from the killer out into the alleyway or a thrilling chase through the recording studio and out into the surrounding countryside and pool while an attack at a carnival ride hidden by the darkness and fog comes off rather nice as well. The final confrontation in the movie-set graveyard setting is just fun, being creepy, exciting and all-around a blast with the true revelation and the different twists featured throughout make for a nice time here. The last big feature here is a really nice and healthy mix amongst the kills, which along with the mask worn are the film's rather good parts. This one here only has a few flaws to it. The main one here is that the main explanation for the killing has a lot of ways for how to interpret it, and it feels just too clumsy and unrealistic to be considered as believable. The fact that the violence is toned down from anything that it should have, since, for all the creativity displayed in the kills, it isn't very bloody and with a couple of kills that could've been in here. These are the same thing that really should've fixed by taking more of those and making them more bloody. It would've taken out a mild flaw in the film rather simply. The last flaw in here is the film's maddening ability to switch between the film shoot and the real world. It's fun at times, but there's also the fact that the film tries to be clever with changing around the two and it gets a little harder to defend the longer they go on. These here are the film's flaws.\r\n\r\nRated R: Graphic Violence, Graphic Language, Brief Nudity and a sex scene.","id":"58cd8f80c3a36850c000e605","url":"https:\/\/www.themoviedb.org\/review\/58cd8f80c3a36850c000e605","movie_id":12212}
{"author":"talisencrw","content":"The other day, my lady Tammy and I watched director Glazer's recent 'Under the Skin' and loved its otherworldly wackiness and ambience, and as I had his first two films on DVD, we decided that at the very least, this first one demanded immediate investigation. I've adored Ray Winstone's work since his early days working in the films of Sir Alan Clarke, and Ben Kingsley's always a treat. Watching the characters brought back such awesome memories of my teenage days, travelling throughout England and continental Europe in December, 1986, as well. We can't wait to hopefully check out 'Birth' later this week...This was definitely one of the best and most original British gangster movies since the likes of 'The Long Good Friday' and 'Mona Lisa' from that era...","id":"57c735ff92514137310046af","url":"https:\/\/www.themoviedb.org\/review\/57c735ff92514137310046af","movie_id":11826}
{"author":"John Chard","content":"But quite frankly your attitude appalls me. It's not what you're saying. It's all this stuff you're not saying. Insinnuendos.\r\n\r\nSexy Beast is directed by Jonathan Glazer and written by Louis Mellis and David Scinto. It stars Ray Winstone, Ben Kingsley, Ian McShane, Amanda Redman, Cavan Kendall, James Fox and Julianne White. Music is by Roque Baños and cinematography by Ivan Bird. \r\n\r\nRetired to the Costa del Chill Out, retired thief Gary 'Gal' Dove (Winstone) finds his tranquil existence shattered when menacing gangster Don Logan (Kingsley) arrives on the scene demanding Gal goes back to London to do another job. \r\n\r\n2000 saw a slew of British gangster films released. The success of \"Lock Stock and Two Smoking Barrels\" opened the door for film makers keen to do their bit for Brit Grit. As is always the way, quality varies, but the class of 2000 had a healthy rate of good 'uns, of which Sexy Beast is a proud operator. \r\n\r\nThe story is very thin, very film noir, an ex bad boy doing one last job that risks everything he has settled down for, but there's a panache to how the makers construct the tale. It helps that it's boosted by a ferocious performance from Kingsley, who is given licence to unleash his dark half, as he swears, stares, gets violent and has a general disregard for anyone but himself. \r\n\r\nDirector Glazer, in what was his film after breaking out from advertisements and music videos, shows a keen eye for stylist visuals and attention grabbing scenes. He opens with an outrageous sequence of Gal sun bathing by his pool, the sun burning down, and then a giant boulder thunders into view and lands in the pool! All set to the sound of \"The Stranglers\" single \"Peaches\". Quite a way to announce yourself in film. \r\n\r\nThe first half of film is the best, set at Gal's Spanish villa, Glazer neatly frames the characters (Gal lives with his wife and his two friends from England live nearby) as they bicker and cower in the shadow of Logan, who wouldn't be beyond sending them all to hell if he doesn't get his way. It's sweaty and tense, a coiled spring like atmosphere tells us something is going to give - and it does. The second half of the piece is not so tense or thrilling, though the robbery has a whiff of genius about it, but the pay off works well because Gal has earned our respect, as has his fellow sun seekers. Sexy Beast is not just sexy (tongue in cheeks for the makers), it's beefy and brutal, but also strangely beautiful as well. Nice. 8\/10","id":"5570e3ea92514140ca002647","url":"https:\/\/www.themoviedb.org\/review\/5570e3ea92514140ca002647","movie_id":11826}
{"author":"John Chard","content":"Hopes, Dreams & Nightmares.\r\n\r\nAlmost Famous is Cameron Crowe's paean to rock music, of bands and songs, of journalism and promotion, of sex & drugs. Drawing from experience and stories passed on, Crowe tells the tale of a young teenage boy aspiring to be a music journalist in the 1970s. Finding himself backstage with the rock group Stillwater, William Miller (Patrick Fugit) embarks on a road journey with the band that's awash with egos, groupies, perils and pleasures, all of which change his life forever.\r\n\r\nLets go find something real!\r\n\r\nThe most striking thing about it is that it's not overtly funny or sensationalistic, it's a production that's full of love, real love, for the subject matters to hand, and it's very often a moving experience to be part of. Narratively speaking, Crowe takes his time, steadily building characters and backdrop essentials, it works a treat as we become immersed in all the major players within the music circle, while also feeling the concerns of those on the outside of the rock group circle. Which of course gives us the great rewards come the final third of film when all matters come to a head. Crowe and his design team also work some magic for period flavours, capturing the early 70s vibe with awareness of clothing, food and drink and transport. Nothing ever seems false, which is remarkable in this era of product placements and shameless plugging. \r\n\r\n50 bucks and a case of beer! \r\n\r\nAnother one of Crowe's strengths is how he garners great performances from his actors. There's no big stars here, no Tom or Renée, but Billy Crudup, Jason Lee, Kate Hudson and Fugit, who respond to their director with sincere and believable performances, no caricatures or ham sarnies here, no way. While outskirt performances from Frances McDormand (brilliant as William's fretful mother), Anna Paquin, Philip Seymour Hoffman (as the legendary Lester Bangs) and Fairuza Balk, consistently hit the hi-hat. The music of course rocks, from metal and progers, to folkers and bubblegum, to some punk godfathery, these sounds feature on the soundtrack and kick the decade into orbit - while the Stillwater scenes are effective and the use of Elton John's Tiny Dancer will land in your heart and stay there.\r\n\r\nCameron Crowe has created a smashingly memorable film that will stand the tests of time. Two cuts are available, where both the theatrical and director's cuts are sure fire things (the latter Bootleg Cut my personal favourite). This is a music based film to sit with the best of them, God Bless Rock N Roll and God Bless Cameron Crowe, for he could have easily embellished and over egged his rock pudding, instead he kept it real. 9\/10","id":"55a4446ac3a3685e59000189","url":"https:\/\/www.themoviedb.org\/review\/55a4446ac3a3685e59000189","movie_id":786}
{"author":"John Chard","content":"The 35% movie that maybe originally was a minor classic?\r\n\r\nAll the Pretty Horses is directed by Billy Bob Thornton and adapted from Cormac McCarthy's novel of the name name by Ted Tally. It stars Matt Damon, Penélope Cruz, Henry Thomas & Lucas Black. Marty Stuart scores the music and Barry Markowitz photographs it. Plot finds Damon as John Grady Cole, a young cowboy who travels with his best friend, Lacey Rawlings, from Texas across the border into Mexico. It's a journey that sees acquaintances come and go, love blossom and the harshness of the world become all too real to such young eyes.\r\n\r\nA big financial disaster for Columbia Pictures and Miramax Films who lost nearly $40 million on the film. Serves them right I say, for Thornton's original cut was a long epic piece thought to be around three and a half hours in length. But good old Harvey Weinstein demanded drastic cuts to be made and Thornton had to trim it to just nearly two hours in running time. That's a lot of story gone astray, and boy does it show, no wonder Damon himself bitterly commented that to lose 35% of your movie ultimately leaves you with a completely different film. It's such a shame because although it's now a film chocked with flaws and flow problems, one can see that in its original cut there had to be at worst an involving rites-of-passage story.\r\n\r\nSo what are we left with? Well it's certainly not a donkey. It drips with period atmosphere and comes resplendent with a poetic beauty thanks to Markowitz's photography. Stuart's score too has the tone absolutely right, blending the old feel of the West with evocative arrangements for the more tender moments involving the protagonists: and there are tender moments, notably between Cole (Damon youthful but not really exuding a naivety for the age of the character) & Rawlings (Thomas effective and dominating his scenes). That the crucial relationship between Cole and Alejandra Villarreal (Cruz weak and lacking believability for the romantic strand) is barely formed can be laid at Weinstein's door. So too can the fact that a number of characters file in and out with blink and you miss them parts, sad when it's the likes of Robert Patrick and Sam Sheperd; and tragic in the case of Bruce Dern's judge; the latter of which is a crucial character in the final quarter but gets about three minutes screen time. Madness. Star of the movie is Black, who as young ruffian Blevins, manages to convey a deep sense of vulnerability. It's a critical role, one that affects the main character's lives, and thanks to Black's spirited performance we anxiously await what fate has in store for the lovable rogue.\r\n\r\nSo much good to sample, then, even if it feels like going out for a three course dinner and finding the main course is no longer available. It's hoped that one day we may get a directors cut from Thornton, only then you feel will All the Pretty Horses be revealed as a potential thoroughbred. 6\/10","id":"589ce993925141088f002bd6","url":"https:\/\/www.themoviedb.org\/review\/589ce993925141088f002bd6","movie_id":21355}
{"author":"John Chard","content":"Some couples dance, others go to Mars.\r\n\r\nIt was the year of two Mars based movies, with the other being Red Planet, of Pitch Black and the chaotic history that produced the Supernova. Plenty of sci-fi around but sadly few decent offerings.\r\n\r\nMission to Mars is a film you can see had good ideas on the page, some brainy and emotion based narrative threads. Effects work is OK for the era, while there's a very impressive cast put together to tell the story. Yet the script stinks to high heaven, the surprises are as absent as Martians are, while the steals from previous sci-fi movies grate on the nerves. The odd sequence has quality about it (dancing in space, woo-hoo, storm attack, yay), while the finale - all be it still a steal - is well constructed and further proof that someone somewhere had the kernel of a good story idea, but it's laborious trite and devoid of the basic film principals - to entertain and engage.\r\n\r\nSo many things wrong here, so much so the names of all involved have been spared. Join this Mission to Mars at your own peril. 4\/10","id":"557b8b5fc3a36863230008ac","url":"https:\/\/www.themoviedb.org\/review\/557b8b5fc3a36863230008ac","movie_id":2067}
{"author":"Qazy","content":"This movie was underwhelming and not worth the hype. The cast acted fine and the story hit a few emotional notes. An average movie with great music, one of Vidyasagar's finest works.                                                    \r\n5\/10","id":"5734304592514174f1000b25","url":"https:\/\/www.themoviedb.org\/review\/5734304592514174f1000b25","movie_id":397128}
{"author":"Per Gunnar Jonsson","content":"This is a decent enough mindless action movie with a lot of over the top action but it is not really a Mission Impossible movie. The movie starts of reasonably well being somewhat intelligent with a bit of Mission Impossible feel to it. It is actually almost a bit slow at times. However, for the second half of the movie it really degrades into a classical John Woo, over the top, action feast with all pretense of intelligence and any true Mission Impossible feel gone. John Woo is not the right person to make a Mission Impossible movie.\r\n\r\nAs with the first movie if it would not have been labelled Mission Impossible I would probably have given it a higher rating since it is a decent enough, mostly braindead though, Hollywood action movie. However, I have higher expectations from a movie labelled Mission Impossible.\r\n\r\nTom Cruise is quite okay as Ethan Hunt. Dougray Scott is okayish as the bad guy. Sometimes he projects the right big bad and mad bad-guy attitude but sometimes he is just silly and just as over the top as the action scenes. He is supposed to be a mastermind but he comes out as a thug a’ la a not so intelligent drug baron in many scenes.\r\n\r\nThe action scenes? Well, they are classical John Woo material. Fast paced with a lot of stunts and things that go boom. They are also, as expected, hugely over the top and unbelievable. They provide a enjoyable visual experience but, as I wrote above, they are not really what I would expect from a Mission Impossible movie.\r\n\r\nThe romance between Hunt and Nyah is the typical Hollywood, let’s throw in a sexy girl and some superficial attraction, which develops from get lost to I love you in the matter of a few hours of contact, between the lead character and the girl. Meh!\r\n\r\nI get the impression that the people that have created these movies so far have not really watched a single full season of Mission Impossible.","id":"56863ac592514132db01c0f5","url":"https:\/\/www.themoviedb.org\/review\/56863ac592514132db01c0f5","movie_id":955}
{"author":"Gimly","content":"The first underwhelmed me, but this one straight-up bored me. Again, of course seeing Hunt climb a mountain without a harness is impressive sure. And I even quite liked the idea behind the villain of the piece (though even that angle was woefully underdeveloped).\r\n\r\nEven setting it in predominantly Australia was enough to grab my attention, and that's saying something cause I'm pretty biased when it comes to that. I hear tell that _Mission: Impossible II_ is the low point in the series, and that at least is encouraging, because if anything afterwards is much worse than this one, I don't know if I'll be able to make it through to Rogue Nation.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"57b2d23dc3a36837d7000b14","url":"https:\/\/www.themoviedb.org\/review\/57b2d23dc3a36837d7000b14","movie_id":955}
{"author":"aardwark69","content":"After quite entertainign Mission Impossible I the second installment turned out ... terrible. As if the screenwriters didn't know how to fill the 2 hrs with action the overuse of heroic slow motion scenes is horrible. You almost might need a barf bag if you can't stand slo-mo every five seconds... for 15 seconds. I am amazed they did decide to push on with more M:I movies after this one, then again, these turned out much much better even if it would be hard to beat that lousy piece of crap of a movie.","id":"5e9120963679a10018375490","url":"https:\/\/www.themoviedb.org\/review\/5e9120963679a10018375490","movie_id":955}
{"author":"John Chard","content":"The last time I was this naked in public I was coming out of a uterus!\r\n\r\nMiss Congeniality finds Sandra Bullock as FBI Agent Gracie Hart, who must go undercover in the Miss United States beauty pageant to prevent a psychopath from committing untold homicide.\r\n\r\nThe premise is simple, it's a Pygmalion\/My Fair Lady scenario that transforms the rough and tough Gracie into a viable contestant for the pageant. Thus we have all the comedy that comes with her literally battling everyone, including her own opinions on pageants, as she is being asked to be something she doesn't believe is in her make up. The mystery of who the killer is who's on the loose is strong for a good portion of film, and even once it's known and drama takes centre stage, it's still hard to get the smile off of your face. \r\n\r\nThe jokes are plentiful, with Bullock finding chemistry with all of her co-stars. She's a very under valued comedy actress, and her ability to bond with an entire cast is marvellous to observe. Reference sexual tension with Benjamin Bratt, the jousting hostilities with Ernie Hudson, the way she bounces off of the other beautiful girls, and best of all the by-play with Michael Caine, who is playing a camp stylist and walks in to lift the laughter roof off the rafters in every scene he is in.\r\n\r\nIt doesn't push the boundaries of comedy, but it's thankfully a consistently funny piece of work, aided by a super cast on form who make a better comedy out of what the screenplay suggested it had any right to be. 7\/10","id":"559464be925141645a004597","url":"https:\/\/www.themoviedb.org\/review\/559464be925141645a004597","movie_id":1493}
{"author":"Wuchak","content":"***Melancholy, foul (but amusing) werewolf flick in the suburbs of Toronto with Katharine Isabelle***\r\n\r\nTwo Goth-ish sisters in the burbs of Ontario are outcasts at their school and obsessed with death. Redhead Ginger (Katharine Isabelle) is hot and blunt while Brigette (Emily Perkins) is mousey. When the former gets bit by an evident werewolf she slowly starts morphing and it changes the siblings’ lives forever. Kris Lemche and Jesse Moss are on hand as the dudes in the girls’ lives while Mimi Rogers plays the seemingly oblivious mother.\r\n\r\n\"Ginger Snaps\" (2000) takes place in the Fall and there’s a gloomy pall with constant F-bombs (mostly from Ginger), but an edge of black humor. The blithe mother, for instance, is amusing. There are similarities to “The Rage: Carrie 2” (1999), but it’s nowhere near as effective. The set-up is good, but the story starts to drag from there and the suburban locations are disagreeably one-dimensional. Katharine Isabelle is the sole feminine interest, but Perkins plays a somewhat interesting character. Meanwhile Lemche’s Sam is notable as the unexpectedly gallant pot-pusher.\r\n\r\nThe film runs 1 hour, 47 minutes and was shot in suburbs of Toronto (Brampton, Mississauga & Markham).\r\n\r\nGRADE: B-\/C+","id":"5cd9c7d7c3a3683c67c3ac97","url":"https:\/\/www.themoviedb.org\/review\/5cd9c7d7c3a3683c67c3ac97","movie_id":9871}
{"author":"talisencrw","content":"This was a captivating film I had wanted to see for some time now. Even though I know the world is like this, I keep on with hope, optimism and blind faith that something can be done to ameliorate the human condition on a global scale. No one should have to live like this unless of course they choose to do so.","id":"574623789251415e65000037","url":"https:\/\/www.themoviedb.org\/review\/574623789251415e65000037","movie_id":14273}
{"author":"MoHA","content":"Just as the mystery of Jack the Ripper continues to grip the English imagination, the case of the Papin sisters of Le Mans — two maids who, in 1933, brutally slaughtered their employer and her daughter — holds a peculiar sway over the French. Jean Genet used the ghastly events as the basis for his celebrated one-act play \"The Maids,\" while the cream of France's intelligentsia, from Jean-Paul Sartre and Simone de Beauvoir to Jacques Lacan, have searched for answers to the questions raised by the Papins' bizarre crime. Jean-Pierre Denis's scorching film — one of the most harrowing true-crime dramas since IN COLD BLOOD — is the latest treatment of the subject, and it's one of the most thorough. Based on the minutes of the sensational trial, selected first-hand accounts and Paulette Houdyer's authoritative book, L'Affaire Papin, the film touches on all the aspects of the case that continue to make it such a fascinating subject: forbidden sexuality, psychosis, class resentment, familial discord, gender oppression, and a tragic case of folie à deux that ended in 30 minutes of sheer savagery. Bringing it all to life is a devastating performance by Sylvie Testud as the high-strung, psychotic Christine Papin, one of four daughters born in poverty to a difficult mother and a hard-drinking, sexually abusive father. Reunited with her younger, far more impressionable sister, Lea (Julie-Marie Parmentier), after childhoods spent in separate orphanages or with relatives, Christine is pressed into service as a housemaid for various bourgeois families. When possible, Christine persuaded her employers to hire Lea as well. Consumed by paranoid delusions, Christine begins to unravel. She's certain that her hated mother is conspiring to take Lea away, her increasingly unhealthy attachment to Lea becomes carnal, and the deep-seated resentment she feels towards their latest employer, Madame Lancelin (Dominque Labourier), begins to chafe and then fester. Christine becomes a walking time bomb that finally explodes in a display of appalling violence. Thanks to Testud's tightly controlled performance, Christine's psychic collapse is just as frightening as the crime she and Lea commit, and Denis does little to cushion viewers from the horror; he doesn't even provide a musical soundtrack. Nearly 75 years after the fact, the matter still hasn't given up all its secrets, but Denis's film comes close to a definitive, deeply disturbing account.","id":"562561c5c3a3680e1d013d13","url":"https:\/\/www.themoviedb.org\/review\/562561c5c3a3680e1d013d13","movie_id":62124}
{"author":"CRCulver","content":"Released in 2000, <i>Blackboards<\/i> was the second film by Samira Makhmalbaf, daughter of acclaimed Iranian auteur Mohsen Makhmalbaf and a precocious director in her own right. As the film opens, a group of itinerant teachers lug blackboards into the mountains of Iranian Kurdistan, seeking to bring education to this illiterate, impoverished region in exchange for some meagre income.\r\n\r\nTwo of the teachers quickly branch off from the group, and the film follows their adventures. Saïd (Saïd Mohamadi) falls in with a group of nomads trying to get back to their native land across the border in Iraqi Kurdistan. Rebwar (Bahman Ghobadi) meets a group of children transporting contraband over the border. The teacher's efforts to help the locals learn to read and write are rebuffed time and time again, to the point that the film takes on the quality of a play by Samuel Beckett or Harold Pinter. Saïd's attempts to get through to the lone woman in the party (Behnaz Jafari) are the height of absurdism.\r\n\r\nSamira Makhmalbaf's visual aesthetic is mainly that of her father's early films, and the film evokes the beauty of this mountainous region, as well as the desolation that causes its poverty. And it's cool that the dialogue is in Kurdish, as there aren't so many films available in the West that highlight this people. However, I must say that I found other aspects disappointing. <i>Blackboards<\/i> makes a thought-provoking point that the poor are too busy surviving to worry about ideals like education, but the script doesn't really hang together. The acting is also inconsistent, with a big disconnect between the professional actors and the local Kurds who were brought on.\r\n\r\nYou might take a chance on <i>Blackboards<\/i>. I certainly don't regret seeing it, it's memorable and there's some humour. But I remain unsatisfied.","id":"5b99f344c3a36827800022a2","url":"https:\/\/www.themoviedb.org\/review\/5b99f344c3a36827800022a2","movie_id":28988}
{"author":"Wuchak","content":"Campy, amusing heroic fantasy with – you guessed it – dungeons and dragons.\r\n\r\nRELEASED IN 2000 and directed by Courtney Solomon, \"Dungeons & Dragons\" chronicles events in the kingdom of Izmer where the idealistic Empress (Thora Birch) advocates equality between the mages and commoners while the power-mad Profion (Jeremy Irons) plots to overthrow the Empress with the help of his formidable henchman Damodar (Bruce Payne). A ragtag team is assembled to save Izmer by apprehending the Eye of the Dragon: Two thieves (Justin Whalin and Marlon Wayans), a beautiful mage apprentice (Zoe McLellan), a dwarf (Lee Arenberg) and an elf girl (Kristen Wilson).  \r\n \r\nThe first shot with Irons hamming it up as the diabolical Profion made me bust out laughing. In other words, the movie telegraphs from the get-go that it’s not to be taken seriously. If you can roll with the campiness, this is an amusing throwaway fantasy flick. Imagine the gaudiness of “Star Wars” (1977) if the story were transplanted to a Medieval-like kingdom where dragons & magic are reality and you’d have a good idea of what “Dungeons & Dragons” has to offer. \r\n\r\nThis was a theatrical release that cost a whopping $45 million, but totally bombed at the box office. The 2005 sequel “Wrath of the Dragon God” (with only Bruce Payne returning as Damodar) cost just $15 million and is slightly better because the creators took the material seriously, but it’s decidedly TV fantasy fare.\r\n\r\nThe film scores pretty well on the female front with the winsome McLellan and cutie Birch. Whalin and Wayans are entertaining as the two main protagonists, if you can get past their goofiness. People love to hate Snails (Wayans), but I found him to be a likable, amusing character.                                 \r\n\r\nTHE MOVIE RUNS 1 hour 47 minutes and was shot in the Czech Republic (Kutná Hora and Prague). WRITERS: Topper Lilien and Carroll Cartwright.  \r\n\r\nGRADE: C","id":"5aa802b8c3a36839cb020cdf","url":"https:\/\/www.themoviedb.org\/review\/5aa802b8c3a36839cb020cdf","movie_id":11849}
{"author":"xenocast","content":"After writing three high-praise reviews, I tried to think of the worst movie that I'd ever sat through and this movie came to mind, front and center. I've sat through plenty of \"chick flicks\" but even by chick flick standards this one is just horrible. (to give this a more modern reference, I rate this one below \"The Vow\" on the painful to watch scale. If The Vow is a broken femur, Dr. T and the Women is everlasting torment in the 9th circle of Hell.) \r\n\r\nI try to look for the good in any movie, and I have plenty of low budget favorites as well as many Hollywood, blockbuster favorites.  I've actually seen Dr. T. and the Women, movie on people's \"Favorites\" lists and I scratch my head and the only conclusion I can come up with is that the people that made this movie and actually like this movie are infatuated with Richard Gere and he could just stand in front of a camera doing anything at random for 90 minutes and these persons would have a deep admiration of the film...  As a movie there is just nothing here. It is an absolute piece of c. I honestly believe that this movie could cause brain damage. Honestly I generally like Richard Gere movies, be they chick flick or not, but this is just an abomination. And if you absolutely have to see Helen Hunt in a \"B\" movie checkout Trancers. At least there is no pretense.","id":"4fce88ed19c29523e0000069","url":"https:\/\/www.themoviedb.org\/review\/4fce88ed19c29523e0000069","movie_id":10763}
{"author":"TheTenth","content":"Gurukul university is know for its excellency. Her dean Narayan Shankar (Amtabh Bachchan) has very strict rules though : you must commit to your studieswith no distractions, especially love. \r\n\r\nWhen new students Karan (Jimmy Shergill), Sameer (Jugal Hansraj) and Vikram \"Vicky\" (Uday Chopra) enter, they have dreams of great success in life. When out of the school for errands, they meet Kiran (Preeti Jhangiani), Sanjana (Kim Sharma) and Ishika (Shamita Shetty) and start developing feelings for them. But Kiran tells the others of the story of the \"sad poet\". Once a student in Gurukul, he fell in love with a girl, they got along very well, but she was Narayan's daughter and when he heard about that, he fired the young man without even seeing him, and when fired from Gurukul, you can never find a place in another university.\r\nSo they have no choice but get on with the studies.\r\n\r\nOne day, a new professor comes, Raj Aryan Malhotra (Shah Rukh Khan), he wants to teach music, and at first Narayan refuses, but gives him his chance to teach music if he finds enough students. But Raj is not here to only bring back love in the students' hearts, he has some unfinished business with Gurukul\r\n\r\nThis is a romantic\/drama, but in the Bollywood way, there are lots of funny moments. The story is both the developing love stories of the new students, and the story of Raj (and also Kake - Anupam Kher in a very funny role). It's very impressive how they fit 4 love stories and an opposition of character in the same movie. Acting is astounding by SRK and Bachchan, and strong from the newcomers. The dance numbers and songs are so great too.\r\nVery recommended.","id":"5a8d46e4c3a36820a800564b","url":"https:\/\/www.themoviedb.org\/review\/5a8d46e4c3a36820a800564b","movie_id":11518}
{"author":"dancingdrunkintothefuture","content":"raw depiction of shifting cultural ideology in Japan. fascinating divulsion into the brutal world of female wrestling which i had no idea existed in Japan. Logninotto offers a stripped back view, never appearing in front of the camera nor providing voiceover - an immersive experience, placing us in the eyes and headspace of Longinotto as she wields the camera. following the journey of a newcomer, we root for the underdog. experiencing both top tier wrestling and training, we question the morality of wrestling in the 2000s which was more of an MMA crossover. not one to miss.","id":"5e020ec075110d0013d9c999","url":"https:\/\/www.themoviedb.org\/review\/5e020ec075110d0013d9c999","movie_id":74121}
{"author":"John Chard","content":"Look into my eyes!\r\n\r\n\r\nGangster No. 1 is directed by Paul McGuigan and written by Johnny Ferguson, Louis Mellis and David Scinto. It stars David Thewlis, Paul Bettany, Malcolm McDowell, Saffron Burrows, Kenneth Cranham, Jamie Foreman and Eddie Marsan. Music is by John Dankworth and cinematography by Peter Sova. \r\n\r\nGangster 55 (McDowell\/Bettany as the younger version) looks back on his brutal life, on how he became a gangster... \r\n\r\nThe British gangster genre of film was gathering apace in 2000. Guy Ritchie's Snatch would wow critics later in the year, while Ben Kingsley's ferocious turn in Sexy Beast (David Scinto and Louis Mellis co-write on that as well) would even get an Oscar nomination, yet Gangster No. 1 is the equal of both films but still doesn't have the acclaim afforded the others - undeservedly so. \r\n\r\nPredominantly set in the late 60s, with period flavours strong, pic doesn't pull its punches, and yet it is never over gratuitous with the violence and mania (but you do feel it big time) that surrounds Gangster 55 (Bettany brilliantly feral and frightening). It's with the characterisations where McGuigan's film gets its strength, we witness greed, blood lust and the yearning of power via chilling portrayals, set to the back drop of a scuzzy London underworld where even the vermin don't dare to dwell. This is a film not wanting to be loved thematically, but the top performances across the board and pic's ability to grab you by the throat - to not let go - makes it a rip-snorting slice of evil. Essential for those interested in the British gangster film revival of the noughties. 8\/10","id":"5574697b9251413aa0000b41","url":"https:\/\/www.themoviedb.org\/review\/5574697b9251413aa0000b41","movie_id":10394}
{"author":"zombieakacris","content":"WHAT A GREAT CAST FOR SUCH A CHEAP FILM.\r\n\r\nDescription:\r\nThree college students base their class project around gossip and how fast it spreads, which soon spirals out of control.\r\n\r\nReview:\r\nGossip is a Dramatic Thriller that was made fifteen years too late. The story sounds like something that could have been believable in the 80's but not for the 2000s, rape kits and a thorough investigation solves the plot. It's pretty to look at and the cast is excellent but the rest of it is unbelievable.","id":"5dd0f0b6b76cbb00137ad8f4","url":"https:\/\/www.themoviedb.org\/review\/5dd0f0b6b76cbb00137ad8f4","movie_id":18041}