{"author":"Gimly","content":"I'm a pretty big fan of director Jamie Blanks, but _Long Weekend_ didn't really do it for me. Neither lead is redeemable, which, to be fair, is sort of the impetus for the horror in this horror movie, but still, it makes it hard to attach yourself when said leads are the only characters on screen for 99% of the movie. One star for _Long Weekend_ itself, and then a whole extra star just for the sea-life.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5a2cc9630e0a264cc1142335","url":"https:\/\/www.themoviedb.org\/review\/5a2cc9630e0a264cc1142335","movie_id":20323}
{"author":"Key-Si","content":"\"One Missed Call\" is a remake of the Japanese version from 2003, was directed by Eric Valette and stars Shannyn Sossamon in the leading role. The plot was as simple back then as it is here and now. People receive a call from their own future self to their own cell containing the last few seconds of their deaths. \r\n\r\nThe only problem with this remake is, that the film makers had no idea what they were doing and in my opinion the material of original director Takashi Miike was pretty much raped and left for dead. Not only that this remake doesn't have the creepy feeling of the original \"Chakushin Ari\", even the characters have been \"white washed\". We have seen this already with the US remake of \"The Ring\", with the differenece that in that remake a lot of respect was shown towards the original movie \"Ringu\". Not so in \"One Missed Call\". The significant ringtone was changed to a dull and relaxed one, taking completely away that sharp and chilling aura surrounding these calls. On top director Eric Valette completely missed the point of \"One Missed Call\" being a franchise such as the already mentioned \"The Ring\" and also \"The Grudge\". Of all these franchises solely \"The Grudge\" was able to stick to the basic idea behind the Asian vengeful spirit, probably because original director Takashi Shimizu also took on the US remake. Yes, there were mostly non Asian characters in it and that was fine for the spirits in form of Kayako and Toshio kept their Japanese origin, making the 3 US remakes still relatable to the origin \"Yu-On\" franchise. \"The Ring\" already failed to do so by replacing Sadako with Samara, but at least it was a really good movie with a great atmosphere. \r\n\r\n\"One Missed Call\" was supposed to carry the tradition forth with Mimiko, but instead we got some random characters you don't even care about and the PG13 crime gives this remake its death blow. You loved the original especially for the extended bone breaking, limb twisting death scene in the film studio? Forget about that in this one. This here is made for children's eyes. Sure, the CGI ghost effects towards the end were somewhat charming, but it is just about as creepy as some effects presented in \"The Pirates Of The Carribean\" and such. The hugging scene of the mother with rotten flesh falling off her fouly body piece by piece? Not even included! The only correct similarity seems to be that in both films the little girl who later becomes the vengeful spirit died due to an Asthma attack ignored by the mother(s). But that's about it.  \r\n\r\nThis remake is shot nicely and also the leading actors Shannyn Sossamon and Edward Burns tried their best to carry the film, but when the film itself already lacks any form of vision and respect for its origin, it just ends up as being a pointless, soulless cash grab product with a few nice visuals. If your kids are 13 you can show this atrocity to them, but please... as soon as they are old enough, do them a favour and show them the real thing. To all the fans of the original: stay away from this one. It will only anger you and leave a very bad taste in your mouth... Or is that due to the red candy? You have been warned!","id":"5b000e43c3a3687c530079a7","url":"https:\/\/www.themoviedb.org\/review\/5b000e43c3a3687c530079a7","movie_id":6933}
{"author":"prabhushakti","content":"This review contains spoilers. A documentary style film, as the director visualised in his mind, and a cheap belief of what it is based upon. I absolutely lost my patience while watching this movie, because I wanted to see a good movie and all it had is how it wanted to be, which I appreciate but unfortunately I hatred it because I was thinking why is it not in some informative channel's stupid shows than a movie? I thought about Häxan - 1922. A film, I love so much because not only it is entertaining but also very well shot and represented. I also thought about \"it follows\" which I believe is another great horror film in the history of cinema.\r\nWhile watching this Australian director's film, I could not see what else it has that there never have been before or is it important as long as the film is good at it. Does this movie show us  anything we have never seen? I absolutely hated the poor direction of how the characters were told to talk about the tragedy! What I hated the most is the blend of dialogues and music. The cheap creepy background music was so high, that you absolutely have to feel the poor suspense the director forces us to feel so desperately, but it was so painful and disgusting far from disturbing. I only felt bad about the privacy of the family involved in the film, if it is based upon the real story which I don't wish to research on.\r\nI will tell you my analysis about the first creepy photo of the dead body and last same living video of the creepy faced body:\r\nA saddist murdered or psychopath did the horrible things to her face, who had all her possessions, and before killing her, he\/she recorded her sadism and buried it in the ground so nobody could find it. Maybe he has been giving her drugs and raping her, which caused her to go through anxiety or depression of death and all those nightmare. Maybe the sadist is not anymore than the Hungarian hypnotiser. Now irrational but dumb people would like it, and some cheap people would spend some bucks to turn it to the most horrible horror film.\r\nI want to explain here - a lot of people like the end creepy footage - I found it absolutely horrible because again the cheap creepy sound gave me a headache","id":"5a9ed4e3c3a3680a13001575","url":"https:\/\/www.themoviedb.org\/review\/5a9ed4e3c3a3680a13001575","movie_id":27374}
{"author":"Vlad Ulbricht","content":"Amazing, astounding, bewildering, breathtaking, extraordinary, impressive, marvelous, miraculous, spectacular, staggering, startling, striking, stunning, stupefying, stupendous, wonderful, wondrous, astonishing, awe-inspiring, awesome, exciting, hair-raising, heart-stirring, impressive, magnificent, moving, overwhelming, spine-tingling, stunning, thrilling, boss, curious, darb, exceptional, fab, fantastic, flash, gnarly, heavy, inconceivable, incredible, odd, outstanding, particular, peculiar, phenomenal, primo, rare, remarkable, singular, special, strange, stupendous, surprising, terrific, uncommon, unfamiliar, unheard-of, unimaginable, unique, unprecedented, unthinkable, unusual, weird, wicked, arousing.\r\n\r\nThese words quickly crossed my mind after the first 4 minutes of this ground-breaking, genre-busting feast for the senses.\r\n\r\nThe way this film opened with the immensely suspenseful scene featuring the pretty blond woman and the reptilian monster, (drinking the evil elixir), immediately grabbed my attention and it didn't let go. J Neil Schulman then innovatively broke the fourth-wall at the end of this scene, with a direct appeal to his audience to have a \"Blast\" watching his film and also to not \"FORGET\" the masterpiece they are about to experience, by imploring them to concentrate and upgrade their memory no less than 3 times. This left me exhausted with excitement and anticipation. So much so, I tried to call J Neil Schulman on the phone number that he subliminally flashed up on screen, to congratulate him on such a brilliant first scene. Unfortunately he wasn't there. Unusually, the girl (who I presumed to be his secretary), then tried to sell me sexual dysfunction pills. I bought 14 bottles.\r\n\r\nThe rest of the film never quite reaches the heights achieved in the blonde lady\/lizard man scene, but it is still better than anything else you will see this or any other year. The casting is sublime. All the actors and actresses are obvious masters of their craft, in particular the Elvis impersonator in the buffet song featured in the end credits. I really thought he WAS Elvis.\r\n\r\nJ Neil Schulman was the best actor in the film, (of course). He FILLED the screen with his presence. His performance was HUGE and FAT with subtle nuances and charisma. He gave immense WEIGHT to the character of Alistair, plus he was VORACIOUS in his CONSUMPTION of the viewer's attention. J Neil Schulman DINED OUT on the masterful script and GORGED the lines on offer. Never has an actor shown so much GUTS on screen. A masterful performance.\r\n\r\nWe must also mention the superb writing in this film. An IRS agent working for the Federal Air Marshals inspects a Muslim man and gets in trouble so they send him to a brothel full of wonderful whores and a linebacker who are also actresses, plus Uhura, in Pahrump. The whores and the linebacker and Uhura often sing in casino car-parks because they like to show they are not only great actresses but also great car park singers. Back at the brothel, by an amazing coincidence, the IRS agent sees the same Muslim man from before, who then plays a violin and kills one of the whores (but unfortunately not the linebacker) and then visits Hoover Dam to take an exciting ride down a long rope. The IRS agent then follows the Muslim man to a hospital, with Uhura and the surviving whores and the linebacker, but not before the Muslim man shoots J Neil Schulman with a ketchup bottle and speaks to Cat Stevens. Uhura then shoots the Muslim man with a small gun ( which she had kept it hidden in her pink velvet pouch) and the whores lurk around looking gorgeous whilst showing off their exquisite acting abilities and some schmoo. They then go to a buffet restaurant and take the last fried drumstick before Elvis gets to it, (because Elvis has a cholesterol problem and needs to cut back).\r\n\r\nAll in all this is the greatest film I have ever seen in my entire life and it therefore is number #1 in my eyes! Accordingly, I just went and gave it a vote of 1, because its NUMBER #1!!!\r\n\r\nHOORAY for J Neil Schulman. Without him my life would be a tiny bit less full than it already is. He entertains like few men before him and I am so so happy I discovered his wonderful talents and his endless ability to entertain.\r\n\r\nJ Neil Schulman is the best. I mean that in all sincerity.","id":"5917a816c3a368426903d1fc","url":"https:\/\/www.themoviedb.org\/review\/5917a816c3a368426903d1fc","movie_id":172911}
{"author":"Wuchak","content":"***Fun island thriller, but a little too long***  \r\n\r\nReleased in 2008, \"Fool's Gold\" stars Matthew McConaughey & Kate Hudson as a couple on the verge of divorce in the Bahamas, the former a treasure-seeker. Donald Sutherland plays Hudson's new rich boss and Alexis Dziena his bimbo-ish daughter. Ray Winstone and Kevin Hart also factor in as potential villains.\r\n\r\nIf you can imagine serious island-thrillers like \"The Deep\" and the two \"Into the Blue\" flicks mixed with a heavy dose of comedy and cartoonish action you'd have a good idea of \"Fool's Gold.\" It's basically \"The Goonies\" as adults in the Bahamas. \r\n\r\nKate and McConaughey look great and are great together, and everyone else is likable, even the villains (sort of). The problem is the movie is too long at 1 hour, 52 minutes. A silly, fun film like should limit the runtime to around 85-100 minutes.\r\n\r\nThe story takes place in (or near) the Bahamas, but the film was shot on the east coast of Queensland, and you can tell. The coast of Queensland is gorgeous but it lacks the lushness of the Caribbean. Regardless, the film is worth watching just for the locations, especially on a cloudy fall day or a cold winter night.\r\n\r\nSo this is a fun island flick with romance, treasure-hunting and adventure, but it’s a little too long for such goofy antics. For the real deal in oceanic thrillers check out 2009's \"Into the Blue 2: The Reef,\" which IMHO is way better than the original \"Into the Blue\" from 2005. \r\n\r\nGRADE: B-\/C+","id":"5c6bf1349251417aa209ee8d","url":"https:\/\/www.themoviedb.org\/review\/5c6bf1349251417aa209ee8d","movie_id":8676}
{"author":"Wuchak","content":"Entertaining romcom marred by incongruent porn-ish elements\r\n\r\nRELEASED IN 2008 and directed by Nicholas Stoller, \"Forgetting Sarah Marshall\" is a romcom starring Jason Segel as Peter, a genial musician from Los Angeles who composes music for a popular detective show, which stars his hottie girlfriend, the titular Sarah Marshall (Kristen Bell). After she breaks up with him he vacations at a resort in Hawaii where, unexpectedly, his ex & her rock star beau (Russell Brand) also happen to be staying. Mila Kunis plays a concierge at the resort who takes interest in Peter.  \r\n\r\nThis is a compelling, amusing romantic comedy with Segel likable as the protagonist and Bell winsome and charismatic as his ex. Brand is great as a Jim Morrison-like rock god who doesn’t drink; the way he performs on stage is laugh-out-loud funny (poking fun at rock stars). The resort locations are a highlight and the story is sprinkled with several notable guest stars (Bill Hader, Jack McBrayer, Maria Thayer, Taylor Wily, Paul Rudd, Da'Vone McDonald, Jonah Hill, etc.).\r\n\r\nUnfortunately, there are several NC-17 (aka porn-ish) scenes that I wasn’t expecting since the version I watched was supposedly rated ‘R.’ I’m talking about several scenes of simulated sex, including one involving fellatio, as well as full-frontal male nudity right out of the gate (Seriously?). I basically ignored these scenes or rolled with them and laughed. I’m sharing this info for those who don’t care to see a movie mixed with nigh-porn elements.                   \r\n\r\nTHE MOVIE RUNS 1 hour 51 minutes and was shot in O'ahu, Hawaii, and Los Angeles, as well as studio work done at Universal City, CA. WRITER: Jason Segel.   \r\n\r\nGRADE: B but basically ruined (for me) by the porn aspects, so really ‘D’","id":"5ab963e40e0a2636480091f7","url":"https:\/\/www.themoviedb.org\/review\/5ab963e40e0a2636480091f7","movie_id":9870}
{"author":"Andres Gomez","content":"This was a refreshing surprise. Quite hilarious at some points, not so funny in others but still refreshing and the cast does a good job.","id":"54f5ec3a9251410692000017","url":"https:\/\/www.themoviedb.org\/review\/54f5ec3a9251410692000017","movie_id":9870}
{"author":"John Chard","content":"Down in an abandoned bunker in Eastern Europe...\r\n\r\n\"SPOILERS\" \r\n\r\nOutpost is the feature length directing debut of Steve Barker, it's written by Rae Brunton and is produced by Arabella Croft & Kieran Parker; who financed the film themselves by mortgaging their own Glasgow home. Starring are Ray Stevenson, Julian Wadham, Richard Brake & Michael Smiley. The plot sees scientist and businessman Hunt (Wadham) hire a mercenary crack team headed by DC (Stevenson) to protect him on a perilous mission into Eastern Europe. There they are to locate an abandoned bunker in no-man's land and seemingly gather information to aid Hunt's research. However, once at the outpost, the men make a horrific discovery - one that is only the start of the terror to come.\r\n\r\nLets get the blatantly obvious negatives out the way first, the kind that pithy critics enjoy beating an independent film with. Outpost is not fresh, certainly not in story, setting and god forbid -- logic. Channeling (by the makers own admission) John Carpenter's spooky 1980 movie The Fog - with more than a nod towards Michael Mann's The Keep & Ken Wiederhorn's Almost Human - Outpost does, from the off, have a familiar ring to it. Yet Barker's movie can stand on its own two ghostly feet on account of it having heavy atmosphere that's nicely blended with no short supply of the grisly. This is not about cheap shocks, though. Barker slow burns the first half hour and then steadily turns up the heat as the secrets of the \"Outpost\" start to unravel, with the sense of dread that accompanies said unravelling palpable in the extreme. \r\n\r\nAway from the rewarding creepy vibe that dominates the piece, the technical aspects also stand up considerably well. Barker's directing is unobtrusive and aware of its genre roots, with a cartoon\/animation section deftly effective, while Brunton's screenplay is lean and lets the characters breath. That it has commentary on the barbaric nature of the Nazis and slots in a Die Glocke for its core, also, should not be understated, war is hell is as apt a saying here, as apt can be. Note worthy on the war is hell theme is that here the makers are saying war is always and everywhere,\u0085 not only is the film set with one foot in a historic war and the other in a \"today\" war, but each of the mercenaries represent a soldier from a different war-zone around the world. With the wooded valley of Dalbeattie near Castle Douglas in Scotland standing in for Eastern Europe, Gavin Struthers does wonders on photography. Smartly stripping the colours down to a near monochrome finish that lends weight to the historical context of the story, he also makes the interiors claustrophobic and captures rich detail for the exteriors. The score from James Seymour Brett is one of the better ones for a low-fi British horror, suitably pulse like, and the acting is no-nonsense and befitting the characters within.\r\n\r\nWith a no cop out and suitably bleak ending, Outpost isn't after the popcorn crowd. It may be heavily influenced by past down in the woods army like shockers, but it sure as hell shows the likes of Rob Green's awful 2001 movie, The Bunker, how it should be done. 7\/10","id":"5bd7804d0e0a26224300002c","url":"https:\/\/www.themoviedb.org\/review\/5bd7804d0e0a26224300002c","movie_id":9017}
{"author":"Arrrrrrrach","content":"This film should have been more than it was. The premise is great, the atmosphere is spot-on, the costumes and make-up are menacing and the characters are pretty decent. This menace is somehow lost, however, at some point during the overblown final plot-arc, which is a major shame because it really looks stunning and builds up some satisfying apprehension.\r\nI cannot give it less than three stars, but only because I absolutely love this sort of thing, having grown up with Wolfenstein and Doom to take me to the early hours. One day somebody will nail this idea and unleash true grim krieg.","id":"58a7942fc3a36877180009d3","url":"https:\/\/www.themoviedb.org\/review\/58a7942fc3a36877180009d3","movie_id":9017}
{"author":"John Chard","content":"Outlandish!\r\n\r\nDuring the reign of the Vikings, a man from another planet crash lands on Earth and unfortunately brings with him a giant alien beast known as the Moorwen. Not only that, but once assimilating himself with this particular Viking faction, he finds that he is now part of a war they are engaged in with another Viking race.\r\n\r\nYep, it's predator in the Viking age, berserker sci-fi played purely for entertainment and cheese sandwiches. Jesus Jimmy Caviezel brings the broody macho posturing, John Hurt the ham, while Ron Perlman picks up an easy pay check for growling a lot. It's still a lot of fun, though, the mixture of TV movie type production values mixing with a cheeky idea that sees the creation of a genuinely cool monster (effects not half bad at all). Good genre action for the undemanding genre faithful. 6\/10","id":"55c7f6e992514105d8002d95","url":"https:\/\/www.themoviedb.org\/review\/55c7f6e992514105d8002d95","movie_id":10529}
{"author":"gurudf","content":"Essa é a comovente história de Jim Crawford (Michel Flynn), um advogado de uma grande cidade que venceu a maioria das batalhas em sua vida. Após a perda de sua esposa, ele tem de enfrentar um futuro solitário, até que, de repente, uma virada do destino (ou talvez um anjo) leva Jim a descobrir os filhotes abandonados de uma loba. Mesmo sem nenhum preparo para a tarefa, o advogado decide levá-los consigo e tomar conta dos animais, uma decisão que mudará para sempre a sua vida.","id":"51e3733b19c29502ea09d565","url":"https:\/\/www.themoviedb.org\/review\/51e3733b19c29502ea09d565","movie_id":61869}
{"author":"John Chard","content":"A timely reminder of what makes action\/thriller movies fun.\r\n\r\nJerry and Rachel are two strangers thrust together by a series of scenarios put together by a mysterious female caller. Under threat to their families and themselves, both Jerry & Rachel must overcome the most hazardous of situations. Intriguingly everything around them seems to be controlled by the female voice that guides them, but just why is the FBI so hot on their tail?, does Jerry's twin brother hold the key?. All will be answered as our protagonists hurtle towards something that may have deadly consequences for America.\r\n\r\nBig Brother gets a reboot and delivers as fun a genre picture as was released in 2008. Yes it's total nonsense, but really the critics venting spleen on this one must have gone through a popcorn entertainment bypass prior to viewing it. Director D.J. Caruso continues his Hitckcockian leanings by following his surprisingly fun \"Disturbia\" with this \"North By Northwest\" type concept that meets a host of the genre staples, where the influences are very hard to miss. Yet as daft as it is, and it is folks, \"Eagle Eye\" knits well together to play out as a highly accomplished piece, the action is first rate, in fact on big screens the two main sequences explode with joyous action abandon. This isn't found wanting on the thriller front either, it's safe to say that no new ground is to be found as we get to the tick tock countdown finale, but Caruso, and writers John Glenn & Travis Wright, have spliced together a series of wholly interesting and thrilling strands. So much so that the finale is disappointingly unable to quite deliver on the promise of the prior build up.\r\n\r\nShia LaBeouf seemed destined to be a young actor who had to earn even the smallest bit of respect, where much like DiCaprio at the time, you felt LaBeouf was likely to get better notices later in his career. After being sidekicks to John McLaine, Indiana Jones, and erm, Optimus Prime, LaBeouf here earned his acting spurs and carries the film with a charm and credibility that the daftness of the piece doesn't quite deserve. Shia is helped enormously by a strong female lead, Michelle Monaghan has an impressive ability to sweat strength whilst channelling believable emotional turmoil, and her interplay with LaBeouf is the heartbeat of the picture. Of the rest, Michael Chiklis is a bit underused, but this is offset by Billy Bob Thornton continuing that knack of being one of the most watchable actors of his generation. Rosario Dawson is sadly weak in this and William Sadler is barely noticeable, conversely though a nod of approval goes to Anthony Mackie who shines in a crucial sequence towards the end.\r\n\r\nMy first viewing was when I went to the cinema with the then two ladies in my life, we were a bit early and sat in the foyer for a while, we watched as they were queuing out the door for \"High School Musical 3\" and weird looking people were trundling in to see \"Saw 5\". There were a total of 12 people in the cinema to see \"Eagle Eye\" on its second week run, at a peak viewing time as well. That was a damn shame because \"Eagle Eye\" may well be a dumb and fun action\/thriller picture, but it's not pro-porting to be anything else, and really film's with honest entertainment intent are to be treasured and used for why they are made for in the first place. \"Eagle Eye\" is made for those who want to shut off from the world for a couple of hours, and in doing so have an energised blast in the process. 7.5\/10","id":"5d88ae44223e20002974f417","url":"https:\/\/www.themoviedb.org\/review\/5d88ae44223e20002974f417","movie_id":13027}
{"author":"Uknown","content":"A movie about robots and emotions? Pixar has made the unlikely combo work really well.\r\n\r\nWALL·E is the lonely robot, the last of his kind, left behind by the humans on Earth. His job - to clean up the garbage the humans have dumped. In 700 years, he seams to have developed one tiny bug - a personality.\r\nJoin WALL·E in his interstellar quest to find a partner.\r\n\r\nWALL·E is short, satirical, dialogue-free and a visual masterpiece. And the fact that it is animated does not make it any less watchable as an adult.\r\n\r\nIt is a must watch for anyone of any age.","id":"57b315fe925141182f002555","url":"https:\/\/www.themoviedb.org\/review\/57b315fe925141182f002555","movie_id":10681}
{"author":"DoryDarko","content":"I typically never write a review on a film that I've already seen more than once, because I insist on the review reflecting my first (and strongest) impression of the film. But after watching Wanted for what must be the 5th or 6th time now, I suddenly felt like writing something anyway, so here I go.\r\n\r\nLet me begin by saying, this is one strange film. Strange in the sense that it's literally like a train wreck that you can't keep your eyes off because it's so fascinating to watch. And you almost feel sick with guilt and exhilaration because you're enjoying it so much. Violence never looked so gorgeous before... \r\n\r\nWanted is about a guy named Wesley Gibson, who is such a hopeless, pathetic dweeb that even Google won't return any results when he types in his own name. He is \"rescued\" from his pitiful cubicle existence by a gorgeous woman named Fox, who recruits him into an organisation of assassins known as The Fraternity, supposedly because they believe he is the only person who can kill the man who killed his father. Little does he know just how drastically his life will actually change once he agrees to join them.\r\n\r\nThe casting of the film is spot-on. James McAvoy has already proved himself to be a versatile actor and he is very believable as a weak push-over, who finds confidence in the fact that group of trained assassins apparently believe in his abilities. He also makes his character likable and fun to watch, because he delivers it with a sense of humour and you can actually relate to him because his situation is so understandable. Basically, he's just another slave to the wage, looking for a way to break free. This way is initially offered to him by Angelina Jolie, and who could say no to a woman like that... Ms Jolie plays a role that seems like it could only have been written specifically for her. Who else could play a beautiful and deadly assassin who's charismatic and covered in tattoos? She could and would kill you in a heartbeat, and yet you just want to be near her. Morgan Freeman plays Sloan, the leader of the Fraternity, and, well... I hardly need to elaborate on this one, do I? He makes pretty much every film he's in worth watching, and that's all I need to say.\r\n\r\nNow, I titled this review 'beautiful garbage'. That's not so much because the film itself is garbage, because it's not, but rather because the events portrayed in this film are so brutal and merciless that they could only come from a very dark and rotten place. The 'beautiful' is directed at the visual effects, because everything ranging from camera techniques to production design to action choreography is so beautifully done, so thrillingly eye-popping that it would almost make you forget that you're watching people get slaughtered, beat up and maimed. Tons of blood flow, brains are splattered against the wall and yet you can't take your eyes off that beautifully designed bullet. That awesome tattoo on Angelina Jolie's hand interlacing with the engravings on her gun. Those mind-blowing car chase scenes. That guy jumping through the glass out of a skyscraper just to finish his \"job\"... This film is visual effects executed to perfection, elevating said perfection to a whole new level. \r\n\r\nIt's all so pretty to watch that it would almost make you able to forgive the writers the overpowering lack of realism. Almost. \r\n\r\nThe staggering amount of ideas and actions that are 98% of the time either inconsistent, improbable or flat-out impossible would in any other case surely put any screenwriter out of work. With a film like this, it's literally only the wrapper that makes the candy sweet. It just goes to show that sometimes, making something really, really pretty can make it worth watching, just so long as you're willing to suspend every inch of disbelief for the sake of watching pretty pictures. Nature, science, biology and every other form of technical factuality is being put to the test here, which is not to say it's basically just being thrown out the window... But hey, I can promise you you're going to get to see a guy get in a car the way you've never seen before. And a girl get in a train in a fashion that defies every rule of physics... It's all worth it for a totally cool, put-your-brain-in-stand-by-mode kind of action flick. \r\n\r\nDirector Timur Bekmambetov has obviously tried his darnedest to make his mark in Hollywood with his first English spoken, big-budget effort, and may I say, he could've done a lot worse. Not to mention the fact that he has managed to recruit a few very big names to top the bill, this is definitely a Hollywood debut to be proud of. I can only hope he will continue to work with the same excellent crew in the future, because although only the sound department was nominated for an Oscar, camera and visual effects would have definitely deserved a nod from the Academy too.\r\n\r\nIn a nutshell, Wanted is an 110 minutes of gorgeous, eye-pleasing nonsense with great action and one very beautiful lady... I for one can't wait for the sequel.\r\n_(July 2012)_","id":"58ac55fec3a36849cc013974","url":"https:\/\/www.themoviedb.org\/review\/58ac55fec3a36849cc013974","movie_id":8909}
{"author":"CRCulver","content":"The Russian filmmaker Sergey Dvortsevoy had gained a reputation for documentaries, but in the 2008 <i>Tulpan<\/i> he tries his hand at fiction with this story set in Kazakhstan. After serving in the Russian Navy, Asa (Askhat Kuchinchirekov) returns to the Kazakh steppe, living with his sister (Samal Yeslyamova) and brother-in-law (Ondasyn Besikbasov) while he tries to court the only unmarried young woman within hundred of kilometres.\r\n\r\nAs a sort of documentary, <i>Tulpan<\/i> will be an interesting experience for viewers in the West, capturing the desolation of the Kazakh steppe and the hard work that herders there must do to eke out a living. Some of the younger characters feel the draw of the big city, whose modernity offers them an easier life than the dull steppe. As a linguist, I found that the film represented well the Russian-Kazakh code-switching common after the Soviet era, which only underscores how these people feel torn between two worlds. The arguable climax of the movie comes with Asa assisting the real-life birth of a sheep, which is depicted realistically so that the audience learns something, but thankfully not too graphically.\r\n\r\nBut as fiction, I am less impressed with the film. I get the feeling that Asa's pursuit of Tulpan was the centre of the original script, but was mostly set aside after Dvortsevoy decided to improvise much of the film. The result is a lack of substance outside the pure observation of traditional life. All in all, it's worth seeing once and you'll learn something, but it's no classic.","id":"5b90b4950e0a2665a800745f","url":"https:\/\/www.themoviedb.org\/review\/5b90b4950e0a2665a800745f","movie_id":8939}
{"author":"Wuchak","content":"***Slow-build suspense on the Trans-Siberian Express***\r\n\r\nA couple doing missionary work in China (Woody Harrelson & Emily Mortimer) takes the Trans-Siberian train from Beijing to Moscow, but their involvement with a dubious couple (Eduardo Noriega & Kate Mara) gets them entangled with a no-nonsense narcotics detective (Ben Kingsley).\r\n\r\nA relative told me a story of his travels in Russia back when it was part of the USSR: He said the deeper he journeyed into the country the more it seemed like he was going back in time. At one point he happened to turn around in some kind of an installation and immediately got stopped by authorities and apprehended. He was taken to the proverbial dark room with a hanging light where he was interrogated for a couple hours. I asked what he thought was going to happen and he said he feared getting taken to a gulag in Siberia.\r\n\r\nI bring this up because you’ll see these kinds of elements in \"Transsiberian\" (2008), a crime drama\/suspense\/thriller that has the tone & themes of “A Simple Plan” (1998), but mixed with a little “Runaway Train” (1985) and “Dr. Zhivago” (1965). While I still prefer “Runaway Train” I have no problem listing “Transsiberian” with these notable films, despite the fact that it’s an obscure flick that bombed at the box office (no doubt because it wasn’t released properly and didn’t reach enough theaters). \r\n\r\n“Transsiberian” works so well because it has the confidence to take its time and establish the characters, which are nicely fleshed-out. Roy (Harrelson), for instance, is an affable Christian who seems oblivious to the evil in the world and assumes the best in everybody. His wife, Jessie (Mortimer), by contrast, has a dark history, but was obviously attracted to Roy’s innocence. She sees her former-self in Abby (Mara), which links them. Meanwhile Carlos (Noriega) is the worldly bad boy who’s an expert at wooing women.\r\n\r\nBut this is just the set-up, the movie takes a thrilling turn in the last act, but it’s superior to the similar Hollywood turn in “A Simple Plan,” which I found unconvincing and a little eye-rolling.  \r\n\r\nThe film runs 1 hour and 51 minutes and was shot in Lithuania, Russian and China.\r\n\r\nGRADE: A-","id":"5ce20fc40e0a263f91c9b676","url":"https:\/\/www.themoviedb.org\/review\/5ce20fc40e0a263f91c9b676","movie_id":6687}
{"author":"Wuchak","content":"**_The real “Horror Express”_**\r\n\r\nIn Eastern Europe, members of a USA college wrestling team board a dubious train to Odessa, Ukraine. Unfortunately some of the staff has something in mind other than a train ride. Thora Birch and Gideon Emery stand out in the cast.\r\n\r\n“Train” (2008) combines “Hostel” (2005) or “Borderland”  (2007) with “Transiberian” (2008) plus the Frankenstein-ian element of “Turistas” (2006) and “The X-Files: I Want to Believe” (2008). It’s basically “Transiberian” with the so-called ‘torture porn’ angle (‘torture porn’ being slasher\/splatter flicks taken to the next level of extreme).\r\n\r\nMovies always amp-up reality to entertain or shock and \"Train\" takes advantage of the fear of being a foreigner in an Eastern Europe country, like Russia or Ukraine, and falling prey to sinister people named Boris, Ivan or Natasha. This should no more be offensive to people from Eastern Europe than \"Deliverance\" (1972) is offensive to people of the Deep South.\r\n\r\nTo be expected in this type of movie, there are some unpleasant and even nasty elements, but that's intrinsic to the horror genre, and particularly this sub-genre: True horror flicks are supposed to horrify the viewer. Beyond that, this is basically a real-life adventure story that turns increasingly terrifying. On that basis, \"Train\" delivers the goods.   \r\n\r\nThe film runs 1 hour, 34 minutes, and was shot in Sofia, Bulgaria.\r\n\r\nGRADE: B","id":"5e9ba7df3103250021c7aa56","url":"https:\/\/www.themoviedb.org\/review\/5e9ba7df3103250021c7aa56","movie_id":22007}
{"author":"John Chard","content":"No tricks here, just a treat.\r\n\r\nTrick 'r Treat is written and directed by Michael Dougherty. It stars Dylan Baker, Rochelle Aytes, Anna Paquin and Brian Cox. Music is by Douglas Pipes and cinematography by Glen MacPherson. Trick 'r Treat plays out as an anthology of four Halloween related stories. One tiny figure with a burlap sack over its head links the film together.\r\n\r\nWarner Brothers kept it on the shelf for two years, a mistake since it happens to be a delightful little frightener that appears to be made with a love of omnibus shockers from back in the day. It's never overtly scary or bloody, but it has a twisted slickness that is rather pleasing in this day and age of poor horror remakes and boorish cash cow sequels. Neatly performed by the cast and with tech credits high from the camera folk, it homages simple horror pleasures as it celebrates Halloween. With a glint in its eye and a macabre smile on the lips, this non linear treat should be perennial viewing for the Halloween hordes. Especially since it rewards still further on repeat viewings. 8\/10","id":"56356fc0c3a3681b540194be","url":"https:\/\/www.themoviedb.org\/review\/56356fc0c3a3681b540194be","movie_id":23202}
{"author":"Wuchak","content":"***What if Jack & Rose married and settled into the conventional American grind?***\r\n\r\nThe Wheelers are a couple with two kids living in the suburbs of Connecticut in the ’50s. Frank (Leonardo DiCaprio) marches off to the big city five times a week, ten hours a day, to a job he hates whereas April (Kate Winslet) takes care of things on the home front, including their hardly-seen children. April's dream of being an actress has failed and she vents her frustrations on Frank. Emasculated, he has a meaningless affair to prove his manhood to himself. Meanwhile April suggests a wild idea for them to move to Paris because Frank's war tales describe it as a place of exhilaration and April desperately wants him to regain that aura of vitality he had when they first met. Will they escape the comatose corner they've painted themselves into or will they join the masses of (supposedly) living dead in their midst?\r\n\r\nEleven years after their mega-hit \"Titanic\" (1997), Kate and Leonardo reunite for \"Revolutionary Road,\" released in January, 2009. Kate has shed her unappealing baby fat and is now a curvy beauty whereas Leonardo is a man and no longer has that boyish vibe.\r\n\r\nI enjoy a good drama now and then, like the excellent \"Snow Angels\" (2007), the potent \"Grand Canyon\" (1991) or the masterpiece \"Dead Poets Society\" (1989), but \"Revolutionary Road\" fails to achieve the greatness of those films, mainly because the characters and their story are fairly boring. The film's just not that engrossing, which is my core criterion for evaluating any flick. In quality and theme, it’s reminiscent of “Joe Versus the Volcano” (1990).\r\n\r\nLike “Joe,” it’s a slyly offbeat drama despite being about American conventionality. The best parts involve Michael Shannon as John, the mentally disturbed son of the real estate lady (Kathy Bates), a fascinating character. Everyone else in the Wheeler's lives thinks their plans to give up their suburban paradise are crazy (big surprise). But John sees the brilliance and necessity of the plan. In other words, the only person who 'gets' the plight of the Wheelers is this nigh-insane dude. But he's not really crazy. John is gifted at seeing through a facade to get to the core of a matter, the awesome or awful truth. And he has no inhibitions about speaking his mind, good or bad. At heart, John is a beatnik, the 50's precursor to the hippie. He represents the first wave of the 60's counter-culture, a generation of youth who discerned the cracks in the post-war \"paradise,\" and rebelled, for better or worse.\r\n\r\nSome important questions are raised: Is life just having a marriage, a family, a well-paying job (you loathe) and a nice home in the pleasant suburbs, plus cigarettes and drinks without end? Or is there more? What about love? What about genuineness? What about unrealized, unused or ignored talents and dreams? What about (gasp) God?\r\n\r\n\"Revolutionary Road\" has some other positives: it's expertly made, has a good score by Thomas Newman and evokes some haunting moments.\r\n\r\nSome have suggested that the film is one POSSIBLE outcome if Jack had survived the end of “Titanic” and married Rose: The once spirited, carefree Jack settles into the robotic grind to pay the bills while Kate is left frustrated at home in suburbia. Regrettably, it’s overall mediocre due to the unengrossing characters and their story, which of course links to the theme its espousing. \r\n\r\nYet it does have flashes of greatness and it makes you reflect on its points. In some ways, the same message is addressed in \"Dead Poets Society\" (and \"Grand Canyon,\" to a lesser degree): rejecting the box society tries to confine you, throwing caution to the wind, and going after your dreams. The difference is that \"Dead Poets Society\" (and \"Grand Canyon\") accomplished this with absorbing stories whereas \"Revolutionary Road\" doesn't. Generally speaking, that is. Yet it's still worth catching if its themes trip your trigger.\r\n\r\nThe film runs almost 2 hours and was shot in Connecticut & New York City.\r\n\r\nGRADE: C+","id":"5dd6f06912aabc00168cb184","url":"https:\/\/www.themoviedb.org\/review\/5dd6f06912aabc00168cb184","movie_id":4148}
{"author":"kineticandroid","content":"Daddy knows best — especially when it comes to a mostly untrustworthy cast of Europeans — in this action film. Liam Neeson's performance elevated this from being forgettable. Otherwise, I kind of didn't care.","id":"53a767a3c3a368707a0034f9","url":"https:\/\/www.themoviedb.org\/review\/53a767a3c3a368707a0034f9","movie_id":8681}
{"author":"Gimly","content":"Probably not good enough to have started the Revenge-Renaissance that it somehow did, but still a pretty entertaining time. _Taken_ does hit a lot of clichés though, and I mean, it starts hitting them right away. We're literally only minutes into the film before we find out that Neeson's lead character is divorced, and his wife has re-married to a decent, rich provider, but one who's bookish and could never take him in a fight, and that the present he got for his daughter is for an interest that she no longer has. But once we get into the action proper, it's pretty great.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5c8cd9419251410fed9e6e3c","url":"https:\/\/www.themoviedb.org\/review\/5c8cd9419251410fed9e6e3c","movie_id":8681}
{"author":"GeekMasher","content":"One of my best films of all time. Apart from they made a second one, this a great movie! Liam Neeson trying to save this daughter, in France, from being sold to the highest bidder. An action packed film with good acting and great fight scenes.","id":"50ea1e1619c2954378544100","url":"https:\/\/www.themoviedb.org\/review\/50ea1e1619c2954378544100","movie_id":8681}
{"author":"Per Gunnar Jonsson","content":"This is a very good action\/thriller flick. It currently holds a 7.9 rating at IMDb which it certainly deserves. The few people giving this a 1 or 2 star rating must be disgruntled French people who do not like to see the French government officials portrayed as corrupt bastards (which they often are anyway).\r\n\r\nI generally like Liam Neeson so the fact that he is in the movie kind of got the movie off to a good start already. In this movie he plays a real badass, I-kick-the-shit-out-of-anyone-standing-in-my-way, former CIA agent hunting down the despicable low-life that kidnapped his daughter. I really, really liked the role he played in this movie. He makes characters like Bourne look like wussy. Even I was surprised when he actually shot the wife of the corrupt French government bastard to get him to talk. That was just awesome.\r\n\r\nThe movie is pretty much action all the way. Well, it starts off laying the groundwork for the story and here Liam Neeson is indeed playing a fairly timid father that seems to be a bit out of his depth. Once he gets thrown into his right element he quickly casts of the sheep's fur and reveals the wolf (sabre-toothed) underneath.\r\n\r\nThis is really a textbook action\/thriller movie. A very enjoyable hour and a half indeed.","id":"513ae6be760ee3231702b18c","url":"https:\/\/www.themoviedb.org\/review\/513ae6be760ee3231702b18c","movie_id":8681}
{"author":"Wuchak","content":"“The Wrestler” (2008)\r\n\r\nTwenty years past his glory days in the mid\/late 80s, a wrestler (Mickey Rourke) struggles to make ends meet in New Jersey while wrestling on the weekends, taking illegal pain-meds, pursuing a dancer at the local strip club (Marisa Tomei) and trying to reestablish a relationship with his estranged daughter (Evan Rachel Wood).\r\n\r\nThis is an engrossing, but gloomy drama about the grim reality of celebrities from practically any field who are long past their prime; it just happens to be a wrestler in this case. People mock how fake wrestling is, but those talented guys bend over backwards to entertain the audience with incredibly painful stunts. The film was shot in the winter in New Jersey and this augments the bleak pall.\r\n\r\nOn the female front, Marisa is absolutely stunning as Cassidy (aka Pam) and Wood is convincing as the embittered daughter. Their relationships with the protagonist are a mixture of sweet, agonizing and moving.\r\n\r\nThe soundtrack features several quality songs from the 80s: \"Bang Your Head,\" \"Round and Round,\" \"Balls to the Wall,\" \"Animal Magnetism,\" \"Dangerous,\" \"Don't Know What You Got (Till It's Gone),\" \"Sweet Child o' Mine\" and more.\r\n\r\nThe movie reminded me of 80’s metal star Jon Mikl Thor and the excellent documentary “I Am Thor” (2015) and, to a lesser extent, “Anvil: The Story of Anvil” (2008). While neither of these is as melancholic as “The Wrestler,” and “I Am Thor” is sometimes laugh-out-loud amusing, they both effectively show the grey reality of former real-life celebs well past their halcyon days.\r\n\r\nThe film runs 1 hour, 49 minutes.\r\n\r\nGRADE: A-","id":"5babd181c3a3683aa20296bd","url":"https:\/\/www.themoviedb.org\/review\/5babd181c3a3683aa20296bd","movie_id":12163}
{"author":"CRCulver","content":"In 1852, Sami reindeer herders in the Arctic region of Norway were fed up with the Norwegian liquor industry exploiting their tendency to alcoholism, local government officials seizing parts of their herds, and a corrupt state church ignoring it all. They rioted, beating the local priest and killing a merchant and government official. The two men considered ringleaders, Aslak Haetta and Mons Somby, were tried and executed. This incidence is little-known in most of Europe, but in the history of the Sami people it is one of the few tales of resistence to pressure from their southern neighbors and has gained a sort of epic status. Nils Gaups' 2008 film <i>The Kautokeino Rebellion<\/i> depicts this event. The main character of the film is Ellen Aslaksdatter Skum, who with her husband Mathis Haetta, was sentenced to long imprisonment. Ellen is played by Anni-Kristiina Juuso, a Sami actress best known for her role in Aleksandr Rogozhkin's 2001 film <i>The Cuckoo<\/i>. The film is multilingual, with the Sami speaking their own language, Swedish used as a lingua franca, and Norwegian heard from a few outsiders. Mid-19th century Norway is depicted in absorbing detail, and watching the film I felt to some degree that I was sharing the challenges of the characters in the frozen north.\r\n\r\nThe film takes a few liberties with history (the whipping of the priest isn't portrayed, and the rioters are stopped by what seem to be Norwegians instead of their own other Sami neighbors. Still, it's generally factual and really inspires the viewer to go out and learn more about the event. What I really admire about the film is that it doesn't try to portray the murderers as bold defenders of national consciousness: their uprising was something of an act of blind rage and they were betraying their own Christian ideals. Other depictions of the riots, such as Launis' godawful opera \"Aslak Hetta\", give in to hyperbolic National Romantic feelings, but Gaups' film keeps it on the level.","id":"5b905e2e925141669b0012dd","url":"https:\/\/www.themoviedb.org\/review\/5b905e2e925141669b0012dd","movie_id":13221}
{"author":"Certfiable","content":"If you liked \"The Kentucky Fried Movie\", you'll love this. A collection of various comedy skits into a movie length presentation, it reflects the US media through a bizarre lens.","id":"5241909c760ee3228b4e7e19","url":"https:\/\/www.themoviedb.org\/review\/5241909c760ee3228b4e7e19","movie_id":14771}
{"author":"John Chard","content":"The Burrower Tribe in BurrowerVision.\r\n\r\nThe Burrowers is written and directed by J.T. Petty. It stars William Mapother, Sean Patrick Thomas, Clancy Brown, Laura Leighton, Doug Hutchison, Karl Geary and Robert Richard. Music is by Joseph LoDuca and cinematography by Phil Parmet.\r\n\r\nAugust the 11th 1879, the Dakota territories, and after a family of pioneers are abducted a posse is formed and go off in search of the culprits. It is believed they have fallen prey to hostile Native Americans, but once out in the wilds the truth hits home and the posse find themselves in a brutal and bloody fight for survival.\r\n\r\nIt's not like Tremors! That wonderful homage to the B movie creature features of the 1950s is played for laughs and action thrills. The Burrowers admittedly on plot synopsis' does lend one to think that a fun packed creature feature is in the offering, but as many unaware film fans have found out, this is far from being the case.\r\n\r\nI would rather walk in the right direction than ride with my head up my ass.\r\n\r\nThe Burrowers takes itself seriously, and not insultingly so. J.T. Petty wanted to make a Horror\/Western but not in the schlocky sense. He even infuses the narrative with some human concerns and statements, ecologically and racially so.\r\n\r\nThe pace is very, very deliberate, so potential first time viewers need to take that into consideration. Once the plot is kick started in the opening salvo, the posse go out into the wilds and interact, for better and worse, dialogue is sharp and pointed, intelligent even.\r\n\r\nA number of great character based scenes are setting the tone for what is a downbeat picture, while when the action comes in tantalising spurts, it's well marshalled by Petty, and it's not just all about the creatures either.\r\n\r\nThe look is of a classical Western, which considering the modest budget is quite some achievement. From costuming and props, to the colour palette, the film convinces as the Old West of 1879. In this regard it would have been very interesting to have seen Petty make a standalone Oater.\r\n\r\nPractical effects are very decent and CGI is wisely used sparingly, though the big showdown at pic's end is something of a let down. Elsewhere Sir Clancy of Brown and Doug The Thug Hutchison are sadly under written, though the face fuzz department scores high marks!\r\n\r\nA tricky one to recommend to either Horror or Western fans, but for atmosphere and a great sense of period - and no little amount of originality as well, it's worth checking out as long as you don't expect Tremors. 7\/10","id":"53cc05aec3a368777100181d","url":"https:\/\/www.themoviedb.org\/review\/53cc05aec3a368777100181d","movie_id":15846}
{"author":"John Chard","content":"It's a comedy with bite, right to the end.\r\n\r\nTwo brothers, David & Peter, kidnap Tracey, the daughter of local tough guy gangster Arnie, they hold her to ransom for the sum of £100,000. What they hadn't bargained into the equation is that Tracey is one tough feisty lady, and that a turn of events will lead them to something far more scary than big bad gangster Arnie.\r\n\r\nThis is the second feature from director Paul Andrew Williams, and bearing in mind that his debut effort was the highly lauded gritty drama London To Brighton, it's no surprise to find that some folk are a little bemused as to the genre splicing nature of The Cottage. The Cottage is far more in keeping with Christopher Smith's 2006 horror comedy, Severance, and certainly it wouldn't be out of place as a double bill with that criminally undervalued picture.\r\n\r\nVery much a film of two halves, this picture is likely to prove a very divisive piece, and it will (has) only find an audience based on word of mouth alone. You will be hard pressed to find any sort of press marketing that will prepare you for the type of genre fusion film you are getting. Already, based on the comments written on this site thus far, you can see that some people were confused (or annoyed) by the tonal shift for the second half of the film. The first half sees poles apart brothers, David & Peter, swapping comedy dialogue as they whisk through a number of exchanges and circumstances with the marvellously volatile Tracey. While the second part of the picture hits you over the head with a quick switch to horror formula that has catering fulfilment for the gore junkies amongst us.\r\n\r\nAnd this is where the problem lies with many, why didn't the film stay as a kidnap farce? Why didn't it set its stall out to be a horror film from the off? There is no denying that the films' high points come with the horror moments, but the film is first and foremost a comedy, from the first reel to the cheeky end of credits sequence it is what it is. As deliciously sick as the gore shift is, The Cottage never once takes its tongue out of its bloody cheek. It's obvious that Paul Andrew Williams is having fun here, and he is clearly hoping his audience will as well. View it as an all encompassing comedy\/horror\/thriller in that order and you wont go far wrong.\r\n\r\nAndy Serkis plays David, the tough brother of the two, with Serkis doing a wonderful line in both visual and vocal comedy. This benefits Reece Shearsmith as Peter, a character so far under the thumb he can barely be seen. Shearsmith feeds off of Serkis to seal the comedy deal for this odd brotherly couple. British tabloid fave Jennifer Ellison plays Tracey, literally swearing for England to have the audience divided as to if they want her to survive or not! But it's a gutsy show from her and one hopes she ventures into this territory a bit more often. There is nothing new or fresh here, and this wont win any awards; even in its homeland of England, but it is FUN and it shows a director intent on making films from different genres. 8\/10","id":"540b5743c3a36879ab001d11","url":"https:\/\/www.themoviedb.org\/review\/540b5743c3a36879ab001d11","movie_id":13849}
{"author":"talisencrw","content":"One of Fincher's masterworks--though I like others better. He's definitely one of the only people alive who could have succeeded with this very intriguing story.\r\n\r\nThere are moments--when Benjamin's coming into his own, both with Tilda Swinton's character and with Cate Blanchett's--that are amongst the finest and most invigorating I have ever seen in cinema. I'm curious how I'll find it when I rewatch it in a few years. I have the impression that as I come to terms with age and gather more wisdom in my own skin, this story will only grow in my heart and appreciation--for both the highs and the lows. That is a spectacular magic trick for a movie to do--and Fincher's downright full of them.","id":"573e4ea392514108d7000150","url":"https:\/\/www.themoviedb.org\/review\/573e4ea392514108d7000150","movie_id":4922}
{"author":"Frank Ochieng","content":"In many ways director Denny Tedesco's music documentary \"The Wrecking Crew\" serves as a personal valentine to his late father Tommy Tedesco, the greatly talented and innovative guitarist that was part of the legendary musical experience of skilled session musicians that provided the background sounds for many of the notable recording artists, television shows and films in the 1960's and early 1970's. Basically, the instrumental arrangements for these many performers that benefited from the dearly departed Tedesco and his fellow Crew members were infectious and influential sounds of artistry. \r\n\r\nThus, \"The Wrecking Crew\" tells the fascinating story of the committed musicians behind the scenes that did not get their share of the spotlight as did the celebrated artists that they provided their unique beats for unbeknownst to the majority of the public. Still, \"The Wrecking Crew\" can take pride in knowing that their contributions in pop cultural circles shaped the personalized soundtrack of a sometimes disillusioned generation hungry for moving and grooving to the tunes that promoted a certain level of comfort, creativity and consciousness. \r\n\r\nNaturally, Tedesco goes on to not only recognize his father's Tommy's prominence in \"The Wrecking Crew\" but is generous to gather the insights and exploratory opinions from his beloved old man's surviving collaborators whose rhythmic timing and individual gifts in music-making added to the extraordinary collective sounds that made \"The Wrecking Crew\" one of the mainly sought after instrumental bands to become so in demand when it came to churning out memorable and money-making compositions in the lucrative music business.\r\n\r\nThough a random round-table sit-down session, Tedesco allows the Crew members to voice their take on what made their personal contributions (both inside and outside of The Wrecking Crew's jam sessions) so impacting. The backbeats that were created clearly served as inspiration and permanent trademarks for some singers, musical groups and media productions that rose through the ranks based on The Wrecking Crew's devotion and proclivities for developing unique instrumental techniques and tactics. The discussions for the Crew members were not solely based on their musical musings but we get a glimpse into their private lives away from the brainstorming of music. Through archived pictures and recordings it is revealed that the ups and downs of family life, financial considerations, investments and other side projects all kept these remarkably resilient performers busy as they were making their mark professionally. \r\n\r\nBasically, The Wrecking Crew supplied what is commonly known as \"the West Coast Sound\" and the audience is immediately reminded about the involvement this small army of session musicians had with such big names as old-time artists such as Frank Sinatra and Bing Crosby to revered 60's rock groups such as the revolutionary The Beach Boys and the popular The Monkees (The Beach Boys' Brian Wilson makes a cameo appearances as well as The Monkees' Micky Dolenz and Peter Tork). \r\n\r\nOf course other notable talking heads are assembled and gladly offer their assessment on how The Wrecking Crew shaped and embraced their singing careers along the way. Artists such as Cher, Glen Campbell, Nancy Sinatra and Herb Alpert all chime in for their singing praises of the Crew that took them to new heights in their careers. Also, music insiders and executives such as Dick Clark, Lou Adler and H.B. Barnum all recall The Wrecking Crew's glory days with spot-on recollections. Plus, the countless archived scenes for whom The Wrecking Crew was cozy with in their musical paths to royalty featured the images of Sammy Davis Jr., Phil Spector, Sam Cooke, Al Jardine from The Beach Boys, The Byrds, The Mamas and the Papas...just to name a few. \r\n\r\nStill, the ultimate rush in \"The Wrecking Crew\" is learning about some of the nostalgic television show that they had their hands in so creatively. From 60's television oldies that run a list of impressive boob tube memories that mention such fare as \"Bonanza\", \"Mission: Impossible\", \"The Monkees\", and \"Batman\" to later shows in the 70's for something like \"Dallas\", the Crew seemed to have had their fingerprints all over anything lyrically stimulating. \r\n\r\nThe interesting revelation pertaining to The Wrecking Crew's growing accomplishments is the fact that their musical achievements garnered Grammy Awards as well based on the countless recordings they put their distinctive stamp on with ferocity. \r\n\r\nWhen Tedesco focuses his camera on Crew members both relatively known to most (drummer Hal Blaine for instance) to the obscure ones (Earl Palmer, Al Casey, Bones Howe and Carol Kaye--the lone female representative of the group) we get a true sense of the pride, persistence and prosperity that these unsung artists have gone through as they knowingly participated in a musical movement meant to be rejoiced because their creative juices was the fabric that enriched our empty lives looking for escapist entertainment. \r\n\r\nCuriously, \"The Wrecking Crew\" was first made in 2008 but is now making the rounds in 2015. Although some viewers did not get to witness Tedesco's thoughtful and noteworthy on-screen affectionate acknowledgment to his gifted guitarist father and his equally productive Crew cohorts some seven-plus years ago the message is still the same then as it is now: the blast to the past in sound and spirit will remain refreshingly in tact courtesy of the legacy that the famed The Wrecking Crew left in its everlasting wake of numerous musical avenues too plentiful to count. \r\n\r\nThe Wrecking Crew (2008; re-released in 2015)\r\n\r\nLunchbox Entertainment\r\n\r\n1 hr. 41 mins.\r\n\r\nStarring: various\r\n\r\nDirected by: Denny Tedesco\r\n\r\nMPAA Rating: PG\r\n\r\nGenre: Documentary\r\n\r\nCritic's rating: *** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)","id":"563fc61cc3a3681b54031bf1","url":"https:\/\/www.themoviedb.org\/review\/563fc61cc3a3681b54031bf1","movie_id":70027}
{"author":"talisencrw","content":"This has no competition. It is the very finest comic-book character movie ever made. Knowing the Burton, Donner and Nolan filmic adaptations of Batman and Superman exist helps me to sleep at night. They are Exhibit A of 'How to Make a Comic-Book Movie'. Nothing else has ever come even remotely close. These seven films (I include 'Superman II' because it was mostly Donner's work)--and Nolan's trilogy especially--are what I imagine a great director like Kubrick, Hitchcock or Kurosawa would have come up with, if they had ever been asked to make a Superman or Batman movie. They are the easiest for an audience to identify with because in these the scripts most approximate human emotions and the typical conundrums of the human experience--in short, are the closest, in a good way, they come to the complexities of the human condition. Peerless.","id":"574639f9c3a36806b00002c1","url":"https:\/\/www.themoviedb.org\/review\/574639f9c3a36806b00002c1","movie_id":155}
{"author":"Wuchak","content":"***Horror adventure in the Mayan jungle***\r\n\r\nRELEASED IN 2008 and directed by Carter Smith based on Scott B. Smith’s novel, \"The Ruins\" refuses to make the mistake of too many conventional horror flicks by NOT going over-the-top with the situation, the \"monster\" or the horrific thrills; films that do so are usually more goofy than horrifying. Take the ending of \"The Ruins,” which is different than the book and, in my opinion, better: In a typical horror movie there would've been a wild (i.e. thrilling but totally unbelievable) vehicle pursuit by the Mayans; not here. It's the BELIEVABILITY of \"The Ruins\" that makes it effective, which is reinforced by the acting of the five protagonists.\r\n\r\nSpeaking of whom, the main cast consists of Jonathan Tucker as Jeff, Laura Ramsey as Stacy, Jena Malone as Amy, Shawn Ashmore as Eric and Joe Anderson as Mathias, the German. The two girls and Tucker (Jeff) especially stand out. I found these protagonists likable and fairly fleshed-out for a 90-minute horror flick. For one, they're not the typical frat trash you see in so many horror flicks. Secondly, we see signs of character again and again, which I detail below.\r\n\r\nCritics complain that the antagonists are decidedly un-scary, but that's one of the main points of the movie. Like 1963's \"The Birds,\" it takes something we see every day and are NOT scared of and turns it\/them into a source of horror.\r\n\r\nOne memorable scene is when Stacy and Amy are in the dark bowels of the pyramid searching for a cell phone they keep hearing. What they discover is equal parts shocking, surreal and amazing (more on this below). Another memorable sequence is when Jeff & Eric are forced to perform a gruesome operation. The climax is also well-done and suspenseful.\r\n\r\nWhile the story takes place on the Yucatán Peninsula, Mexico, it was surprisingly shot at Gold Coast and Tamborine Mountain, Australia, just south of Brisbane, which is on the East coast. In any case, the locations are spectacular.\r\n\r\nBOTTOM LINE: \"The Ruins\" surprised me in light of the inexplicable mediocre ratings and incessant panning. It's an adventure story mixed with psychological horror utilizing something common and un-scary as the \"monster.\" It features quality gore, excellent locations & props, quality performances and proficient filmmaking in general. Plus it takes advantage of the presence of Laura Ramsey and eschews the overdone cartoony-ness of too many horror flicks, which are more funny than creepy or horrifying. In other words, \"The Ruins\" delivers the goods.\r\n\r\nThe theatrical version runs 90 minutes and the unrated version 93 minutes. I viewed the latter.\r\n\r\nGRADE: B+\/A-\r\n\r\n***SPOILER ALERT*** (Don't read further unless you've seen the film)\r\n\r\nThe plants that live on the pyramid and what they are able to do spur a fascinating point: The animal kingdom spans the spectrum of worms to human beings. What about plant life? The plants at the Mayan ruins are obviously from the higher-developed end of the plant kingdom – they work as a team to obtain sustenance and are able to mimic sounds, like human voices and the ringtone of a cell phone.\r\n\r\nI've heard complaints about how the protagonists constantly make the wrong decisions. Answer: The foursome had befriended Mathias and therefore trusted him. They wanted to experience some Mayan history off the beaten track. When the Natives suddenly arrive on the scene and brutally shoot one of their members in the head the only place for them to safely flee is the pyramid. At that point they're stranded because the Natives have the ruins surrounded. How is any of this a wrong decision?\r\n\r\nSomeone complained that the youths never attempt to escape the pyramid until it is basically too late, which supposedly defies logic. Answer: They're only on the pyramid for two nights and were waiting for help to arrive. Their only other recourse was to make a run for the jungle, which was impossible because the pyramid was surrounded by Natives with deadly weapons who already proved they would kill without mercy anyone infected by the plants. As such, the most logical thing to do was to wait for help and only make a run for it (to the jungle) if they absolutely had to, which is what happens. It sounds logical to me.\r\n\r\nAnother criticism is that the protagonists are imbeciles with little character development. I found them likable, as noted above, and there are numerous examples of character: They desire to experience the culture of the area and not just utilize their exotic vacation to party, like the average one-dimensional spring-breakers. Also, they refuse to leave Mathias for dead in the pyramid and the girls risk going down the same dubious rope that resulted in his fall. Moreover, Jeff insists on performing the gruesome task of cutting off Mathias' legs and Eric agrees to help even while the primitive operation causes him to vomit. Lastly, Jeff willingly sacrifices himself so that Amy has a chance to escape and she makes a bold dash for freedom. All this sounds like character to me.\r\n\r\nNeedless to say, the criticisms leveled at the film are mostly invalid or easily explained.","id":"5b3c416392514102e2004a85","url":"https:\/\/www.themoviedb.org\/review\/5b3c416392514102e2004a85","movie_id":11152}
{"author":"tricksy","content":"Excellent movie. Best of the trilogy. Lovely music. Nolan is a genius. So is Heath Ledger.","id":"557693fac3a368569a003fab","url":"https:\/\/www.themoviedb.org\/review\/557693fac3a368569a003fab","movie_id":155}
{"author":"Kris_12","content":"It is a really deep movie... I really like dramas. That film shows how children can survive and even prosper emotionally despite the terrible childhood. The <a href=\"http:\/\/befair2rare.com\/\">poker games<\/a> which was shown in the film was so exciting that for a second I thought that it is me the one who was playing poker.\r\nActors have played so plausibly that you begin to sympathize with the heroes without even thinking about it. You start to think as if you are living in this movie. I recommend to anyone who loves dramatic films and films about players.","id":"5c51be0a0e0a26494dda8681","url":"https:\/\/www.themoviedb.org\/review\/5c51be0a0e0a26494dda8681","movie_id":63287}
{"author":"John Chard","content":"Lazarus of Oregon.\r\n\r\nThe Lazarus Project is directed by John Patrick Glen, who also co-writes the screenplay with Evan Astrowsky. It stars Paul Walker, Linda Cardellini, Piper Perabo, Bob Gunton, Malcolm Goodwin and Tony Curran. Music is by Brian Tyler and cinematography by Jerzy Zielinski. \r\n\r\nA reformed criminal out on parole is beset by bad luck and finds himself sentenced to die by lethal injection. Strange then that once the lethal dose is administered, he wakes up working as a grounds-keeper at a psychiatric hospital… \r\n\r\nJohn Glen's first directing assignment is very much a mixed bag, but if landing in the DVD\/Blu-ray players of the right audience it could well gain some momentum in the wake of Walker's untimely death. \r\n\r\nIt's one of those films that operates at a funereal pace and thrives on other worldly atmosphere. After the introductions to the main character and his psychological make-up is out the way, pic shifts into a realm where we, as well as Walker's character, are never sure what is real or what is going on. Is he in some afterlife place? Is it all in his head? A dream? Drug induced? And etc. One of the smart things about the movie is that it binds the audience to the mystery by asking us to fill in the gaps with our own logic. While crucially the reveal comes at the right time so as to give us viewers the opportunity to re-evaluate the various quandaries that the piece has thrown up. \r\n\r\nFor those who like films like Jacob's Ladder, Shutter Island, The Jacket et al, then this has to be at the very least of interest, to warrant the chance to sell itself to those particular sub-genre fans, besides which, it also shows a string to Walker's acting bow that was rarely tapped into by other directors. And it's beautifully shot by Zielinski too. Contemplative, intriguing and even chilling as regards the various themes it deals with, this Lazarus deserves its own second coming. 7\/10","id":"53c33983c3a3684ce9008fc2","url":"https:\/\/www.themoviedb.org\/review\/53c33983c3a3684ce9008fc2","movie_id":13825}
{"author":"Andres Gomez","content":"Astonishing story about the rights of the women in Iran, staged in a small town in the border.\r\n\r\nThe cast is really good and credible.","id":"50bf0970760ee30359000729","url":"https:\/\/www.themoviedb.org\/review\/50bf0970760ee30359000729","movie_id":33409}
{"author":"Wuchak","content":"***High adventure in China, albeit totally overdone***\r\n\r\nIn 1946 Rick & Evy (Brendan Fraser & Maria Bello) are bored in their middle age in England and so take an assignment to China where they meet Evelyn's brother (John Hannah) and their son (Luke Ford) who has discovered the tomb of a tyrannical ancient emperor (Jet Li). Unfortunately, there’s a secret plot to resurrect the mummified remains of the Emperor and all hell naturally breaks loose. Michelle Yeoh and Isabella Leong are also on hand.\r\n\r\n\"The Mummy: Tomb of the Dragon Emperor\" (2008) is an overblown action\/adventure horror\/comedy popcorn blockbuster, just like the first two flicks. It's not as good as “The Mummy” (1999), yet it's better than the unabsorbing “The Mummy Returns” (2001). Yes, it's overdone like the second one, but the story is more compelling.\r\n\r\nWhile it's regrettable that Rachel Weisz opted out of this third film in order to be with her one year-old son, Maria Bello is a solid replacement and actually looks better in tight pants (as she's curvier and therefore more physically appealing).\r\n\r\nOf course the film’s preposterous in the tradition of the previous two and the Indiana Jones flicks. But let's give credit where credit is due: “Tomb of the Dragon Emperor” bends over backwards to entertain with tombs, priceless artifacts, mummies, Shanghai, the Great Wall, the Himalayas, yetis, Shangri-La, zombies, a three-headed dragon and martial arts.  \r\n\r\nIf you can get past the absence of Weisz and embrace Bello (which, let’s face it, isn’t that hard to do), this is easily the second best of the trilogy. Interestingly, Roger Ebert maintained that it was the best and he ain't no slouch when it comes to appraising pictures, whatever the genre. Yet my wife zeroed-in on the film’s flaw, which is the same as the previous flick: It tries too hard. It frantically throws in everything but the kitchen sink and is the lesser for it. (Yetis, seriously?)\r\n\r\nThe movie runs 1 hour, 52 minutes, and was shot in Buckinghamshire, England; Montréal, Québec; and China (Beijing, Shanghai, Inner Mongolia, Tianmo, Heng Dian, Dongguan & Terracotta Warriors Museum, Xi'an, Shaanxi).  \r\n\r\nGRADE: B-","id":"5dec706ceee18600168bf784","url":"https:\/\/www.themoviedb.org\/review\/5dec706ceee18600168bf784","movie_id":1735}
{"author":"furious_iz","content":"Surprisingly good, low budget gem.\r\n\r\nYou've probably seen the scenario before, kids go feral for some reason and the grown-ups have to survive. What makes this version good is the realistic character reactions. I read other reviews saying at the first sign of danger you would stop looking for your kids and just run. I call BS, or maybe I call someone who has never had kids. A halfway decent parent would not ditch their kids and run away! I would sacrifice my life and the life of anyone around me to save my kids! In a heartbeat. So suggesting that it would be more realistic for a parent to instantly believe a moody teenager that their children are now monsters, with no proof, is just crazy talk. \r\n\r\nThe tight plot very cleverly splits up the cast and only lets one character see what is really going on, creating doubt and misinformation, so no-one believes the poor teenager until it is too late, for most of the cast at least.\r\n\r\nThe tension builds consistently, and doesn't let up. There's enough gore and suspense to please more mature horror fans, but you have to go in expecting a slow build up. Also something weird was going on with the sound, I've read other reviews mention the same, so it wasn't just my copy. Turn the volume up, better yet wear headphones and let yourself get sucked in.","id":"5c1649c892514132c00b772d","url":"https:\/\/www.themoviedb.org\/review\/5c1649c892514132c00b772d","movie_id":16342}
{"author":"erickprieto","content":"Perhaps the best Batman movie of all times. I think that this Batman trilogy presents the well-known superhero history in an unexpected way with the capable to maintain on the edge of the chair all time.\r\n**Heath Ledger** present an excellent impersonification of a psychopath.\r\nAll support roles are magnificent.\r\nAnd Bruce Wayne role played by Christian Bale, shows a human being behind of the mask.","id":"5be161edc3a3680a00009915","url":"https:\/\/www.themoviedb.org\/review\/5be161edc3a3680a00009915","movie_id":155}
{"author":"Wuchak","content":"***Intriguing, Spiritual, Insightful, Moving***\r\n\r\n\"The Day the Earth Stood Still\" (2008) is an intriguing, powerful and even moving modern sci-fi blockbuster. I particularly like the symbolism: Klaatu=Christ, GORT=YaHWeH, as well as the numerous biblical references: Noah's Ark, the death plague, human beings trying to put God in a box literally, the sacrificial nature of agape love, etc. In other words, the film tackles subjects of great depth that every human being can relate to whatever their belief system. This itself separates it from the usual idiotic blockbuster fare.\r\n\r\nNow let me address some common criticisms (please see the film first before reading further due to **SPOILERS**): \r\n\r\nThe kid is initially quite annoying but this is understandable as he's an archetype for what humankind is: an annoying, untrusting, simpleminded child-race. His sudden change into \"maturity\" represents how humanity needs to \"grow-up.\" This helps make sense of the kid's repeated statements about killing Klaatu, which were magnified by the media's slander of Klaatu as a dangerous escaped convict. Klaatu's strange actions helped feed this negative mindset. As for the kid's dead father, the boy was only 9 years old and understood his father to be a soldier. Why wouldn't he have a mythical impression that he killed 'bad guys' for a living, likely with his bare hands? \r\n\r\nThe judgment of mass human destruction was already set for the earth after hundreds of years of observation, including an Asian scout who lived with humans for 70 years. Klaatu was sent to activate the judgment UNLESS he observed some clear indication that the harsh judgment wasn't necessary yet. Klaatu didn't change the original plan UNTIL very late in the story, which is why he stated to Helen that he wasn't sure if he could overturn it. Although Klaatu was the primary agent, he wasn’t necessarily alone. Gort was there and he was only partially robotic, as well as Mr. Wu. There were probably hundreds\/thousands of other aliens involved in one way or another.\r\n\r\nThe military attacks because their modus operandi is to defend the nation, which was augmented by the destructive nature of humanity in general. \r\n\r\nWhen Bate's character finally decides to send Helen out to talk with Klaatu she was the government’s proverbial last hope. All other governmental attempts to prevent the judgment failed abysmally up to this point, not to mention the judgment of mass destruction was ALREADY well into motion. Other national leaders were concerned with saving their own.\r\n\r\nThe biggest sphere was the central command orb. Klaatu didn't possess the power to stop the swarm himself; he had to get to the central orb to attempt to stop the mass destruction. Even then, he wasn't sure if he could do it. In fact, it cost him dearly.\r\n\r\nThe alien swarm only destroyed humanity and all human imprints (like the stadium, the the installation and the semi); I saw no evidence of the swarms destroying trees or animal life. The animal ark-orbs were obviously precautionary in nature; in other words, the aliens knew there would be collateral damage due to the nature of the swarms so they snatched away all manner of animal life as a precaution.\r\n\r\nKlaatu made it quite clear what he was doing: saving the earth by destroying humanity and their intrinsic bent toward destruction. The way he put it was: If humanity lives the earth will die, but if humanity dies the earth will live.\r\n\r\nThe Aliens are powerful, but it's inaccurate to call them careless. They monitored the planet for centuries and their decision was carefully decided.\r\n\r\nTo write-off humanity's destructive bent as \"minor-league carelessness\" is shallow and un-enlightened, as well as wholly inaccurate.\r\n\r\nThe aliens' actions had nothing to do with \"might makes right\" but everything to do with saving a planet from the infection that would wholly destroy it (people) if they failed to act. Their celestial judgment was that the cancer HAD to be cut out and time was of the essence.\r\n\r\nReally, the only \"detestable characters\" are the government as a whole, which is displayed as a cold machine. Helen (Jennifer Connelly) is a character of beauty, reverence and wisdom while the professor plays humanity's wise intercessor. Kathy Bates' character is unlikable because she represents the government and comes off as an arrogant machine-like biyatch. After she's completely humbled, however, she changes her tune. Meanwhile the kid is only 9 years old and lost both of his biological parents; cut him some slack. Besides, he also changes his tune and Klaatu takes on the role of his spiritual father. How can you NOT feel for Jacob when he falls on his face at his dad's grave? \r\n\r\nSo none of the common gripes hold water. The insane bashing of the film is simply the result of an unjust critical feeding frenzy. If people would disregard the monkey-see-monkey-do panning and view the film with an open mind they might actually enjoy it and possibly discover something worthwhile.\r\n\r\nThe film runs 1 hour, 43 minutes.\r\n\r\nGRADE: A-","id":"5ddf3f0bc51acd0013f285fe","url":"https:\/\/www.themoviedb.org\/review\/5ddf3f0bc51acd0013f285fe","movie_id":10200}
{"author":"Andres Gomez","content":"The animation is awesome and beautiful but the story and plot, as in last I.G. productions I've seen, is overcooked in a intent to be deeper than it actually is.","id":"525eb5a0760ee3630502b9d9","url":"https:\/\/www.themoviedb.org\/review\/525eb5a0760ee3630502b9d9","movie_id":15877}
{"author":"Gimly","content":"Gritty revenge movie that works on the shoulders of its lead performer. Any film with a hero (I use that term **very** loosely) that gets his ass kicked every 5 minutes is a welcome change from the stake-free glossy violence of most mainstream cinema. Or at least, it would have been if half of these ass-kickings didn't take place in flashbacks, that by the nature of time, we know he already made it through.\r\n\r\nStill a very palatable Ozzie flick for those who have the stomach.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","id":"5937a5c59251417fca001391","url":"https:\/\/www.themoviedb.org\/review\/5937a5c59251417fca001391","movie_id":33134}
{"author":"tmdb44006625","content":"It's an improvement on the Ang Lee film only in the sense that the smashy smashy bits are more entertaining than the previous film's thinky thinky bits. But the fact that the entire film is just one long extended fight scene is disappointing to us who enjoy the darker, more emotional beats of the Hulk's story. I enjoy this movie quite a bit as a well put together piece of fluff entertainment, but I hold no delusions that even Marvel Studios couldn't get the definitive version of Hulk on screen.","id":"5c8427afc3a36839d4d28415","url":"https:\/\/www.themoviedb.org\/review\/5c8427afc3a36839d4d28415","movie_id":1724}
{"author":"Rob","content":"Terrible remake, original vastly superior","id":"55c8ce7d9251415bad00161c","url":"https:\/\/www.themoviedb.org\/review\/55c8ce7d9251415bad00161c","movie_id":10200}
{"author":"John Chard","content":"High Infidelity - High High High High!\r\n\r\nThe Other Man is directed by Richard Eyre who co-adapts the screenplay with Charles Wood from a short story written by Bernhard Schlink. It stars Liam Neeson, Laura Linney, Antonio Banderas and Romola Garai. Music is by Stephen Warbeck and cinematography by Haris Zambarloukos.\r\n\r\nNeeson plays Peter, a tortured husband who upon finding evidence of his wife's infidelity, travels to Milan to confront her lover in the hope of understanding.\r\n\r\nThere is nothing remotely funny about infidelity, it can wreck lives. Sadly The Other Man is a funny film, though not intentionally. It so often misses the beat of real grief and anger, throwing up ridiculous situations that beggar belief, it's often impossible to take seriously, so much so that when the big reveal etc comes crashing forward, the emotional impact is null and void. There's a couple of decent plot turns and the Italian locales are gorgeously photographed, but the script is trite, the score out of sync and ultimately it wastes a damn fine cast. 5\/10","id":"56dc4d3cc3a368689d00293c","url":"https:\/\/www.themoviedb.org\/review\/56dc4d3cc3a368689d00293c","movie_id":17606}
{"author":"John Chard","content":"Not the same Mummy twice, nor thrice for that matter.\r\n\r\nWell it's been pretty much universally panned has this third Brendan Fraser led instalment of the new age Mummy series. So lets not beat around the bush here, it's not very good, but it's hardly deserving of the 1\/10 ratings it has been given by amateur on line reviewers.\r\n\r\nThe plot (for what it's worth) sees young Alex O'Connell, now amazingly a grown man in a short space of time, unearth evil old Chinese Emperor Han and his accursed Terracotta Army. Naturally some bonehead is going to bring him back from the dead, and naturally the now retired O'Connell's are forced back into their Mummy fighting ways. Can Rick, Evelyn and poor Jonathan save the day? Will Alex prove his credentials as the offspring of such daring-do parents? Will anybody care come the finale? \r\n\r\nRachael Weisz has (wisely) bailed and into her shoes comes a woeful Maria Bello, with fluctuating accents and zero chemistry with her leading man, Bello has undone the promise shown in World Trade Center & A History Of Violence. Steer clear of action movies dear. Fraser looks bored and can barely muster the energy to deliver the now tired and stilted lines. He admitted once that The Mummy 2 was basically a cheeky remake of the first film, quite what he has to say about this one I await with much interest. John Hannah is merely a bystander and it's probably the easiest money he will ever earn, an utter waste it be. Luke Ford does OK as Alex and Michelle Yeoh, Jet Li (the Emperor) & the beautiful Isabella Leong make do with what the unimaginative script gives them to do.\r\n\r\nWhat saves the film from being a bottom of the barrel feeder is the action quota. Even though the spectre of poor CGI hangs around every corner, the sequences come thick and fast and they at least keep the blood pumping, thus stopping the audience themselves from drifting into a centuries long sleep. There's some good gags too (you will yearn for more of Liam Cunningham), while the choreography for the fights involving the Asian stars is not to be sniffed at. Stephen Sommers left the directors chair for this one, handing over to Rob Cohen, which explains why the film is more concerned with action accelerate over substance. But Sommers, who gave us a genuine genre delight with the first film, has a writing credit and was on production duties for this effort. I trust he now feels saddened by what his franchise has now become. 4\/10","id":"5ca40d339251417713a89f32","url":"https:\/\/www.themoviedb.org\/review\/5ca40d339251417713a89f32","movie_id":1735}
{"author":"tmdb22590444","content":"One of the best movies of all time. Christopher Nolan has brought us the Batman trilogy that it made it feel it could happen today. Christian Bale returns as Batman, was able to perform as wonderfully as he did in Batman Begins. The one person that ultimately stole the show had to be the late Heath Ledger who played as the Joker. His performance as a psychotic clown terrorizing Gotham City was one of the best performance as a superhero villain. One of the best parts of the Joker was when he was telling his victims on how “he got his scars?”. Another great part was when he kidnapped a police officer and he was recording it while scaring the man and also giving a warning to Batman. The supporting actor and actresses did a good job of delivering the story. I was disappointed that Katie Holmes did not return as Rachael Dawes but the actress how played as her Maggie Gyllenhaal did a really good job. One of the best parts of Christopher Nolan is that in every movie of his, the cinematography would look amazing and this movie is no exception.","id":"5ccbd4ee0e0a262fcd009b52","url":"https:\/\/www.themoviedb.org\/review\/5ccbd4ee0e0a262fcd009b52","movie_id":155}
{"author":"CRCulver","content":"This 2008 film by Stefan Komandarev, a loose adaptation of a novel by Ilija Trojanow, is both a heartwarming family tale and a biting critique of Communist-era Bulgaria. Alexander \"Sashko\" Georgiev (Carlo Ljubek), who was born in Bulgaria and came to Germany as a child, is the sole survivor of a car crash that kills his parents. Due to the trauma, he initially cannot recall anything of his former life. His grandfather, Bai Dan (Miki Manojlović), visits from Bulgaria and, with the help of some tough love, tries to get him out of his funk and reawaken his memories. Bai Dan is a larger-than-life character, one of those wild, freespirited guys who somehow managed to survive here and there in Eastern Europe in spite of the greyness of society and the endless hassles by the authorities. Bai Dan is also an obsessive backgammon player who believes the game very directly relates to our lives. As Bai Dan and Sashko set off east from Germany, on a tandem bicycle back towards the old family home in Bulgaria, Sashko starts to remember, and the audience discovers in flashbacks the dramatic events that led his family to flee Bulgaria under Communism.\r\n\r\nThis is an enjoyable little film. The political subtext adds some depth to the film and its scenes of a refugee camp and the frustrated aspirations of ordinary, hardworking people are especially relevant as I write this review. But that political touch is never heavy-handed, and what will strike most viewers is the common humanity of this family that lovingly stayed together through thick and thin. A remarkable thing is that neither of the main actors are themselves Bulgarians. Miki Manojlović has been a mainstay of Yugoslav and Serbian cinema for decades (Western audiences are most likely to know him from Kusturica's <i>Underground<\/i>), but he learned Bulgarian well enough to pass as one of them. Similarly, Carlo Ljubek was born in Germany to Croatian immigrants.\r\n\r\nIn spite of being worthwhile on one viewing, it is hard to rate this film more than average due to some peculiar aspects of the story. A romantic interest is written in, but she comes too late and Bai Dan's motivations in pushing Sashko to pursue her just baffle. The characters' actions were strange enough that I started to wonder if there was originally more material here, but Komandarev had to cut it out to achieve his 145-minute running time. Still, worth a try for anyone open to Central and Eastern European cinema, and Bai Dan is certainly the grandfather everyone wishes they had.","id":"5b7df7e00e0a2615c300880c","url":"https:\/\/www.themoviedb.org\/review\/5b7df7e00e0a2615c300880c","movie_id":5871}
{"author":"Gimly","content":"Upon first viewing, _The Strangers_ was one of only two films I'd seen that actually ever frightened me as an adult (well, a seventeen year-old, but close enough). To be fair, both films I'd seen in the same setting - alone, the middle of the night, in the aptly named \"Suicide Flats\", and what's more, I've since re-watched _The Strangers_ a couple of times and realised that both my fear, and my enjoyment, were perhaps a bit overstated on that first viewing. Even taking that into account though, and seeing it again almost a decade after that first time, I still honestly believe that _The Strangers_ is a good movie, with some pretty genuinely creepy elements.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5bb3284b0e0a263df2007829","url":"https:\/\/www.themoviedb.org\/review\/5bb3284b0e0a263df2007829","movie_id":10665}
{"author":"Gimly","content":"**A long form review originally posted in 2011:**\r\n\r\nDubbed as a “re-quel”, _The Incredible Hulk_ was first released in 2008, and now, I’m here to review it in the line of Marvel films I’m getting through a the moment. \r\n\r\nI always like to think of films individually, but with the Marvel Cinematic Universe getting so big, that can be rather difficult to do. So though I may comment on films in relation to their sequels, remakes, prequels, spin-offs, parodies and the like, know that my final score out of ten is always based purely on the films merits, or lack thereof. \r\n\r\nIt’s pretty crazy seeing Edward Norton (_American History X, Fight Club, Red Dragon, Kingdom of Heaven, Pride and Glory, Stone_) as a very scrawny Bruce Banner, considering that he turns into the giant, muscular Hulk. But to me it totally worked. As an interesting side-note, Norton co-wrote the script, which may or may not have contributed to his being ousted as Banner for any future films after the movie was released. Not because the script is particularly awful or anything, but because as a general rule production doesn’t like actors getting all up in \"dey grillz\" half way through. Although it’s not like Norton’s never done this sort of thing before.\r\n\r\nUnder-appreciated Tim Roth (_Reservoir Dogs, Pulp Fiction, Planet of the Apes, Lie to Me, Rob Roy_) is also excellent (as far as I’m concerned) playing the role of Abomination\/Emil Blonsky. Interesting side-note, no, he’s not related to Eli Roth, who’s also a friend and actor of Quentin Tarantino and his films.\r\n\r\nUltimately, _The Incredible Hulk_ is a fine film, but it just can’t stand up to the superior writing and character building of Thor, Iron Man or Iron Man 2. Liv Tyler (_The Strangers, The Lord of the Rings Trilogy, Armageddon_) is rather a non-event as supposed love interest Betty Ross. And William Hurt (_Robin Hood, A History of Violence, The Village, A.I.: Artificial Intelligence, Dark City_) as semi-antagonist General Thunderbolt Ross, is nothing but annoying (although it is pretty cool to see just how much they got him looking like the comic book character he is based on.\r\n\r\nYou would’ve thought that having a modern day Dr. Jekyll and Mr. Hyde story to run with, backing from the success of the franchise you’ve got supporting you, that it would be easy to write strong characters, unfortunately, it’s not the case. And while the action sequences are cool, and the fighting is possibly some of the best that Marvel’s come up with, it’s not enough to bring this film up to the standards of the other 3. The film lacks the flair I’m sure everyone would be expecting, and while it’s a perfectly good monster-movie movie, perhaps a completely separate Super Hero origin story would have been better than the overly-CGI-ridden quasi-sequel to 2003’s _The Hulk_ that we ended up with.\r\n\r\n66%\r\n\r\n_-Gimly_","id":"5b1545db925141783500a0f3","url":"https:\/\/www.themoviedb.org\/review\/5b1545db925141783500a0f3","movie_id":1724}
{"author":"Gimly","content":"From dumb fun to... regular dumb.\r\n\r\nIt's hard to find a point where _Tomb of the Dragon Emperor_ wasn't hampered by itself. Or a point where it makes any sort of logical sense. Unfortunate that is was no good, lending credence to the need of a reboot, which we now have, but wish we didn't.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"594a409ac3a36861ef00aa6c","url":"https:\/\/www.themoviedb.org\/review\/594a409ac3a36861ef00aa6c","movie_id":1735}
{"author":"Key-Si","content":"I know this movie gets hyped without end, and I think, that has mainly to do with Liv Tyler playing the lead. I remember seeing this, as it first came out, and even though I enjoyed it, it didn't really stick with me. Nothing overwhelming, but a nice watch. Liv Tyler does a fine job here, but for most of the time she is alone in the house, and the movie becomes quite repetitive after a while. Once we get to the killers, most people were so excited about the reason, they did all this. Because 'Kristen' was home! Seriously? Who would have thought? Isn't that the same reason, why 'Jason Voorhees' kills people all around 'Camp Crystal Lake'? Because they are there? But I get it. The point is, that the killers have no other motivation than just to attack random people. There is no desire for money or jewelery... just the pure lust to take lives. But that is a motivation, most serial killers have, and therefore it doesn't seem all that special. When the movie becomes bloody towards the end, I really loved it though. It is nice, to see a movie like this acted by someone, who is as well known as Liv Tyler, and also Scott Speedman was totally fine. \"The Strangers\" is a fine little home invasion movie, but most certainly it doesn't deserve this extreme hype.","id":"5d6162697f6c8d0019ecfddc","url":"https:\/\/www.themoviedb.org\/review\/5d6162697f6c8d0019ecfddc","movie_id":10665}
{"author":"Kai","content":"The Chasing World is a survival horror film with a curious and interesting premise. Everyone with the surname Sato is mysteriously dying across Japan. As it continues and spreads with more frequency, high school student Sato Tsubasa fights to keep his sister - Sato Ai - alive.\r\n\r\nThis was a film that I originally wasn't sure how I felt about it. Originally, I only wanted to watch this for the films really cool poster. I'm easily pleased that way. All I really knew about this what that it is considered one of the iconic Japanese horror series that have shaped the genre - and I'm all for movies and series like that.\r\n\r\nI felt pretty excited for this and ended up... really bored. I was let down by a Shibata Issei film already today, and this one makes the second in a row. This isn't necessarily bad, however. Whilst I didn't enjoy this as much as I wanted to, it's still getting a pretty solid 6\/10 from me.\r\n\r\nWhilst this is pretty fun, has a good sountrack and is a solid movie - it's a lot like any other parallel universe films out there. I watch this and I think of other parallel universe films I haven't even seen and ones I have. I'm also reminded of Battle Royale come the ending, and I feel like there isn't enough uniqueness in this film to fully hold on its own - how this film has a 7 part series, honestly I'm not sure - but it doesn't make me excited to watch the whole series.\r\n\r\nA pretty average film that took me by surprise how average it was.. that's all I really have to say about The Chasing World. There's nothing particularly special to take into account, nothing that really shocked me, etc. It's a good film, but I feel the Sion Sono make of this film is probably going to be a much better take.","id":"5df9370026dac100175748a3","url":"https:\/\/www.themoviedb.org\/review\/5df9370026dac100175748a3","movie_id":69726}
{"author":"Wuchak","content":"***Curiously unabsorbing account of the Red Baron***\r\n\r\nThe exceptional career of the ace-of-aces, Manfred Von Richthofen, is chronicled up to his death at 25 years-of-age on April 21, 1918.  \r\n\r\n“The Red Baron\" (2008) comes in the tradition of similar WW1 fighter pilot flicks “The Blue Max” (1966), “Aces High\" (1976) and “Flyboys” (2006). “The Blue Max” is an extraordinary melancholic epic while the realistic “Aces High” is good, but one-dimensionally mundane. The blockbuster-ish “Flyboys” is entertaining, but marred by comic book storytelling (think “Legends of the Fall”). Does “The Red Baron” match or surpass any of these movies? Unfortunately, no.\r\n\r\nEverything is here for a quality film of this sort, but something about the storytelling makes for a curiously unabsorbing viewing experience, whether the fault is the script, the directing or something else (no doubt a combination). The first act lacks dramatic hooks and the necessary exposition to grab the viewer; and the movie never recovers. \r\n\r\nThis is augmented by the typical non-historical additions, like the nonsense of Von Richthofen (Matthias Schweighöfer) and Capt. Roy Brown (Joseph Fiennes) having cozy little chats throughout the course of the war. A lesser criticism is that a few of the cast members are noticeably too old for the parts. For instance, Lt. Werner Voss was only 20 when he was shot down while actor Til Schweiger was in his mid-40s during shooting. Lena Headey is a milder example. The score is good, but conspicuously rips-off the superior “The Last of the Mohicans” in two parts.\r\n\r\nIt’s not all bad. Schweighöfer, for instance, is fine for the titular role and carries the picture, which admittedly LOOKS good. I’ve seen the flick three times over the years and there’s enough good here to make it worth watching for people interested in Von Richthofen and what it was like during WW1. The story’s just not captivating.  \r\n\r\nThe film runs 1 hour, 46 minutes, and was shot in Baden-Württemberg, Germany, with studio stuff done in Prague.\r\n\r\nGRADE: C+","id":"5de18c600cd44600123531d1","url":"https:\/\/www.themoviedb.org\/review\/5de18c600cd44600123531d1","movie_id":8349}
{"author":"moubledian","content":"I used to leave a theatre after seeing a highly anticipated movie, specifically a sequel, and be so revved up about what I saw that I would declare that movie to be the best of a series. After each of the prequel \"Star Wars\" films, I rated that one the best, as good as any of the originals...for a time, until my opinion balanced out and I had a more well-rounded take. For that reason, I steer away from that mindset, and did for \"Dark Knight\".\r\n\r\nThough my opinion is solidifying already after having seen a Warner Bros. screening last night, \"Dark Knight\" ably stands on its own with or without \"Batman Begins\". At a two and a half hour runtime, it's definitely an epic of a movie, but one that never runs out of gas. A delightful addition to this experience was a healthy amount of IMAX footage, which significantly adds to the feel of being on a personal, and gruesome, tour of Gotham City.\r\n\r\nChristian Bale plays such a well rounded Batman and Bruce Wayne, qualities that none of those who have donned the cowl before him have pulled off. I still have to remember that Bale is British since he speaks with such a spot on American accent. Bale has a particular slurring lisp that serves him quite well, charmingly for Bruce Wayne and threateningly for Batman.\r\n\r\nCountering him is the late Heath Ledger, who plays such a scary and creepy Joker that I found it impossible to NOT have chills half the time I saw him on screen. What really separates this brand of Joker from Jack Nicholson's portrayal is true unpredictability. It's obvious that, to be a good guy and think like the Joker, it really takes a toll, and it sure isn't easy. How exactly does one take him down when he's woven his harebrained plot around multiple hostages, explosives, or disappearing parlor tricks?\r\n\r\nInitially, I was uneasy about how the character of Harvey Dent would be handled. In my mind, there was really only one faithful portrayal of him, and that could be found in the \"Batman\" animated series of the early 90s. As well as Tommy Lee Jones COULD have handled him in \"Batman Forever\", he certainly did not, though it still was a highlight of that movie. Aaron Eckhart ably assumes the mantle here, delivering a performance out of this world, easily on par with the Batman animated series.\r\n\r\nBe it known, this caped avenger stands for the good of Gotham City that the police force and its counterparts can't represent, the good that has no jurisdiction, no procedures...and no rules, save for one. I can only hope that we've seen just the prelude to the Dark Knight's upcoming legendary battles with the worst of Gotham City's dark underside.\r\n\r\n\"The Dark Knight\" gets a solid 10 of 10 stars.\r\n\r\nI used to leave a theatre after seeing a highly anticipated movie, specifically a sequel, and be so revved up about what I saw that I would declare that movie to be the best of a series. After each of the prequel \"Star Wars\" films, I rated that one the best, as good as any of the originals...for a time, until my opinion balanced out and I had a more well-rounded take. For that reason, I steer away from that mindset, and did for \"Dark Knight\".\r\n\r\nThough my opinion is solidifying already after having seen a Warner Bros. screening last night, \"Dark Knight\" ably stands on its own with or without \"Batman Begins\". At a two and a half hour runtime, it's definitely an epic of a movie, but one that never runs out of gas. A delightful addition to this experience was a healthy amount of IMAX footage, which significantly adds to the feel of being on a personal, and gruesome, tour of Gotham City.\r\n\r\nChristian Bale plays such a well rounded Batman and Bruce Wayne, qualities that none of those who have donned the cowl before him have pulled off. I still have to remember that Bale is British since he speaks with such a spot on American accent. Bale has a particular slurring lisp that serves him quite well, charmingly for Bruce Wayne and threateningly for Batman.\r\n\r\nCountering him is the late Heath Ledger, who plays such a scary and creepy Joker that I found it impossible to NOT have chills half the time I saw him on screen. What really separates this brand of Joker from Jack Nicholson's portrayal is true unpredictability. It's obvious that, to be a good guy and think like the Joker, it really takes a toll, and it sure isn't easy. How exactly does one take him down when he's woven his harebrained plot around multiple hostages, explosives, or disappearing parlor tricks?\r\n\r\nInitially, I was uneasy about how the character of Harvey Dent would be handled. In my mind, there was really only one faithful portrayal of him, and that could be found in the \"Batman\" animated series of the early 90s. As well as Tommy Lee Jones COULD have handled him in \"Batman Forever\", he certainly did not, though it still was a highlight of that movie. Aaron Eckhart ably assumes the mantle here, delivering a performance out of this world, easily on par with the Batman animated series.\r\n\r\nBe it known, this caped avenger stands for the good of Gotham City that the police force and its counterparts can't represent, the good that has no jurisdiction, no procedures...and no rules, save for one. I can only hope that we've seen just the prelude to the Dark Knight's upcoming legendary battles with the worst of Gotham City's dark underside.\r\n\r\n\"The Dark Knight\" gets a solid 10 of 10 stars.\r\n\r\nI used to leave a theatre after seeing a highly anticipated movie, specifically a sequel, and be so revved up about what I saw that I would declare that movie to be the best of a series. After each of the prequel \"Star Wars\" films, I rated that one the best, as good as any of the originals...for a time, until my opinion balanced out and I had a more well-rounded take. For that reason, I steer away from that mindset, and did for \"Dark Knight\".\r\n\r\nThough my opinion is solidifying already after having seen a Warner Bros. screening last night, \"Dark Knight\" ably stands on its own with or without \"Batman Begins\". At a two and a half hour runtime, it's definitely an epic of a movie, but one that never runs out of gas. A delightful addition to this experience was a healthy amount of IMAX footage, which significantly adds to the feel of being on a personal, and gruesome, tour of Gotham City.\r\n\r\nChristian Bale plays such a well rounded Batman and Bruce Wayne, qualities that none of those who have donned the cowl before him have pulled off. I still have to remember that Bale is British since he speaks with such a spot on American accent. Bale has a particular slurring lisp that serves him quite well, charmingly for Bruce Wayne and threateningly for Batman.\r\n\r\nCountering him is the late Heath Ledger, who plays such a scary and creepy Joker that I found it impossible to NOT have chills half the time I saw him on screen. What really separates this brand of Joker from Jack Nicholson's portrayal is true unpredictability. It's obvious that, to be a good guy and think like the Joker, it really takes a toll, and it sure isn't easy. How exactly does one take him down when he's woven his harebrained plot around multiple hostages, explosives, or disappearing parlor tricks?\r\n\r\nInitially, I was uneasy about how the character of Harvey Dent would be handled. In my mind, there was really only one faithful portrayal of him, and that could be found in the \"Batman\" animated series of the early 90s. As well as Tommy Lee Jones COULD have handled him in \"Batman Forever\", he certainly did not, though it still was a highlight of that movie. Aaron Eckhart ably assumes the mantle here, delivering a performance out of this world, easily on par with the Batman animated series.\r\n\r\nBe it known, this caped avenger stands for the good of Gotham City that the police force and its counterparts can't represent, the good that has no jurisdiction, no procedures...and no rules, save for one. I can only hope that we've seen just the prelude to the Dark Knight's upcoming legendary battles with the worst of Gotham City's dark underside.\r\n\r\n\"The Dark Knight\" gets a solid 10 of 10 stars.","id":"5c95ccc40e0a2645f151d76d","url":"https:\/\/www.themoviedb.org\/review\/5c95ccc40e0a2645f151d76d","movie_id":155}
{"author":"John Chard","content":"They are saying she’s a Faerie Changeling.\r\n\r\nThe Daisy Chain is directed by Aisling Walsh and stars Samantha Morton, Steven Mackintosh, Mhairi Anderson and David Bradley.\r\n\r\nGrieving over the loss of their first child to Sudden Infant Death Syndrome, newly pregnant couple Martha and Tomas decide to leave England and live on the Irish coast. They settle in quickly and things seem to be going well, but when their neighbours house burns down, leaving young Daisy an orphan, Martha and Tomas decide to foster care for Daisy in spite of her being a little different and introverted. Soon enough bad things seem to befall people who come into contact with Daisy, leading to the locals to suspect she may be something terrible from Irish folklore.\r\n\r\nOk! There’s some pretty venomous reviews of this out there in internet land, but really it’s a very well constructed creeper that’s not without intelligence. Firstly it needs to be noted that this is not a horror film as such, anyone searching for a scare fest or Omen like shocks are in for the biggest of disappointments. Secondly, taking some time out to read something about the legends of Faerie Changeling’s will significantly improve your viewing experience. Walsh’s movie firmly deals in the realm of superstitious legend, adds in a heart aching strand involving surrogacy via grief, and then lets it play out in ethereal beats till the chilling conclusion is reached.\r\n\r\nMorton and young Anderson are superb, the former stoic of motherly instincts but still emotionally cracked underneath, the latter a pallid and unnerving presence that haunts the picture even without much dialogue. The photography around the coastal hillside location is stripped back for realism purpose, it may be beautiful terrain, but there’s a greyness hanging in the air, suitably so as well. The musical score is a touch irritating, and Walsh is guilty of over doing the slow burn approach, but this definitely has more going for it than has previously been said. Not one to rush out and buy for sure, but certainly worthy of TV time on proviso you understand the Faerie thematics at work first. 7\/10","id":"52995967760ee31c5e0e932f","url":"https:\/\/www.themoviedb.org\/review\/52995967760ee31c5e0e932f","movie_id":37196}
{"author":"Oldnewbie","content":"Upon watching this film for a second time I realized just how much it reminded me of the famous \"War of the Worlds\" radio broadcast Orson Welles aired in 1939. With just the medium of radio he successfully created an atmosphere of panic so real people listening (who had not caught the beginning where it stated that the following was a radio drama) fled their homes thinking aliens from Mars had invaded Grovers Mill, New Jersey!\r\n\r\n\"Pontypool\" takes place almost exclusively inside a small radio station in the town of Pontypool, Ontario Canada. What starts out as an ordinary day slowly morphs into an extraordinary situation told almost entirely through eye witness call ins, a weather reporters sky view, and eventually the towns doctor who has a preposterous yet undeniably believable theory as to what is going on.\r\n\r\nDirector Bruce McDonald and writer Tony Burgess expertly create an atmosphere of frustration, disbelief, and panic all within the confines of a single set. Never once did I feel limited by not seeing what was going on outside. Like the aforementioned \"War of the Worlds\" radio drama, the situation unfolds by audio reports coupled with the unexpected entrance of the doctor.\r\n\r\nFor blood and gore fans there is a scene that is both shocking and heartbreaking. But this film is generally not for that audience... unless they have good imaginations and can be taken in by \"eyewitness\" accounts of brutality.\r\n\r\nThe other part of the tale that is refreshing is that the antagonism that is affecting the outside world is not a virus nor is it the dead come back to life. No... it is something... as the doctor explains... preposterous yet undeniably believable.\r\n\r\nThe casting of Stephen McHattie as the past his prime but not ready to go quietly DJ was a masterstroke. He brings to life Grant Mazzy in a way I cannot imagine another doing as perfectly. He mixes a jaded world view with pathos, anger, humor, and a just the right touch of madness as all around him slides into madness.\r\n\r\nIt is to be noted that in the IMDB trivia section, the writer admits to being heavily influenced by Orson Welles legendary radio drama when conceiving first the book, then radio broadcast, and finally film. It shows, as stated, and it shows gloriously.","id":"59647938c3a368265d100f8d","url":"https:\/\/www.themoviedb.org\/review\/59647938c3a368265d100f8d","movie_id":23963}
{"author":"TheTenth","content":"General Wang Sheng (Kun Shen) atacks a bandit camp and saves Xiaowei (Xun Zhou) who is a demon fox spirit that needs to feed on human hearts to keep her nice appearance. Wang Sheng brings her home and presents her to his wife Pei Rong (Vicky Zhao) that welcomes her and offers to keep her in her service. But Xiaowei falls in love with Wang. \r\n\r\nStrange events then happen, including people disappearing or dying, so Pei Rong turns to a demon hunter, Pang Yong (Donnie Yen), who is tired of things and not of much help. He meets an inexperienced demon hunter, Xia Bing (Li Sun) who is very interested in the events, and thinks a chameleon demon is the cause of problems. It is indeed such a demon, Xiaoyi (Yuwu Qi) that is in love with Xiaowei and kills people to bring her hearts.\r\n\r\nPei Rong won't quit finding the source of problems and confronts Xiaowei that reveals her demon form and forms a pact with her : the killings stop, but Pei Rong takes the blame for the murders.\r\n\r\nThis is a mix of faery tale, Wuxia and love story. The main cast does a breathtaking job, creating powerful characters with strengths and weaknesses, and led by their emotions and honor, including the demons. This makes a very moving story, as noone is really guilty and tries to hurt as few people as possible, or at least believes they're doing the right thing.\r\nI've been a fan of Vicky Zhao for years, and Donnie Yen is always great, but it's Xun Zhou that really shines here. Her mysterious charm creates a complex and charming character that we try to hope will either become good or be forgiven for her actions.\r\n\r\nVery recommended.","id":"5ae091d30e0a26156c015572","url":"https:\/\/www.themoviedb.org\/review\/5ae091d30e0a26156c015572","movie_id":17808}
{"author":"John Chard","content":"Summer is a stunner!\r\n\r\nEvery once in a while a fabulous British independent film slips under the radar and is criminally missed by a ream of cinema goers. Summer is one such film. It's directed by Kenneth Glenaan, written by Hugh Ellis and stars Robert Carlyle, Rachael Blake and Steve Evets.\r\n\r\nShaun (Robert Carlyle) and Daz (Steve Evets) were the rouge kids on the block, best friends forever, they were constantly getting into scrapes. Thoughts of education were the furthest thing from their minds. We find Shaun now in adulthood, and now caring for Daz who is crippled and suffering from terminal cirrhosis. From here the film is told through Shaun's eyes with flashbacks to better, vibrant times, in particular the one important summer where Shaun tries to come to terms with life, loves (Blake as the girlfriend Katy) and where fate stepped in to change things. It's through these flashbacks that we learn exactly why Shaun is so devoted to his dying pal.\r\n\r\nStructured in the way it is, basically set in three time periods of the protagonists life, Summer involves the viewers to the maximum with the characters. So much so that even with the hanging sense of doom in the air, the nagging question of why is this bond so strong? makes for a fascinating, and emotionally potent experience. The material and its central themes could quite easily been given the sledgehammer treatment by Glenaan, but he directs it in such a subtle way, the final result is all the more emotionally involving. There's no soft soaping either, the plot is tough and realistic, these are real people reacting to real life issues. Something that is helped enormously by the first rate performances of Carlyle (one of his best ever performances) and Evets.\r\n\r\nComplementing the acting is Tony Slater-Ling's beautiful photography, particularly in the flashback scenes to the boys youth. The warm glow of the sun, the ripple of the water, the green and pleasant land, each serve as painful reminders to Shaun of his lost youth. Nostalgia is not thought of warmly, it is by definition here, a yearning that gnaws away at his soul. Hugh Ellis' screenplay also deserves plaudits, this may not be the easiest of viewings, since this is after all about wasted life and impending death. But there is always hope in the offering, and coupled with the odd flecks of gallows humour, Ellis has found the right balance for the story. It's downbeat of course, and you may feel like you have been through the mangler come the end. But this really is excellent film making that tells a worthy and most endearing story. With Carlyle magnetic and real and Glenaan serving notice that he's a British director fit to sit alongside Meadows, Loach and Arnold. It's hoped that more people can find and let Summer into their lives. 9\/10","id":"5d5f5078924ce5001714e0cf","url":"https:\/\/www.themoviedb.org\/review\/5d5f5078924ce5001714e0cf","movie_id":25311}
{"author":"Reno","content":"**Theirs concern wasn't surviving, but what they had in their hands!**\r\n\r\nThis Canadian thriller-drama was a surprise. This little gem was well made despite financially belong to a lower grade. From the actors to the crew, all were fresh. This is a limited cast film about the four young teen girls who are stranded on a lake bank for days with a dead body. Trying to get back home, but lost their way in the wilderness. So they face numerous challenges, and risking their lives, they take a mission on their hands. But would they succeed or not what leads to the final segment of the narration.\r\n\r\nI have seen plenty of lost in wild and struggling to survive films. But this one was not one of those, except the story outline. In this, the girls are not concerned about their survival. Obviously, that's the first step anybody would consider for, but these girls are comfortable and confident on that. So what's this about then? This is about a quest they had undertaken that becomes theirs foremost priority. That's why it looked so fresh, despite there's no story in it, just the random happenings.\r\n\r\nSo I think it is an underrated film. I was aware of this film when it came out, but had no luck to have a watch. Very engaging narration, there's always something keeps happening. That is one of the reasons to hook with it till the last, despite technical flaws. I mean, in many parts, the camera work was sloppy, like out of focus and too much close up shots. They might have done it deliberately, but the viewers won't feel comfortable in a normal film and this one wasn't a normal film, not to me.\r\n\r\nI loved the locations, feels like I want to visit there. I think the filmmakers used it perfectly to the story they wanted to tell us. I know the end should have been in detail, but I'm happy for its simplicity. Besides, small film like this can't afford fancy conclusion and to commercialise. Now this is kind of artistic portrayal of struggle, as well as very edgy film. Its okay if you're not interested in this, but you should try it if an opportunity is near to you.\r\n\r\n_7\/10_","id":"5835e18f9251416c63019b1e","url":"https:\/\/www.themoviedb.org\/review\/5835e18f9251416c63019b1e","movie_id":56023}
{"author":"DoryDarko","content":"The first thing that went through my head the second Sunshine Cleaning ended, was 'I could have gone on watching for at least another hour'. Not just because it ended a little abruptly, but mostly because I so thoroughly enjoyed this film, that I was seriously disappointed when it was over. It's like that book that's so compelling that you just want to inhale every word, but dread to actually finish.\r\n\r\nSunshine Cleaning is about two sisters, who, driven by dire financial straits, decide to start \"a biohazard removal\/crime scene clean-up service\", cleaning up the houses of people who died gruesome deaths. The premise is fairly simple, but executed in a very lovely, heart-warming way, half tragedy – half comedy. Because of course, this film is not only about cleaning up other people's mess, but also about cleaning up some of their own baggage along the way, especially when the sisters are confronted with the memory of a death akin to what is now their daily business. Somewhere in between all this they have to deal with their eccentric father, the elder sister's peculiar son, love, loss, failure and a glimmer of hope. Reading this back now I realise this actually sounds really cheesy and sentimental, but I would have hated it if it was. Trust me.\r\n\r\nAmy Adams plays Rose, the eldest of the two, and Emily Blunt plays Norah, the rebellious younger sister. Rarely have I seen such great chemistry and energy between a leading pair. These two women make it seem like they've been working together for years, and physically they're a perfect match too, they actually look they could be sisters. Rose is obviously the mature, sensible one, whereas Norah just kind of takes things as they come, not worrying and not taking responsibility for her life. Though they seem to be bound not so much by kinship, but rather by a mutual fate and childhood hardship that has left its mark on both of them, although they deal with it very differently. Rose tries desperately to build a better life for herself and her son, but rarely finds any luck on her path. Norah just wings it and refuses to grow up.\r\n\r\nBoth Amy Adams and Emily Blunt prove to have great star quality and talent, and I think I can now officially call myself a fan of both. They are raw and real, one is sweet and the other is sour, without overacting anything. Alan Arkin is great as their dad. Eccentric, bitter yet loving, idealistic and seemingly in a mild state of denial. He plays pretty much the same character as in that other (great!) film of Sunshine Cleaning's producers, Little Miss Sunshine, where he also played the grumpy granddad. This type of role seems to be custom-made for him. Another great part is played by professional chameleon Clifton Collins, Jr. He plays Winston, the owner of a cleaning supplies shop, and he turns out to be that small shimmer of good luck that Rose so desperately needs. Actually, everyone in this film is so perfectly cast that it almost seems like this is a real family, in a real situation. It just doesn't feel contrived in any way, despite the lack of originality and obvious pitfalls where the story could have easily crashed and burned into a wasteland of melodrama and false sentiment. But like I mentioned earlier, this doesn't happen at any point. Usually when a film is on the borderline of becoming a total cliché, and yet works out successfully, it is because of one or maybe two factors. However, with Sunshine Cleaning, it's all of them. Cast, screenplay, dialogue, direction, camera work, production, just everything is wonderful. I'm actually running out of superlatives to describe this film.\r\n\r\nI'm inclined to give this film 10 stars, however there is just one small thing that kind of failed in my opinion and that's the ending. Nothing wrong with it story-wise, it just ended so abruptly that it feels like they literally ran out of tape. It actually kind of threw me off. But... oh, what the heck, this film deserves 10 stars, easily.\r\n\r\nIn conclusion, Sunshine Cleaning is just a beautifully crafted story about falling (hard) and getting back up on your feet again. It has a real indie-feel to it, it's basically just a pretty little art house gem. Funny thing – while I'm writing this, 4 Non Blondes' \"What's Up\" is playing in the background, and it feels strangely appropriate to the feeling of this film. So if you want to know what to expect of Sunshine Cleaning, listen to that song, it really captures the essence of the story. \r\n\r\nI can't think of much more to say to sell this film, all I can do is strongly recommend Sunshine Cleaning to pretty much anyone and everyone. It's wonderful.\r\n_(May 2012)_","id":"58ac4fbac3a3684a0a014337","url":"https:\/\/www.themoviedb.org\/review\/58ac4fbac3a3684a0a014337","movie_id":13090}
{"author":"The Movie Diorama","content":"Shutter takes Polaroid remnants of the original without the stunning flash. This is a peculiar remake. During the towering heights of Hollywood westernising world-renowned Asian horrors, mostly from Japan and South Korea, Japanese director Ochiai opted to alter the story of Thailand’s arguably most famous eponymous horror with American actors, set in Japan. Western audiences apparently wouldn’t be spooked if the ghost haunting the main characters wasn’t a pasty white Japanese girl with luscious black hair and masses amount of eye liner. It’s a cluster of cultures, and whilst the end result isn’t exactly terrible, it’s far from being tolerably good. Because much like ‘The Grudge’, ‘One Missed Call’ and ‘Pulse’, the underlying sense of pointlessness becomes an overburden for everyone involved.\r\n\r\nA photographer and his new bride travel to Tokyo where they accidentally smash into a girl standing in the middle of the darkened misty road (bare foot, might I add!). And so, through the ominous power of spirit photography, they become haunted. Specks of mysterious white vapours and the glistening sunlight against the camera lenses, being interpreted as ghostly entities attempting to communicate with the living. “The dead latch onto the flesh”.\r\n\r\nWithout changing the essence of the overall story too much, just minor details here and there, Ochiai manages to produce various suspenseful moments through the usage of anonymity. The ethereal cries of a haunting girl, the innocent humming of an eerie song and the most intense tonguing since Toad got struck by lightning back in ‘00. The supernatural elements work best when nothing is showed on screen. The dark room sequence when Megumi entered the room, although initially presumed to be Jane, was executed with enough slow-paced tension to become effective. Dropping a splinter of wood into a solution that causes a tsunami into the eyes? Ineffective. Electrocuting one’s self in a desperate attempt to rid the latched ghost? Well, I don’t need to tell you how stupid that is.\r\n\r\nDawson’s script is less than impressive. Masses amount of exposition and one-dimensional development that forced characters to be nothing more than tourists and amateur photographers. Seriously, Jane is the worst tourist. Shouting in the faces of locals exclaiming “excuse me, where do I go!?”. Is she oblivious to native languages? Like, she failed to even attempt one word in Japanese. That’s not Taylor’s fault, who isn’t the most talented actress in existence, but managed to bring out some surprising emotionality towards the film’s conclusion. Jackson on the other hand? Ehhh. He’s the kind of guy you want to slap for acquiring no personality. Just bland. His character’s best friends are pointless and sadly resorted to expendable deaths that suffered from no build-up.\r\n\r\nThe central mystery that powers the narrative does captivate, even if Ochiai’s direction made certain twists obvious due to extensive foreshadowing, and that’s the primary element for preventing this remake from venturing into the realms that we do not speak of. I’m looking at you ‘One Missed Call’ and ‘Pulse’!\r\n\r\nSo yes, Shutter is fine. As a film, it functions by itself with enough flash for the uninitiated. However, for those who have watched the original, you’re bound to find disfigurement within the composition of this photographic remake.","id":"5e206cabb3316b0013033ef3","url":"https:\/\/www.themoviedb.org\/review\/5e206cabb3316b0013033ef3","movie_id":10885}
{"author":"John Chard","content":"A heavy burden.\r\n\r\nAmerican remakes of Asian horror films have mostly struggled to win grace and favour with horror fans. Shutter is no exception, it has been met with the usual howls of derision, claims of it being pointless, loosing the horror essence of the original and etc. But what for someone like me who hasn’t seen the original?\r\n\r\nI found Shutter to be much like how I found The Ring, the Naomi Watts starrer from 2002, a very effective chiller with a solid mystery to be unravelled at the core. The ghost is creepy – as are the various photographic links, the scares handled professionally by the makers, and the finale pays off with a startlingly chilling revelation that freaked me out; and I’m a middle aged man!\r\n\r\nIt’s far from perfect, the pace is a bit haphazard, logic goes out the window often, and cast performances are only adequate in the absence of  “A” list stars to propel the story onwards. While it’s tough to hang your hat on the two principal players since the emotional empathy hasn’t been earned by them, courtesy of the writing. Yet with no frame of reference to raise expectation levels – or down them as well, this is a safe and sturdy spooker that does its job well enough. 7\/10","id":"54309c4cc3a3681143000474","url":"https:\/\/www.themoviedb.org\/review\/54309c4cc3a3681143000474","movie_id":10885}
{"author":"David","content":"When it comes to comedy, I'm like a patchwork. My favourite kind is the one I grew up with which is the Looney Tunes cartoons. I can watch them over and over again, and I will always laugh. I also love dark British humour, slapstick, and wait for it.... American.\r\n\r\nAmerican humour (especially these days) gets derided, most often due to it being \"dumbed down\" so the collegiate set can understand it, often using toilet humour as its best punchline. I somewhat disagree, I say that the humour people use between themselves is what drives movies made by Judd Apatow & co.\r\n\r\nTake Pineapple Express for example, this movie seems on some level to be fairly realistic. I use that term very loosely, because of course many things that happen in this film, could, and should never happen. Anyhow, the comedy, the dialogue, the fight sequences, and other interactions between the characters are the reasons I think make it feel this way.\r\n\r\nThe fight sequences aren't ones that I could say seem all that choreographed, of course there are \"X\" spots they need to hit, but for the most part I think it is done on the fly, or like much of the comedy, improvised.\r\n\r\nPineapple Express follows the story of a process server Dale Denton (Rogen), & his pot dealer Saul Silver (Franco), as they avoid henchmen (Robinson & Corrigan) of Ted Jones (Cole), Marijuana kingpin of L.A. after Dale witnesses a murder Ted commits. With a corrupt cop on the take (Perez) also on the hunt, staying alive for the buyer & supplier turned stoner buddies becomes an adventure of friendship as well as appreciation of the relationships built by people in this lifestyle.\r\n\r\nThe name Pineapple Express comes from the name of the variety of weed Saul introduces to Dale.\r\n\r\nI enjoy this movie because of the old fashioned approach taken to deliver the laughs and the story, and the characters feel very relatable to almost anyone on some level.","id":"5e3fd7b941465c0018cb4c80","url":"https:\/\/www.themoviedb.org\/review\/5e3fd7b941465c0018cb4c80","movie_id":10189}
{"author":"John Chard","content":"If you're good at anticipating the human mind, it leaves nothing to chance.\r\n\r\nJigsaw is dead. Does he have another apprentice to carry on his brand of bloody judgement? Will there be more elaborate traps to test the human condition to the max? You betcha.\r\n\r\nIf you are a fan of the series, and chances are that if you have sat down to watch this latest part then you must be, this one has enough about it to tickle the senses. Yet there's no getting away from the familiarity breeding contempt factor, narratively it offers nothing new, and irritatingly it becomes quite evident that it's obviously setting up the next film in the series. It's a sad state of affairs when the flashbacks involving Tobin Bell (Jigsaw) prove to be the film's only strengths, well there is the death traps to keep us awake I suppose... 4\/10","id":"560ed05a9251414ab9000f59","url":"https:\/\/www.themoviedb.org\/review\/560ed05a9251414ab9000f59","movie_id":11917}
{"author":"John Chard","content":"Extended Enlistment.\r\n\r\nKimberley Peirce’s (Boys Don’t Cry) movie proved to be controversial in military circles. The story is about the stop-loss procedure used by the American military, a kind of small print tactic that can extend a soldiers service should their country deem it so. Sergeant Brandon King (Ryan Phillippe) returns home from the Gulf Wars with his mentally scarred pals fully expecting to get back to a domestic life without blood and brains dominating his personal landscape. Yet he is called back in for another tour of Iraq under the stop-loss procedure, something he rebels against and goes AWOL. He has done two tours already, surely he has earned his retirement?\r\n\r\nIt starts off in electrified fashion, the horrors of the war in Iraq bursting from the screen as a firefight ensues, character traits are introduced to us, we are left in no doubt that the soldiers at the end of this tour of duty have seen it all. Pic then settles into a sort of cross between a road movie and a PTSD portrait awash with emotional strangulation. Peirce and her co-writer Mark Richard have honourable intentions, but too much is given over to stereotyping, of stock clichés and the bold signposting of character’s futures. They carefully paint King as a model soldier, this is definitely not about cowardice, but come the cop-out finale it’s evident that the narrative suffers glaring inconsistencies and confused messaging.\r\n\r\nOn the bonus side is the performances of the youthful cast, where some fluctuating accents aside, Phillippe, Channing Tatum and Abbie Cornish are superb, while Joseph Gordon-Levitt makes a weakly written part crackle with pained emotion. Of the elders, most are underwritten, which is a shame when you got the likes of Ciaran Hinds in the cast. We are left as a whole with a film that is as uneven as a dusty road in Tikrit, not only in narrative structure, but also in actual facts as regards the procedures of the American military, both on the written documents and execution of duty in battle.\r\n\r\nIt was a flop at the American box-office and it’s not hard to see why, but it still has merits. Even as the familiarity tries to breed contempt, the anguished reality of a soldiers life, during tours and post service time, strikes a mightily distressing chord. 6.5\/10","id":"54fac1b79251417b26000ed3","url":"https:\/\/www.themoviedb.org\/review\/54fac1b79251417b26000ed3","movie_id":8988}
{"author":"sam","content":"A movie that pushes the boundaries and explores inter-generational sex and how an older man can take advantage of a horny teen.  The adolescent is about to flunk out of school, primarily due to his focusing on improving his tennis game to move up to the pro ranks.\r\nHe contracts with a tutor to help him get his secondary degree.  As part of the deal he moves into the man's apartment and does light house keeping.  The older man watches the teen masturbate and sets up various scenarios that lead to oral sex.  The young man is having unsatisfactory sex with his girl friend and she eventually leaves him.  After a few parties and some heavy drinking, the tutor sodomizes the teen making that sex act part of the learning process.  As normal with French movies, there is sex, nudity and lots of dialog.","id":"573265ddc3a3686965000060","url":"https:\/\/www.themoviedb.org\/review\/573265ddc3a3686965000060","movie_id":72465}
{"author":"tmdb44006625","content":"To be fair, Punisher: War Zone is the most accurate representation of the comic we've had to date. The gore, extreme violence, and borderline sadism is very much a part of the comic. Ray Stevenson is spot on as Frank Castle. Dominic West is not so good as Jigsaw but at least his gang is more competent than Travolta's.\r\n\r\nGiven that this came out in the same year as two other big comic book movies, there is one big thing that Punisher: War Zone contributes: proof that a female director can make an unforgivingly cruel but kick ass action flick, so I don't understand how more of them aren't being given the opportunity to do so.","id":"5c84286d0e0a264303637a9c","url":"https:\/\/www.themoviedb.org\/review\/5c84286d0e0a264303637a9c","movie_id":13056}
{"author":"Wuchak","content":"***The best of the Punisher movies with a weak last act***\r\n\r\nThe Punisher first appeared in the Spider-Man comic in February, 1974, and became a semi-regular foe\/ally in that mag, but was more apt to appear in Daredevil in the 80s until the character got his own mini-series in 1986 and then his ongoing titles: The Punisher (1987), The Punisher War Journal (1988) and The Punisher War Zone (1992). The character was so popular at the time that he inspired a black & white magazine as well (1989).\r\n\r\nThe reason The Punisher was and continues to be so popular is because he's essentially an over-the-top version of \"Dirty Harry\" and \"Deathwish\": Frank Castle's family is killed by the mob while on a picnic in Central Park and so he declares war on all criminals wherein he becomes their judge, jury and executioner. Unlike Daredevil, a lawyer who utilizes the justice system, The Punisher just kills 'em all.\r\n\r\nThe first movie version was 1989's \"The Punisher\" with Dolph Lundgren, which was a disappointment. Lundgren was good, but the movie was too Grade B cartoony and it took too many liberties. Still, some consider it a cult flick. The 2004 movie with Thomas Jane curiously transferred the character from New York City to sunny Florida, specifically the Tampa area. There were other oddities that didn’t sit well, but Jane was good as the protagonist and there was enough good in the flick to marginally enjoy it.\r\n\r\nThis 2008 rendition, “Punisher: War Zone,” was originally intended to be a sequel to the 2004 movie with Thomas Jane, but delays in the production caused him to pull out. Lexi Alexander ultimately got the gig as director and she pitched the idea of doing the film “as a throwback to '80s era action films” with 6’4” Ray Stevenson taking over as The Punisher.\r\n\r\nJigsaw (Dominic West) makes for a memorable villain with Loony Bin Jim an entertaining wacko sidekick (Doug Hutchison). Wayne Knight plays Microchip and Julie Benz the wife of an undercover agent that Castle mistakenly kills on one of his missions. The towering Colin Salmon stands out as a police agent intent on tracking down The Punisher.\r\n\r\nIt was a good call to bring the story back to New York City and, honestly, this has to be one of the best-looking big city movies I’ve ever seen, no kidding. The cinematography\/locations\/lighting are exceptional. While the movie has the urban grittiness of Nolan’s Batman trilogy, it balances it out with amusing cartoonish-ness. There is some quality drama, like Castle’s anguish over killing a “good guy” and his dealings with the dead agent’s widow & daughter, but it’s not overlong and dull like in “Batman Begins” (2005) and “The Dark Knight” (2008). Unfortunately, the last act, while serviceable, could’ve been better.\r\n\r\nAt the end of the day, “Punisher: War Zone” edges out the 2004 movie as the best film version of the character. It’s more faithful to the comics and overall more entertaining even though it totally bombed at the box office.\r\n\r\nThe film runs 1 hour, 43 minutes and was shot in Montreal, Quebec.\r\n\r\nGRADE: B\/B-","id":"5beedba39251415cd10186c6","url":"https:\/\/www.themoviedb.org\/review\/5beedba39251415cd10186c6","movie_id":13056}
{"author":"Andres Gomez","content":"Really interesting movie that starts with a hilarious first half an hour but that it is unable to keep the level until the end.\r\n\r\nStill, it is worthy to be watched.","id":"52f1ef8b92514115b00994e3","url":"https:\/\/www.themoviedb.org\/review\/52f1ef8b92514115b00994e3","movie_id":18176}
{"author":"John Chard","content":"Sunbeam and Bashful Boy.\r\n\r\nDeception is directed by Marcel Langenegger and written by Mark Bomback. It stars Ewen McGregor, Hugh Jackman and Michelle Williams. Music is by Ramin Djawadi and cinematography by Dante Spinotti.\r\n\r\nJonathan McQuarry (McGregor) is a timid New York accountant who whilst working late one night meets Wyatt Bose (Jackman). Bose is the complete opposite to McQuarry, he's highly sexed, confident and supremely cool. So when a mix up with the pair's mobile phones introduces McQuarry to an exclusive sex group, he's spun into a world completely alien to him.\r\n\r\nIf you have watched a lot of film noir, both classic era and neo, Deception will come off as irritatingly stale. What we have here is very much a case of the title revealing far too much! You would hope that with the makers going for broke with such a title then they would have the nous to fill out the story with surprises, take us and the principal characters down some twisty streets, not so, sadly. Within ten minutes you catch on to what is happening, the writing so poor as to not cleverly challenge the narrative drive. It could maybe be argued that McQuarry's journey, and how the character evolves, is something of a veer from the noir norm? But it has no dramatic worth and renders the finale as dull (the alternate ending is even worse).\r\n\r\nIt's not a total wash out as such, the cast are engaging in their roles, good actors straining to make a weak screenplay work, while cameos from Natasha Henstridge, Charlotte Rampling and Maggie Q impact to come off as better than novelty value. And then there's Spinotti's (Manhunter, L.A. Confidential, Heat) cinematography, the best character in the play. His nighttime city scapes are electric, his colour lenses beautiful (golds and blues are poetic), his work deserves a better film. But that's about it, leaving us with a shallow noir cover version that's in search of its own identity. For those not familiar with the noir form, then this is just about average enough for a look see. For noir fans, though, it's neither erotic or thrilling and as unadventurous as it gets. 5\/10","id":"59ed9d5d92514119fc027f9a","url":"https:\/\/www.themoviedb.org\/review\/59ed9d5d92514119fc027f9a","movie_id":13018}
{"author":"sykobanana","content":"This is one of those films that I recommend to everyone who love movies and great acting.   It was little seen upon its release which is a shame because it has some of the most sublime and subtle acting as well as a moving and at times hilarious screenplay.\r\n\r\nSet in Edwardian England, we meet Fisk senior, an elderly gentleman looked after by his son, Fisk Junior, and house keeper, Mrs Brimley.  Fisk senior has withdrawn from life and as a part of his son trying to keep him involved in society, they visit a talk on reincarnation where they briefly meet local clergyman, Dean Spanley.  Following a further chance meeting, Fisk junior decides that he would like to spend more time with the reclusive Spanley, but he can only do so if he can procure a bottle of Imperial Tokaji (formerly spelled Tokay in English).  \r\n\r\nAs I mentioned, the acting in this film is superb by all, Northam with his quiet frustration with his father as Fisk junior and Brown does his “abrasive” Australian.  But it is Sam Neil and Peter O'Toole who are the highlights – their acting, particularly during close ups, is at times incredible.  \r\n\r\nFull credit to Toa Fraser for bringing these performances out with his light-handed direction.  \r\n\r\nThe beginning of the film can be a bit slow but I believe that this was done on purpose as a reflection of Fisk senior's life...as we journey with him, the film opens up more.  \r\n\r\nI highly recommend this film, especially if you can try some Tokaji when you watch it.  \r\n\r\n9\/10.","id":"5a68055c0e0a2653b2003cb4","url":"https:\/\/www.themoviedb.org\/review\/5a68055c0e0a2653b2003cb4","movie_id":18117}
{"author":"Dan_Tebasco","content":"There is no quality whatsoever to be found here. They paid DMX a couple thousands to make a quick appearance in order to sell it as a DMX movie (he's in it for about 59 and a half seconds).","id":"590325a89251413e35009366","url":"https:\/\/www.themoviedb.org\/review\/590325a89251413e35009366","movie_id":32010}
{"author":"Gimly","content":"A massive departure from the original, _Death Race_ keeps the cars and kills and forgoes virtually everything else from _2000_. Fun in a very different manner, but still fun, and that's what counts.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","id":"591688b7c3a36840aa02615a","url":"https:\/\/www.themoviedb.org\/review\/591688b7c3a36840aa02615a","movie_id":10483}
{"author":"Andres Gomez","content":"A correct comedy. No big surprises, except that Ryan Reynolds is a decent comedies' actor.\r\n\r\nThe script is the expected and it is something perfect for a rainy evening in the couch under a blanket.","id":"56ab2522c3a3681c3f002254","url":"https:\/\/www.themoviedb.org\/review\/56ab2522c3a3681c3f002254","movie_id":8390}
{"author":"Bazzjazz","content":"The Coen brothers really seemed to enjoy making this dark comedy.\r\nGreat ensemble cast . It really is just good solid entertainment and some great cynicism.","id":"5b04ac03c3a36864b400156e","url":"https:\/\/www.themoviedb.org\/review\/5b04ac03c3a36864b400156e","movie_id":4944}
{"author":"Slvrngrn","content":"Sadly, the title is misleading. \"Know Your Mushrooms\" is what the makers of the film want you do... it's not the subject. There is almost no material about identifying fungi, instead it's a puff-piece about the importance of mushrooms, even claiming that they are the basis of religion and that Jesus was a mushroom. All of the groundwork leads to a diatribe that seems meant to entice the viewer into trying \"Magic\" mushrooms.\r\n\r\nIf you want some fairly interesting random facts, it's OK...\r\n\r\nIf you want some talking points to justify drug use, it's pretty good...\r\n\r\nIf you want to learn mushrooms, it's worthless.","id":"5e1c92336a300b00165e7b71","url":"https:\/\/www.themoviedb.org\/review\/5e1c92336a300b00165e7b71","movie_id":30981}
{"author":"Gimly","content":"I think Simon Pegg is probably better served as a comedic actor in his native British movies, he's proven himself in that field time and time again, but when it comes to things like _How to Lose Friends & Alienate People_ he is never given the opportunity to shine, and it's the lacklustre, derivative movies themselves (like this one) that are to blame.\r\n\r\nAlso, he starts this movie already alienated and he doesn't have any friends, so the title is like???\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5aa49751c3a3687bff01a608","url":"https:\/\/www.themoviedb.org\/review\/5aa49751c3a3687bff01a608","movie_id":13092}
{"author":"Reno","content":"**The family of two cops and a thief and a super hot mom!**\r\n\r\nBasically, this film was nothing, just a timepass flick. Of course it has a story, though easily predictable. The actors were okay, but it was their roles which were not challenging enough. There are no good comedies, all were so plain or maybe already seen in different films. So this is one of those comes and goes kind, I mean not to stay in anybody's hit list.\r\n\r\nThe son who is working in the FBI returns to his mom's with his fiancé who works with him to stay for a while. One day while they all were out, the mom meets a stranger and instantly they two start to see each other. But what they don't know is the man's an art thief and planning for a big heist. So within them, two cops and a thief, how the events turn out, especially how it affect their romance was told in the remaining part.\r\n\r\nI have not seen Meg Ryan for a long time, though this is nearly a decade old film that I watched now. All I'm familiar with is the beautiful Meg from the 1990s romantic comedies. She looks quite the same, but not impressed with her performance. The others like Antonio Banderas was not bad, including Colin Hanks and Selma Blair. It could entertain those who watch films occasionally. But for a film fanatic like me it is completely boring, because the common line everyone of us say is 'I'd seen a better one'. So it is okay for a few people, but not for everyone.\r\n\r\n_6\/10_","id":"581cf51e9251413739001214","url":"https:\/\/www.themoviedb.org\/review\/581cf51e9251413739001214","movie_id":9262}
{"author":"John Chard","content":"King George angry at them white fellas. King George say them white fella bad spirit. Must be taken from this land. \r\n\r\nAustralia is directed by Baz Luhrmann and Luhrmann co-writes the screenplay with Stuart Beattie, Ronald Harwood, and Richard Flanagan. It stars Nicole Kidman, Hugh Jackman, David Wenham, Bryan Brown and Brandon Walters.\r\n\r\nIt took a bit of a kicking from the pro critics upon release, where the consensus is that at a cost of $130 million this intended sprawling epic is an ambitious flop. For the record at the box office it practically made double its outlay, so certainly wasn't a financial flop.\r\n\r\nIt's a mixed bag for sure, a film of two differing halves. First half sends Kidman's English aristocrat to Northern Australia after she inherits the sprawling Faraway Downs Ranch. Here she finds herself in the middle of a dirty take over plot and reluctantly makes a working pact with Jackman's stock-man Drover. Seeds are sewn here for a bit of a screwball relationship, all while a cattle feud brews and the Aborigines at the ranch - particularly young Nulllah (Walters) - are in fear of racial tension. Pic then flip-flops into a love story, a war story (as the Japanese attack Darwin) and the bile strewn historical strand that features the \"stolen generations\" of half-white\/half-Aboriginal children. \r\n\r\nWith all this going on, as Lurhman nods to classic epics from classic era past, the vistas are stunning and the hard work of cattle ranching is given genuine credence (helps having the rugged Jackman leading the way). Set pieces are exciting, the Japanese aerial attacks realistic for dramatic worth, while the chemistry between the leads, a worthy child performance from Walters and a quality weasel villain turn from Wenham ensure performances don't harm the pic in that department. There's even the likes of Ben Mendelsohn and John Jarratt in secondary support slots. \r\n\r\nIt isn't all it can be, and tonally it feels like there might have been some behind the scenes interference (three co-writers probably didn't help). Yet there are some genuine moments of fun and beauty here, mixed with some heart string tugs and reflection of an historical time that should never ne forgotten. Luhrman reached for \"Somewhere Over the Rainbow\" and didn't quite make it, but it's honourable and has some damn fine craft for entertainment purpose. 7\/10","id":"5e1b55cfe194b00014b5ed24","url":"https:\/\/www.themoviedb.org\/review\/5e1b55cfe194b00014b5ed24","movie_id":6972}
{"author":"John Chard","content":"I was taught four rules...\r\n\r\nThe Pang Brothers remake their 2000 Asian film for the American audience with mixed results. Starring Nic Cage, film follows Cage's hit-man to Bangkok where he is to complete a number of hits. He tells us via narration that he has a set of rules that he follows so as to survive in the \"business\". He then promptly breaks his own codes and his life comes under threat.\r\n\r\nThat's pretty much it as regards plotting. The Pang's bring much visual style to the picture, and show themselves to be adept at action sequences, but it all feels so familiar. Action movies are rarely going to bring new stuff to the table, they often, as is the case here, are kinetic popcorn pictures missing some emotional depth to marry up with the carnage. Thus this is not a film to be sought out by any action junkies looking for something new to add to their collections. As it happens Cage is fine and broody, managing to blend hard ass machismo with vulnerable traits. He, and the filmic style make it above average, even if ultimately it's instantly forgettable afterwards. 6\/10","id":"555690589251411e540039fa","url":"https:\/\/www.themoviedb.org\/review\/555690589251411e540039fa","movie_id":13184}
{"author":"Lee","content":".","id":"515c4c2419c2952d4f01f0e9","url":"https:\/\/www.themoviedb.org\/review\/515c4c2419c2952d4f01f0e9","movie_id":182618}
{"author":"Bazzjazz","content":"This film is a two part film . \r\nVincent Cassell is stellar as this gangster above the law. Based on true \r\nEvents.\r\n\r\nI thoroughly enjoyed it.\r\nLots of violence.","id":"5ae198aa0e0a262a6100b1ae","url":"https:\/\/www.themoviedb.org\/review\/5ae198aa0e0a262a6100b1ae","movie_id":13635}
{"author":"Law","content":"Devoid of narrative thrust, the movie foists scene after boring scene of strangers going about their banal lives on you, and expects you to care even though it gives you no reason to. What are the stakes? Where is the friction? There is virtually no story here.","id":"5b2848b7c3a36847c800039e","url":"https:\/\/www.themoviedb.org\/review\/5b2848b7c3a36847c800039e","movie_id":20116}
{"author":"RCH2288","content":"Wade Porter (Stephen Dorff) had it all going for him.  A thriving construction business, a beautiful family and a future with endless possibilities for a great life.  That all ends in an instant when while defending his home, he chases after a burglar and ends up killing him.  Faced with the possibility of serving a 15 year sentence for Involuntary Manslaughter he pleads his case down to 13 months instead.  Unfortunately he is woefully unprepared for what prison will be like for him.  He gets caught up in unfortunate circumstances with a white prison gang and is then sent to the San Quenton SHU to serve his time.  To survive against the other inmates and a sadistic cadre of guards, he finds himself tip toeing the line of prison politics and racism of the  gangs and violent fights just to stay alive.\r\n\r\nHe is befriended by a hardened 20 year veteran of the prison who is a mass murderer named John Smith (Val Kilmer).  Smith helps guide him to keep his sanity in the brutal conditions of prison.  All the while Porters fiancee and child are trying to stay afloat while he is in prison as well serving out his sentence.\r\n\r\nWell acted and well directed, Felon is one of the best prison movies ever made. It's right up there with American Me in terms of quality of film.","id":"590bbda79251415a4d00145c","url":"https:\/\/www.themoviedb.org\/review\/590bbda79251415a4d00145c","movie_id":13012}
{"author":"Dan_Tebasco","content":"DMX was a very promising actor at one point 'NEVER DIE ALONE' being the highlight of his acting-career  (and seemingly his last great performance).\r\n\r\nI think he was going through alot of personal problems in 2007-2008, and financial as well I asume as he appeared in 6 movies during that time. And all these movies were of poor quality that promoted them as DMX films (while he was usually only in them for about one scene and just a meer shadow of his former acting self).\r\n\r\nAnd this is one of these movies.\r\n\r\nWhile other ones like DEATH TOLL were just excrutiatingly awful, this is more or less as bad BUT this comes with the advantage of ocassionally  being laughably bad so it does at least entertain somewhat on some level so in that sense it's better.\r\n\r\nBut yeah don't expect this  to be good (it's not) and don't expect to see X for more than a minute. At least they didn't lie about Kris Kristofferson being one of the leads so there's always that, and he is the only person in the film that does make this movie remotely watchable.","id":"59032bb3c3a368288b008d8c","url":"https:\/\/www.themoviedb.org\/review\/59032bb3c3a368288b008d8c","movie_id":31461}
{"author":"Franky","content":"Julia Sweeney is funny and very intelligent. Brought up Roman Catholic, she started having questions about religion after reading the bible. Whether you believe in God or not, her arguments and questions are insightful and provocative. She approaches the subject with an astute mind, looking into multiple religions and delving deeper than most people care to. Many people follow religion blindly, and accepting whatever they are told by their minister. You will follow Julia Sweeney as she attempts to reconcile her faith in God before ultimately, letting go.","id":"58eebc62c3a3686059000d0e","url":"https:\/\/www.themoviedb.org\/review\/58eebc62c3a3686059000d0e","movie_id":40594}
{"author":"Rob","content":"OUTSTANDING","id":"55c8cb72c3a36818e2000880","url":"https:\/\/www.themoviedb.org\/review\/55c8cb72c3a36818e2000880","movie_id":13310}
{"author":"Gimly","content":"Essentially a Roadtrip movie with heavy criminal elements, _Cactus_ feels incomplete. Many of the great films of the modern era are seen as such specifically **because** they don't give the audience answers, _Cactus_ however feels more like it has straight-forward missing pieces, the ones that would get us across the line to fully invested in the story.\r\n\r\nEven so, it's a watchable piece, with no more hideously glaring faults than memorable moments.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5937a320c3a36827bf000f62","url":"https:\/\/www.themoviedb.org\/review\/5937a320c3a36827bf000f62","movie_id":17152}
{"author":"John Chard","content":"In a fairytale city with a couple of foul mouthed hit men.\r\n\r\nRay (Colin Farrell) & Ken (Brendan Gleeson) are two Irish hit men who are sent to lay low in the beautiful city of Bruges by their gangster boss Harry Waters (Ralph Fiennes). As they wait for instruction from Harry the pair start to address many things that are troubling them, with one pressing matter particularly relevant to their lives post the Bruges visit.\r\n\r\nWritten and directed by Martin McDonagh, a man more known for his play writing abilities, In Bruges is a rare old animal indeed. Not only is it a winner in the very wobbly sub-genre that encompasses the British gangster movie, it's also a hugely funny and tasteless button pusher to boot. From the outset the film sets itself up to not be to everybody's cup of tea. As Colin Farrell and Brendan Gleeson exchange expletive after expletive whilst surrounded by the considerable beauty of Bruges, it's obvious this is not going to be a \"normal\" movie. Throw in drug abuse, prostitution and a racist dwarf, well you can understand why the film is seen as unpalatable to some - yet still be digestible brilliance to others. What is for sure is that those who haven't seen it really should do so for it may just become one of your favourite movies, yes, it really does deserve the chance to pull you on board.\r\n\r\nBy definition, it's an ultimate black comedy, But in amongst the laughs, and there are many, lies a potent and affecting human drama involving love, guilt, morals and redemption. With the trick pulled by McDonagh being that of having every character in the piece dislikable, and yet easy to be on side with. Don't be surprised if you find yourself welling up with emotion during some of the more critical scenes. For the screenplay (BAFTA Award Winning) and the performances of Farrell (Golden Globe Award Best Actor) & Gleeson are razor sharp and very involving. Even Fiennes' spiv gangster boss is shown to be a ruthless sweary anger merchant, yet still capable of apology and genuinely respective of good principals. If that sounds odd? Then good, because it's an odd and strange little movie. I mean the love interest comes in the form of pretty Clémence Poésy, a criminal femme fatale type here, but once \"Fleur Delacour\" in \"Harry Potter\" & \"The Goblet Of Fire\". While Canadian dwarf actor Jordan Prentice is more well known for playing \"Howard The Duck\". Each of them serving genuine purpose, both for the funny side of the story, and for the more humanistic elements that unravel as we hurtle towards to the coup de grâce a like finale.\r\n\r\nA barbed wire black comedy led by a towering performance from Farrell - where just like him you should laugh, cry and swear to your hearts content. 9\/10","id":"5e5a6acd55c92600174e7fe4","url":"https:\/\/www.themoviedb.org\/review\/5e5a6acd55c92600174e7fe4","movie_id":8321}
{"author":"Sushrut Bhattacharjee","content":"There are good movies. Then there are great movies. And then there are perfect movies. Movies like In Bruges fall in the last category.\r\n\r\nBut what is In Bruges? It's a simple story of two hitmen hiding in Bruges, Belgium, while waiting for further instructions from their boss. It is a relatively simple story. Even the cast lacks any star names. Then what makes this film \"perfect\"?\r\n\r\nWell, pretty much everything. You see, rarely do we see a film which makes us feel a range of emotions; In Bruges is one of those films. We laugh in the absurd and often downright offensive jokes; we sympathise with the characters' woes in life; we feel scared at the bullets flying in the crowded Belgian streets. We \"feel\" everything when we are watching this movie. It's not a movie, it is an experience.\r\n\r\nThis character-driven movie is cinema at its finest. It's a must-watch for everyone who wishes to know why British humour is loved around the world. If nothing else persuades you, just watch it to see Colin Farrell deliver a performance of a lifetime.","id":"5e077c31eda4b700172c4029","url":"https:\/\/www.themoviedb.org\/review\/5e077c31eda4b700172c4029","movie_id":8321}
{"author":"John Chard","content":"Life in the old dog yet.\r\n\r\nIndiana Jones is called back into action when he becomes entangled in a Soviet plot to uncover the secret behind mysterious artifacts known as the Crystal Skulls.\r\n\r\nSo here it is, the fourth instalment of the Indiana Jones series is finally here, one of the most talked about, most anticipated, and most yearned for films is here to hopefully entertain the fans and maybe garner some new ones in the process?? Does it deliver? Well to me it most certainly does, as adventure yarns go, this is a ripper, and although the plot gets lost within the outlandish ideals, the film still emerges as one of the betert popcorn blockbusters of the year. All the chief ingredients that have made the franchise so beloved are crammed in by way of crowd pleasing necessity, and it damn well works, outrageous action sequences perk us up at frequent intervals, deftly self aware comic moments are many, and crucially, the film remains loyal to the heroic good against evil spirit of the franchise.\r\n\r\nWe begin in the Nevada Desert in 1957, and it's through this 50s setting that we come to accept the ageing of the main protagonist, he is after all a mere mortal, a man with a whip and a bit of guts. The 50s was a time of paranoia, spies and dubious cover ups were all the rage, this shines through from the outset here, and putting an aged Indiana Jones in this time frame is nothing short of genius. But enough of the politics, we as fans just want to be entertained, and we are well served here, spooky chambers, mysterious civilisations, tricksy maps, unfathomable codes, creepy crawlies, peril at every turn, and stuntery abound, oh yes it's all here. However, the purists will hate the use of CGI in this, and for sure it does grate during one over extended sequence, but just like it didn't stop Stephen Sommers' The Mummy being a riot, it doesn't harm this picture either, we are after all talking about a popcorn actioner here. Surely going into a film of this type one immediately suspends disbelief? I mean I'm personally going into the cinema to escape for a couple of hours, and Kingdom Of The Crystal Skull is just what the doctor ordered, with a lollipop to follow for good behaviour.\r\n\r\nThe cast are a mixed bunch, Ford easily carries off the role as the older Indiana Jones, very aware and with tongue firmly in cheek, he surely has rammed all the pre-negative vibes down the throats of the doom mongers. Shia LaBeouf fits into the series with no problems at all, spunky and witty, he adds the young sparkle needed to off set the aged nature of our hero, and he gets a quite delightful entrance to boot. Ray Winstone is an odd casting choice because his character is very underwritten, if you are going to utilise the big Englishman then give him the reins to take, he's gruff and watchable but it remains a case of wasting talent. Karen Allen joyfully reappears as Marion, and the film takes a significant leap upwards once she arrives, however the character is reduced to playing fourth fiddle in the ensuring shenanigans, and as much as the interplay with Indy still sparkles, you can't help hankering for much more from our Marion. Cate Blanchet is sparky as Irina Spalko but although as our chief villain of the piece she's tough, sexy, and not to be messed with, it's a turn that is never quite fully formed. John Hurt does the best he can with what little the role calls for, whilst Jim Broadbent barely gets time to fill the considerable boots left by Denholm Elliott's Marcus Brody.\r\n\r\nIndiana Jones and the Kingdom of the Crystal Skull will divide fans and newcomers alike, but I honestly say without nostalgia rearing its head, that this film is a joy ride to be judged on its own merit. It's difficult to understand some of the venom aimed at this latest instalment, it's not like anything has really changed with the formula, Indiana Jones has always been about fun, nothing more and nothing less, just remember why you fell in love with the franchise in the first place and you will see the makers here have given the fans what they wanted. Perhaps the advent of time and the new technology available has a hindrance value for sure, but although Indy 4 obviously isn't quite the impacting franchise jolt that Bond got with \"Casino Royale\", it's sure as hell shown \"Die Hard 4\" how it should have be done. 8\/10","id":"53fe9e9f0e0a262de5003162","url":"https:\/\/www.themoviedb.org\/review\/53fe9e9f0e0a262de5003162","movie_id":217}
{"author":"tmdb44006625","content":"Iron Man did a lot more than just launch the Marvel Cinematic Universe. It was the first comic book movie in a long time to integrate the fantastical nature of superheroes and supervillains into a real world setting with consequences. It also showed how great of a filmmaker Jon Favreau is and rebooted the career of Robert Downey Jr.\r\n\r\nFor all this, Iron Man is a fantastic movie, still one of the best MCU films. It's so much fun to watch. Yet it displays a lot of intelligence, exploring the internal dilemma of a man profiteering off war when faced with the harsh reality that he is part of a system that corrupts absolutely.","id":"5c8427cc0e0a2642fe63694b","url":"https:\/\/www.themoviedb.org\/review\/5c8427cc0e0a2642fe63694b","movie_id":1726}
{"author":"Gimly","content":"**A long form review originally posted in 2010:**\r\n\r\nMarking the beginning of the latest Marvel franchise, _The Avengers_, is Jon Favreau's _Iron Man_.\r\n\r\nI'm quite fond of Super Hero movies, I don't love them to the same extent that I do the slasher or psychological thriller genres, but they do hold a small place in my heart all to themselves. I'm pretty pumped for this whole \"Avengers\" thing to come to fruition, 'cause honestly it's all been great so far, starting with Iron Man, whom Robert Downey Jr. (_Natural Born Killers, Gothika, Kiss Kiss Bang Bang, A Scanner Darkly, Zodiac, Sherlock Holmes, Due Date_) portrays, and incredibly so.\r\n\r\nIt's important to set yourself a starting point. More specifically, what I mean is, a reason. Batman's parents were murdered, and his home was destroyedby crime; The Punisher's whole family was murdered in front of him and he big-time snapped; characters like the X-Men and the Fantastic 4 are defending themselves and end up having a penchant for world-saving. Those are all fine, and so long as you have one, I'm happy. But I really kind of like Tony Stark's reason for becoming Iron Man... He's a dick. That's why. He's a dick that supplies the world with the most lethal weapons in existence, and they take lives left, right and centre. Then, he's put through the world where they get used, and finally is told by the person who helped him escape that world, not to waste his life. He believes he is still alive for a reason, he decides that reason is to become a dick that is intent on privatising world peace. Which I think makes perfect sense.\r\n\r\nThat may have come across as sarcasm, but I was deadly serious. Tony Stark becomes Iron man, and that's why. It works fantastically. We then get to see all the incarnations of his suit, how difficult it was to make, what it runs on, the technology, everything. And I'm a huge fan of back story, which Iron Man delivers.\r\n\r\nIt's sort of the antithesis of DC's _Batman Begins_. Though they're both young adults that come from money with no family, a British butler (although Iron man's butler Jarvis was transformed into AI for the film [he was an actual person in the comics]), they have a board of directors take care of their family's billionaire business until they're ready to eventually take the reins, they both become \"____ Man\" and go about saving the innocent, not through superpowers but technology. I'm sure I could go on. But they're also incredibly different. Where Batman is a total bad ass, the gothic unknown defender of the night that uses fear as a weapon to protect his home town, and yet refuses to kill; Iron Man is a bright, shiny, loud attention grabber, who goes all international to fight crime, he wants the world to know he's Iron Man and his enemies are totally lame, so no wonder he has no qualms about killing! Batman's secret identity, Bruce Wayne, is an angsty tosser, that tries way to hard. But Tony Stark, is a witty, brilliant inventor, who has basically harnessed all of Batman's training, strength, weapons, vehicles and flight, improved them, and put them in to a single suit. So though I personally prefer Batman as a hero, I prefer Tony Stark as a character.\r\n\r\nThe interaction between Stark and Pepper Potts, played by Gwyneth Paltrow (_Se7en, The Talented Mr. Ripley, The Royal Tenenbaums, Sky Captain and the World of Tomorrow_) was incredible. It just goes to show what good casting can achieve, even in an action flick, the dialogue is hilarious and clever. Is it possible for a Super Hero movie to be a bad Super Hero film but a great film? I guess it is.\r\n\r\nThe antagonists are lacking to say the least, and their dispatching leaves even more to be desired. Which is normally not too huge when you get the rest so perfect, unfortunately, it's a comic book film, about Super Heroes, and Super Villains. They fight one another over and over, in fact that's pretty much what the comics are about in their entirety, so it's quite a major short coming. That being said, it's really the only one that _Iron Man_ has. In a way though, they're a similar comparison to the latest Batman films again; Iron Monger and Whiplash are flashy, but disappointing, where The Joker, Two-Face, Scarecrow and Ra's al Ghul are top notch as bad guys. Whereas Ironman's Obadiah Stane and Ivan Vanko were great characters, but Batman's The Joker is only seen in his villain persona, and Harvey Dent, Jonathan Crane and Henri Ducard are nothing more than vessels for their alter-egos.\r\n\r\nAll that aside, the film is just plain good, and you don't need to be a fan of Iron Man, Super Heroes or comics in general to enjoy _Iron Man_.\r\n\r\n82%\r\n\r\n-Gimly","id":"5b1520a00e0a262df1009196","url":"https:\/\/www.themoviedb.org\/review\/5b1520a00e0a262df1009196","movie_id":1726}
{"author":"The Peruvian Post","content":"When director Jon Favreau and Sarah Halley cast Robert Downey Jr, they glimpsed something magnificent: a more-than-skilled actor who faultlessly portrayed the role of Tony Stark. Despite Favreau's initial decision in choosing a fresh face, he ended up delighted due to his charismatic, natural and comfortable attitude. He did not realise it yet, but he was moulding with the right measures a whole superhero cinematic universe which lasted until today and still goes for more.\r\n\r\nThe filmmakers took the proper time to introduce a character whose production was undecided since New Line Pictures argued that the main character [Iron Man] had no potential to be brought up to the theatres. Therefore, planning from scratch a prosperous superhero who was not related to the typical Fantastic Four, X-Men or Spider-Man [famous superhero films of the 2000s] was quite a challenge. However, the director unquestionably demonstrated his skills at the visual effects, the rock metal music, the accurate dialogues for each moment and finally, the remarkable development of each persona. How exactly?\r\n\r\nEstablishing the visual effects of a high-speed-altitude enthusiast was marvellous, considering the time of the creation. The way Favreau adjusted the Iron Man gave numerous innovative perspectives of a superhero while in battle. If we first watched the 'Spidey Sense', then it was time to behold the flying upper and upper. What an achievement ladies and gentleman! Taking into account the sound effect, it was splendid in every single way because it gave decent time to evoke emotions, from sadness to awesomeness, it permitted to feel the sensation of building a strong armour or flying as fast as possible. \r\n\r\nMan! That AC\/DC hard rock music was well-defined to this fascinating character. Did I mention that Downey's son is growing on music? He has a band, and it's called \"The Dose Band\". Just watch the School of Rock's report. Probably there is where the influence came by. On the other hand, this film gives such iconic quotes which will live on our memory: \"Is it better to be feared or respected?\", \"Sometimes you gotta run before you can walk\", \"I am Iron Man\". WOW! What potential we have got here! Finally, but not least, the impeccable action scenes and drama ones were the highest achieves Iron Man had got. The sequence in the cavern traped with Dr Yinsen serves to the protagonist time to reflect on himself and the responsibility he has in protecting the world against high-tech diseases.\r\n\r\nPlus, the very unusual but gorgeous chemistry between Tony Stark and his secretary\/companion Pepper Potts is another striking feature which is not considered at all was. When Kevin Feige, the current president of Marvel Studios, was asked about his desition about casting Gwyneth Paltrow he confessed the following: \"Gwyneth is the embodiment of a leading lady. She brings intelligence, poise and an incredible range of talent to this role\". Throughout the movie, these two characters happened to be facing their professional and sentimental relationship naturally owing to the Iron Man. The way Pepper Potts clings on to the fact that his beloved boss is in troublesome scenarios, it's just pure tenderness and shows how much potential this couple has.\r\n\r\nThe cast assuredly introduced not only convincing performances but strong characters which will be handy for the following Marvel instalments, just watching Jeff Bridges as the badass Iron Monger is superb! The film producer nailed it! If someone asked me about the flaws it has presented, probably I would say the dark tone, some petit explicit scenes (bearing in mind there are children as spectators) and the lack of sense of humour at times. Still, it is mostly pure perfection.\r\n\r\n[83\/100]","id":"5e4a051a9b8616001662e541","url":"https:\/\/www.themoviedb.org\/review\/5e4a051a9b8616001662e541","movie_id":1726}
{"author":"The Peruvian Post","content":"When director Jon Favreau and Sarah Halley cast Robert Downey Jr, they glimpsed something magnificent: a more-than-skilled actor who faultlessly portrayed the role of Tony Stark. Despite Favreau's initial decision in choosing a fresh face, he ended up delighted due to his charismatic, natural and comfortable attitude. He did not realise it yet, but he was moulding with the right measures a whole superhero cinematic universe which lasted until today and still goes for more.\r\n\r\nThe filmmakers took the proper time to introduce a character whose production was undecided since New Line Pictures argued that the main character [Iron Man] had no potential to be brought up to the theatres. Therefore, planning from scratch a prosperous superhero who was not related to the typical Fantastic Four, X-Men or Spider-Man [famous superhero films of the 2000s] was quite a challenge. However, the director unquestionably demonstrated his skills at the visual effects, the rock metal music, the accurate dialogues for each moment and finally, the remarkable development of each persona. How exactly?\r\n\r\nEstablishing the visual effects of a high-speed-altitude enthusiast was marvellous, considering the time of the creation. The way Favreau adjusted the Iron Man gave numerous innovative perspectives of a superhero while in battle. If we first watched the 'Spidey Sense', then it was time to behold the flying upper and upper. What an achievement ladies and gentleman! Taking into account the sound effect, it was splendid in every single way because it gave decent time to evoke emotions, from sadness to awesomeness, it permitted to feel the sensation of building a strong armour or flying as fast as possible. \r\n\r\nMan! That AC\/DC hard rock music was well-defined to this fascinating character. Did I mention that Downey's son is growing on music? He has a band, and it's called \"The Dose Band\". Just watch the School of Rock's report. Probably there is where the influence came by. On the other hand, this film gives such iconic quotes which will live on our memory: \"Is it better to be feared or respected?\", \"Sometimes you gotta run before you can walk\", \"I am Iron Man\". WOW! What potential we have got here! Finally, but not least, the impeccable action scenes and drama ones were the highest achieves Iron Man had got. The sequence in the cavern traped with Dr Yinsen serves to the protagonist time to reflect on himself and the responsibility he has in protecting the world against high-tech diseases.\r\n\r\nPlus, the very unusual but gorgeous chemistry between Tony Stark and his secretary\/companion Pepper Potts is another striking feature which is not considered at all was. When Kevin Feige, the current president of Marvel Studios, was asked about his desition about casting Gwyneth Paltrow he confessed the following: \"Gwyneth is the embodiment of a leading lady. She brings intelligence, poise and an incredible range of talent to this role\". Throughout the movie, these two characters happened to be facing their professional and sentimental relationship naturally owing to the Iron Man. The way Pepper Potts clings on to the fact that his beloved boss is in troublesome scenarios, it's just pure tenderness and shows how much potential this couple has.\r\n\r\nThe cast assuredly introduced not only convincing performances but strong characters which will be handy for the following Marvel instalments, just watching Jeff Bridges as the badass Iron Monger is superb! The film producer nailed it! If someone asked me about the flaws it has presented, probably I would say the dark tone, some petit explicit scenes (bearing in mind there are children as spectators) and the lack of sense of humour at times. Still, it is mostly pure perfection.\r\n\r\n[83\/100]","id":"5e4a06c32d93750017a9b05b","url":"https:\/\/www.themoviedb.org\/review\/5e4a06c32d93750017a9b05b","movie_id":1726}
{"author":"izgzhen","content":"Imaginative illustration of an epic story. It combines the modern background society, e.g. terrorism, with the unconventional high-tech fantasy. Our leading actor Robert Downey Jr. deeply embodies the soul of the Iron Man in himself. We common people never lived this way :P","id":"59cc634fc3a3682aa30065a3","url":"https:\/\/www.themoviedb.org\/review\/59cc634fc3a3682aa30065a3","movie_id":1726}
{"author":"CookieCutter","content":"Not my review, but a review by Sara Schieron on Boxoffice.com\r\n\r\n(http:\/\/www.boxoffice.com\/reviews\/2009-04-oblivion-el-olivio?q=Oblivion)\r\n\r\nDutch documentarian Heddy Honigmann’s last film, Forever, explored the importance of art in people’s lives by interviewing visitors of the famous French Cemetary Père-Lachaise. A similarly simple approach is taken in her newest documentary, Oblivion, but here the subject explored is that of memory and its influence on wealth, politics and the people of Lima, Peru. Poetic in its structure and humane in its storytelling, Oblivion is poignant, filled with interviews that effortlessly speak volumes. Numbers may be small in theatres, as the film will find its home in metro centers known for arthouse patronage. Still, theatres in areas with Peruvian, or Latin American hubs nearby could benefit from outreach to those communities.\r\n\r\nA young man walks through a ramshackle neighborhood in Lima, chatting with boys his age and younger, all of them are practicing handstands. They practice for their daily performances of acrobatics and juggling, which they do at intersections for tips—and they’re not a minority. Many youth perform like this, in ways both vexing and inventive. One little boy, perhaps 8 or 9, rubs a comb against a can and sings window to window. The juggler heads to a bartending class where his teacher speaks clearly and directly about the value of service and the importance of smiling at your customers—service, it is stated, is about making everyone feel welcome. This is a critical point, as the majority of the people we meet in Oblivion seem unable to make a home in their homelands due to inhospitable circumstances. They are, each in their fantastically unique ways, dispossessed.\r\n\r\nA distinguished bartender at a luxury bar across from the Capitol Building explains that people come to Lima because they’re inventive and there’s no future where they come from. Ironically, Lima suffers from mass political corruption, at the hands of supposedly publicly elected officials who, as it’s made clear by the bartending class, have little concept of what it means to serve. The bartender tells a story about a previous Minister of Finance who never lived in Lima and came to the city just at the beginning of his term, heading straight to the bar where he gave the bartender the equivalent of two dimes and told him to buy every city paper with it. But the main city paper cost something like $2.50. The bartender identifies promptly: “What could we expect of him as a Minister of Finance?” Under this Minster, the country suffered a period of hyperinflation from which it seems to still be recovering.\r\n\r\nThe factor Honigmann weaves to unify these people is memory, particularly memory of better times. Hongimann asks most of the interviewees, if they don’t bring up the matter without her provocation, “Do you have any good memories?” And with the exception of one heartbreaking, 14-year-old shoeshine boy, who’s so clearly suffered in his short time, everyone has a story of easier days, with fewer obstacles and more warmth. As a companion to her questions about good times, Honigmann asks about bad times, in particular, when those in service were treated badly. Most say they haven’t been treated terribly but one waiter at an upscale eatery says, “I’m a good clown.” With a universe of dignity the waiter says his wife has never eaten at the restaurant where he works. He can, he explains; make those meals for her at home. He plays a folk song from his pueblo about a massacre in a town square that took two of his family members. It’s unknown still if the terrorists or the police were behind the massacre. As with this man and his wife, it’s Lima’s elders, distinct and dignified, whose silence echoes.\r\n\r\nHonigmann dedicates the film to the memory of her friend, poet and screenwriter José Watanabe, whose poem she includes in its entirety: “Surrounded by horror, I allow myself just this silent poem.” \r\n\r\nSource: http:\/\/www.boxoffice.com\/reviews\/2009-04-oblivion-el-olivio?q=Oblivion","id":"53918d5d0e0a260fc900152b","url":"https:\/\/www.themoviedb.org\/review\/53918d5d0e0a260fc900152b","movie_id":211714}
{"author":"Andres Gomez","content":"Ritchie repeats again the same template and this is not one of his best shots.","id":"53585721c3a3685609008308","url":"https:\/\/www.themoviedb.org\/review\/53585721c3a3685609008308","movie_id":13809}
{"author":"Kenneth Axel Carlsson","content":"Someone is trying to make easy money, but gets screwed. However, there is always a bigger fish in the pond looking to eat the smaller fish. In this movie, lowly criminals meets councillors, junkies, dead musicians, dirty accountants, nasty crime bosses and filthy rich russians. Sounds like another movie by Guy Ritchie, more or less, and it does indeed follow the same rhythm (and theme) as Lock, Stock and Two Smoking Barrels.\r\n\r\nThe movie opens with the narrator, Archy, who breaks down the plot for us in tiny, easy-to-digest bits, and thats definitely my least favorite bit in the movie, but sadly, needed. This plot is a twisted labyrinth, that constantly shifts from one person to the next. There are no real heroes here, just fish eaten by sharks, hunted by humans, killed by... you get the point.\r\n\r\nRocknRolla has a huge cast, and some big names too. In smaller roles, you'll see names such as Tom Hardy (Handsome Bob), Jeremy Piven (Roman), Thandie Newton (Stella) and Idris Elba (Mumbles), and in the bigger, you find names like Gerard Butler (One Two), Mark Strong (Archy) and Tom Wilkinson (Lenny Cole). Most of them delivers quirky and fun characters, and some of them even gives us a bit to think about, like Tom Hardy's role, Handsome Bob, who is coming to terms with being gay.\r\n\r\nThe movie is fast-paced to begin with, but slows down a bit later on. It has the obligatory violent Guy Ritchie scenes that reminds us of the early movies of Quentin Tarantino, but in the end, it is all a bit hollow. This is a movie about greed, about screwing over those with money, or even, those without.\r\n\r\n_Last words... looking for a bit of solid entertainment, a good plot (not too easy to get your head around, but not too hard to loose you either) and some nice solid actors (and actresses), this is definitely the movie you are looking for._","id":"549c1fbc925141311f003994","url":"https:\/\/www.themoviedb.org\/review\/549c1fbc925141311f003994","movie_id":13809}
{"author":"Wuchak","content":"_**Intense with more depth than you might think**_\r\n\r\nJohn Rambo (Sylvester Stallone) is alone, bitter and living hand-to-mouth in Thailand when a group of Christian missionaries enlist him to take them into Burma (aka Myanmar) to aid a village. Rambo discourages them in light of the political instability, which includes persecutions and mass slayings, but they insist. Weeks later he learns that the missionaries are missing so he goes back with a group of mercenaries.\r\n\r\n\"Rambo\" (2008) is the fourth installment in the franchise after \"First Blood\" (1982), \"Rambo: First Blood Part II\" (1985) and \"Rambo III\" (1988). I'm a huge fan of the first one, which I think is an action\/adventure masterpiece, but the next two films are too comic-booky and the characters are cardboard, although Stallone never looked better and the locations are fabulous. \r\n\r\nThis third sequel makes up for that because it's not comic booky at all and there's quite a bit of depth, albeit not much in dialogue form. It combines elements of \"Apocalypse Now,\" \"The Killing Fields\" & the first two Rambo films and is grim & intense from beginning to end, not to mention it's one of the most violent films ever made. The picture powerfully illustrates the best and worst in humanity. The Christian missionaries are willing to risk everything to help the villagers, whereas the Myanmar militarists revel in slaughtering scores of unarmed people for \"fun\"; they're also shown abusing\/raping women and boys. Obviously they've given themselves wholly over to the darkside of their natures. Such reprobates are only worthy of one thing: Utter annihilation.\r\n\r\nSeveral important themes are addressed in the picture besides the main one:\r\n\r\n* BITTERNESS\/DESPAIR AND DELIVERANCE. The beginning of the film shows Rambo in a state of utter bitterness: He's just existing. He has no friends. He doesn't talk much and, when he does, it's few words laced with expletives. The male leader of the missionaries is completely unable to talk him into helping them. Two Biblical proverbs state \"a gentle answer turns away wrath\" and \"a gentle tongue can break a bone.\" The female missionary (Julie Benz) knows this and skillfully talks John into helping them. Yet there's more going on here. This woman with a heart of gold is Rambo's \"golden connection\" out of the rut of bitterness. Despite his gruff exterior, she sees something in him, something in his eyes – a good heart, even greatness, a genuine glimmer, however faint. Is Rambo helping the missionaries or is she the one helping him? John instinctively realizes the rope she's throwing him and takes hold of it. There's nothing sensual about their relationship, despite her attractiveness; it's solely spiritual. She stirs in him the hope and faith he's been longing for.\r\n\r\n* VIOLENCE IS NOT ALWAYS NECESSARY. Although this is a very violent film it skillfully shows when pacifism _is_ appropriate. Note the incident on Rambo's riverboat when the lead mercenary continually insults John and tries to provoke him into a fight. Rambo just ignores him, not even saying a word. In other words, he refuses to allow someone to victimize him and draw him into a conflict that has no positive purpose. It takes true strength to do this and Rambo has this strength. Indeed, John treats the guy as if he's a bothersome gnat. What do you do when a gnat bothers you? Do you break out a machine gun or merely ignore it? This is the \"turn the cheek\" principle.\r\n\r\n* TOTAL PACIFISM DOES NOT WORK. The New Testament does not support the idea of absolute pacifism, but rather limited pacifism (only resorting to violence when justified). For instance, Christ’s ministry team had a treasury box with loads of money and some of his workers carried swords for protection from thieves & murderers. Also, Romans 13 clearly states that the righteous laws of human governments are God-ordained for the purpose of punishing criminals, including the right to execute when appropriate. The vast majority of sane Christians realize this, but there are a few extremists who refuse to be BALANCED with the Scriptures on this topic and insist that conflict, and especially armed conflict, is never appropriate. The lead male missionary represents such a person, but perhaps he'll learn the error of his ways. The simple fact is: Some people are so degenerate and evil that execution is the only just ultimate reaction (notice I said \"ultimate\").\r\n\r\n* RAMBO’S SPIRITUAL REBIRTH. The first two sequels show Rambo searching for truth and flirting with religion and spirituality. In the second film he gets a Buddhist necklace off the Asian woman he befriends and at the beginning of \"Rambo III\" he is shown living & working at a Buddhist temple helping the priests; later, he meets and wins the hearts of moderate Islamic villagers and gives his necklace to a Muslim boy who helped him. In this movie the female missionary is key to John's positive transformation; at one point she gently asks him whether or not he has any family in the USA. He mumbles that he might have a father, he wasn't sure, and didn't seem to care. Shortly later she gives him a cross necklace for helping them (he wouldn't take money). Anyway, the end of the film shows Rambo walking to his family ranch in southern Arizona. Obviously John had a positive spiritual metamorphosis in the story that leads to a decade of peace & love before the next film, “Last Blood” (2019).\r\n\r\n\"Rambo\" was written & directed by Stallone and shot in Thailand (and Arizona). It’s short & sweet at 1 hour, 32 minutes.\r\n\r\nGrade: A","id":"5eac577ec8a2d4001e4ae2ef","url":"https:\/\/www.themoviedb.org\/review\/5eac577ec8a2d4001e4ae2ef","movie_id":7555}
{"author":"JPV852","content":"Kick-ass action all around and although the story is on the basic side and has minimal character development for Rambo himself, just a bloody, albeit too much of it CGI'd, entertaining especially an action-fest finale. Amazing, especially being the fourth entry into the series.","id":"5d66ea506082eb0015a57270","url":"https:\/\/www.themoviedb.org\/review\/5d66ea506082eb0015a57270","movie_id":7555}
{"author":"DoryDarko","content":"Rachel Getting Married left me feeling quite ambivalent. On the one hand I was really impressed with the acting (most notably from Anne Hathaway), on the other I just couldn't get myself to care. But that's really the director's doing; after all, it's his job to get me involved and to make me care about the story he's telling, and unfortunately, Jonathan Demme failed to do so with this film.\r\n\r\nSomething that throws you off right from the start is the incredibly shaky hand-held camera. There isn't a steady shot throughout the entire film. It actually gave me a headache during the first five minutes. This, in combination with the lack of proper story- and character build-up makes you feel like you're watching a home video of some stranger's wedding. And it's not particularly interesting… Strangely enough, during some parts of the film I felt like I was watching a Louis Theroux documentary, because that's exactly the way it was filmed. I expected a gangly Englishman with dark glasses to walk in at any moment and start asking questions. Actually, that might have done this film a world of good… Scenes go on way too long without there being a clear point to it, and I just have to wonder why Demme decided to go this way. I mean, he has made some really good films in the past, and I was strangely surprised to see he directed this. It looks and feels more a graduation project from some film student, which isn't necessarily a bad thing, but it is when your name is Jonathan Demme. I even fast-forwarded some parts because the scenes were really dragging and I got bored. I actually felt like turning it off a few times, and that doesn't happen to me lot.\r\n\r\nIn the end though, I'm glad I stuck with it, because the second half of the film picks up the pace and finally introduces some real character drama.\r\n\r\nSimply put, this film is about a drug addict who gets leave from rehab for a few days to attend her sister's wedding and pretty much ruins the whole thing. Anne Hathaway is very impressive as Kym, a self-centred, reckless addict, and she plays her role convincingly. So much so even, that she manages to make you feel NOT sympathetic towards her character at all. She is completely self-absorbed and unlikable, and even steals her sister Rachel's thunder when she (Rachel) announces to her family that she is pregnant, and Kym immediately turns the conversation around and makes it all about her again, and does so on many more occasions. I know that many people who are related to drug addicts will be able to relate to these typical symptoms, so in that sense, it was all very real. On her part, Rosemarie DeWitt, who plays Rachel, was equally impressive as she firmly stood her ground as the loyalty-torn older sister who only asks to be in the spotlight for one day of her life, without her troubled sister claiming all the attention. However, the part that mostly struck a nerve with me was that of their dad, played by Bill Irwin, who is, more than anyone, caught in loyalty limbo, not wanting to have to choose sides between his two daughters. He doesn't overact his inner conflict in any way, yet he garners more sympathy than anyone, because he makes his pain so understandable.\r\n\r\nIn fact, everything about Rachel getting married is all very human and relatable. The story (written by Jenny Lumet, daughter of Sidney!) is not one any of us have never heard before, but that's alright. We don't always need super complicated psycho-analysis with characters talking like they all studied Freud for the past twenty years. Sometimes, simple stories about human troubles are enough to carry a film. It may be somewhat predictable, with a quasi-happy ending, but it's still credible enough to leave you satisfied.\r\n\r\nAnd yet, I don't feel this film deserves much more than a 6, maybe a 7. And the fault of this lies entirely with the direction. The shaky home video style I mentioned earlier might work for The Blair Witch project, but not for a slow-paced character drama. And the pacing was just horrible. Some scenes were completely unnecessary and could have easily been cut down or even left out completely and nobody would have noticed. In fact, that would have helped a lot. It's really a shame, because the story is decent and the acting is great, but this is not a great film and it never will be. I do think it's worth the watch, especially if you want to see Anne Hathaway in what is probably a career-defining role. But from the man who made Philadelphia, this is a bitter disappointment.\r\n_(October 2011)_","id":"58ac4c659251415900014a91","url":"https:\/\/www.themoviedb.org\/review\/58ac4c659251415900014a91","movie_id":14976}
{"author":"TheTenth","content":"Surinder (Shah Rukh Khan), a 40+ shy guy, comes to visit his professor. His daughter Taani (Anushka Sharma) is soon to be married, the father presents him as his favourite student, but as a young energetic woman she doesn't even see him. Tragedy strikes as the future husband is killed in a car accident. The father is devastated and sent to the hospital. He asks for Surinder and Taani and makes them promise to get married so that she is taken care of by someone he trusts. Taani comes to live with Surinder but barely speaks a word to him, despite his extreme gentleness and attempts to make her laugh. One day she comes on an advertisement for dance lessons. She asks Surinder to do it. He doesn't care about it at first, then accepts. He sees improvement in her mood, but she doesn't open to him. He then disguises to get into the dance lessons, but the school gets into a dance competition and couples are (randomly?) chosen.\r\n\r\nI saw maybe 300 Bollywood movies, most being romantic comedies. This one begins as a drama, then the mood gets lighter as the movie goes on. The characters are very likeable from the start, and the story development is mostly slow to allow to know them better. The scenery is only the small town they live in, so nothing fancy there, only the dance course is somewhat more colored, and improves a bit as the tension grows.\r\n\r\nBut what makes the movie is the stunning performance of SRK, playing both a shy guy in a strange situation and the bold dancer trying to warm Taani's heart. And Anushka Sharma (in her first role) is totally stunning, she plays this broken young woman in such a moving way, either very sad, a bit angry, lost among other people ...\r\nA special sequence with lots of guests (Kajol, Rani, Bipasha, Lara Dutta ...) brings a happy moment.\r\nVery recommended.","id":"5a8d38410e0a267c6b004729","url":"https:\/\/www.themoviedb.org\/review\/5a8d38410e0a267c6b004729","movie_id":14072}
{"author":"Kenneth Axel Carlsson","content":"A woman, Wendy (Michelle Williams), is trekking through America, well, she does have a car, although not of much use to her (it breaks down early on in the movie). She also has a dog, Lucy, whom she loses early in the movie. We have no idea where this woman came from exactly, but we know where she is going, and why. Alaska... to get work. Of course, this might not be the entire truth, just what she tells people. She is not poor, but she has clearly not been wasting her money so far and she is not about to do that now, although, circumstances might take that decision right out of her hands.\r\n\r\nThis woman has experienced something, and carry the scars. She does not trust people well, but learns to trust some people throughout the movie. But luckily, the movie does not provide all the answers... we have to figure them out for ourselves. These are the movies that I like the best.\r\n\r\nMichelle Williams is amazing in this role, heartbreaking really. She makes good decisions, but also some terribly wrong ones that might change her journey significantly. I found myself being angry at her early on for making a really stupid and unnecessary decision, but how wonderful to finally see a character who isn't perfect. Flaws is what define a human.\r\n\r\nThe movie itself is slow paced, taking its time to follow Wendy around. It never rushes the story for a second, and when it is over, you can't help but think that it could have easily been 2-3 hours longer, as you want to see what happens to Wendy and Lucy. The images are very realistic, following Wendy close. They are not perfect, but neither is life, and this movie wants to show us just that... life. This is clearly an indie movie, and one of the best I've seen in a good while. I've seen another movie by the director, Kelly Reichardt, and it was filmed in the same way.\r\n\r\n_Last words... Wendy and Lucy is a story about being human, about surviving in the world, about searching for something, a purpose maybe. It is also about friendship and trust, about the choices that we make, the choices that come to define us and our lives. Yes, it might seem like a small movie, but in reality, it is the biggest story of all, the story of our lives._","id":"549f33839251411d530033bc","url":"https:\/\/www.themoviedb.org\/review\/549f33839251411d530033bc","movie_id":8942}
{"author":"Reno","content":"Michelle Williams is one of the photogenic face in Hollywood and also like her performance. But won the negative impression of mine over portrayal of her character in 'Take This Waltz'. Doing a villainous role may get appreciation, for example, the Joker from Batman, but doing things that affect morality is really hurt if you really like that person. After that movie, I was not into her films and she also did not do any major roles. Accidentally I came to know about this movie, which is in fact a bit older movie than what I was talking about and after knowing more about it, I got interested and I could not resist from watching. Frankly, this movie filled the gap created by the earlier crack.\r\n\r\nThis movie falls in the line of 'Open Road' and 'Into the Wild' when it comes to rendering the main character. If you have already seen those two, or any other similar flicks, then you would find this movie was very much intense. Wendy, a woman in her late 20s with her dog Lucy are on an expedition to the other end of the country seeking a solution to the difficulty for having a normal life and job. One must have to keep walking on either of way to see a light at the end of the tunnel and that's what Wendy does here.\r\n\r\n> \"You can't get an address without an address.\r\n> You can't get a job without a job.\"\r\n\r\nThis movie commence middle of her destination, where she's stranded after her car broke-down. It won't say anything about the earlier account of Wendy or what might happen after the timeline of this film. All the 80 minute of narration takes place in the Oregon city which is just a glimpse of her life for us as a movie, but a major impact thenceforth in her life. The struggle during fixing her car is what depicted simply, but beautifully on the screen.\r\n\r\nThe story is about the man and his pet's relationship, that's what the meaning of the title, like 'Marley & Me'. Also being a young woman, society is no safe for roaming freely all the places alone at all the time. Plain drama, it was, but something meaningful story, a lesson to learn, a character to study and a life to experience. A kind of journey of self- discovery during understanding how the civil system works. Thematically there's nothing wrong, but 'setting an example' wise, this movie is not safer for other than the adults. Among the best movies of the year it was released. Impossible not to recommend others, especially by me to you perhaps.\r\n\r\n8\/10","id":"5564a217c3a36851cf004d77","url":"https:\/\/www.themoviedb.org\/review\/5564a217c3a36851cf004d77","movie_id":8942}
{"author":"Gimly","content":"\"Epic\" in so much as Emmerich films always are, but that's not to be confused with \"good\". If you want to learn something true, or feel an emotion, look elsewhere. But if poking a mammoth with a stick is more your thing, you could probably handle _10,000 B.C._\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"593c258a92514105cf010c95","url":"https:\/\/www.themoviedb.org\/review\/593c258a92514105cf010c95","movie_id":7840}
{"author":"DanDare","content":"Quantum of Solace had to follow Casino Royale which rebooted the Bond franchise with critics as well as with some of the public with a youthful, angry Bond.\r\n\r\nQuantum of Solace starts 20 minutes after the events of Casino Royale with a fast edited but choppy car chase sequence. This is the first hint that Bond is following the Bourne films as co-editor Richard Pearson previously edited one of the Bourne films. This also highlights director's Marc Forster inexperience in making action films as many of the action sequences are hard to follow because of the way it has been edited.\r\n\r\nThe film was also hampered by the 2008 writer's strike. This meant that film went into production without a full working script which also meant that the director and even Daniel Craig allegedly wrote scenes for the film. It might explain the short running time.\r\n\r\nThe film unveils Quantum as a shady organisation with tentacles everywhere even in the heart of the British security services. The setting in Bolivia with disputes about water gives the film a political edge with a cynical look at corporations making dicey alliances with dictatorships to mutually exploit the people and plunder resources.\r\n\r\nForster gives the film some intriguing set pieces such the opera scene which is the meeting point for Quantum operatives which Bond infiltrates.\r\n\r\nThe short running time means the film is not overblown but with Craig at the helm it is kept lean and mean.","id":"58aee6519251410b3b006df0","url":"https:\/\/www.themoviedb.org\/review\/58aee6519251410b3b006df0","movie_id":10764}
{"author":"John Chard","content":"If we refused to do business with villains, we'd have almost no one to trade with!\r\n\r\nQuantum of Solace is directed by Marc Forster and written by Paul Haggis, Neil Purvis and Robert Wade, suggested from the stories written by Ian Fleming. It stars Daniel Craig, Olga Kurylenko, Mathieu Amalric, Judi Dench, Giancarlo Giannini, Gemma Arteton & Jeffrey Wright. It is the 22nd film of the James Bond series.\r\n\r\nFollowing on straight from Casino Royale, we find James Bond thirsting for revenge on those he believes responsible for Vesper Lynd's death.\r\n\r\nIs Quantum Of Solace a great action film? Yes it surely is, is it however a great James Bond picture? Not quite, apparently, given the often venomous reaction to it from some Bond fan quarters. You wonder if Quantum Of Solace is a victim of Casino Royale's soaring success? A film that even surprised the many Daniel Craig haters. Were these internet warriors preying for a bad Bond film purely to further their argument that Craig should not be Bond? Did QOS give them smug satisfaction? Actually no it didn't, the box office and longevity of professional critiques proves this fact. Further viewings of QOS show it to be very astute in the Bond universe, where much of the charges of it not being fun enough etc just do not stick. As for not being Bondian enough? Opening car chase, a pursuit on foot that ends in a quite exhilarating rope dangle punch up, speedboat chaos, aeroplane peril with free-falling! Not Bond enough? Seriously? While it's also great to see Bond active on a motorcycle again.\r\n\r\nThe Casino Royale rebooted and re-suited offering was popular because it had an earthy make over, Daniel Craig's Bond is a fallible human being brimming with egotistical ruggedness. It's much of the same here in Quantum, where he is forced to go rouge, something that again has proved to be an itchy narrative thrust with sections of the Bond faithful. Yet as serious as he is, driven by pangs of annoyance, revenge and unanswered questions, Bond does have time to lay out a quip, there is some fun stuff their, honestly, Mother. Personally I enjoy the dark half of this Bond, \"I don't have any friends\", he wouldn't care\", and \"how many is that now?\", these are moments nearly as good as the interwoven opera blood bath and Bond drinking away his demons with 6 high velocity cocktails. Then there is Craig. Ah, Craig, Daniel Craig, again perfect in the tux and kicking arse with streetwise credibility, each scar on his nicely formed body a testament to this new rugged Bond of the people. That he rises above a relatively muddling script is testament to not only his acting ability, but also his new found acceptance in this most iconic of cinematic roles amongst the British institution that is James Bond.\r\n\r\nThe rest of the cast are a mixed bunch, Jeffrey Wright & Giancarlo Giannini are again merely making up the numbers, though the last gets to give Bond one of the film's darkest and cold inducing moments. Judi Dench of course does her usual solid M performance, swearing and growing the balls she hinted at previously, while Olga Kurylenko is very much a sparky Bond girl to savour; even if the sub-plot involving her almost feels like it was shoe-horned into the script as an added extra. Elsewhere there are problems. Casino Royale, had on the surface a weak villain, a man merely playing cards to pay off a more evil source, but he was effective. Sadly here in the Quantam universe the main villain is a hindrance to the picture. Mathieu Amalric's Dominic Greene does a good line in smarmy, but he's so weak the film nearly crumbles under the weight of his banality. The people at the house of Bond need to realise that little fish villains are only OK if we get the big daddy shark showing his\/her face later in proceedings, for if this trend continues I fear the franchise could well lose the edge so well built up in Royale, and Gemma Arteton is pretty, but pretty ineffective. The locations are sumptuous, mind, and the sets are Bondian delights, with the title sequence certainly hitting the spot in spite of the quite dreadful Jack Black and Alcia Keys' theme song that accompanies the sequence. A homage to a former great Bond film sequence is respectful but a touch lazy, but QOS still overcomes its failings to be up above many action pictures of the last decade; this in spite of it being very slim line at an hour and 45 in length. Crucially, though, it pulses with Bond aggression and egotistical nous, just as Fleming wanted it. But this only comes out with further viewings...\r\n\r\nSkyfall will be the next venture for Bond, regardless of quality we know that it will fail to appease every Bond fan on the planet. That's just the way it is with the series, so many want so many different things from their Bond. But I feel this is a good period for Bond, they do have the right man wearing the tux and as a character he is well tuned into the times, both politically and cinematically, it's now up to the makers to fuse the two and deliver a film to fully realise the rebooted franchise's potential and maybe, just maybe, win the dissenters' trust. 7\/10","id":"58a8ee299251410a0e004a9a","url":"https:\/\/www.themoviedb.org\/review\/58a8ee299251410a0e004a9a","movie_id":10764}
{"author":"Potential Kermode","content":"**It's a shame that they did this to the Bond films**\r\n\r\nIt's upsetting for Bond fans that Eon productions ran away from the lively, fun formula that sustained the franchise for 40 years. What does it leave us with? Well - this type of Bond film unfortunately. Staggeringly bland and uninteresting.  If we removed the name Bond from the film we would have no idea that we were watching a Bond movie. \r\n\r\nIt is depressing that they flushed 40 years of fun Bond films down the toilet to satiate people who dislike classic Bond adventures. They reached for a wider audience by going all generic action film to the detriment of the Bond legacy.\r\n\r\nWho is this unsophisticated, short, blond man in the suit? Unfortunately, _he could be anyone_ - even you or I. Bond is now a lager chugging everyman. Ian Fleming would be furious.\r\n\r\nNo chance of Craig's Bond wearing  _a strap on plastic seagull hat_ as Connery did in the classic Goldfinger (1964) - they would not dare make the films that fun and entertaining anymore.\r\n\r\nIt's a shame what they did to the Bond films.","id":"58a24ea3925141537f000530","url":"https:\/\/www.themoviedb.org\/review\/58a24ea3925141537f000530","movie_id":10764}
{"author":"JPV852","content":"Probably liked this a bit more than the last time I saw this ('08 or '09) but still a sizable step down from Casino Royale, although I do appreciate that this is a direct sequel (whereas it seems most Bond movies are standalone). The plot isn't the best nor is the villain, albeit Mathieu Amalric does have the creep-factor going for him. The action sequences are good but not enough quieter moments.\r\n\r\nPlus, the (kind of) twist at the end regarding Vesper really cheapened that character, having her being duped like that, seems out of character given how perceptive she was with Bond.\r\n\r\nIn any case, still a solid enough movie as a whole and I absolutely love Olga Kuryenko, shame she never really took off. **3.25\/5**","id":"5e9689ef002134001399f235","url":"https:\/\/www.themoviedb.org\/review\/5e9689ef002134001399f235","movie_id":10764}
{"author":"noodles95","content":"Se conhecêssemos tão bem o cinema português como o de outros países, talvez este \"1.ª Vez 16mm\" fosse o nosso filme de culto: o The Room português, que é ainda mais fascinante que a obra de Tommy Wiseau. Tudo correu tão mal, que nos states o filme de Rui Goulart foi considerado experimental. Mas não: entre tanta coisa estranha há que contemplar os simbolismos bizarros que polvilham todo o filme, a forma muito, muito deprimente com que o realizador lida com a história pseudo-autobiográfica que queria contar, e os constrangedores momentos de autocrítica, em que o autor goza\/santifica - o espectador escolhe - os seus métodos de produção, que passam por enviar cartas para toda e qualquer empresa disposta a pagar uns cobres para aparecer durante uns segundos de película (vemo-lo a ir aos correios proceder ao envio desses pedidos), não pagar à equipa técnica e viver de filmagens dominadas por um constante...\"improviso\". E há muito mais, neste espécime de filme hilariante (cuidado para não se engasgarem), extraordinariamente mal feito (não há nada que se salve), e que foi uma das experiências mais perturbadoras que tive na minha vida. Preparem-se para um festival de nonsense acidental, (não encontrem respostas para nada em parte alguma desta fita), um daqueles acidentes que dá prazer ver do início ao fim.","id":"585716409251416f100549e7","url":"https:\/\/www.themoviedb.org\/review\/585716409251416f100549e7","movie_id":430793}
{"author":"Wuchak","content":"Not all Germans supported that madman\r\n\r\nRELEASED IN 2008 and directed by Bryan Singer, \"Valkyrie\" is a World War II crime thriller based on the true story of the last German plot to assassinate Hitler in the Summer of 1944, although it wasn't a crime, of course, but rather an act of heroism.\r\n\r\nTom Cruise resembles the protagonist, Colonel Claus Von Stauffenberg, but he lacks his height. Despite this, Cruise is solid in the role and the story works up some quality suspense. Even though we know the plot will fail, you can't help but root for the dissenters' success. Almost 5000 Germans were subsequently executed on grounds of treason for the failed attempt, although not all of them were connected to this specific conspiracy.\r\n\r\nThe film is both entertaining and educational. It shows that there were thousands of Germans who were willing to risk all to get that lunatic out of office. And they almost succeeded. \"Valkyrie\" is reminiscent of 1976's \"The Eagle has Landed\" in some ways so, if you liked that one, you'll probably appreciate \"Valkyrie.\" I like the '76 film a little better.\r\n\r\nTHE MOVIE RUNS 2 hours, 1 minute and was shot in Germany, Czech Republic and California. WRITERS: Christopher McQuarrie & Nathan Alexander.\r\n\r\nGRADE: B","id":"5b3687b50e0a263ffc02f09d","url":"https:\/\/www.themoviedb.org\/review\/5b3687b50e0a263ffc02f09d","movie_id":2253}
{"author":"JPV852","content":"Decent if not also contrived quasi-political thriller (the politics of it is rather thin and safe, so neither side will be offended) with each segment were okay though the Forest Whitaker one was the most ridiculous. Also not sure if there was meant to be one with the news team, and Sigourney Weaver's talent was utterly wasted.\r\n\r\nAll that said, the stunt and car chase sequences in the final act was great and a good choice more or less having Dennis Quaid being the lead of the ensemble. This probably makes for a fine weekend viewing even if the pacing, that is the jumping from one POV to the other, never quite worked but still found it entertaining. **3.5\/5**","id":"5eaf2e10edeb43001fc7ea80","url":"https:\/\/www.themoviedb.org\/review\/5eaf2e10edeb43001fc7ea80","movie_id":7461}
{"author":"Fixyf","content":"A terrible movie that is full of cruelty. The problem of cyber crime is never relevant in our time. This cannot but scare. I am glad that I am using the Utopia P2P application, which allows me to keep my data safe.","id":"5e4e46e8283ed900195e15b6","url":"https:\/\/www.themoviedb.org\/review\/5e4e46e8283ed900195e15b6","movie_id":8090}
{"author":"John Chard","content":"Nothing new and only proving that the horror genre in 2008 wasin need of reinvigoration.  \r\n\r\nJennifer Marsh is a secret service agent, her speciality is crime across the internet. One day she comes across a site that is untraceable, the host of the site conducts painful killings to entertain the watching public. The kicker being that the more people who log on and observe, the quicker the death will be, and, well people being people...\r\n\r\nThere really isn't much to recommend here, outside of a solid performance from Diane Lane as Marsh, and some newer ingenious deaths to woo the gorno crowd, it's a buy the numbers horror thriller that seems to come along every three months. The villain is incredibly weak, the script is tepid and uninspiring, and the ending is as predictable as anything that has been done badly before. The premise promised so much as well, we are all here in an internet driven age, so what a perfect chance the makers had to play on users fears, sadly this fails in the same way that 2006s Stay Alive failed, thinking the premise alone will make a great genre piece.\r\n\r\nIf you liked Hostel 12 and Saw 37, chances are you will get something from this film, but the original Saw, Cube and My Little Eye seem a million miles away now, for at least they had originality and vitality in their favour, Untraceable just comes across as a big league cash cow milking the purses of gorno children who fail to see the blunt hammer hitting them over the head. 3\/10 for Diane only.","id":"5c43c4009251412beedcd260","url":"https:\/\/www.themoviedb.org\/review\/5c43c4009251412beedcd260","movie_id":8090}
{"author":"John Chard","content":"Ouch!\r\n\r\nSmart little horror this, what it lacks in story originality it more than makes up for elsewhere.\r\n\r\nYoung lovers Seth (Paulo Costanzo) and Polly (Jill Wagner) find their attempts at a romantic camping trip usurped by their inadequacies in the great outdoors. But this soon becomes the very least of their problems, because they are car-jacked by escaped convict Dennis Farell (Shea Whigham) and his drug addict girlfriend Lacey Belisle (Rachel Kerbs). When they run over what they think is an animal of some sort, it signals the start of a terrifying ordeal that will see the group backed into the interior of a gas station and forced to fight for their lives.\r\n\r\nWhat follows is a solid hour of suspense, terror, horrifying scenes and rich character dynamics. It’s a siege situation with the enemy some sort of porcupine – vegetable – human hybrid, and it’s relentless and clever. Director Toby Wilkins doesn’t once let the picture sag or suffer from filler, all scenes and character interactions are integral to the plotting. Mercifully free of characters doing the dumb things that are so inherent in this splinter (hrr hrr hrr) of horror, Wilkins’ film is consistently effective in what it wants to achieve. \r\n\r\nThe effects are kept to a minimum and the only real complaint is that for every attack by the creature we are subjected to shakycam. If this is to hide the effects work we don’t know? And it’s always great to have a horror assailant be used sparingly on a visual level, but the shakycam becomes annoying and feels like a bit of a cheat in the final quarter. The small cast offer up some sterling performances, with Whigham standing out as the hateful villain, while Nelson Cragg’s photography strips the colours down to primal indie level and the film is better for it.\r\n\r\nA pleasant surprise and recommended to horror fans after a quick and bloody siege horror that never disappoints. 7.5\/10","id":"5443d0330e0a266336005236","url":"https:\/\/www.themoviedb.org\/review\/5443d0330e0a266336005236","movie_id":13220}
{"author":"John Chard","content":"The mirrors. They're so clean.\r\n\r\nMirrors is the American remake of a little known Korean film called Into the Mirror. The plot has Kiefer Sutherland as a recovering alcoholic cop, who whilst on suspension is taken to working as a security guard at a large burnt out department store and starts to see terrifying images in the many mirrors about the place... \r\n\r\nYou would think that Mirrors was a flop. The critics hated it and the horror hordes were very much divided on it, the latter of which is to be fair the norm for any big horror movie release. Yet it didn't flop, it did very well at the box offices of the world and has a decent 6.2 average on IMDb, which for a divisive horror film is well above average.\r\n\r\nMirrors overstays its welcome, there really was no need for it to run to just under two hours in length. While elsewhere there's some pretty poor dialogue, parts of the screenplay are pointlessly soap opera in nature, while some thinking will make you scratch your head in bewilderment at events outside of the brilliantly monolithic department store.\r\n\r\nHowever, does Mirrors create a genuinely spooky atmosphere (the interiors of the store are creep fest nirvana), insert some shock moments to jolt you out your seat? Is it visually stylish, with sound work to match? And does Sutherland (and to a degree Paula Patton as his wife) overcome the trite parts of the script and give effective and committed performances? The answer to those questions is yes.\r\n\r\nDoes the ending cop out in any way? Insult the audience? No! It doesn't do that either.\r\n\r\nIt has flaws, but they are not insurmountable for the horror fan who's just looking for some good scares, atmospheric dread and some stylish touches from the director (Alexandre Aja). If you haven't seen it then give it a try, judge for yourself, you might be pleasantly surprised at what you find. 7.5\/10","id":"560ef359c3a368681f00c317","url":"https:\/\/www.themoviedb.org\/review\/560ef359c3a368681f00c317","movie_id":13515}
{"author":"The Movie Diorama","content":"Milk shakes its nutrient-rich substance to produce a delectably important biopic. No fat free milk. No semi-skimmed froth encrusting the top layer. Lactose is included. Just whole Harvey Milk dairy, freshly pasteurised by superlative direction and sharp writing. Much like fine wine, Milk tastes exquisitely with age, consistently complementing current democratic strands of chaos. Highlighting the significance of a single vote in a referendum without glorifying the omnipotence of activism.\r\n\r\nHarvey Milk, for all intents and purposes, was the first openly gay individual to be elected for public office in the shining state of California. Combatting initiatives such as Proposition 6, the banning of homosexuals to acquire careers in public schools. As a homosexual myself, who had been unfortunately suppressed into the “closet” due to fear of zero familial acceptance, Harvey Milk can only be described as an LGBT hero. The focus on political lobbying and general activism never dissipates, with Van Sant constantly presenting Penn as a voluptuous sculpture for gay rights. And, whilst it would’ve been supremely simple to resort to a melodramatic approach by documenting the several deaths and polygamous relationships in Milk’s life, Van Sant opted for a subversive aesthetic.\r\n\r\nBy combining archival footage of police raids and controlled protests with the core dramatisation, Van Sant effortlessly blended a documentarian style with a standard biographical narrative. In doing so he enabled Milk to remain human throughout, retaining an ever-important reminder of the work that he had lovingly committed to, not just for his own acceptance into the community, but for every LGBT representative.\r\n\r\nIngeniously, Black addressed Milk and Moscone’s assassinations from the offset, establishing a flashback narrative structure to illustrate Milk’s political career. From opening a store entitled Castro Camera to campaigning against Christian fundamentalists. Black’s audacious dialogue inserted a substantial amount of characterisation, often resorting to humour and sassy quips, whilst tackling the heavier subjects at hand. Further humanising Milk and his supporters. The representation of opposing conservatives were also well-developed, with Milk’s fellow supervisor White gaining the most traction in comparison to Briggs and Feinstein. Offering a clash of perspectives in the democratic environment, eventually building up to a subdued yet profound climax that unleashed an endless candlelight vigil lighting up the streets of San Francisco.\r\n\r\nVan Sant’s astute direction, specifically the inclusion of multiple one take sequences of delicious dialogue, would not have been as effective if it wasn’t for one element. An aspect to which the entire biopic relied on. Sean Penn as Harvey Milk. Without a doubt, one of the greatest performances to ever grace our screens. Rarely do I take issue with heterosexual actors portraying homosexuality, and his unanimously acclaimed performance is a valid reason why. Very shortly after his presence was noticed, subverting his typical “hard as nails” gritty roles, I no longer saw Penn. Through sheer mannerism changes, he transformed. The whispering voice, the exaggerated hand motions and the gentle personality. Deserving of any and all awards that he received.\r\n\r\nHirsch was just as transformative portraying fellow supporter Jones, fully embodying gay culture into a singular character. Brolin and Luna also offering noteworthy performances. Franco on the other hand failed to replicate the same quality. His monotonous delivery felt reminiscent to ‘Pineapple Express’ or any other stoned comedy. Elfman’s score, whilst enabling a lighter tone throughout, occasionally overwhelmed the more emotional sequences. Some jarring jump cuts edited by Graham also further relinquished the effectiveness of Milk’s central character and the pace.\r\n\r\nHowever, as a dramatisation of a leading figure in LGBT history, Van Sant delivered the goods. Yet, as a reminder for both heterosexuals and homosexuals alike for how archaic life was, Milk is absurdly powerful. As a “fellow degenerate”, I stand alongside everything that Harvey Milk represented, enabling the LGBT community to come “out of the closet”.","id":"5e206c0df04d010017102850","url":"https:\/\/www.themoviedb.org\/review\/5e206c0df04d010017102850","movie_id":10139}
{"author":"Andres Gomez","content":"Romantic story about the weirdest characters from the weirdest families.\r\n\r\nDeschanel and Dano do a good job but it is just not that funny nor works that well.\r\n\r\nIt is just too artifficially weird.","id":"545a3120c3a368399d004279","url":"https:\/\/www.themoviedb.org\/review\/545a3120c3a368399d004279","movie_id":14940}
{"author":"John Chard","content":"We can't have our law officers beatin' people half to death for no reason.\r\n\r\nAppaloosa is based on the 2005 novel of the same name written by Robert B. Parker. It's directed by Ed Harris, who also co-writes the story with Robert Knott. Harris also stars alongside Viggo Mortensen, Renée Zellweger, Jeremy Irons & Lance Henriksen. Music is by Jeff Beal and Dean Semler provides cinematography on location in Albuquerque, Austin and Santa Fe.\r\n\r\nAppaloosa is in the grip of bully boy rancher Randall Bragg (Irons), who finally oversteps the mark when the latest Marshall and his deputies are killed in cold blood. The townsfolk decide enough is enough and hire no nonsense travelling lawmen Virgil Cole (Harris) and his sidekick Everett Hitch (Mortensen) to protect and serve the town. Ruling with a rod of iron, Cole & Hitch start to bring order to Appaloosa, but the arrival in town of pretty Allie French (Zellweger) causes quite a stir between the two men. Bad timing too since the guys are trying to get Bragg to his rightful execution.\r\n\r\nIn the modern era the Western has been the hardest genre for film makers to tackle. You can probably count on one hand the number of great or agreeable ones that have surfaced post Costner and Eastwood's efforts of 1990 and 1992 respectively. Enter Ed Harris, who undaunted by the long odds of getting a Western to be successful; and suffering worrying overtures from his backers at New Line Cinema, got Appaloosa made. Well made as it happens.\r\n\r\nSince the story itself is etched like the Wyatt Earp legend, there's really no fresh perspective on offer here. In fact, anyone familiar with Edward Dmytryk's excellent Warlock from 1959 will feel some narrative déjà vu. But Appaloosa does have strong performances and lush landscapes to see it successfully home. Slotting in a good helping of action, romance and humour also goes some way to making Harris' movie a worthy modern day Oater. True, the cliche's are many, but Harris wasn't after revisionism, he wanted (and got) old fashioned Oater values. A film that follows those old beloved B movie Western conventions, but one that still retains a topical criminal thread.\r\n\r\nThe best reward in the film comes from spending time with Harris & Mortensen. Their characters are nicely drawn and not over cooked by the script. Cole & Hitch are devoted to each other, lots of straight love and respect exists between the two men. Their bond is believably brought to life by Harris & Mortensen, who formed a friendship when making A History Of Violence for David Cronenberg in 2005. Zellweger and Irons too are not without high merit value. She (stepping in when Diane Lane walked over delays), is pleasing and captivates in what is the critical glue role. While he is dandy dastardly supreme, a well spoken villain of much intelligence and crafty as a cat.\r\n\r\nAppaloosa is a subtle film, both in story and as a technical production. Beal's score is unobtrusive, while Semler's photography manages to deliver that old fashioned feel that Harris was after (the low lighting for the interiors is particularly on the money) . Harris' direction is smooth and unhurried in pace, with the odd inspired bit thrown in for good measure (check out the up-tilt camera work during a train on a bridge sequence). While the production design can't be faulted. All that and you got the likes of Henriksen and Timothy Spall in the support cast too. A lovely film that is as tight as the friendship at its core. 7.5\/10","id":"589cf475c3a368115100353e","url":"https:\/\/www.themoviedb.org\/review\/589cf475c3a368115100353e","movie_id":12690}
{"author":"portnoyz","content":"Decent flick with many clever bits.","id":"5d4e29de0d5d8500123e0288","url":"https:\/\/www.themoviedb.org\/review\/5d4e29de0d5d8500123e0288","movie_id":13094}
{"author":"Milo_Jeeder","content":"\"Dorothy Mills\" is one of those films that may not fit into the horror category, but it still contains enough elements to get the attention of horror lovers who want more than gore and a nice variety of scares. I admit that I also like those kinds of horror films, but I can also acknowledge and praise something a little bit more complex, less violent and more 'psychological', which is the case of this film. 'Dorothy Mills' certainly went beyond my expectations and I honestly don't understand why some people are complaining about the movie being 'too slow'. For the contrary, this film successfully manages to capture the attention during the first minutes, which is a crucial thing to do when you're telling a story. If you shock the audience enough during the first minutes and develop a well narrative line that gets more and more complex throughout the end, you're all set, and personally, I think Agnès Merlet and Juliette Sales achieved this perfectly.\r\n\r\nI don't know anything about Jenn Murray, the young actress who portrayed Dorothy Mills. I am not acquainted with her earlier work, but I don't need any information to state that she is definitely one of the most gifted actresses I have seen in a long time. The first time we see Jenn on screen, her character is doing something extremely violent, which provokes repulsion and hate towards her. However, only a few minutes later, Dorothy suddenly appears as a poor innocent child, which causes more sympathy than fear or rejection. Jenn Murray is obviously gifted enough to elaborate a complex character, who never ceases to amaze the audience with a variety of types of behavior through the entire film. Dorothy is a flawless character, not only thanks to Jenn Murray, obviously, but also because the writers did a marvelous job creating her. Judding this film by the cover, one would be inclined to assume that 'Dorothy Mills' is another movie about a bad little girl who kills people and gets away with it because nobody ever suspects of young innocent little girls. Well... this is really not the case. The cover is misleading and it makes it makes it look campy, when in reality, Dorothy is a much more complex character with a lot of things to express. Again, I have a special love for campy films as well, but I'm just stating a difference, in this case.\r\n\r\nI highly recommend this fine psychological thriller, with one of the most complex 'villains' I have seen in a while. If you're in the mood for a good thriller with some well done twists, give this movie a chance.","id":"58a24d739251415383000499","url":"https:\/\/www.themoviedb.org\/review\/58a24d739251415383000499","movie_id":15741}
{"author":"talisencrw","content":"Knee-deep in the throes of my first love, I was quite surprised to hear that my lady's favourite movie was 'Joe Versus the Volcano'. (I still haven't seen the film). It dawned on me, when I wanted to check out an American film which, to my knowledge, had a plethora of fine acting, that this was written and directed by the same guy who made that film much earlier. Being raised Christian and hearing in the press over the past few years about misdeeds, especially involving leaders of the Catholic church (represented in films as diverse as 'The Boys of St. Vincent' (John N. Smith, 1992) and 'In Bruges' (Martin McDonagh, 2008), I was especially intrigued by this, his work of more recent vintage.\r\n\r\nThe ambiguity at the core of the film (and hence the 'doubt') really acts in the movie's favour. The script and direction are both tense and flawless, and the beautiful New York locations chosen to illustrate The Bronx in 1964 help air the play out, and give it more cinematic scope. It features some of the finest work I have seen from Philip Seymour Hoffman (though my favourites will always be 'Happiness' and 'The Master'), Meryl Streep (my most-esteemed works of hers are 'The Deer Hunter' and 'The Devil Wears Prada') and Amy Adams (this is her finest performance IMHO) as well as a breakthrough role for Viola Davis, who steals every scene she's in. This easily holds up well even with Shanley's Oscar-winning screenplay for 'Moonstruck', and, though dark and depressing, is thoroughly recommended for those who can stomach its subject matter, and peer into that abyss without flinching, as these fine exemplars of 21st-century American cinema so easily do here.\r\n\r\nThat it didn't win any of its five Oscar nominations is almost as ghastly, to the cinephile, as the misdeeds insinuated here are to the community at large. Must have been a strong year for film, methinks.","id":"57e47427c3a36875a100a395","url":"https:\/\/www.themoviedb.org\/review\/57e47427c3a36875a100a395","movie_id":14359}
{"author":"John Chard","content":"Sexy is unique.\r\n\r\nDread is a deliciously spiteful British horror adapted from a Clive Barker short story. Plot has three college students meeting up and working together on a documentary about the nature of people’s fears. As things progress it becomes apparent that one of them has an ulterior motive.\r\n\r\nDirector and screenplay writer Anthony DiBlasi spends a considerable portion of the film establishing the psychological make-ups of the principal players, which is a key component to making the film work. Theo Green’s music trundles away menacingly during this portion of pic, while Sam McCurdy’s photography is on the money, with unnerving shades of green, reds and blues stripped back for a perfect troubled world feel.\r\n\r\nOnce the worm turns, and motives and mental anguishes show themselves, Dread reveals a cruel hand of such psychological force that the impact is troubling. Yet this is no torture porn picture, the gore is minimum and this for sure is not a slasher type of film either. It’s a slice of mental cruelty mixed with a damaged seed, two bad aspects of human nature crashing together to assault those interested in the psychologically based splinter of horror.\r\n\r\nOh and the ending is a cracker-jack, guaranteed to jolt you, for better or worse! 7.5\/10","id":"5455655fc3a3682be900295a","url":"https:\/\/www.themoviedb.org\/review\/5455655fc3a3682be900295a","movie_id":26587}
{"author":"ZeBlah","content":"Very nice french production. In my opinion under some aspects better than the usual\/standard Walt Disney films. Technically very good.","id":"5d17ee87126ec300180e94f2","url":"https:\/\/www.themoviedb.org\/review\/5d17ee87126ec300180e94f2","movie_id":10800}
{"author":"Dan_Tebasco","content":"A bit of a mess but offers some _amusement_.\r\n\r\nStarts out more like a anthology horror type of movie with 3 seperate shortfilms (of sorts even though they are all very much in the same universe and get tied together after a while).\r\n\r\nThe first two 'shortfilms' were good, maybe even really good. With some genuinly creepy and well-crafted horror moments and really good cinematography. \r\n\r\nThe third 'shortfilm' however, was not very good. In fact I would probably say it was mostly crap. In that one Jessica Lucas takes the lead and she (as usual perhaps) doesn't really try to do much acting and instead focuses on looking pretty.\r\n\r\nThe second half where they all get tied in together, is really despite having it's moments with the solid cinematography continuing and some decent enough atmosphere is in the end very much a very messy ordeal with one plothole after the other and in the end doesn't make a whole lot of sense, if any.","id":"58ded7dc9251415e6a000946","url":"https:\/\/www.themoviedb.org\/review\/58ded7dc9251415e6a000946","movie_id":13803}
{"author":"Zoro DPiece","content":"***SPOILERS AHEAD***\r\n\r\n_Mamma Mia!_ is an American-British romantic comedy musical directed by Phyllida Lloyd. The movie is loosely based on the original London musical also directed by Lloyd, and was the brain child of Judy Craymer who was convinced ABBA songs could be used in a theatrical production, especially after hearing the love ballad _The Winner Takes It All_. Craymer along with British playwright Catherine Johnson also worked on this film. Johnson being the original musical's scriptwriter wrote the movie's script, Craymer was an executive producer alongside Gary Goetzman as well as Tom Hanks and Rita Wilson.\r\n\r\nThe film stars Meryl Streep, Pierce Brosnan, Colin Firth, Stellan Skarsgård, Julie Walters, Dominic Cooper, Amanda Seyfried, and Christine Baranski.\r\n\r\nSet on the idyllic Greek island of Kalokairi it tells the story of Donna Sheridan (Streep) an independent manageress and owner of her own hotel. Donna has a 20 year-old daughter by the name of Sophie (Seyfried) who is getting married to Sky (Cooper). Upon finding Donna's old diary Sophie discovers that there were three men: Sam Carmichael (Brosnan), Harry Bright (Firth) and Bill Anderson (Skarsgård) and learns that one of them could be her father. She decides to invite all three of them to her wedding. \r\n\r\nSophie later reveals this to her friends Ali (Rachel MacDowall) and Lisa (Ashley Lilley) who have agreed to be her bridesmaids. Donna has invited her old friends\/bandmates Rosie (Walters) and Tanya (Baranski) to the wedding to help her out. She is however completely unaware of what Sophie has done and is taken by surprise when Sam, Harry and Bill arrive on the island. This causes Donna to have a mid-life crisis, and it is up to Rosie and Tanya to lift her spirits. While at the same time Sophie bonds with the three men, and discovers she has a trait from each of them. Things get complicated when all three men agree to give Sophie away, and realizing the mess she created she faints at her own bachelorette party.\r\n\r\nThe next day Sophie runs into Donna who is convinced that she wants the wedding called off. This causes Sophie to yell at Donna, and openly states she wants to avoid all the mistakes Donna has made in her life. At the same time Donna is pursued by Sam, the two realize they still love each other but are too busy for each other. Meanwhile, Tanya is courted by Sky's friend and best man Pepper (Philip Michael) despite the fact that he is old enough to be her son. Sophie then runs to Sky and admits what she did, angry and hurt Sky runs off. At the same time Sam tells Sophie that marriage is not always a happy thing.\r\n\r\nSophie then runs back to her mother and asks her to help her dress for the wedding, Donna is delighted and they mend their relationship. Sophie then learns that Donna was disowned by her mother when she got pregnant, she then proceeds to ask Donna to give her away. Donna happily agrees and as the two prepare to go to the chapel she finds herself accosted by Sam. Sam demands to know why Donna will not explain why she won't talk about their relationship. Donna then says she still loves him despite her better judgement and the fact that he broke her heart by being engaged.\r\n\r\nDonna then proceeds to run into the chapel where the wedding finally begins. As the ceremony begins Donna realizes that she can't hide the fact that the men are there. She then introduces Sophie's dad, but then learns that Sophie invited all three of them. They then all decide to be a third of her father, Sophie surprised decides to call off the wedding. Prompting Sky to run away with her and sail the world. Sam meanwhile decides that the wedding should not go to waste, despite Donna's protest at bigamy. After revealing his divorce Sam pops the question, hesitant Donna accepts it. At the wedding reception Rosie falls in love with Bill, who at first rejects her advances but then ends up loving her too.\r\n\r\nThe movie closes with Donna and Sam alongside Bill and Harry bidding Sophie and Sky farewell as they sail away from Kalokairi. Donna, Tanya and Rosie then reprise _Dancing Queen_ during the end credits, and then the rest of the cast appears and they all sing the song _Waterloo_. The movie then finally ends with Sophie singing _Thank You For the Music_ during the end credits.\r\n\r\nTold using several popular ABBA songs including_ Honey, Honey, Honey_, _Dancing Queen_ and the iconic titular song _Mamma Mia_ this movie soundtrack is responsible for making ABBA's music hit the charts again. Albeit some bad singing (cough)Pierce Brosnan(cough) the soundtrack is wonderful. The movie has some references to other films including _Dirty Dancing_ and _Grease._ Meryl Streep's performance of Donna Sheridan is an amazing example of her versatility especially when she sings the love ballad \"The Winner Takes It All.\" \"S.O.S\" is an interesting scene Brosnan's voice is flat but judging by his body language he is enjoying himself.\r\n\r\nIf you ignore the bad singing, you will be able to enjoy this film. I highly recommend it and the soundtrack. However, due to royalties and disagreements with UNICEF UMG and Decca Records could not secure the rights to the song _Chiquitita_ which explains why it is not on the CD.\r\n\r\nIf you have not seen this movie, then what are you waiting for?! Stream it or buy it and do it before July 20 because that is when it's highly anticipated sequel hits theaters!\r\n\r\n> It's very Greek! - Rosie","id":"5b3c31400e0a2623fb004e20","url":"https:\/\/www.themoviedb.org\/review\/5b3c31400e0a2623fb004e20","movie_id":11631}
{"author":"Joe","content":"Really enjoyable film, with a lot of funny one-liners, and despite the fact that a lot of them are rubbish singers, that partly adds to the humour, and obviously, Amanda, Meryl, Colin and others do have good voices :)","id":"5921f2f09251414a5705af2c","url":"https:\/\/www.themoviedb.org\/review\/5921f2f09251414a5705af2c","movie_id":11631}
{"author":"CipE","content":"Rated this 5\/10 due to large amounts of repeated and gratuitous violence.\r\n\r\nIs it worth torturing people to find out if there is life after death?\r\nThis movie's answer seems to be \"Keep doubting\".","id":"5309d697c3a3684208003cd2","url":"https:\/\/www.themoviedb.org\/review\/5309d697c3a3684208003cd2","movie_id":9539}
{"author":"John Chard","content":"Martyrs: Greek for Witness.\r\n\r\nMartyrs is written and directed by Pascal Laugier. It stars Morjana Alaoui and Mylene Jampanoi.\r\n\r\nThe New French Extremity Movement had its bar raised considerably by Pascal Laugier’s brutal but thought provoking horror. It’s a film as uncompromising as it is confrontational, a picture guaranteed to get a response for better or worse. Once viewed it simply will not be forgotten, the images, the twisty narrative thematics and the bloodshed that flows consistently throughout the story, Laugier and his two brilliant lead actresses assault the senses, magnificently so.\r\n\r\nStory is unfurled as a three tiered structure, each one devastating, but it’s with the final third where the picture goes up through the stratosphere, stopping briefly at the café weird just to further tickle our craniums. Some of the violence here is tough to watch, and it’s no surprise to find it was met with the inevitable charges of misogyny. Yet the culmination of it all puts some perspective on the violence witnessed, leading to a strangely profound and moving climax.\r\n\r\nThe less you know about it going in for the first time the better. A strong stomach is required, as is an open mind, if you have these things then awaiting you is a visceral masterwork, one of the finest horror film’s to have ever come out of France. Yes, it’s that astonishing. 10\/10","id":"5326f7ce92514115440034f7","url":"https:\/\/www.themoviedb.org\/review\/5326f7ce92514115440034f7","movie_id":9539}
{"author":"LastCaress1972","content":"To Mamma Mia! then, a movie easily slipping in past Coyote Ugly as the second-worst film I've ever seen (behind The Rocky Horror Picture Show). My eyes. I can't unsee it.\r\n\r\nFrom what I could gather (and that's not because the plot is difficult - Christ, no - or because I wasn't really paying attention, it's because the film seemed to be not sinking in, not digesting in my brain. I think my brain was trying to reject it, like a foreign object) - an airy-fairy middle-aged bohemian tart (Meryl Streep, The Iron Lady) prances and dances around her primary-coloured villa on an unspecified Greek (I think) island. Her equally airy-fairy \"Barbie Princess\" daughter (Amanda Seyfried, Les Misérables) prances and dances around with her. That seems to be what they do. I mean, for a living, like. They're not on holiday. This is the summation of their lives. Idyllic and unrealistic prancery and dancery, around a villa apparently coloured in by over-enthusiastic first-graders. They have two friends each who escort them everywhere - even to the sh!tter perhaps, I dunno - who exist exclusively to orbit like satellites around this main pair. In fact, everybody in this movie exist purely to serve the life stories of Streep and Seyfried. It's that sort of film, where everybody on-screen is wondering, \"Oh! Will Streep eat a tangerine next? Or a satsuma? Will Seyfried brush her hair with a soft brush, or a slightly-softer-than-that brush? Oh, the agony!\" Anyway, the daughter's getting wed - the next day, I think - to some impossibly perfect young lad (to suit her impossibly perfect everything else), but, oh noes! She never knew who her dad was, because her mum was a dirty old stropper back in the eighties, and they've both been too busy prancing and dancing for two straight decades to even have brought it up, ever! So, who will give her away tomorrow? Oh noes!\r\n\r\nWell she prances and dances her way to her mum's secret diary (with her two conjoined mates, obvs) and, equally \"obvs\", it's all in there. Ta-daa! Except, there are three possible \"daddies\" and of course, they are Colin Firth (The King's Speech), Pierce Brosnan (Goldeneye) and Stellan Skarsgård (Pirates of the Caribbean: Dead Man's Chest). So she invites all three to the wedding under the pretense of being her own mum and of course all three drop whatever they've been doing for twenty years and turbo their way, immediately, to this island, all arriving together, on the same boat, which also belongs to one of them. Hurrah. From there, much \"hilarity\" ensues as the airy-fairy daughter tries to suss which one's her dad while her airy-fairy tart mother spends the rest of the film - with HER conjoined mates, obvs - wondering whether to let Brosnan \"tap dat ass\" one more time.\r\n\r\n**********\r\n\r\nSPOILER ALERT (LIKE ANYONE GIVES A DRY, UNYIELDING BUMPLOP): They don't find out who the daddy is: the three pinhead blokes all agree that they now already love this silly airy-fairy daughter so much that they agree to be one-thirds daddy each. Then, out of the clear ****ing sky, the airy-fairy daughter tells her groom at the altar that the wedding's off, and they should just prance and dance around the world instead. Fantastic! And not to waste a wedding full of perfect ****ing strangers anyway, but Brosnan decides to marry Streep while they're there. Well of course. And Skarsgård hooks up with Julie \"Isn't she dead yet?\" Walters - one of Streep's conjoined mates - and Firth, who as it happens was a left-footer all along who was just experimenting with Streep back in the day, cops off with a waiter in traditional Greek island fashion. Hurrah for everything! Let's have another ABBA song, eh?\r\n\r\n**********\r\n\r\nOh, the ABBA songs. I mean, there are musicals. Then, there are musical musicals. And then, way past any of that, there is Mamma Mia!. A quick Wiki-up shows me that, excluding reprises and a deleted scene, there are twenty songs performed in Mamma Mia!. So, say, four minutes per song, that's eighty minutes. Wiki (again) tells me that the film is 109 minutes in length, so let's knock off ten minutes-worth of credits, and you're looking at eighty minutes of singing in a 99 minute film. That sounds about right. A 19-minute story - a p!ss-poor one, at that - stretched over an hour-and-a-half by the soothing tunes of Agnetha, Benny, Bjorn and Anni-Frid. Looking at those numbers I'm now somewhat impressed that whilst watching this pile of pooey bum-leavings I didn't stand up, lose the plot, smash my house to rubble and wander off to live in the woods as a sasquatch. It was ceaseless. An ABBA song, three lines of dialogue (if you were lucky, which wasn't often), another ABBA song. Over and over. And... well, the songs were all sung in-camera by the actors. And whilst I wouldn't call any of them good singers, they could all at least hold a note (only just in Streep's case, but she managed to stumble over that line).\r\n\r\nAll except Pierce Brosnan.\r\n\r\nOh, Pierce. Pierce! Why didn't someone tell him? Did no one care enough? Is he THAT unlikeable? Why couldn't he hear it himself? I don't want to come across as either xenophobic or stereotypical when I suggest that he sounded like a drunken Irishman preparing to fight, but that IS what he sounded like. And who knows, maybe that's what was really happening with him at that time. He IS an Irishman, perhaps he needed to get good and liquored up before the singing - I know I would - and perhaps he was wondering whether or not to attack the first person on the set who dared laugh. Sounds perfectly plausible.\r\n\r\nAnyway, the whole thing's a travesty, top-to-toe. Most closely resembled one of those straight-to-video Barbie movies, beloved of six-year-old girls and nobody else on the entire planet. If you ever have an opportunity to see it, DO NOT take that opportunity. SPURN that opportunity. Spurn as though your very life depended on it. That's all the advice I can give. Don't do what I did, and watch Mamma Mia!. Only madness lies that way.","id":"5207afdf760ee3630e234173","url":"https:\/\/www.themoviedb.org\/review\/5207afdf760ee3630e234173","movie_id":11631}
{"author":"mastergsg","content":"This is a unique specimen of a film, as it engages directly in the art of remaking classic films that we've grown up on, with a twist. Even more so fitting given the films setting of a mom and pop owned video store. Mos Defs character Mike is excellent as the straight man to Jerry (played by Jack Black) and his more then outrageous stunts and escapades. You can also feel sympathy for the character of Mr. Fletcher (played by Danny Glover) whose trying everything to keep his video rental store and apartment from being demolished. I won't spoil any further plot details or the ending, but the way things are wrapped up are bittersweet, and by the time the credits roll, everything is left in ambiguity. Overall I didn't go into major parts of this film because it just has to be experienced for oneself for full enjoyment. Be Kind Rewind is a funny, touching, and nostalgic trip down the roads of analog film renting, and fan film creation, all in one. Four and a half stars, out of Five.","id":"5c3802980e0a267d55219695","url":"https:\/\/www.themoviedb.org\/review\/5c3802980e0a267d55219695","movie_id":4953}
{"author":"Gimly","content":"As keen as I am for the new Neil Marshall directed _Hellboy_ reboot, I do still wish we had gotten to see a _Golden Army_ sequel to wrap up Ron Perlman's trilogy. Here director Guillermo del Toro lets loose all bars on his fantasy elements, stacking the movie with elves, trolls, even tooth fairies, making for a less grim, but still very good _Hellboy_ sequel. Not to mention it features personal favourite Luke Goss in what is probably his best role to date.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5bb6e454c3a368150c0212d6","url":"https:\/\/www.themoviedb.org\/review\/5bb6e454c3a368150c0212d6","movie_id":11253}
{"author":"talisencrw","content":"Easily the worst film I have ever seen that wasn't helmed by a female director. I am usually very picky when it comes to selecting movies to watch, hence my usually high satisfaction as a cinephile. I can't believe I wasted my time on this vile piece of garbage and that this ever saw a cinematic release when there MUST be thousands...NO, millions, of better things that could have been made instead. The Lumiere brothers must be rolling in their graves at how cinema has been travestied.\r\n\r\nMy only regret other than my time wasted and the scar on my brain from having watched it is the fact that unlike Metacritic, on Letterboxd I can't give it a zero rating. Or a negative, for that matter! =)","id":"57b208dd9251411aa6000c81","url":"https:\/\/www.themoviedb.org\/review\/57b208dd9251411aa6000c81","movie_id":13805}
{"author":"talisencrw","content":"Easily the worst film I have ever seen that wasn't helmed by a female director. I am usually very picky when it comes to selecting movies to watch, hence my usually high satisfaction as a cinephile. I can't believe I wasted my time on this vile piece of garbage and that this ever saw a cinematic release when there MUST be thousands...NO, millions, of better things that could have been made instead. The Lumiere brothers must be rolling in their graves at how cinema has been travestied.\r\n\r\nMy only regret other than my time wasted and the scar on my brain from having watched it is the fact that unlike Metacritic, on themoviedb.org I can't give it a zero rating. Or a negative, for that matter! =)","id":"57b20927c3a368019a00342a","url":"https:\/\/www.themoviedb.org\/review\/57b20927c3a368019a00342a","movie_id":13805}