{"author":"Wuchak","content":"***The birth of skateboard culture***\r\n\r\nIn the mid-70s, the accomplishments of the innovative Zephyr skateboarding team of Venice, California, are dramatized based on events chronicled in skater Stacy Peralta’s documentary “Dogtown and Z-Boys” (2001). John Robinson plays Stacy, Emile Hirsch plays Jay and Victor Rasuk plays Tony (aka T.A.). Heath Ledger is on hand as Skip Zephyr while Rebecca De Mornay appears as one of the teens’ struggling mother.\r\n\r\nWhile I suppose “Lords of Dogtown” (2005) is a sports flick, it’s just as much a coming-of-age movie detailing growing-up on the bad side of Venice, aka Dogtown, the birthplace of America’s skateboard culture, which influenced the world.\r\n\r\nIt reminded me of the dissolute environment depicted in “River’s Edge” (1986) with elements of Jim Morrison’s hedonistic misadventures from “The Doors” (1991), but combined with skateboard action, like skating in dry backyard pools and various competitions. It’s a good movie with slightly amped-up events (so what else is new?), but somewhat hampered by a curiously dismal air with occasional dialogues that don’t work. Maybe I found it slightly depressing because it reminded me of the glory & shame of my teen years. The 70’s soundtrack is great, however.\r\n\r\nThe film runs 1 hour, 47 minutes and was shot in the Los Angeles area, including Venice Beach, Imperial Beach and Santa Monica. \r\n\r\nGRADE: B-","id":"5cd8b5a60e0a265350ccecbb","url":"https:\/\/www.themoviedb.org\/review\/5cd8b5a60e0a265350ccecbb","movie_id":9787}
{"author":"JPV852","content":"This sequel at times doesn't make sense, but still had its share of creepy moments, not as much as the first film, yet maintained some genuinely emotional scenes though. Like the last one, some fine performances, as far as I can tell, and did like these characters. **3.75\/5**","id":"5e47079c2da846001104b7ed","url":"https:\/\/www.themoviedb.org\/review\/5e47079c2da846001104b7ed","movie_id":14021}
{"author":"John Chard","content":"Romero lines up the Bush administration for à la carte eats.\r\n\r\nLand Of The Dead is directed & written by George A. Romero and it's the fourth film in his Zombie based series of films. It stars Simon Baker, John Leguizamo, Dennis Hopper, Eugene Clark & Asia Argento.\r\n\r\nHuman society has regrouped and formed a new community in a sealed off section of America. Run by a feudal government headed by Paul Kaufman (Hopper), the state survives on supplies garnered from the outside world by Riley (Baker) and his \"Dead Reckoning\" team. But during one of their raids they notice that one of the Zombies, Big Daddy (Clark), is starting to show signs of human awareness.\r\n\r\nAfter the emergence of the Dawn Of The Dead remake in 2004 and the plaudits heaped upon zom-com Shaun Of The Dead also in 2004, one question immediately sprang to the minds of zombie fans, \"could Romero, the don of the dead, be stirred into a new entry in his already heralded series?\". Yes was the joyous answer to that, and although a torn ligament down from previous instalments, the great news is that Land Of The Dead rocks with gore and politico fervour. Naturally a lot has changed in the world of zombiedom since Romero's last venture in 85, but he manages to tonally keep the old fashioned feel while observing the unsteady social climate that was seeping from the wounds in 2005.\r\n\r\nBy his own admission he is taking pot shots at the Bush administration, while Hopper, on delightfully excessive form, deliberately channels Donald Rumsfeld. From fireworks in the sky bringing conformity, to class division down on the turf, Romero as always has something to say. The cast are a solid and energetic bunch, with Baker pleasingly coming up trumps as a hero type, while gore hounds are very well served here as George finds new and inventive ways of delivering the ick (one \"head\" sequence is genius). Sure there's a suggestion that the central idea of the zombies getting smarter is kind of going off tangent, but since he wrote the rules, he's also allowed to change them. But with this ending here it offers hope, not just in this skew whiff world he's created, but also of further film's to come. And that maybe is a touch too far? 7\/10","id":"5636ccf29251414ad801a7ab","url":"https:\/\/www.themoviedb.org\/review\/5636ccf29251414ad801a7ab","movie_id":11683}
{"author":"Andres Gomez","content":"An interesting movie about the personal experience of a Hungarian Jew during the Holocaust.\r\n\r\nStill, you cannot really empathize with the weird apathetic personality of the main character until the last reflections of the movie.","id":"5259326b760ee32950052748","url":"https:\/\/www.themoviedb.org\/review\/5259326b760ee32950052748","movie_id":41508}
{"author":"John Chard","content":"Hello rock, this is me in between you and the hard place.\r\n\r\nReed Richards (Ioan Gruffudd), Sue Storm (Jessica Alba), Johnny Storm (Chris Evans), Ben Grimm (Michael Chiklis) & Victor Von Doom (Julian McMahon). All set off on a space mission that sees them engulfed by a mysterious storm that imbues them all with different special powers.\r\n\r\nFantastic Four is arguably the most loved on the page of the super-group comic book creations. Certainly it's Marvel's flagship offering in that corner of the super hero market. Odd then, that when it finally makes it to the big screen they throw money at it but employ the director of \"The Firing Squad\" & \"Taxi\"? The whole film reeks of nervousness, with director Tim Story either fearful of making a hash of said flagship movie, or worse still, being directed himself by studio executives fearful of making a hash of said flagship movie. While the casting of Gruffud (dull), Alba (cleavage for hire) and McMahon (out of his depth as a villain) beggars belief. Sloppy CGI fails to ignite what little action there is, while the final smack down as our intrepid 4 battle with Von Doom, is of a TV movie standard. Yet it still has a smidgen of fun about it to warrant investing a damp dark afternoon with.\r\n\r\nChiklis and Evans are the plus points, the former injecting a bit of heart into proceedings and the latter some sexiness and some much needed humour. There's also some worth in the script's attempt at messaging about the perils and pitfalls of celebrity status. While who can deny that the first appearance of \"flame-on\" & \"clobbertime\" doesn't induce an ickle tingle down the spine of the discerning comic book fan (ok that may just be me hankering for my youth). If only the film wasn't so safe and had been in better hands. But hey! the film turned over a $230 million Worldwide profit, so what do I know eh? The sequel was inevitable, so one can only hope that with the same people involved they not only learn from their guardedness, but that they manage to stay faithful to the source and give it some much needed pizazz.\r\n\r\nFootnote: The extended cut at twenty minutes longer, suffice to say, is a better experience as it has more pizazz. So 5\/10 for the theatrical cut and 6\/10 for the extended version.","id":"5e5b8b13357c00001328fff5","url":"https:\/\/www.themoviedb.org\/review\/5e5b8b13357c00001328fff5","movie_id":9738}
{"author":"Reno","content":"**A guide on how to get through during unemployment.**\r\n\r\nI thought I have seen almost all the films of Jim Carrey, but then I found that's not true, so I decided to start with this. This is a remake of the 70s film or you could say the second screen adaptation of the novel of the same name. I haven't seen the other version, but I must admit that I enjoyed it thoroughly. This is not the greatest comedy I have ever seen, but still so good with great performances, particularly Jim Carrey's.\r\n\r\nA simple storyline, a couple loses their jobs and they find hard to get another. They begin to lose one by one, everything that belongs to them and finally the house is the last thing they want to lose. So they plan to do something very serious thing to tackle their situation and seems its working out so well, but for how long. Then comes their masterplan to the permanent solution and how they accomplish it is what leads to the conclusion.\r\n\r\nThe film was so fast, feels too short or like a TV episode. That means makes us to feel to have more, but it ends very nice way. The story might feel silly, but the comedies are so good. And if you like Jim Carrey and his trademark jokes, then you would have a great time. Truly, I haven't seen a good comedy from the recent time releases, so I'm happy I saw this, even though it is a decade old. There's no serious negative stuffs in it like drugs, sex or nudity, so I think it is okay for family viewing.\r\n\r\n_7\/10_","id":"580e48489251416e0a001b4c","url":"https:\/\/www.themoviedb.org\/review\/580e48489251416e0a001b4c","movie_id":7552}
{"author":"Nubyan","content":"That was a great movie.\r\n\r\nI read the subject matter in the preview and thought...this sounds interesting. I can't believe this came out in 2005. Twelve years isn't that long ago, however...it fits right in with 2017.\r\n\r\nIt was easy to fall for the main characters. I found myself being torn between wanting Rachel to remain with Heck and wanting her to be with Luce.\r\n\r\nIt's a story of love. Just when you think you've found true love, life throws you a curve ball and complicates everything.\r\n\r\nIn the end, everyone seems to end up where they should be.","id":"59c74eacc3a3681454050457","url":"https:\/\/www.themoviedb.org\/review\/59c74eacc3a3681454050457","movie_id":1544}
{"author":"LastCaress1972","content":"Wal-Mart: The High Cost of Low Price - a ninety-minute documentary demonising a massive company, and with no one from Wal-Mart prepared to go on record, there's no subjective balance. That said, they do look like horrible bastards, certainly in their native USA and in the Asian sweatshops where they manufacture their goods. The family themselves seem to have amassed 100 billion dollars between them, yet the employees can't afford the healthcare plan offered by the chain. A bunch of small towns are presented, showing how they've become virtual ghost towns as one business after another has folded. There are security cameras in their parking lots, but they're only used to monitor possible union activity or demonstrations. The rest of the time they're unmanned to save a wage and as a result Wal-Mart car-parks have become a haven for robberies, assaults, rapes, abductions and murders. Bangladeshi workers, making garments to be sold in store, work 14-hour days for 17 cents per hour and are literally beaten by the supervisors. An American inspector, a loyal employee of Wal-Mart in love with the company, was moved to tears by the conditions but upon reporting them to Wal-Mart, was promptly fired. Managers in stores stopped eating their lunches in the staff rooms because they would feel guilty sitting with employees who were so broke because of their terrible pay that they wouldn't have anything to eat on their hour breaks. Sweatshop workers in China were sent to live in the same dormitory, for which rent and utility bills were deducted from their pay. They were free to move out of the dormitory, but the rent would continue to be deducted anyway. The chinese workers are taught how to lie, and what lies to say to health inspectors who might visit the sweatshops. Gardening retail products containing pesticides and poisons are stored in car-parks, and when it rains those poisons run into the creek that provide a whole town with drinking water. There are examples all over the country of stores being fined for this practise. And so on, and so on. It's a damning piece of material on its own, but I think an attempt at hearing an alternate view might have made it even more powerful (in fairness, my understanding is not that Wal-Mart were not approached, but that they simply wouldn't co-operate). Anyway, 7\/10, worth a look.","id":"5207b222760ee3630b24d36c","url":"https:\/\/www.themoviedb.org\/review\/5207b222760ee3630b24d36c","movie_id":29595}
{"author":"JPV852","content":"First time seeing this in 15 years and lame plot, annoying characters (both kids got on my nerves) and a protagonist who just runs around, as Tom Cruise does so well, but has zero impact on the end game which was... bacteria. Yeah, this was just as dumb today as it was back then. At least the visual effects and sound design still holds up. **2.5\/5**","id":"5eb720c6e24e3a0022da4608","url":"https:\/\/www.themoviedb.org\/review\/5eb720c6e24e3a0022da4608","movie_id":74}
{"author":"Gimly","content":"_Waiting..._ is incredible for three reasons.\r\n\r\nFirstly, it was one of the films that helped rocket forward the careers of both Ryan Reynolds (_Buried, Deadpool_) and Justin Long (_Accepted, Dodgeball, Jeepers Creepers_).\r\n\r\nSecondly, it glorifies what is in my opinion the best American Comedy ever made, _Super Troopers_, as well as Kevin Smith (director of _Clerks I & II, Jay and Silent Bob Strike Back, Dogma, Chasing Amy, Mallrats_)\r\n\r\nFinally, it's an American Comedy movie, and I paid actual money for it. I then watched it. I've watched it before. I'll probably even watch it again. BOOM! This probably means nothing to anyone who's reading this (there's also probably nobody reading this) but regardless, it's quite a big deal.\r\n\r\nManaging to take something as mundane as one day in a repetitive dead-end catering job, and make it even vaguely humorous is rather an achievement. You should watch it and play the other-other \"The Game\" (sidenote: I lost the game) like we used to in High School. 'Cause I'm classy like that.\r\n\r\nSeriously though, and I can't believe my thoughts even as I'm typing this, but I honestly think Waiting... is an underrated American Comedy gem, maybe I'm just seeing that comparatively, or with the rose-tinted glasses of nostalgia, but I really do enjoy the film.\r\n\r\n76%\r\n\r\n-Gimly","id":"5b13dc180e0a263de600f4dc","url":"https:\/\/www.themoviedb.org\/review\/5b13dc180e0a263de600f4dc","movie_id":7553}
{"author":"narrator56","content":"I enjoyed this entry into the HG Wells film library. The special effects are great (to this amateur anyway) and the acting and action more than adequate. Plus it stays near enough to the sci-fi genius of the author to satisfy the fans of the classic novel. I will say that I got a little tired of the son acting like such a teenager, but he and the Tom Cruise character both show some character growth by the end of the film. Tom is one of those actors who seems to be playing himself a lot, but I suspect there is a lot more work to it than that. I'm not sure Dustin Hoffman would have gotten his Academy Award for Rain Man if he had played off a lesser actor than Cruise. \r\n\r\nI think there are a couple of scenes the movie could have done without, such as in the cellar with Cruise, his daughter and the man who lived there. It slowed the story down, changed the tenor of the drama, and didn't add a lot, in my view. But it is what it is and overall I found War of the Worlds to be entertaining. Good science fiction movies can be hard to find.","id":"5e89c511cf1afd00116cd015","url":"https:\/\/www.themoviedb.org\/review\/5e89c511cf1afd00116cd015","movie_id":74}
{"author":"Rob","content":"A great example of bad casting, Cash was over 6'","id":"55d3a610925141201600079c","url":"https:\/\/www.themoviedb.org\/review\/55d3a610925141201600079c","movie_id":69}
{"author":"OzDrDj","content":"Just when you thought it was safe to go hiking in the bushes again...along comes Mick Taylor. Kristy, Ben and Liz are three pals in their twenties who set out to hike through the scenic Wolf Creek National Park in the Australian Outback. The trouble begins when they get back only to find that their car won't start. The trio think they have a way out when they run into a local bushman named Mick Taylor. Wait until you get a load of what Mick has in store for them. Their troubles have just begun.","id":"4fd02b1a19c2956c2e001774","url":"https:\/\/www.themoviedb.org\/review\/4fd02b1a19c2956c2e001774","movie_id":9885}
{"author":"John Chard","content":"I could tell you - but then I'd have to kill you!\r\n\r\nThree young travellers are making their way across the Australian outback in search of Wolf Creek, a mystical site where a meteorite struck and created a crater. After achieving their mission they endure car trouble and fearing that they are stuck in the middle of nowhere, they are relieved when help comes in the form of big Mick. At first he's a likable sort of man, but then Mick starts to show signs of strangeness as the evening progresses, and then the travellers fall asleep...\r\n\r\nDirected and written by Greg McLean, this Australian film opens with the ominous warning that it is based on real events. Clearly intent on grabbing the viewer by the throat with its raw and real feel, it should be noted however that the film is actually an amalgamation of ideas drawn from real Oz killers like \"Bradley John Murdoch\" and \"John Bunting\". Casting aside the film's boast of real life credentials, the question hangs on if it's actually any good?. \r\n\r\nMcLean has crafted a genuinely unsettling picture, one that upon theatrical release didn't in truth live up to the hyperbole that was so boisterously marketed back in 2005. Now that the furore has long since passed and the tag-lines running about \"A new dawn in terror\" and that the \"Reality is here\" have since faded away from memory, what is actually left to sample?.\r\n\r\nMcLean's film builds up nicely by letting us get to know our three soon to be troubled protagonists. Then it's enter Mick Taylor from outback stage right, and here is a larger than life bogeyman and one of the modern eras better, and yes, scarier creations. Taylor, excellently portrayed by John Jarratt, debunks the myth of the chirpy Aussie bushman, becoming the polar opposite to \"Crocodile Dundee\" (given a mention in one particular uneasy exchange). Then the terror starts, grim violence and unnerving dialogue seamlessly blends together, all shot in a docu-style on Hi-Def DV. \r\n\r\nHowever, with this narrative trajectory, where the usual formula escape attempts begin to arise, comes the exasperation that so often blights the horror genre. One particular opportunity that lands at Liz Hunter's feet, an opportunity that any sane person in the world would have taken, beggars belief, but then I guess if common sense ruled there would be no post script at the end - which is a post script that blatantly wants us to believe that what we have just watched really happened...\r\n\r\nThe last quarter is a touch rushed, and that's a shame since we have spent so much time in the company of the three actually likable and believable youths. It rather feels like a quick horror fix than the intended protracted line in terror that Mclean and co were going for. Nevertheless, it does actually work, and crucially it does frighten and hold the utmost attention. \r\n\r\nThe performances are strong, dodgy British accents aside, with the girls (Cassandra Magrath & Kestie Morassi) in particular convincing as being truly terrified. While the piece is, surprisingly in context of the material, beautiful at times. Red sunsets and the crisp dusky desert come vividly out the screen thanks to Will Gibson's excellent photography. Wolf Creek will not and can't hold up on repeat viewings, but it is still an effective entry in the horror genre, and with Jarratt's Mick Taylor there is a character that's unlikely to be forgotten in a hurry. 7\/10","id":"5db0d23fd05a030016bf6033","url":"https:\/\/www.themoviedb.org\/review\/5db0d23fd05a030016bf6033","movie_id":9885}
{"author":"The Movie Diorama","content":"White Noise fizzles out its noisy static by just being plain boring. Watching Keaton as he unconvincingly stares at televised white noise for an hour and a half, which is essentially nothing, perfectly surmises the experience of Sax' supposedly supernatural horror. However, the biggest crime that the studio committed was releasing the feature on the first weekend of the year. Now, it's common knowledge that the initial start to the cinematic year typically begins with a disposable horror. Well, White Noise is to blame. Signalling untapped box office potential, despite the overt opinions of critics. And, as to be expected, matches the quality of a broken tape. A successful architect loses his wife to a drowning accident, to which he then encounters a psychic introducing him to the supernatural phenomenon of EVP.\r\n\r\nElectronic Voice Phenomena. Y'know, recording background noise in a room, playing back the tape and flabbergasted when the ghost of ‪Michael Jackson‬ hauntingly sings \"Thriller\". Except in White Noise the tool that's used is, well, white noise. The annoyingly hypnotising static from televisions when no channel is picked up from the current frequency. Keaton becomes entranced by the ominous voices and high definition faces he sees within the six televisions he owns in his modern apartment. Who is making contact? Is it his wife? Malevolent entities trapped in the cubic prison that is a television? Pretty sure writer Johnson didn't even know himself.\r\n\r\nThe film is a mess. It's muddled, confused and abhorrently remains stagnant throughout. This architect, a father, essentially abandons his son when fixated on saving souls warned by his deceased wife that conveniently match the images in the white noise as soon as he arrives to any given scenario, despite \"Willow Avenue\" being mentioned days before. So think of it as 'Final Destination' meets 'Pulse' (original, obviously...). Except it's neither as entertaining as the former nor as horrifying as the latter.\r\n\r\nKeaton looked bored as hell and overacted in times of emotional distress, although reassured the narrative with control. The jump scares were obnoxiously tame, yet admittedly one of the piercing noises made me twitch my body. The ending is...well, let's just not talk about it. It's terrible, with CGI ghost things swooping in on Batman, and answers no lingering questions that the mystery of EVP conjured up. Heck, the feature begins and concludes with onscreen text about \"existing\" occurrences. \"1 in 12 cases are dangerous\". Yeah. Ok. You know what is dangerous? Ruining Keaton's career. We had to wait a decade later for his rejuvenation!\r\n\r\nWhite Noise admittedly has a decent enough premise, yet Sax' lack of direction accompanied by shoddy writing and lacklustre performances resulted in one film that had the similarities to white noise. Nothingness.","id":"5e206bd9f04d0100150fd157","url":"https:\/\/www.themoviedb.org\/review\/5e206bd9f04d0100150fd157","movie_id":11804}
{"author":"EmkEyen","content":"Clever in its meta movie aspects, but lacking in consistency. While keeping a good pace and has enough charisma to keep you ignoring logical flaws along the way, the last part becomes a bit too much of a mess and degrades an otherwise good horror movie experience. It is a pity as the core story is not bad and the script holds some interesting twists that keeps even seasoned horror movie aficionados on their toes until the end.","id":"5a77bc689251417766008937","url":"https:\/\/www.themoviedb.org\/review\/5a77bc689251417766008937","movie_id":14217}
{"author":"trevortrash","content":"Super low budget fantasy dream from 2005 (released in 2010) made with a mix of puppets, old man masks, and a lot of computer graphics. Kind of slow for 48 minutes but there's always something wacky to look at. I LOVED IT, kinda bummed they never made a part 2 though.","id":"5d718e7977c01f45795ab10b","url":"https:\/\/www.themoviedb.org\/review\/5d718e7977c01f45795ab10b","movie_id":628724}
{"author":"Wuchak","content":"Witch Zombie\r\n\r\nRELEASED IN 2005-2006 and directed by Jeremy Haft, \"Tamara” is a Canadian production about an unpopular girl (Jenna Dewan Tatum) at a Winnipeg high school who is harassed by her peers and inadvertently buys the farm in a malevolent prank. Through the dark power of witchcraft, however, she returns as a wannabe seductress to enact revenge. Matthew Marsden and Claudette Mink play a married teacher and administrator at the school. \r\n \r\n“Tarmara” contains elements of “Carrie” (1976), “The Rage: Carrie 2” (1998), “The House on Sorority Row” (1983) (which was remade as “Sorority Row” in 2009), “The Craft” (1996) and “The Faculty” (1998). Yet it mixes its own brew and, surprisingly, has a few original aspects, along with respectable gore, if that’s your thang. The movie influenced future flicks like “I’ll Always Know what you did Last Summer” (2006) and, especially, “Jennifer’s Body” (2009). If you like these kinds of films, you’ll like this one.\r\n\r\nThere are some awkward or un-compelling moments in the filmmaking. With just a few key tweaks this could’ve been great in the manner of “The Rage: Carrie 2.” Still, it’s good enough and, like I said, has some innovative parts. Marsden and Mink are strong as the adult protagonists. The women are cute (e.g. Katie Stuart as winsome Chloe) but, with the exception of Mink, they look like they’re suffering mild anorexia. Please, ladies, eat some food!                   \r\n\r\nTHE MOVIE RUNS 1 hour, 38 minutes and was shot in Winnipeg, Manitoba. WRITER: Jeffrey Reddick. \r\n \r\nGRADE: B\/B-","id":"5aeb5fb692514167c800753f","url":"https:\/\/www.themoviedb.org\/review\/5aeb5fb692514167c800753f","movie_id":10263}
{"author":"John Chard","content":"The most infamous serial killer of our time... is still out there.\r\n\r\nThe Zodiac is directed by Alexander Bulkley who also co-writes the screenplay with his brother Kelley Bulkley. It stars Justin Chambers, Robin Tunney, Rory Culkin, Philip Baker Hall, Brad Henke, Marty Lindsey, Rex Linn and William Mapother. Music is by Michael Suby and cinematography by Denis Maloney. Story is based on the true events involving a serial killer known as The Zodiac who terrorised the San Francisco Bay Area in the late 1960s. He was never captured.\r\n\r\nThere's a lot of scorn poured on Bulkley's movie, which on the surface is understandable given that it's neither an in-depth examination of the actual case or a terrifying serial killer thriller. It's cause isn't helped, either, by David Fincher's meticulous version that followed in 2007. Yet there's value in The Zodiac, even if it's difficult to recommend with confidence.\r\n\r\nThe Bulkley's choose to focus primarily on one policeman and his family and how they are deeply affected by The Zodiac case. This involves Detective Matt Parish (Chambers) coming under increasing pressure at work, where his superiors are demanding a result, and at home, where his wife Laura (Tunney) grows frantic\/frustrated by the day and his young son Johnny (Culkin) becomes unhealthily fascinated by the case.\r\n\r\nThe director paints a very good period backdrop whilst deftly filling the narrative with a sense of paranoia that surely enveloped the Bay Area as The Zodiac enacted his crimes. The killer's face is rightly never seen, though we get POV shots from the killer and glimpses from afar or from behind him. While interestingly there's a link between The Zodiac and young Johnny as each go about their respective ways.\r\n\r\nThe colour schemes used at various points of the story are well thought out, providing the film with a documentary feel for the exteriors and a saturated neo-noir universe for interiors. There's a spareness to the production that really aids the subject matter. Cast performances are fine, with Tunney really getting to grips with her character, and Suby's score rumbles along ominously.\r\n\r\nNot to be sought out by blood hounds or Zodiac historians, this is still a better than average picture that holds some interest as it rises above its modest budget limitations. 6\/10","id":"5424b0f30e0a263b7e0046c0","url":"https:\/\/www.themoviedb.org\/review\/5424b0f30e0a263b7e0046c0","movie_id":11345}
{"author":"furious_iz","content":"Predictable B movie creature feature that doesn't get past budget restraints, a weak script and a lack of adequate direction.\r\n\r\nA bunch of divers and scientists try to map an undiscovered underwater cave in Romania, for reasons I have now forgotten, and get more than they bargained for when they encounter a new species of creatures dwelling within. \r\n\r\nThe premise is well worn, but that doesn't mean it has nothing to offer to the genre.  In theory at least.  The film plods along with characters announcing what they see in front of them, almost like they are performing an audio play.  Most of the film is all tell and no show, which is a mistake for the medium it is delivered in.\r\n\r\nThe B grade cast take what they are doing very seriously, and most of them are trying to do the best with the material they have.  Sadly the script is weak, there is almost zero character development and people are constantly behaving irrationally.  I know it's an action\/horror, and no one ever acts normally in those films, but to have experienced salvage divers panicking so quickly when things go south is stupid and unrealistic.\r\n\r\nSome of the design for the creatures are interesting and kinda cool, with surprisingly adequate CG for a B movie, and they are what elevates it from complete garbage to just not very good.  Unfortunately most of the action scenes are edited at such a frenetic pace that you almost have no idea what is happening.\r\n\r\nCould have been worse, but probably should have been better than it was, maybe would have been better with a more seasoned director.  The biggest fault lies with the weak script though, so maybe it was always destined to be what it is.\r\n\r\nMaybe 5\/10 is a little generous, but 4 seems too harsh, so there you have it.","id":"5a6f75bfc3a368481c0032a3","url":"https:\/\/www.themoviedb.org\/review\/5a6f75bfc3a368481c0032a3","movie_id":9042}
{"author":"John Chard","content":"You're as maniacal as a box of kittens.\r\n\r\nA remake of Robert Aldrich's 1974 film The Mean Machine, which starred Burt Reynolds, this version sees Peter Segal direct and Adam Sandler headlining. Also starring are Chris Rock, Burt Reynolds, James Cromwell and William Fitchner.\r\n\r\nOne time gridiron superstar Paul Crewe, now disgraced, gets himself sent to a prison run by a gridiron fanatical warden. Coerced into being part of a match between the guards and the cons, Crewe has his work cut out to make a team out of misfits, runts and near idiots!\r\n\r\nAdam Sandler has always proved divisive, and this film has proved to be no exception. Massively popular at the box office (over $100 million profit), it's a film that anyone with an aversion to Sandler should stay away from. I mean if by 2005 you hadn't realised he's not for you then why would you watch this?\r\n\r\nComing from someone who absolutely adores the original film, I had no hesitation in watching this, I like Sandler and I don't mind remakes as I'm always intrigued to see how they pan out. This is full of prison stereotypes, close to the knuckle humour and meaty violence, but is it funny? From my perspective yes it is, very much so, with some of the dialogue sparkling and delivered with comedic grace by a fine cast. But that's me, others, as we know, don't feel the same. \r\n\r\nThe action is well put together by Segal, the convicts training sequences are great fun, while the main game that crowns the pic is exciting, dramatic and yes, great fun. The support slots contain more beef than an Aberdeen Angus stew, with the likes of Michael Irvin, Terry Crews, Steve Austin and Brian Bosworth fronting up, while David Patrick Kelly playing a weasel is never a bad thing. A lot of people loved it in 2005, I'm now one of their number. 7\/10","id":"5770fa7a9251411bc50004c8","url":"https:\/\/www.themoviedb.org\/review\/5770fa7a9251411bc50004c8","movie_id":9291}
{"author":"Gimly","content":"Oh man this was so bad. Like this was **so** bad. Part of me is afraid to go back and check out the original now, but the rest of me feels safe in the knowledge that it couldn't possibly be worse... I mean it couldn't, right? ...Right?\r\n\r\n_Final rating:★ - Of no value. Avoid at all costs._","id":"5c8d03380e0a2612f55353b8","url":"https:\/\/www.themoviedb.org\/review\/5c8d03380e0a2612f55353b8","movie_id":791}
{"author":"markuspm","content":"I have watched this movie soooo many times already and I am still not tired of it. OK I confess I really am a big fan of \"Jordan Two Delta\".","id":"52b7eaf019c2952853057045","url":"https:\/\/www.themoviedb.org\/review\/52b7eaf019c2952853057045","movie_id":1635}
{"author":"slayrrr666","content":"During the trial for his events, a lawyer tries to help her client, a priest, seek the truth about what happened to the young woman who died under his care while performing an exorcism to cure her of a demonic possession and eventually lets the truth about it be known.\r\n\r\nThis wasn't anywhere as bad as it could've been. The film is really split into two halves here with this one being basically helped greatly by its really good possession and shock scenes. The opening scene that sets her up to becoming possessed is one of it's best sequences, as the long hallway and the unearthly voices floating around give it an unearthly feel while the first scene in the classroom where she sees a demonic face appearing in the window through a cloud of mist and turns around to see a student's face turn into a distorted demon's face giving off an unearthly roar makes it quite shocking. Running out into the rain and seeing more demonic faces give off the same unearthly roar is a bit clichéd, but it still helps to sell the mood while the finale in the church giving this a quite creepy conclusion. The different manners of how she’s become afflicted are quite memorable moments with the frenzied bug-eating, speaking in tongues or just contorting her body into such impossible positions that it really becomes obvious something is wrong with her, and the long, suspenseful and chilling exorcism is the film's selling point, coming off with any number of creepy ideas and scenes in such a drawn-out style is one of the best scenes in the film. Otherwise, beyond the shocks and the exorcism, there isn't much else to like about it. Therefore, everything else in it doesn't really work which is only relegated to the courtroom battle drama. It's marketed as being a supernatural possession film, and the best moments come from those scenes, but the fact that the majority of the film is a courtroom battle with the supernatural elements coming in the form of flashbacks is a real misstep and is likely to confuse those coming in expecting the other kind of film. It's not that they're boring or anything, it's just that it's out of nowhere that it becomes that way, and it can be a disappointment. The fact that these are slow and really long don't help matters, extending this out far longer than it should. This could've easily been an hour and a half, or maybe a little longer, but the two hours running time forces it to keep the courtroom antics going for no reason other than to extend the running time. A few extraneous scenes could've been snipped as well, including the introductory scenes at the bar that repeat information we already know and also keep the running time going, and most of the time simply elicit a feeling of wanting to move along and get to the good scenes. These really harm the film.\r\n\r\nRated PG-13: Language, Mild Violence and intense demonic and spiritual themes.","id":"58c4b4bcc3a3681641004fca","url":"https:\/\/www.themoviedb.org\/review\/58c4b4bcc3a3681641004fca","movie_id":8643}
{"author":"Per Gunnar Jonsson","content":"Well, no matter how I rate this movie a lot of people are going to say that my rating is wrong. That is something that you probably can say about any rating for any movie. I feel it is especially true as far as this movie goes though. As you can see from my rating I was not exactly thrilled by the movie. That does not mean that it is a bad movie. Again, this you can say about a lot of ratings, especially my ratings.\r\n\r\nOkay, I guess I have confused everyone enough now so let me try to explain. As a piece of cinematic art this movie is excellent. The acting is quite good. I especially liked John Hurt as the literate bounty hunter but most of the main characters where performing admirably. The scenery is wonderful. The Australian outback makes for a excellent backdrop and it is indeed a nice change from the classical North American western sceneries.\r\n\r\nAs a movie it falls flat though. In my opinion a movie should at least try to tell a story. Even if it aspires to be a piece of art it should try and tell a story that the audience can, in one way or another, follow. This movie have a basic idea of a story but it does not really tell a story. We never get to know who the bad guys really are, what they really did, except for a bunch of hints about killing and rape, or why. Heck, we never actually get to know of the guy the flogged to death where really taking part in the deed or not.\r\n\r\nThroughout the movie the bad guys are supposedly hiding in some place where it is impossible to get them so the main character tries to get the bad guys brother to kill him. Not very plausible at all. The governor, Eden Fletcher played by David Wenham, or whatever he as supposed to be was pretty much an asshole. Okay every movie has to have one but his role was never really developed. Once he managed to get the young kid, innocent or not, flogged we really do not see much of him for the rest of the movie.\r\n\r\nThe end of the movie is much the same as the rest of the movie. Cinematically excellent but not much of a story. There is no real conclusion. It just ends in a sequence of well done scenes but without any real story behind it.\r\n\r\nMaybe I’m a too simple mind when it comes to these kind of movies but I, even though I appreciated the graphics that was shown on my TV-screen, I did not really enjoy it as a movie.","id":"5157f78419c2953ed0168db5","url":"https:\/\/www.themoviedb.org\/review\/5157f78419c2953ed0168db5","movie_id":16608}
{"author":"narrator56","content":"There are a lot of sub-genres in movies: spaghetti Westerns, Police Procedural Mysteries, and Epic Fantasy - like Lord of the Rings. You can usually find a lot of room within these sub-genres for imaginative examples. They can be wildly different. Romantic Comedies seem to have less leeway. You have a formula that is often used, with minor changes here and there. The characters usually seem to have little in common at first glance, one of the characters usually gets sidetracked by another love interest (in Fever Pitch the love interest is the Boston Red Sox), there is a breakup where one or both becomes miserable, and the one who is \"at fault\" usually has to make a grand gesture at the end to mend the split. And of course there are jokes and romance.\r\n\r\nI think Fever Pitch is an excellent example of the genre. The two main characters are witty and charming and provide a lot of laughs. They are caring people and there is  great chemistry between them. You don't have to be a baseball fan to enjoy it (though perhaps Yankee fans should steer clear), but like with most romantic comedies, you might want to set your cynicism aside for the duration, especially if you are a guy watching it with your favorite lady. If she is okay with the sports theme, you can let the romantic moments wash over you.\r\n\r\nThis is one of those rare movies that when it comes on, no matter what place it is in the film, I am apt to settle in and watch it.","id":"5e910d9f3679a1001337236c","url":"https:\/\/www.themoviedb.org\/review\/5e910d9f3679a1001337236c","movie_id":11431}
{"author":"Wuchak","content":"***Mysterious winter death at an exclusive prep school in the Northeast***\r\n\r\nA 17 year-old student (Thomas Gibson) from the prestigious Haddan School is found frozen in the nearby river. The school wants to avoid negative press by quickly closing the case as a suicide, but police officer Abel Grey (Edward Burns) smells something fishy and considers the possibility of a hazing gone wrong. Rachelle Lefevre plays a friend of the dead student while Jamie Thomas King appears as his rival for her affections. Jennifer Ehle is on hand as an engaged teacher at the school that captures Abel’s attention as he’s investigating.\r\n\r\n\"The River King\" (2005) is a drama\/mystery that takes the setting of “Dead Poets Society” (1989), albeit in the modern day, and adds elements seen in later films, like “Snow Angels” (2007), “Coming Through the Rye” (2015) and “The Drowning” (2016). If you favor these types of films you’ll appreciate this one. While not on the level of “Dead Poets” and “Snow Angels,” it’s not too far behind.\r\n\r\nBurns is a Ben Affleck lookalike and makes for a quality protagonist while Ehle is reminiscent of a young Meryl Streep. Of course, Lefevre is jaw-dropping from beginning to end. The winter setting of the school, the surrounding woods and nearby town is a highlight. Meanwhile the story is realistic and intricate without being convoluted. There’s a love affair that completely smacks of reality. Everything gels, including the end revelation and how it relates to Abel’s haunting past and current burdens.\r\n\r\nThe film runs 1 hour, 39 minutes and was shot in Nova Scotia, Canada (Halifax & Windsor).\r\n\r\nGRADE: B+\/B","id":"5ce2f499c3a36823c523d793","url":"https:\/\/www.themoviedb.org\/review\/5ce2f499c3a36823c523d793","movie_id":45072}
{"author":"John Chard","content":"It was like an itch I had to scratch !!!!\r\n\r\nIs it possible for fans of the John Carpenter original to be objective with this remake? Is it possible for a modern audience fed on Gorno and Slice Dice horror genres to be objective also?\r\n\r\nWell I like to think that as a man in middle age I can be very objective and rate the film accordingly, so with that in mind I happily admit to being a member of both the above groups I have mentioned. This smacked of a bad idea when it was first mooted but it came as no surprise to anyone who can see that mainstream cinema had at this time in film history simply run out of great ideas for movies. This is real bad and I avoided it for so long, but the fact that his royal highness John Carpenter was lending his name to the project always kept me interested, it was the itch I was destined to scratch at some point.\r\n\r\nIt's poorly directed, badly acted, in fact there is a scene with four people on a boat (two of each sex) that is so badly acted you would be surprised if these actors ever work again! The pic is devoid of suspense, jump shocks and worst of all, an ending that is as dreary as it is insulting. I give it 2\/10 for the sound mix only. An awful abomination.","id":"565932949251410dc0001792","url":"https:\/\/www.themoviedb.org\/review\/565932949251410dc0001792","movie_id":791}
{"author":"John Chard","content":"Lincoln Six Echo and the Utopian Redemption.\r\n\r\nLincoln Six Echo is having vivid dreams about a past existence, here in this Utopian world he lives in, he's starting to question the function of his world. In this perfectly formed existence the inhabitants dream of winning the lottery, the prize? Relocation to an outside paradise known as The Island. After stumbling upon something sinister, Lincoln escapes with fellow inmate Jordan Two Delta, and now the consequences for both of them are as dangerous as it is for the rulers of this strange and intriguing place.\r\n\r\nIf you are entering a movie that is directed by Michael Bay then one can reasonably assume you know what you are going to get, cue explosions, ear splitting sound mix and a host of carnage set pieces. Bay's formula works and mostly his efforts have entertained the popcorn masses. So it's interesting to find that \"The Island\" does have some intellectual nous in amongst the Bayhem that the director is famed for. Working from a tantalising cloning story written by Caspian Tredwell-Owen (though the similarities to Robert Fiveson's \"The Clonus Horror\" resulted in a law suit being filed), \"The Island\" now more than ever is highly engrossing sci-fi in premise, where certainly the ethics of the story's core are worth scrutinising.\r\n\r\nOne of course can argue that Bay was the wrong director for such interesting material, and yes it's a point to note that the characters and plot arcs are not given any depth or a serious second glance, but really we are here for the bang to go with the buck are we not?. Ewan McGregor (Lincoln) and Scarlett Johansson (Jordan) play it just about right, the bemusement of their situation is coupled with daring do heroics, while suitably tongue in cheek performances come from Sean Bean, Djimon Hounsou and a picture stealing Steve Buscemi. This is not a film that is easy to recommend because it can frustrate as much as it entertains, but entertain it does, and with big screen TVs and glorious home cinema a staple requirement for the movie fanatic, \"The Island\" is something of an essential purchase - check out the highly octane outrageousness of the road pursuit here, it's fabulous through the speakers.\r\n\r\nA serious topic is given a nonsense sheen for sure, but hell what a blast it is. 7\/10","id":"5d88a7c0172d7f00274b209e","url":"https:\/\/www.themoviedb.org\/review\/5d88a7c0172d7f00274b209e","movie_id":1635}
{"author":"legoman2000","content":"Just read the Book, it's so much better. If you have read The Hitchhikers Guide to the Galaxy there is a series to read, get to it!","id":"500981b7760ee34846004f07","url":"https:\/\/www.themoviedb.org\/review\/500981b7760ee34846004f07","movie_id":7453}
{"author":"Reno","content":"> Chasing a dream halfway across the world.\r\n\r\nOne of the inspiring biopic I have ever seen. It is about chasing a dream and it is never too late to do that so. Based on the story of a New Zealand motorcyclist Burt Munro. After spending 25 years to build a faster motorbike in the down under, now a very old Munro travel halfway across the earth to Bonneville speedway in the US to set a record. So what's the remaining of the tale reveals is that does his dream becomes reality or not.\r\n\r\nAwesome performance by Anthony Hopkins, but in some parts I was distracted by his fake Kiwi accent. Overall, not bad with his effort, he achieved the goal conveniently. It is one of the best road movie that directed by the 'Species' filmmaker. The 120 minutes was too short, but well covered story with inclusion of messages like anti smoking and alcohol consumption.\r\n\r\nIt is a decade old film, never too late to watch a fine film like this, but inside I feel regret for the delay. I had no idea about the storyline. I thought it might be about Indians and then thought American Indians, but realised only while watching it that it is about a motorbike called Indian. It is surely a good family movie, especially if there is a motorbike maniac in the house. Highly recommended by me.\r\n\r\n9\/10","id":"576d836fc3a368576c0005ca","url":"https:\/\/www.themoviedb.org\/review\/576d836fc3a368576c0005ca","movie_id":9912}
{"author":"Wuchak","content":"***Quirky crime\/dramedy with loads of black humor tries a little too hard***\r\n\r\nThe owner of a small travel agency in Alaska (Robin Williams) loves his wife with Tourette Syndrome (Holly Hunter), but he’s financially strapped and needs funds fast. After stumbling upon a frozen corpse he hatches a harebrained scheme that draws the suspicion of an obsessed insurance claims investigator (Giovanni Ribisi). Alison Lohman plays the latter’s live-in girlfriend while Woody Harrelson plays the protagonist’s wild brother. Tim Blake Nelson and W. Earl Brown are also on hand as goofy wannabe hitmen. \r\n\r\n“The Big White” (2005) is similar to “Fargo” (1996), but more eccentric and comedic. Imagine “A Simple Plan” (1998) or the later “Sugar Mountain” (2016) if they were oddball black comedies and you’d have a good idea.  \r\n\r\nThe cast is notable and it’s entertaining enough for what it is while attempting to balance the unsavory with the honorable, but it tries a bit too hard to be offbeat (which I suppose is better than not trying enough). Meanwhile the locations & cinematography are great, Lohman is stunning in a cute way and the score is exceptional.   \r\n\r\nThe movie runs 1 hour, 40 minutes, and was shot in Winnipeg, Manitoba, and Whitehorse, Yukon. The bulk of the outdoor sequences and cinematography were shot at summit of the White Pass along the border of Alaska and British Columbia, not far from Skagway.\r\n\r\nGRADE: B-\/C+","id":"5e6ee44e357c00001344d83a","url":"https:\/\/www.themoviedb.org\/review\/5e6ee44e357c00001344d83a","movie_id":9968}
{"author":"Milo_Jeeder","content":"I suppose we could say that this movie is not, shall we say... a 'serious' horror film?. That means that the story is beyond delirious and a bit silly to a certain extent, but that doesn't necessarily imply that it can't be enjoyed. The main premise in this nice little horror flick, is obviously not a very realistic one and leaving aside the so-called ridiculousness of the story, this is definitely a must-see to all slasher fans. It seems however that this film was not exactly acclaimed and my wild guess is that the disappointment comes from grind-house lovers who expected a good'ol nunsplotaition flick and they got a Hollywood-like Spanish slasher instead. The other possibility is that some of the angry reviewers are the ones who assumed that this film was going to be by some means similar to \"Darkness\", which was written (and also directed) by Jaume Balagueró, who was in charge of the story here as well. Considering that \"Darkness\" was far more respected when it came out for being among other things so atmospheric and artsy, I wouldn't be surprised if some people expected something mildly similar or at least a few connections with this movie. However, \"La Monja\" was not directed by Mr. Balagueró, so I really don't see why there should be any connection whatsoever. So my little advice to anyone who is expecting anything remotely similar to \"Darkness\", is to discard this slasher, because it will turn out to be a major let down.\r\n\r\nIn \"La Monja\", six young ladies in a Catholic boarding school, are tormented by a cruel nun called Úrsula, who is also the headmistress of the establishment. One day, during a sadistic purification ritual, Sister Úrsula goes a little bit too far with her medieval methods and tries to drown Mary, one of the students, as a way to purify her sinful soul. However, her cruel ritual is interrupted by the other girls, who rise up against Sister Úrsula and kill her. After that, they decide to make a pact of silence and throw her body inside a pool of holy water. Eighteen years later, Eve, Mary's daughter, begins to have strange hallucinations about a vicious nun who appears out of nowhere. Several people start to die around her, including her own mother and some of her class mates. Right after her mother's mysterious death, Eve takes a trip to Spain with her friends, only to find out that she's merely doomed to confront a terrible fate and discover an awful truth about herself.\r\n\r\nThe plot clearly promises a nice slasher... and a nice slasher we get!. With a nice variety of well done murders and moderated use of CGI, this bizarre horror gem manages to entertain and mock slasher films for their similarities and lack of originality. \"La Monja\" is a good exponent of what contemporary slasher films are all about and even though the film is a Spanish production, it does a good work emulating some of the finest American films out there. The supernatural villain reinforces the evidence that the director clearly wasn't aiming to a dark or profound film and instead, he basically wanted to achieve a highly entertaining and unpretentious horror gem to enjoy with some pop-corn and a large soda. If you're in the mood for some genuine and simple fun, give this evil nun and chance and she won't disappoint you with her cruel punishments against the sinners who dare to stand in her way.","id":"58a3950c9251414b75000332","url":"https:\/\/www.themoviedb.org\/review\/58a3950c9251414b75000332","movie_id":42968}
{"author":"talisencrw","content":"Harron's biography, specializing on Page's early life, start in pin-ups and notoriety due to being the target for a Senate hearing on indecency and her subsequent born-again Christianity, is very enjoyable, and Gretchen Mol is great at portraying the inner sexiness, naivety and Southern charm that made the Nashville-born Page take the world by storm. Though it made the biopic more graceful by concentrating on the earlier times, it would have been more complete had it also included her later, troubled times, punctuated with brushes with the law and institutionalization for schizophrenia, as well as being greatly financially troubled due to not getting royalties for her years of photo-work and celebrity. Thankfully, late in life, that was rectified and she was able to live her last years decently and in happiness, dying of a heart attack at 85, three years after seeing Harron's work come to light, and her success come full circle...","id":"569c75bd9251415e6a001cdb","url":"https:\/\/www.themoviedb.org\/review\/569c75bd9251415e6a001cdb","movie_id":15402}
{"author":"Kenneth Axel Carlsson","content":"Australia. A man looking to catch a criminal by the name of Arthur Burns (the head of the Burns Gang). He catches his brothers instead, and offers the elder brother (Guy Pearce) a deal. A proposition. Bring him Arthur Burns, the man who raped and killed Eliza Hopkins. And to make sure that Charlie will honor the deal, he keeps the youngest brother, Mikey.\r\n\r\nThe stage is set early on in the movie, and yet, this is more than just a simple story about a gang of criminals and the law enforcers who are chasing them down, this is a story about a country being created, about the fight for survival in a strange land. About justice and peace of mind.\r\n\r\nNick Cave wrote the screenplay, and also most of the music. This gives us a hint that it is not going to be your average movie, but something... more, something different. We can also expect the sound to be spectacular and forceful, and indeed, it is. The music here very much reminded me of the music in There Will Be Blood by Paul Thomas Anderson, extraordinary and... haunting really. But it doesn't stop at the music, the visual side of the movie is rather stunning in a haunting way as well, dirty and dusty all the way through. I love when a movie has a distinct visual style and rhythm, and this one does.\r\n\r\nThe movie starts out with a bang, as the law enforcers hunt down the two younger brothers, Charlie and Mikey, but as soon as Charlie is given the proposition, it slows down considerably and branches out to tell two stories, that of Charlie hunting down his brother, but also that of Captain Stanley and his wife, two opposing forces. This guy clearly has demons of his own, and is looking for justice to be served. I love the pace in this movie, it wants to tell its story just right.\r\n\r\nThe cast is a great one, as mentioned Guy Pearce plays one of the Burns brothers, together with Danny Huston. These guys are dirty and bend on doing whatever it takes to survive. Captain Stanley is played by the amazing Ray Winstone. He plays the role with a quietness and a subtlety that surprised me. He is the hero of the story, at least for me, and wants only justice to be served. In other parts we see David Wenham and John Hurt, both delivering quirky and interesting characters. A great movie needs a great cast, and this one most certainly have that.\r\n\r\n_Last words... this movie does not compromise. It is honest, it is dark and it forces you to think about right and wrong. How does one identify a criminal and what forces people to do evil deeds? Nothing is simple really, and it shouldn't be. Most people have both light and darkness within them, and that is the case in this movie._","id":"549dfb679251411d53000e1d","url":"https:\/\/www.themoviedb.org\/review\/549dfb679251411d53000e1d","movie_id":16608}
{"author":"Gimly","content":"The _Empire Strikes Back_ of the Firefly Family franchise. Firstly because they're both the middle entry in their respective trilogies, and secondly because I gave them both the same rating. And I say that knowing full well how much the film community at large will look down on me for admitting it. But I don't care. This is a fantastic movie. Probably Zombie's best. Mm, second best. After _Halloween II_. Which is also the best _Halloween_ movie.\r\n\r\n...Now they're really coming for me.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5e0725424c1d9a0013e1343a","url":"https:\/\/www.themoviedb.org\/review\/5e0725424c1d9a0013e1343a","movie_id":1696}
{"author":"TheTenth","content":"Two young kids try to scrounge food on a battlefield. The girl uses cunning to get a cake the boy found. As she flees with it she drops it in the water. A female spirit offers her a deal : if she never find happy love, she will never be hungry (= rich) again. She accepts.\r\nGeneral Guangming (Hiroyuki Sanada) is victorious in battle once again. He meets the spirit (in human form) that tells him someone will kill the king and stain his honor. He is wounded but is rescued by a slave, Kunlun (Dong-Gun Jang). He sends him to the palace with order to save the king, describing him as the only one without a weapon. Confused, he kills the king and escapes with Qinsheng (Cecilia Cheung), they are surrounded by soldiers and agrees to jump off the cliff to save Qinsheng.\r\nGeneral Guanming is faced by his soldiers and saved again by Kunlun. He meets Qinsheng and falls in love.\r\n\r\nThis is a Chinese fairytale. The story is very simple, what's important here is the characters, what their choices lead to, and morale of the portagonists (even the \"evil\" characters). The movie is known as \"The Promise\" (as for the promise of the little girl) or \"Legend of the wind riders\" (the tribe Kunlun comes from). There is some Wuxia elements, with incredible sword fights, incredible jumps and races ...\r\nDirector Chen Kaige uses very bright colors that bring intensity and life to the movie, either using the scenery or costumes to this effect.\r\n\r\nThe main characters, Kunlun and Qinsheng, are victims of fate and can only try to do their best of the situation. There is mostly drama here, with good hearted characters trying to keep their honor and follow their heart and aspirations until their last breath.\r\n\r\nRemarkable movie.","id":"5ae089070e0a26156c0149aa","url":"https:\/\/www.themoviedb.org\/review\/5ae089070e0a26156c0149aa","movie_id":2008}
{"author":"J4stringthang","content":"Fun, Entertaining, and VERY Predictable. This christmas based romantic comedy made me miss my own dysfunctional family. The Family Stone can be enjoyed by all. Luke Wilson was hilarious. Claire Danes looked great and Diane Keaton made this family. You'll laugh, You'll Cry, and you might want to call your Mom after watching this.","id":"52f31d2a925141131d084b14","url":"https:\/\/www.themoviedb.org\/review\/52f31d2a925141131d084b14","movie_id":9043}
{"author":"Wuchak","content":"***Gripping realistic account of divorce and its consequences; it’s also occasionally comical***   \r\n\r\n“The Squid and the Whale” (2005) is a frank, quirky and amusing drama about a family from Brooklyn in 1986 that encounters divorce and the ramifications thereof. The father (Jeff Daniels) is a literary professor and fading author while the wife (Laura Linney) is an emerging writer, a sweet liberal who for some reason can’t stop having affairs. The two boys are played by Jesse Eisenberg and Owen Kline. William Baldwin is on hand as a tennis instructor while Anna Paquin plays a college student.   \r\n\r\nThe story is unsurprisingly based on director\/writer Noah Baumbach’s own family’s experience. I say “unsurprisingly” because the movie smacks of real life with its candid and sometimes comical approach.\r\n\r\nA few viewers didn’t ‘get’ the father, Bernard Berkman (Daniels), and have interpreted him in an uber-negative way. Yes, he’s a grotesquely competitive, pompous cheapskate, but his comical flaws are rounded out by an inherent decency. He’s clearly not the unfaithful partner and wants to keep the family together. He takes the time to spend quality time with his boys and mentor them, especially Walt (Eisenberg), who idolizes him.  \r\n\r\nSpeaking of the father and Walt, Eisenberg and Daniel’s characters and their performances are the highlight of this picture. Both characters are fascinating psychological studies. Eisenberg possesses the intense, intelligent charisma of James McAvoy and Brando. Is it any wonder that he went on to play The Joker in the DCEU? Winsome Halley Feiffer is on hand as his girlfriend.\r\n\r\nSpeaking of females, Anna Paquin is another highlight even while her lack of modesty isn’t very becoming. Nevertheless she looks great in jeans.   \r\n\r\nThe movie runs 1 hour, 21 minutes and was shot in Brooklyn, New York.\r\n\r\nGRADE: A-","id":"5c5f36690e0a264d6f69be49","url":"https:\/\/www.themoviedb.org\/review\/5c5f36690e0a264d6f69be49","movie_id":10707}
{"author":"John Chard","content":"Visceral, Visionary, Visual, Sin City kicks the big un!\r\n\r\nThree grizzled stories from Basin City comprise the basis for Robert Rodriguez's adaptation of Frank Miller's graphic novels (Miller along for co-directing duties as well). Man mountain Marv is out to avenge a murdered hooker, Dwight attempts to help the red light girls stay independent from the mob, and aging cop Hartigan is trying to protect a beautiful dancer from a sadistic pervert.\r\n\r\nI think the first thing I should say is that I have no frame of reference as regards the adaptation here, I have never read (or seen) a Frank Miller story, but from what I can gather from the IMDb site is that fans of Miller's graphic stories were well pleased with the final result. I'm pleased to see that, because too many times comic book adaptations are roundly panned by the hard core fan base of each respective franchise for not being close to the spirit of the source, so here I'm doubly relieved mainly because I find Sin City to be a majestic assault on the senses.\r\n\r\nSin City is a stark place, full of seedy residents thriving on misery and mistrust, and here we are privy to three stories that only serve to remind us that we don't want to be anywhere near the place. Playing out as some sort of horror comic noir, Sin City is for sure a very violent picture, yet the violence is formed so perfectly in its style, it cloaks the film in artistic class. Once viewed, Sin City is never forgotten, and I for one literally do tip my hat towards Frank Miller & Robert Rodriguez for bringing such a great and interesting movie to the masses. All of the cast do great work, so I'll not single anyone out for praise, the techniques and the whole structure of the piece is quite simply marvellous, and as for the writing? Well get a load of it!\r\n\r\nSin City, a dark horrible place, Sin City, a wonderful wonderful movie. 9\/10","id":"541b00540e0a261c8d0000d7","url":"https:\/\/www.themoviedb.org\/review\/541b00540e0a261c8d0000d7","movie_id":187}
{"author":"Gimly","content":"We watched this because we had just seen a crappy movie with Billy Zane in it. _Survival Island_ was the worse of the two.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5b9122af0e0a2665a300eb5a","url":"https:\/\/www.themoviedb.org\/review\/5b9122af0e0a2665a300eb5a","movie_id":9753}
{"author":"Wuchak","content":"***A side story to “Kingdom of Heaven” about a Templar, a Muslim and a widow in the desert***\r\n\r\nAfter the Battle of Hattin in 1187, a grim Knight Templar named Rene (Tim Abell) wanders the desert where he encounters a Muslim named Hassan (Bill Mendieta). They meet a Muslim woman, Soheila (Mapi Galán), and discuss sectarian differences and the human penchant for conflict & killing while the woman seems intrigued by one of the men.\r\n\r\nThis is basically a low-budget companion piece to the events of “Kingdom of Heaven” (2005). “Soldier of God” came out later that same year, but only cost $325 thousand while “Kingdom” cost a whopping $130 million. Thankfully, the filmmaking doesn’t seem THAT low-budget: There’s a lot of beautiful desert photography, the editing is proficient and the score is aesthetic and moving. I encourage you to watch or re-watch “Kingdom of Heaven” first because it provides the background events and key names that will help you understand the situation here.\r\n\r\nThis is a dialogue-driven sword & sandal drama with flashes of action. The acting is well done for such low-budget fare. The problem is that too much of the verbiage is hard to discern and there’s no subtitle option. Another reviewer called the movie “a pointless exercise in verbose pretentiousness,” but some of the dialogue is quite good, at least what I heard anyway, particularly the discussion when the Jewish merchant visits.\r\n\r\nSomeone criticized the actions of a certain character on the grounds that a such-and-such wouldn’t do such-and-such. I disagree. I just went to coffee with a devotee of a certain noble belief system who recently got out of prison for murder, which he committed in a flash of angry frustration. Plus you have to consider the adrenaline rush of battle frenzy and the desire to remove something lingering & troubling.\r\n\r\nI probably would’ve liked this flick a lot more if I was able to discern more than 50% of the dialogue.\r\n\r\nThe film runs 1 hour, 34 minutes and was shot in Dumont Dunes, California, with some exteriors done in Málaga, Andalucía, Spain.\r\n\r\nGRADE: C","id":"5baaae8b92514150f100b946","url":"https:\/\/www.themoviedb.org\/review\/5baaae8b92514150f100b946","movie_id":31973}
{"author":"NeoBrowser","content":"George Lucas comes full circle in more ways than one in \"Star Wars: Episode III -- Revenge of the Sith,\" which is the sixth -- and allegedly but not necessarily the last -- of the \"Star Wars\" movies. After \"Episode II\" got so bogged down in politics that it played like the Republic covered by C-Span, \"Episode III\" is a return to the classic space opera style that launched the series. Because the story leads up to where the original \"Star Wars\" began, we get to use the immemorial movie phrase, \"This is where we came in.\"\r\n\r\nThat Anakin Skywalker abandoned the Jedi and went over to the dark side is known to all students of \"Star Wars.\" That his twins Luke Skywalker and Princess Leia would redeem the family name is also known. What we discover in \"Episode III\" is how and why Anakin lost his way -- how a pleasant and brave young man was transformed into a dark, cloaked figure with a fearsome black metal face. As Yoda sadly puts it in his inimitable word order: \"The boy you trained, gone he is, consumed by Darth Vader.\"\r\n\r\nAs \"Episode III\" opens, Anakin Skywalker (Hayden Christensen) and his friend Obi-Wan Kenobi (Ewan McGregor) are piloting fighter craft, staging a daring two-man raid to rescue Chancellor Palpatine (Ian McDiarmid). He has been captured by the rebel Gen. Grievous (whose voice, by Matthew Woods, sounds curiously wheezy considering the general seems to use replacement parts). In the spirit of all the \"Star Wars\" movies, this rescue sequence flies in the face of logic, since the two pilots are able to board Grievous' command ship and proceed without much trouble to the ship's observation tower, where the chancellor is being held. There is a close call in an elevator shaft, but where are the guards and the security systems? And why, for that matter, does a deep space cruiser need an observation tower, when every porthole opens on to the universe? But never mind.\r\n\r\nBack within the sphere of the Jedi Council, Anakin finds that despite his heroism, he will not yet be named a Jedi Master. The council distrusts Palpatine and wants Anakin to spy on him; Palpatine wants Anakin to spy on the council. Who to choose? McDiarmid has the most complex role in the movie as he plays on Anakin's wounded ego. Anakin is tempted to go over to what is not yet clearly the dark side; in a movie not distinguished for its dialogue, Palpatine is insidiously snaky in his persuasiveness.\r\n\r\nThe way Anakin approaches his choice, however, has a certain poignancy. Anakin has a rendezvous with Padme (Natalie Portman); they were secretly married in the previous film, and now she reveals she is pregnant. His reaction is that of a nice kid in a teenage comedy, trying to seem pleased while wondering how this will affect the other neat stuff he gets to do. To say that George Lucas cannot write a love scene is an understatement; greeting cards have expressed more passion.\r\n\r\nThe dialogue throughout the movie is once again its weakest point: The characters talk in what sounds like Basic English, without color, wit or verbal delight, as if they were channeling Berlitz. The exceptions are Palpatine and of course Yoda, whose speech (voiced by Frank Oz) reminds me of Wolcott Gibbs' famous line about the early style of Time magazine: \"Backward ran sentences until reeled the mind.\"\r\n\r\nIn many cases the actors are being filmed in front of blue screens, with effects to be added later, and sometimes their readings are so flat, they don't seem to believe they're really in the middle of amazing events. How can you stand in front of exploding star fleets and sound as if you're talking on a cell phone at Starbucks?\r\n\r\n\"He's worried about you,\" Anakin is told at one point. \"You've been under a lot of stress.\" Sometimes the emphasis in sentences is misplaced. During the elevator adventure in the opening rescue, we hear \"Did I miss something?\" when it should be \"Did I miss something?\"\r\n\r\nThe dialogue is not the point, however; Lucas' characters engage in sturdy oratorical pronunciamentos and then leap into adventure. \"Episode III\" has more action per square minute, I'd guess, than any of the previous five movies, and it is spectacular. The special effects are more sophisticated than in the earlier movies, of course, but not necessarily more effective.\r\n\r\nThe dogfight between fighters in the original \"Star Wars\" and the dogfight that opens this one differ in their complexity (many more ships this time, more planes of action, more detailed backgrounds) but not in their excitement. And although Lucas has his characters attend a futuristic opera that looks like a cross between Cirque de Soleil and an ultrasound scan of an unborn baby, if you regard the opera hall simply as a place, it's not as engaging as the saloon on Tatooine in the first movie.\r\n\r\nThe lesson, I think, is that special effects should be judged not by their complexity but by the degree that they stimulate the imagination, and \"Episode III\" is distinguished not by how well the effects are done, but by how amazingly they are imagined. A climactic duel on a blazing volcanic planet is as impressive, in its line, as anything in \"Lord of the Rings.\" And Yoda, who began life as a Muppet but is now completely animated (like about 70 percent of what we see onscreen), was to begin with and still is the most lifelike of the non-humanoid \"Star Wars\" characters.\r\n\r\nA word, however, about the duels fought with lightsabers. When they flashed into life with a mighty whizzing thunk in the first \"Star Wars\" and whooshed through their deadly parabolas, that was exciting. But the thrill is gone.\r\n\r\nThe duelists are so well-matched that saber fights go on forever before anyone is wounded, and I am still not sure how the sabers seem able to shield their bearers from attack. When it comes to great movie sword fights, Liam Neeson and Tim Roth took home the gold medal in \"Rob Roy\" (1995), and the lightsaber battles in \"Episode III\" are more like isometrics.\r\n\r\nThese are all, however, more observations than criticisms. George Lucas has achieved what few artists do; he has created and populated a world of his own. His \"Star Wars\" movies are among the most influential, both technically and commercially, ever made. And they are fun. If he got bogged down in solemnity and theory in \"Episode II: Attack of the Clones,\" the Force is in a jollier mood this time, and \"Revenge of the Sith\" is a great entertainment.\r\n\r\nNote: I said this is not necessarily the last of the \"Star Wars\" movies. Although Lucas has absolutely said he is finished with the series, it is inconceivable to me that 20th Century-Fox will willingly abandon the franchise, especially as Lucas has hinted that parts VII, VIII and IX exist at least in his mind. There will be enormous pressure for them to be made, if not by him, then by his deputies.\r\n\r\n4.5\/5\r\n\r\n- Rodger Ebert","id":"51ea450c760ee35aab42effc","url":"https:\/\/www.themoviedb.org\/review\/51ea450c760ee35aab42effc","movie_id":1895}
{"author":"Vlad Ulbricht","content":"Having seen the first movie when it reached France as I was about 10, it left a vivid mark on my imagination, and I kind of treasured the little bit of fantasy it brought to me among probably millions of other people.\r\n\r\nI think the reason why episodes IV to VI became timeless classics is that they were simply fairy tales in sci-fi clothing. You had heroes and princesses actually doing their heroes and princesses things on the screen, but most of the coolest bits happened somewhere in the recesses of your own imagination.\r\n\r\nStruggle of good against evil. Quest for the father. Passage from childhood to adulthood through a series of trials and challenges. All the stuff chivalry stories are made off, presented in a minimalist way that stuck to the essential elements of the plot. All the rest, including top notch SFXs and the excellent Solo-R2D2-C3PO trio was just cleverly fleshing out this very strong backbone.\r\n\r\nJust a few lines from a dreamy-eyed Sir Alec Guinness about the clone wars while young and clumsy Luke had his pants burn by a floating tennis ball were enough to flare your imagination in depicting an epic struggle between dark empire forces and a few heroic Jedi knights overwhelmed by sheer force and treachery. A few words about Leia and Luke's past were enough to evoke the moving fate of orphans afraid to uncover the hidden truth about a father shrouded in menacing mystery. Stuff dreams are made of, really.\r\n\r\nSadly oh so sadly, it looks like nowadays a blockbuster will never get the green light until some kind of quality insurance comity makes sure even the slowest 10% of your average audience will never be left wondering about anything that goes on for more than 2.5 seconds. I guess some marketing genius managed to convince the producers that leaving anything to the imagination of the customer seriously threatened the return on investment or something.\r\n\r\nThe last 3 episodes were unfortunately born in this disastrous context and proceeded methodically with the extermination of the slightest bit of magic that populated the 3 previous movies. Everything is laid bare in front of our eyes like some specimens on a dissection table. No, not even that. More like pieces of hardware broken down into component parts on a sterilized workbench.\r\n\r\nSo the Force is just something you catch like a flu. The mythical clone war is just 15 minutes of a ridiculous \"plan 66\". The mighty Vader is just a poor boy with an over-sized ego and an IQ reduced to 2 digits figures by an excess of testosterone (or midichlorians or whatnot for that matter). The mighty conflict that flares through the galaxy is just the outcome of desperately trivial political plots. The Jedi council a bunch of pathetically weak over-aged muppets. Yoda a preposterous 10 inches tall kung-fu master.\r\n\r\nThe epic spirit of the first trilogy has been judged guilty of sales-threatening capital crime, quietly dragged behind the marketing barracks at dawn and shot in the back of the head.\r\n\r\nAs if to make good for this assassination, the last 3 movies drown us into a squirming pool of special effect and fan service that go light years over the top. Hysterical scenes flashing past before you really could decide where to focus your gaze just make the cheesy plot-advancing ones look miserable. Here again I feel the invisible hand of the marketing staff, managing to cram about every single second or third rate characters from the previous trilogy into an already bloated plot, stretching even further the already badly mauled consistency of the scenario in the process.\r\n\r\nFrankly, what could this stupid \"average viewer wants facts\" assumption bring but bitter disappointment? The result is not only boring, but really, really sad.","id":"5917a750c3a3683a93038457","url":"https:\/\/www.themoviedb.org\/review\/5917a750c3a3683a93038457","movie_id":1895}
{"author":"Gimly","content":"Truly the best of the bad _Star Wars_ movies, _Revenge of the Sith_ doesn't make a whole lot of sense, both when viewed as self-contained, and when seen as a part of the _Star Wars_ whole, but at least Lucas bothered to put a whole movie in here.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5e096a0f4c1d9a0019e73f0d","url":"https:\/\/www.themoviedb.org\/review\/5e096a0f4c1d9a0019e73f0d","movie_id":1895}
{"author":"Andres Gomez","content":"Good adaptation and performances from Knightley and MacFayden.","id":"5278c78f19c2955d331246fc","url":"https:\/\/www.themoviedb.org\/review\/5278c78f19c2955d331246fc","movie_id":4348}
{"author":"tmdb87389679","content":"The Protocols of Zion is really something that exists. It has been documented and it's still being applied today. This movie, like all movies that tries to shut down anyone that it's opposed to Zionism, tries to touch people's hearts by using strong images and also tries to make you feel bad and consider yourself antisemitic. Don't get fooled. This movie is just made to mislead you.","id":"5b4b335d0e0a26453b024ac1","url":"https:\/\/www.themoviedb.org\/review\/5b4b335d0e0a26453b024ac1","movie_id":33241}
{"author":"John Chard","content":"Superb slice of supernatural neo-noir.\r\n\r\nWritten and directed by Hadi Hajaig, Puritan stars Nick Moran, Georgina Rylance, Pete Hodge, David Soul and Ralph Brown. Music is by Simon Lambros and cinematography is by Peter Ellmore.\r\n\r\nSimon Puritan (Moran) is a medium in the East End of London. Tormented by the bad cards life has dealt him, he's become a alcoholic and battles with migraine headaches. When his latest client introduces him to Ann Bridges (Rylance), it spins his life onto another plane.\r\n\r\nLow on budget it may be, but Hadi Hajaig's movie has style and atmosphere to burn. Though set in modern London, Hajaig pitches Simon Puritan into a Gothic flavoured world. It's world where the spectres of Jack the Ripper and Aleister Crowley dwell, where architecture is by Nicholas Hawksmoore. Then the director fills this eerie backdrop with shadows and filtered light, enhancing the blood reds and the deathly blacks for maximum impact. There's the distinct whiff of the supernatural as Puritan finds himself in classic film noir territory.\r\n\r\nThe plot is deliberately labyrinthine as intriguing characters wander in to further cloud Puritan's perception. Some of the means and motives of the main players are at first glance murky, but as the makers blend genres, as Simon tries to crawl out from what is now a vortex of crime and dishonesty, it pieces together with a devilish glint in its eye. Ambiguities are one of the film's strengths, they drag us the viewers into Simon's confused state of mind, whilst simultaneously keeping us hooked into this most interesting and visually stunning picture.\r\n\r\nPerformances are only OK and the sound mix is sadly poor at times, but I'm convinced this would be better known and rated if more fans of noir could see it. 8\/10","id":"53804e740e0a2624bd00721b","url":"https:\/\/www.themoviedb.org\/review\/53804e740e0a2624bd00721b","movie_id":80541}
{"author":"Wuchak","content":"***Amazing filmmaking*** \r\n\r\nRELEASED IN 2005 and directed by Philip Adrian Booth, \"Death Tunnel\" is a well-made horror flick about five college gals (in lingerie) locked in a huge abandoned sanatorium in Kentucky where 63,000 people died of the \"white plague\" in the early 20th century. It's supposed to be a college initiation, but things go sour when the ghosts of the plague victims show up!\r\n\r\nThis movie successfully combines grisly locations & F\/X with stunningly beautiful women and a kinetic editing style for an amazingly entertaining film. What's more, the ending is actually moving. It boggles the mind to think of the time & effort put into creating this film. Such attention to detail and professionalism is rare, particularly in low-budget independent fare.\r\n\r\nNegative reviewers were no doubt turned off by the many flashbacks, flashforwards and flashbetweens in the first act, which confused them and turned them off. There's almost zero build-up of suspense due to the flashforwarding and the fact that the girls are shown whining in terror from their outset in the sanatorium. However, the story settles down in the second and third acts where it focuses on the five girls trying to get out of the sanatorium.\r\n\r\nI suspect the director and his brother, Christopher Saint Booth with whom he wrote the script, took this non-linear approach in the first act to disorient the viewer right out of the gate. If so, it worked. But this is understandably oft-putting to most people on their initial viewing because the movie requires you to concentrate in order for it to pull you in. For such people, I suggest re-watching the film, kick back, and just let it give you a good time. The story comes together as you are ultimately captivated by the movie magic.\r\n\r\nA more linear approach to the storytelling would've probably made \"Death Tunnel\" more compelling, but after re-watching the film it dawned on me that the Booth brothers were shooting for art and originality above horror conventions, which should be respected, which isn’t to say that there aren’t any obvious horror conventions in the movie. The fact that \"Death Tunnel\" is an artistic horror film rather than a conventional slasher flick explains the mass of negative reviews, but anyone who appreciates cinematic art should value this film.\r\n \r\nYou just have to be in the right mode and accept that this isn't a dialogue-driven, plot-driven movie that focuses on slowly building suspense. Instead, it's 90 minutes of horror and the entertaining elements thereof FROM THE GET-GO, which some people understandably can't appreciate.\r\n\r\nThe film was largely shot at Waverly Hills Sanatorium near Louisville, KY, which is a perfect location for a horror flick. As noted above, the film features numerous ultra-gorgeous women, particularly the ones trying in vain to get out of the sanatorium (e.g. Kristin Novak as Ashley, Melanie Lewis as Devon and Yolanda Pecoraro as Elizabeth). But there are even more, including a couple of the ghosts. The movie’s Grade A on this front. There's also a genuine aura of creepiness and a few good scares. Plus the modern metal song \"Disconnected\" by 9 Volt Revolt is excellent (featured in both the story and the end credits) counterbalanced by the haunting score by Christopher Saint Booth.\r\n\r\nAll of this gels together for a massively entertaining work of celluloid with the dynamic editing work particularly pulsating with creativity. Another reviewer related this kinetic editing style to Rob Zombie’s work in “House of 1000 Corpses” (2003), but that movie was a campy black comedy whereas “Death Tunnel” is serious horror. Besides, the innovative editing in “Death Tunnel” clearly ups the ante by comparison and is a marvel to behold. \r\n\r\nThe film runs 97 minutes.\r\n\r\nGRADE: B+\/A-","id":"5b21fa0d9251416e18012d41","url":"https:\/\/www.themoviedb.org\/review\/5b21fa0d9251416e18012d41","movie_id":9814}
{"author":"John Chard","content":"Just Death.\r\n\r\n1928, Kentucky. A horrific disease known as “The White Plague” claimed over 63,000 lives. A monstrous sanatorium was built to isolate the infected and play host to bizarre experiments in desperation to find a cure. Unable to cope with the large amount of corpses, a five hundred foot underground tunnel was constructed for the removal of these bodies, hiding the enormous death toll from the rest of the outside world. This was called “The Death Tunnel”.\r\n\r\nThe above opening salvo from Death Tunnel and the stories doing the rounds about spooky stuff happening during filming, are significantly better than the actual film. All things are in place for a rollicking haunted building movie, a genuinely creepy location with a bleak history (The Waverly Hills Sanatorium in Louisville, Kentucky), a young and pretty cast lining up to be terrified and continuing stories of real hauntings in the vicinity. What transpires, sadly, is a desperately derivative picture made worse by a group of film makers who on this occasion are out of their depth. \r\n\r\nThe writing doesn’t give the characters any depth to begin with, and then they are thrust into the horrors of the sanatorium and we are supposed to invest in them. Tension is in short supply as the same old same old routine of the girls walking around scared quickly gets dull. The editing and intrusive camera work shows a rookie director (Philip Adrian Booth) let loose unsupervised, making his film seem more like an over extended rock video by some Death Metal band. There’s no pausing for breath, something which makes the haphazard structure of the plotting even more baffling. While of course screeching levels of volume are over used throughout as Booth and company crib from a number of other – and better – horror movies.\r\n\r\nIMDb ratings are rarely a true measure of quality for films, especially with a diverse genre such as horror, yet Death Tunnel’s rating of 2.7\/10 is very very appropriate. The brains trust behind this movie could have done no worse than learning from Brad Anderson’s superb Session 9. Philip Booth and his brother Chris clearly love horror, but their subsequent genre films will need restraint and thought in equal measure. 2\/10","id":"54426c8fc3a3683dfb001f53","url":"https:\/\/www.themoviedb.org\/review\/54426c8fc3a3683dfb001f53","movie_id":9814}
{"author":"LJ_989","content":"With its hip lyrics and 50's styled character speak BRICK is an instant classic. It has a streak of REBEL WITHOUT A CAUSE in it. The eclectic arrangement of the deranged is inventive and full of texture. I own it and watch it often!","id":"5346d6110e0a265fec001c03","url":"https:\/\/www.themoviedb.org\/review\/5346d6110e0a265fec001c03","movie_id":9270}
{"author":"Gimly","content":"Funny how much more famous the actors playing the background gangsters got than the one playing the leader.\r\n\r\nFinal rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole.","id":"58985defc3a36877150084da","url":"https:\/\/www.themoviedb.org\/review\/58985defc3a36877150084da","movie_id":14695}
{"author":"John Chard","content":"I'm a soldier of the apocalypse, man! \r\n\r\nHarsh Times is written and directed by David Ayer. It stars Christian Bale, Freddy Rodriguez, Eva Longoria, Chaka Forman, Tammy Trull, J.K. Simmons and Michael Monks. Music is by Graeme Revell and cinematography by Steve Mason. \r\n\r\nSouth Central Los Angeles, and best friends Jim Luther Davis (Bale) and Mike Alonzo (Rodriguez) begin hurtling into violence that threatens to derail their respective future plans.\r\n\r\nThis was to be David Ayer's directorial debut, and with him already boasting the writing credit for Training Day, the comparisons between the two are hard to ignore - but that's ok right?! Bale goes full tilt as the unpredictable and unnerving Jim Davis, a scarred Gulf War Veteran on a road to self destruction. Question is, will he take his best friend with him?\r\n\r\nThis is very much about Bale's barn storming show, which while it  thrills us greatly, it also hinders the Rodriguez characterisation of Lopez, making the pic a bit lop-sided. Narrative threads focus on the scrapes the pair get into, whilst in the background their love partners are waiting for their men to wake up and commit. Another features Davis suffering bad dreams from the war, all while he is head hunted by Homeland Security after he had failed to get into the LAPD. Davis firmly believes he belongs in the protection business, if only his habit for finding trouble wasn't so prevalent...\r\n\r\nThe violent action scenes are brisk and bloody, marking this out as a hard movie for sure, a hard movie with dialogue to match. Yet it's also a pic laced with black comedy, where there's a perverse pleasure in watching Davis and his not very bright cohort being bad boys. Longoria is not done any favours in the writing, but it's kind of ok since this really is about a friendship spiralling towards a day of reckoning that we obviously know is coming. Which when it comes to us, does not disappoint at all and leaves us some reflecting to do as the adrenaline finally slows down. 7.5\/10","id":"5d8406a87aecc6022008d398","url":"https:\/\/www.themoviedb.org\/review\/5d8406a87aecc6022008d398","movie_id":7873}
{"author":"John Chard","content":"Do not do so lightly! If chosen, there's no turning back. As from this moment, The Triwizard Tournament has begun!\r\n\r\nYear four at Hogwarts for Harry Potter and his chums, and it's a time of change, chance and danger. The prestigious Triwizard Tournament is being hosted and the applecart is turned upside down when Harry, unqualified and underage, is selected by the Goblet of Fire to be one of Hogwarts' competitors. If the thought of competing in such a dangerous tournament wasn't scary enough, Harry also has the worry of finding a date for the Yule Ball to contend with! \r\n\r\nThe Prisoner of Azkaban set the marker for a darker, more grown up Potter picture, a high standard that Goblet of Fire, and new director Mike Newell, arguably had no hope of attaining. But it's not for lack of trying, and in fairness Newell and the team have managed well enough to blend the blackness that comes with the impending arrival of Lord Voldermort (Ralph Fiennes), with the burgeoning ping of teenager hormones. There's an awful lot going on here. With the Triwizard Tournament comes two groups of exchange students to Hogwarts in the form of the glamorous girls of Beauxbatons Academy, and the hunky boys of Durmstrang Institute. The arrival of which sends Ron, Hermione and co into blushy flustered awakenings. The tournament itself (rightly) dominates much of the film, the lead up to it and the three challenges that the competitors have to face, with Harry's dragon face off a bona fide excellent piece of film. Then on to the fall out of the tournament where it gets real dark and the film and series lurch on to another level and set up the next installment a treat. \r\n\r\nAs is customary for a Potter film, there's also a number of new characters and replaced characters in the mix, while major story developments flit in and out of the narrative to the point you really have to pay attention completely. Of the new arrivals it's Alastor \"Mad-Eye\" Moody (Brendan Gleeson terrific) who is most telling and enjoyable, but tabloid scribe Rita Skeeter (Miranda Richardson) is something the film could have survived without. Yes it's a nice pop at the gutter press, but watching it now, would the time spent wasted on Skeeter not have been better served on the sadly under filmed Quidditch World Cup? Especially considering the build up to it is magnificent. Or at the very least some more Malfoy Senior, Sirius or Snape! But the disappointment felt there is offset some by the wonderful Yule Ball, where Newell is in his element gleefully dangling his charges through the joys and sorrows of awkward awakenings. It's a series highlight that's not to be missed.\r\n\r\nA film of variable pace due to the makers trying to juggle so much, it's ultimately something of an up and down viewing experience. That said, Newell is able to dazzle the pre-teens with his set pieces, because the kiddies sure as hell will not understand the angst and hormonal issues present, while the rest plays out on adult terms. So something for everyone, then. It may not be successful as a whole, and newcomers dipping in for the first time get no guidance at all, but it's still a ripper of a ride for those who are into the films having not read the books. It's set up nicely for part 5, but pity poor David Yates in the directing chair for Order of the Phoenix, though, for that is one hell of a door stopper novel to try and condense down into an entertaining Potter movie! 7\/10","id":"5c4f24d60e0a264965d7f7b8","url":"https:\/\/www.themoviedb.org\/review\/5c4f24d60e0a264965d7f7b8","movie_id":674}
{"author":"kaushikdjay","content":"A must watch Social Documentary on Drug Addiction. One of my friend suggest me to see this Documentary.","id":"59f9adeac3a3682d50011795","url":"https:\/\/www.themoviedb.org\/review\/59f9adeac3a3682d50011795","movie_id":310911}
{"author":"Gimly","content":"Probably the best thing Shane Black's ever made, and I do not say that lightly, even the worst things he's behind have been okay, and the great (like _Kiss Kiss Bang Bang_) are truly great. The movie that turned me on to lead man Robert Downey Jr., but it's Val Kilmer that steals the show here.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5c446dc8c3a36819fd24ab58","url":"https:\/\/www.themoviedb.org\/review\/5c446dc8c3a36819fd24ab58","movie_id":5236}
{"author":"aya zein nassar","content":"That's the real title, whomever submitted it for IMDb, must have shortened it.\r\n\r\nAnyways, Egyptian superstar Hanane Turk stars as sultry Dunia, a young woman who is sexually repressed according to society and this inhibits everything she does. One day she auditions for an oriental dance competition (think the type of Jennifer Beals audition from Flash Dance) and is stopped by the judges because of her lifeless performance. They are captured by her obvious beauty but do not buy her lifeless rendition of Arabian poetry. It is her obstinate rebellious nature that drives them to select them, when she challenges the jury to show her how she is supposed to display love when society forbids her to do so. She catches the eye of Beshir (Mohammed Mounir) who takes her under his wing, hoping to rescue her from a dark secret from the past as well as make her his muse.\r\n\r\nThe forbidden attraction between them in unmistakable and only deepens as Dunia awakens to the sensuality hidden beneath her traditional values. Turk, a trained dancer in real life is flawless in the dance sequences and she has a body to die for. Her costumes are great as well. By the way, all the magnificent songs in the film are performed by none other than \"The voice of Egypt\" Mohammed Mounir. Dunia is a force to reckon with as she raises awareness to the trials and tribulations associated with being a woman in Egypt. Walid Aouni plays Dunia's dance teacher, Khaled El Sawi & Youssef Ismail co -star. Controversial but also a must see!","id":"50731094760ee30ea200134d","url":"https:\/\/www.themoviedb.org\/review\/50731094760ee30ea200134d","movie_id":136510}
{"author":"Wuchak","content":"Good start and ending, weak middle, but magnificent photography and haunting score  \r\n\r\n\"Kingdom of Heaven\" (2005) isn’t as good as contemporaneous sword & sandal flicks \"Troy\" (one of my favorites) and \"King Arthur\" (very good), but it's not bad either.\r\n\r\nTHE PLOT: After the death of his child and suicide of his wife, Balian (Orlando Bloom) meets his long, lost father (Liam Neeson) who encourages him to go to Jerusalem and start a new life. After a long eventful trip, Balian arrives in Jerusalem and is introduced to Princess Sibylla (Eva Green), the leprous King Baldwin and other VIPs. The political maneuverings of these key personnel is mindboggling (I suggest using the subtitles to keep track of who’s who) but, when all is said and done, Balian must rise to the challenge of defending the city against Saladin (Ghassan Massoud) and his great Muslim army.\r\n\r\nLike \"Lawrence of Arabia\" (1962), \"Kingdom of Heaven\" is a film that can be enjoyed just for the visuals and soundtrack. The film was shot in Morocco where a vast replica of ancient Jerusalem was built in the desert with the backgrounds enhanced by CGI effects, and so on.\r\n\r\nStory-wise, the beginning and ending are strong while the convoluted soap operatics of Jerusalem aren't very compelling, but Eva Green's awesome eyes help.\r\n\r\nI'm no connoisseur of the crusades but I realize the filmmakers put a modern spin on the events and ideology of the characters. So what else is new? In any case, I was impressed that all the main players are based on real-life people and that the gist of the story is accurate.\r\n\r\nThe Theatrical Cut runs 144 minutes and the Director's Cut about 48 minutes longer. The DC is heralded as one of the best DCs ever, like \"Daredevil\" (2003).\r\n\r\nBOTTOM LINE: \"Kingdom of Heaven\" is worth it just for the magnificent visuals and soundtrack. The story starts strong and ends strong while the dramatics of the lengthy mid-section are complicated and not very compelling. But story drive and interesting characters were never director Ridley Scott’s strong suit. Nevertheless, Orlando Bloom is likable as the protagonist and Massoud makes for a striking Saladin, who doesn’t appear till the halfway point.\r\n\r\nGRADE: C+\/B-","id":"5baaa15492514150ff009293","url":"https:\/\/www.themoviedb.org\/review\/5baaa15492514150ff009293","movie_id":1495}
{"author":"John Chard","content":"It's literally like someone took America by the East Coast and shook it, and all the normal girls managed to hang on.\r\n\r\nKiss Kiss Bang Bang is written and directed by Shane Black. It stars Robert Downey Jr., Val Kilmer and Michelle Monaghan. Music is by John Ottman and cinematography by Michael Barrett. \r\n\r\nSmall time thief Harry Lockhart (Downey Jr.) is running from the police and stumbles into a movie audition and gets the part! Partnered with private detective Gay Perry (Kilmer), who is to show him the ropes for the part he's to play, things turn just a little weird when dead bodies start turning up in his life\u0085 \r\n\r\nShane Black's first venture into big feature film directing is a master class of genre bending bravado. The screenplay and script bare all the hallmarks of Black, where anyone familiar with his writing work previously will know where to set expectation levels as per barbed dialogue and blitzkrieg energy. Yet this is very much one of a kind, a standalone of such dizzying thrills and shameless awareness of movie conventions, it practically begs to be visited on more than one occasion. \r\n\r\nTo simplify it, it's a neo-noir \u0096 murder mystery \u0096 bromance \u0096 romance \u0096 comedy \u0096 actioner! OK, so not really that simple, then! Black takes a loving homage to pulp cinema and mixes it with caustic asides to the Los Angeles industry that provides him with work. How wonderful. Downey's (fabulous) Lockhart is the fulcrum, acting as antagonist, protagonist, narrator and a number of other things as Black runs him through the meta mangler. Kilmer (also fabulous) sidles up to deliver sarcasm, machismo and tongue in cheek posturing, the chemistry with Downey concrete. An odd couple pairing beautifully baring fruit, and, well, just beautiful really. \r\n\r\nInto the mix is the gorgeous Monaghan, who as Harry's childhood object of affection, is now a failed actress, slightly damaged, but strong and savvy, but also not, an unconditional femme fatale, but also not really! Corbin Bernsen (whose company produced the pic) files in for some joy filled has-been smarm, while sound tracking and photography sit comfortably with the nature of the beast. As a plot it's deliberately complex and convoluted, Black knows his noir onions, but he also wants to put his vibrant stamp on things, so he crowbars the comedy of The Hard Way into the hardboiled haze of The Big Sleep. And it works very well indeed. \r\n\r\nViolence is aplenty but very much irreverently played. Murders occur, either by design or otherwise, various body parts get assaulted and they shouldn't make for belly laughs, but they do; and not in some lame Weekend at Bernie's way either. And yet still Black has time to trickle sad themes below the surface, one in particular really hits home and forces the viewer to snap out of the frivolity for some reflection. Make no bones about it, these are damaged characters straight out of noir's dark alleyways in the 40s and 50s. So Capra meets Siodmak - Dmytryk - Mann - Tourneur - Wilder...then? \r\n\r\nSmarty pants film making makes for smart entertainment, see it more than once. Hell! See it annually in fact. 9\/10","id":"5cd870050e0a265350cc5a90","url":"https:\/\/www.themoviedb.org\/review\/5cd870050e0a265350cc5a90","movie_id":5236}
{"author":"Andres Gomez","content":"Funny story, tailored for Robert Downey Jr. with a superlative Michelle Monaghan. Val Kilmer shines like in movies some years ago.","id":"5677a8bec3a368168500824c","url":"https:\/\/www.themoviedb.org\/review\/5677a8bec3a368168500824c","movie_id":5236}
{"author":"Wuchak","content":"***Originally titled “Attack of the Blurry Ape”***\r\n\r\nThe Asylum’s “King of the Lost World” (2005) is a TV knockoff of Peter Jackson’s “King Kong,” released one day before that blockbuster during Christmas. While there’s a giant ape and an island of colossal creatures, the similarities end there. This has more to do with Arthur Conan Doyle's fantasy\/adventure novel “The Lost World” (1912) than “King Kong.” The plot revolves around a group of survivors of a plane wreck who search the mysterious island; and clash with the giant creatures & primitive-type people that dwell there.     \r\n\r\nThe movie only cost $1 million and the blurry CGI creatures look it. If you can get past that, there’s quite a bit to like here for fans of comic book adventure flicks, especially of the lost on a deserted island variety. Imagine “Mysterious Island” (1961) if it was done on a miniscule budget, like \"Planet of the Dinosaurs\" (1977), and that’s what this is. \r\n\r\nThe Asylum’s “The Land that Time Forgot” (2009) is comparable, but that one had over double the money to spend, as did the 1974 film with Doug McClure. Another point of reference is those cheesy primeval flicks from Hammer back in the day, like “The Lost Continent” (1968) and “When Dinosaurs Ruled the Earth” (1970).\r\n\r\nIf you don’t appreciate Grade B (or Grade C) adventure fare like this I’d suggest passing but, if you can roll with it, the story and cast are decent, highlighted by curvy Sarah Lieving in form-fitting shorts, not to mention a couple others. The Southern Cal locations feature magnificent coastlines, lush jungles, cool caves and barren landscapes.\r\n\r\nThe film runs 1 hour, 20 minutes and was shot at Pikake Gardens, Valley Center, and San Diego County, California.\r\n\r\nGRADE: C","id":"5c1ccaba92514127f34e4068","url":"https:\/\/www.themoviedb.org\/review\/5c1ccaba92514127f34e4068","movie_id":31394}
{"author":"John Chard","content":"They just couldn't leave him on his island could they...\r\n\r\nKing Kong is directed by Peter Jackson and Jackson co-writes the screenplay with Fran Walsh and Philippa Boyens. It's based on a story by Merian C. Cooper and Edgar Wallace. It stars Naomi Watts, Jack Black, Adrien Brody, Thomas Kretschmann, Colin Hanks, Andy Serkis, Evan Parke, Jamie Bell and Kyle Chandler. Music is by James Newton Howard and cinematography by Andrew Lesnie.\r\n\r\nAfter completing the hugely successful Lord of the Rings trilogy, Peter Jackson turned his attentions to a reimaging of that daddy of classic creature features, King Kong. With all the new tools of the trade to hand, Jackson set about making a Kong film full of love and respect the original from 1933, whilst obviously making his own beast as it were. Story remains the same, mankind sets off to a fabled place known as Skull Island, there they find beasties not of this world, not least a gigantic mountain of a gorilla. They stupidly bring him back to America for money making exercises and things go really bad. The End.\r\n\r\nI have personally found it most interesting re-watching the film nearly 15 years since its release, especially given we have not long had a different Kong reboot with \"Kong: Skull Island\" in 2017. For the differences, for better or worse depending on your proclivities in Kongdom, are enormous. Kong: Skull Island is a no brain adventure yarn, high on action but low on intelligence, but it does know it. Jackson's Kong aspired to be much more cerebral, and for the most part it achieves it. Sadly it takes a whopping 3 hours to reveal its intentions, which was a problem to many back in 2005, and is still a hindrance sitting down to watch it these days - this even knowing and preparing once again for how long it is. Frustratingly there's a great film in the mix just crying out for an hour of extraneous filler and clunky dialogue to be jettisoned. \r\n\r\nOnce set up has been achieved in the first hour, we finally get to Skull Island and it's an absolute technical treat. The look is fantastic, the turn of events as Kong and his acolytes have been introduced is terrific. From here it's creature feature mayhem, the beauty and the beast aspect kicks into gear, and it's all very comforting, thrilling even - with one exception. A dinosaur stampede looks ridiculous, the blend of human actors and CGI is so poor it belies the money spent on the effects for this production. That aside, though, the action sequences are electric, particularly the monster mash ups. Yet the quite reflective periods on Skull Island really strike a chord as well, just sections where Kong and Ann Darrow (Naomi Watts) are chilling out together, taking in the landscape that money mad men want to take Kong away from...\r\n\r\nThen it's back to The States and carnage ensues, culminating in a brilliantly staged last quarter of film, where all that superb period detail gets obliterated during the battle between man and beast, and where even now I'm rooting for Kong to win! As the tenderness of the Beauty and the Beast arc subsides - and it is beautiful - it's then that you once again know that Jackson was too indulgent. His cast were on form, Serkis as Kong a revelation, this is a great picture at times, a real treat in High Definition, if only someone had fronted him up to not over indulge. For then we might have a 9\/10 movie as opposed to a bloated 7\/10 one.","id":"5cef40810e0a262318c98e11","url":"https:\/\/www.themoviedb.org\/review\/5cef40810e0a262318c98e11","movie_id":254}
{"author":"microscope","content":"2 hours of tedious boring nonsense.","id":"591785cf925141580d03843a","url":"https:\/\/www.themoviedb.org\/review\/591785cf925141580d03843a","movie_id":5236}
{"author":"Gimly","content":"A moderately engaging climax, but otherwise quite the bore.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"591692b8925141580d029d25","url":"https:\/\/www.themoviedb.org\/review\/591692b8925141580d029d25","movie_id":19166}
{"author":"Wuchak","content":"Engrossing and imaginative modern Mystery\/Horror with Elisha Cuthbert \r\n\r\nRELEASED IN 2005 and directed by Jaume Collet-Serra, \"House of Wax\" is a horror\/slasher about six college students (4 dudes and 2 gals) who drive from Gainesville to Baton Rouge to attend a crucial football game. They end up camping in the woods somewhere off I-10 where some of the party discovers a mysterious town in the sticks that has a curious House of Wax. Horror and death ensue.\r\n\r\nThis is not a remake of the splendid 1953 Vincent Price cult flick of the same name. The only thing these two films have in common is their title, their genre, and the fact that they both involve a wax museum. It's therefore pointless to compare them as they are two totally different stories. Plot-wise, \"House of Wax\" is an obvious mixture of the original \"Texas Chainsaw Massacre\" (1974) and the 1953 film of the same name, along with elements of more modern flicks like “Wrong Turn” (2003) and torture porn.\r\n\r\nAlthough the first 12 minutes or so are unimpressive with too much annoying shaky cam, the story starts to capture your attention at the camp-out sequence. From there their encounter with a horrible stench, a local hick, and the mystery of the isolated town & wax museum gradually pulls you in. The fairly slow initial 50-minutes are a crucial character-building and mystery-developing foundation to the final horrific hour.\r\n\r\nThe major protagonist of the story is Carly, played by Elisha Cuthbert, who was only 22 during filming and never looked better with her curvy cuteness. The glamorous and infamous Paris Hilton also stars and does a commendable job, but Elisha basically blows her out of the water as far as all-around beauty goes.\r\n\r\nSpeaking of Ms. Hilton, in light of the ads to “Come see Paris Hilton die,” it’s no secret that her character does indeed buy the farm and, the way it happens, is pretty amusing. The film's worth checking out for this scene alone, especially if you despise her.\r\n\r\nThe picture was shot in Queensland, Australia, of all places, but it works alright as a stand-in for the Deep South, although I don’t recall any hills along I-10, as depicted in the background of the town. Speaking of the town, it doesn’t look like a Deep South town, but rather a contrived set. Nevertheless, the filmmaking is top-notch in all categories with the rest of the no-name cast doing a fine job. As a matter of fact, the six college kids are all rather likable; even Nick (Chad Michael Murray), Carly’s supposedly 'black sheep' twin, once he shows his true colors.\r\n\r\n\"House of Wax\" works fabulously for what it IS, a mystery\/slasher flick. The unlikely story is played straight and serious by all involved; there's no silly \"comedic relief\" or camp to be seen. Everyone knows going in that this isn't going to be \"Gandhi.\" But if you're in the mood for an entertaining and imaginative mystery\/horror picture, look no further. \"House of Wax\" has practically everything you’d want in such a film. Why do I describe it as imaginative? See the conclusion's spectacular melting wax museum and you'll understand; this is F\/X at its finest.\r\n\r\nTHE MOVIE RUNS 1 hour, 48 minutes. WRITERS: Chad Hayes & Carey W. Hayes.\r\n\r\nGRADE: B+","id":"5b4bd7f90e0a26453402e1f4","url":"https:\/\/www.themoviedb.org\/review\/5b4bd7f90e0a26453402e1f4","movie_id":10066}
{"author":"Reno","content":"> High quality narration, low standard production! Yet wins fairly.\r\n\r\nI'm shocked, this is not a Disney's or the Pixer's, not even DreamWorks' or the Sony's, but a very good film. I meant only the story, though the animation was outdated, even for a film from the 2005. I had trouble watching it in the initial parts, because of the poor technical quality. Once the flashback began, I totally hooked to it and forgot the production standard. The film was saved because of the very good story.\r\n\r\nYou know retelling the same old tale is so old fashioned, telling a tale in the different angles and adding more flavour to it is the new thing. Like for example the recent 'Maleficent'. So other than those all the awesome qualities, the film is more a television type. But very enjoyable by all.\r\n\r\nIt has been a decade since it came out and I never tried it because someone told me that it's very bad, but I regret for believing that and ditching it. So believe me it is a wonderful film, except it's not a top notch presentation. It is too short and well worth spending your 80 minutes for it. There's a sequel to it, so I want to try it as well and let you know how it is in another review under that title.\r\n\r\n6\/10","id":"5752e97dc3a3684b6a00013f","url":"https:\/\/www.themoviedb.org\/review\/5752e97dc3a3684b6a00013f","movie_id":10982}
{"author":"John Chard","content":"Sounds like Boo...\r\n\r\nBunch of pretty teens convene at an old abandoned mental hospital for Halloween. Things go awry.\r\n\r\nWritten and directed by Anthony C. Ferrante, Boo is either a loving homage to all things involving \"haunted house\" cinema? Or one of the laziest horror movies made in 2005?\r\n\r\nEverything but the kitchen sink is thrown at the audience for this one, with the sound mix turned up to the max for, erm, max impact. The fear of this, the fear of that, what's real? What's not? And let there be blood! There will be blood!\r\n\r\nActing is ordinary, as is the writing, but scene setting and location filming is not half bad. In a nutshell, it's a horror film that you show to your pre-teen family members to prep them for far better horror pleasures in their up coming adult life. 4\/10","id":"543f7f69c3a3685e33001288","url":"https:\/\/www.themoviedb.org\/review\/543f7f69c3a3685e33001288","movie_id":20215}
{"author":"John Chard","content":"It's not who I am underneath, but what I do that defines me.\r\n\r\nBruce Wayne is constantly tortured by his childhood memories when he witnessed his parents being murdered. Taken under the wing of The League Of Shadows, a deadly ninja assassin army devoted to erasing crime with their own brand of harsh justice. After completing training, Wayne refuses to join them on account of not agreeing with their methods, he returns to Gotham City to reek his own one man war against crime.\r\n\r\nDirector Christopher Nolan literally goes back to Batman origins to not just give the dead franchise a kiss of life, but actually to spark it into a sort of triumphant homecoming. Gone is all forms of camp veneer so evident in Joel Schumacher's offerings, and in place we have a darkly rich picture intent on fleshing out Batman's motives, and crucially, his fractured persona.\r\n\r\nOne of the most pleasing things to me was that Nolan paced this picture to perfection, the build up of character, and then birth of the Bat, dominates for practically the first hour of the piece. This gives Batman Begins some crucial heart, it really helps us to focus on this weird super-hero now that we have some meat on his bones. We then follow Wayne from a Chinese prison to The League Of Shadows monastery, watching his transformation from brawling man of anger into a controlled fighting machine. A machine that still roams with a revenge laden heart.\r\n\r\nThen its to Gotham City where he then births Batman and all bad guys are on his agenda. Mob boss Falcone, the mysterious Scarecrow, and also a face from his past that rears its surprising head. Wayne is driven by powerful motives, and it's here in the second part of the film that Batman Begins rewards those who indulged in the character build up. In come the stunts and outrageous sequences, all played out in Nolan's desperately dank Gotham City (a far cry from Tim Burton's dark Oz like scapes). This Gotham is pot boiling to disaster and is crying out for the Bat to sweep all before it, and thankfully Nolan and his cast fulfil all the early promise to deliver a wonderful action fantasy that caters for all ages.\r\n\r\nChristian Bale dons the Batsuit and it fits like a glove, his Bruce Wayne may lack the ebullient charisma that Michael Keaton's had, but his Batman is mean and moody and comfortable with the zippy dialogue. Michael Caine plays Alfred the loyal servant to the Wayne family, much heart and emotive drive from Caine ensures the role is a roaring success. Cillian Murphy is Dr Jonathan Crane\/Scarecrow who actually scares more as Crane with his piercing eyes and devilishly smirky leer, whilst both Gary Oldman (Jim Gordon) & Morgan Freeman (Lucius Fox) are solid with what little they actually have to do. Liam Neeson gets his teeth into a meaty role as Henri Ducard, and as a character arc he gets the best scenes (Nolan clearly having great fun here).\r\n\r\nMinnor let downs to me without hurting the picture are Katie Holmes (pretty but hardly convincing as Assistant D.A. Rachael Dawes) and Rutger Hauer as Earle (a little bit of menace wouldn't go amiss here Rutger old man). Still, as I said they are very minor let downs because as comic book adaptations go, Batman Begins is from the top draw, a franchise re-suited, rebooted and completely reinvigorated. But now the test comes with that all important sequel... 9\/10","id":"5424a6ac0e0a264576000114","url":"https:\/\/www.themoviedb.org\/review\/5424a6ac0e0a264576000114","movie_id":272}
{"author":"Reno","content":"**The comedy about a second chance.**\r\n\r\nI'm reviewing a decade old film. This kind of themes is very much done for the current era, particularly in Hollywood. You can't believe this guy did a film like this back then. I'm obviously talking about Ryan Reynolds. It was just for fun, other than that there's nothing to expect from it. Clearly we know how the story begins and ends, but we're only going to see the middle parts, how they developed it, especially the comedies.\r\n\r\nAll the actors were decent, particularly Amy Smart was much preferred actress than what she's now. Ryan Reynolds with those dual getups was not bad either and Anna Faris was excellent in the comedy parts. Maybe it is a chick film, or close to that category, but the perspective of the story was from a man.\r\n\r\nBeing a geek in the high school, how he transformed into a handsome man is the film. When he visits his hometown, all the old memories comes back to the life, particularly after seeing his old close friend who he had a crush on her, but never revealed it. So it is like his second and probably final chance to express his feeling. How it all develops and ends was the remaining story.\r\n\r\nBeing a comedy, it has not delivered anything big. It might have effected good way, if I had watched when it came out. So not everyone who watches it would end up happily. It is not easy to suggest this film for everybody, but if you're looking for a comedy, some comedy, it will work okay. And again, don't take it seriously, even some of the jokes are too ordinary, but tried its best. An average comedy, but a good time pass film.\r\n\r\n_5\/10_","id":"57ed8793c3a3686d010003ba","url":"https:\/\/www.themoviedb.org\/review\/57ed8793c3a3686d010003ba","movie_id":10033}
{"author":"Stephie59","content":"I just watched this movie, Confession. From the time it started I was intrigued. First of all I love Chris Pine and think of him as a good actor. The movie started off as very interesting and continued so til the end. However, there are some things I didn't like.\r\n\r\nWithout giving away much, I felt that the priest who was accused (that's in the synopis so I'm not giving anything away), had me very annoyed because I felt he could have said something without breaking his vows.\r\n\r\nThe detective did not do due diligence in trying to find out more about the crime because he was so hell bent on believing the priest was guilty. I also think they could have fleshed out his reason for his distrust\/hatred of priests.\r\n\r\nI can forgive the director because I understand he wrote this when he was just 14 years old at a prep school and directed this in his early twenties. So I would give him A for Effort. Still a very interesting story and a good watch if you want a little intrigue. Would love to know what others thought of it.","id":"5998c965c3a368226801826f","url":"https:\/\/www.themoviedb.org\/review\/5998c965c3a368226801826f","movie_id":68612}
{"author":"markuspm","content":"Somehow I feel this movie in a way focuses more than others on feet. I know it sounds strange and I might be alone in my perception but hey this might be useful information for someone.","id":"52b7d8ee19c29535db023246","url":"https:\/\/www.themoviedb.org\/review\/52b7d8ee19c29535db023246","movie_id":561}
{"author":"sonofbalkans","content":"Childish in concepts and a little bit ideological. I like the costumes and atmosphere.","id":"5adde6680e0a26143203c00c","url":"https:\/\/www.themoviedb.org\/review\/5adde6680e0a26143203c00c","movie_id":9681}
{"author":"bobbeijing","content":"Ottar Thor (Bjorn Hlynur Haraldsson) is the handsome, arrogant star player of a pro soccer team, as well as main breadwinner for a family in which the overbearing males seem to spend most of their time telling long-suffering wives to shaddap. Ottar is divorced from his spouse, a former Miss Iceland (Lilja Nott as Gugga) turned full-time alcoholic. They share custody of adolescent son Magnus (Arnmundur Ernst), who buries himself in videogames.\r\n\r\nOttar doesn’t think about the repercussions when he decides to tell a journalist — in the locker room after a game — that he’s gay. His motivation is no loftier than securing a magazine cover for himself. But teammates, the conservative owners, and everyone else immediately freak out. Ottar finds himself banned from play, and for lack of anything else to do, joins a friend’s amateur league team, which already has a couple of gay guys on board. Soon more show up — drawn by the protag’s notoriety — as hetero players flee.\r\n\r\nReconstituted squad’s league status skyrockets, even if its winning streak is largely a matter of forfeits by rivals who refuse to play the “queers.” Meanwhile, Ottar’s former team is suffering a publicity backlash from having kicked him out. They want him back — even if they’re still nowhere near to accepting “the gay thing.”\r\n\r\nThings culminate in a farfetched but agreeable showcase match between amateurs and pros, which just happens to be scheduled on Gay Pride Day.\r\n\r\nA similarly acerbic but not unkind humor pervades the story’s other threads. Ottar’s parenting skills are fairly lousy, but he does care, as does the generally hapless Gugga. Magga’s rising hostility turns out to be based not in homophobia, but in the fact that no 13-year-old is thick-skinned enough to welcome a parent’s coming out in the national media.\r\n\r\nWhen Ottar tries to settle down into his new lifestyle by going steady with a teammate, the effort flops — because he chooses a partner even more shallow than he. Subsidiary characters — notably, the hero’s incredibly obnoxious father (Sigurdur Skulason) and brother (co-scenarist Jon Atli Jonasson — have no redemptive qualities, but make up in sheer hilarity whatever they lack in psychological nuance.\r\n\r\nPerfs are perfectly in tune with the director’s deadpan yet boisterous tone. Design contribs hit the right gritty but polished note, while the tech package is first-rate.","id":"552d46bb9251413d210016f0","url":"https:\/\/www.themoviedb.org\/review\/552d46bb9251413d210016f0","movie_id":5286}
{"author":"Termino","content":"\"Curse of Lola\" is a thrilling tale about love, jealousy, and the end that either can drive a person! When I first saw it at Blockbuster, I was surprised it was at the \"New Release\" section-- usually they just stick Foreign films in a far off castaway corner. This movie is hardly an epic, but it has strong casting and developed characters. Tg is a great leading man in this movie. In the beginning, the plot is slow to build (it happens in a lot of movies, actually-- usually the better ones!) but after it has 'built' it is an mellow-paced movie. You (the audience) know more than most of the characters, but the film makers still hold the key-- they can come out and surprise you whenever they want. That's what makes this movie so great.\r\n\r\nThe movie builds its strength off the music (which is done beautifully) and the silences. This movie is blissfully quiet, and serene. Sound in a movie is extremely important, to build mood, to build the scene, and in \"Curse of Lola\" it sets the stage for the audience very well.\r\n\r\nIf you go into this movie expecting a horror flick, or be scared out of your seat, you will be disappointed. This movie is not face paced, it is steady + deep.\r\n\r\nThe script and special effects are really well done. The camera at times I thought could have done some different angles, but the vivid colors of the flashback scenes + the preceding music were really well put together.\r\n\r\nOVERALL: 9 out of 10 for beautiful music, dancing, and a great cast!","id":"534cb0a8c3a3686075000544","url":"https:\/\/www.themoviedb.org\/review\/534cb0a8c3a3686075000544","movie_id":264718}
{"author":"ThorsDay","content":"It's story isn't bad (although it's full of clichés) and it does have some likable characters but it's budget, script, and acting (in particular Brianne Davis) are all pretty awful.","id":"527608d0760ee3353f22581f","url":"https:\/\/www.themoviedb.org\/review\/527608d0760ee3353f22581f","movie_id":86254}
{"author":"Andres Gomez","content":"The stereotypical sports movie about a character which goes from glory to hell and back to the glory again.\r\n\r\nThe story is OK, but nothing new. Crowe performs well, but it is not one of his best movies. Giamatti is great, as always but Zellwegger is too cheesy in her role.\r\n\r\nJust an entertaining movie without any more intentions.","id":"56f0850fc3a3687186000eac","url":"https:\/\/www.themoviedb.org\/review\/56f0850fc3a3687186000eac","movie_id":921}
{"author":"John Chard","content":"This is the captain. We have a little problem with our entry sequence, so we may experience some slight turbulence and then - explode.\r\n\r\nSerenity is written and directed by Josh Whedon. It stars Nathan Fillion, Gina Torres, Alan Tudyk, Morena Baccarin, Adam Baldwin, Jewel Staite, Sean Maher, Summer Glau, Ron Glass and Chiwetel Ejiofor. Music is by David Newman and cinematography by Jack N. Green. \r\n\r\nWhen the captain Mal Reynolds (Fillion) of the space craft Serenity takes on board Dr. Simon Tam (Maher) and his troubled sister River (Glau), it thrusts the entire crew into a world of conspiracy and galactic despots. \r\n\r\nComing at it as a complete novice as regards \"Firefly\", the short lived TV show that Serenity is spawned from, I personally have no frame of reference to work from. What I found was a hugely enjoyable sci-fi Western hybrid that deserved a better box office than it got. The cast are all comfortable with each other and very watchable, which isn't surprising since Whedon has transported them all over from \"Firefly\", good move that, while the action quota is high and the black comedy rich.\r\n\r\nWhere the itches start to appear for newcomers like myself, is that it does feel like an extended TV episode. With a twisty plot that sees Whedon cram much into the 2 hour running time, it demands the utmost attention. Which is fair enough to a degree, but many go (or more pertinently would have gone) into \"Serenity\" for a sci-fi action adventure, not for a tickle of the cranium. If this contributed to the poor show at the box office? I'm not sure. But you have to think this really was only made for the die-hard fans of the show.\r\n\r\nGalling really, because the last third is a ripper of a blockbuster. The action sequences are expertly crafted, the story explodes still further and the principal characters really let loose, particularly the excellent Fillion. Biggest plus of all, the finale doesn't cop out by insulting those who have stayed the course chartered by the good ship Serenity and its crew. It's smart genre film making, a very enjoyable film without doubt, but really it's not got mainstream appeal. Which might suit those die-hards in a selfish kind of why, but that also means we are unlikely to get a sequel. And that's a shame because a newbie like me could easily stand some more of this whizz bangery. 7\/10","id":"5d8a1bffc58acd00192ef36b","url":"https:\/\/www.themoviedb.org\/review\/5d8a1bffc58acd00192ef36b","movie_id":16320}
{"author":"Matthew Sanders","content":"This was an extremely poor movie. The weakest character during the TV series, River Tam, confusingly became the story focus in this movie.\r\n\r\nDespite never exercising and having a small frame, River fought and K.O.ed a room full of bar patrons.\r\n\r\nThe crew, mysteriously, were devoted to going to the planet River wanted to visit to help her discover her past despite showing various degrees of hostility toward her during the series ranging from open contempt to advocating her murder.\r\n\r\nThe main villains do not make sense. They are, supposedly, so wild that they regularly sack planets and cannibalize its inhabitants, but can still work together well enough to fly space ships. The entire population of these wild people came from the planet River wants to visit and from a single research facility. I'd guess about 1,000 research and support personnel were initially infected. They have no way of infecting further individuals, the facility was shut down, and yet their current population is many times the original amount. How?\r\n\r\nThe plot does not make sense. It is not engaging. None of the characters are interesting. The characters die without emotional impact. Pass on this movie. Like the TV series, this is a waste of time.","id":"52e5b3e4760ee34a5e0fa5d0","url":"https:\/\/www.themoviedb.org\/review\/52e5b3e4760ee34a5e0fa5d0","movie_id":16320}
{"author":"anthonyryan1","content":"A nice wrap-up to Firefly, unfortunately far too condensed. In may ways it felt like they took the major events that would have spanned the next 2 or 3 seasons and crammed it all into a 2 hour movie.\r\n\r\nNonetheless, it provides a decent sense of closure to the series.","id":"51a44026760ee33bdc0c4e1e","url":"https:\/\/www.themoviedb.org\/review\/51a44026760ee33bdc0c4e1e","movie_id":16320}
{"author":"Gimly","content":"Woefully underrated drama too often passed off as a \"boy's night\" action film.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._","id":"5a83a1d5c3a36863390028b0","url":"https:\/\/www.themoviedb.org\/review\/5a83a1d5c3a36863390028b0","movie_id":8923}
{"author":"Gimly","content":"Now you could watch this, I guess, I wouldn't stop you. But for a movie only a decade and change old, _Doom_ has dated **hard**, and it's not just 'cause of that garbage CGI.\r\n\r\nWeird like the videogame it's based on, but still fucks up the lore that I can't see it sitting well with that crowd either. _Doom_ might genuinely have been made for no one.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5bacc9d092514150e803645c","url":"https:\/\/www.themoviedb.org\/review\/5bacc9d092514150e803645c","movie_id":8814}
{"author":"Wuchak","content":"Caught between Earth and Sky  \r\n\r\nRELEASED IN 2005 and directed by Wim Wenders, \"Don't Come Knocking\" tells the story of a 60 year-old B-Western film has-been, Howard Spence (Sam Shepard), who is sick of his meaningless scandalous carnal existence. While on a film set in Utah he jumps ship and flees on a horse, searching for SOMETHING, like a reason to exist. He ultimately travels to Butte, Montana, where he gets reacquainted with an ex-girlfriend (Jessica Lange) and meets an angry young musician (Gabriel Mann) as well as a mysterious spiritual woman (Sarah Polley). Meanwhile the film company sends an eccentric bounty hunter (Tim Roth) to fetch Shepard for breach of contract.\r\n\r\nAlthough this is generally a quiet drama, it has a hip and likable artistic flair. The film is highlighted by magnificent Western locations and a nice modern Country\/Western\/Rockish score\/soundtrack (non-twangy).\r\n\r\nWe can all relate to Howard's search on some level; hence, despite the film's slow drama it generally maintains the viewer's attention throughout its runtime, unless you strictly favor fast-paced, quick-edited explosion-every-five-minutes thrillers.\r\n\r\nThe two youths Howard meets in the story, Earl and Sky, represent two extremes. Earl's name is fitting because he's full of volcanic rage that spits out from deep within the Earth (Earl\/Earth, get it?). Sky, on the other hand, is completely spiritual in nature (hence, sky\/heaven). She's full of warmth, love, compassion and forgiveness. In fact, she's the crucial Christ figure without which there would be little reconciliation for anyone in the story.\r\n\r\nTake note of the scene where Sky meets Howard in his hotel room. Sky just looks at him with the understanding eyes of divine love. This naturally makes Spence uncomfortable; he's never experienced this before. He doesn't know what to do, so he asks her to leave.\r\n\r\nOn a side note, Jessica Lange still looks good for being in her mid-50s but I found her character strange and annoying. Also, Earl's girlfriend (Fairuza Balk) is an entertaining free spirit who looks like she might be the daughter of Steven Tyler.\r\n\r\nThe third act of \"Don't Come Knocking\" is too low-key for my tastes, but the movie’s worthwhile if you favor the cast and have a taste for eccentric indie dramas, as well as stories about the modern West with echoes to the past.\r\n\r\nTHE MOVIE RUNS 1 hour, 51 minutes and was shot in Butte; Arches National Park and Moab, Utah; Elko and Wendover, Nevada; and Los Angeles. WRITERS: Sam Shepherd and Wim Wenders.\r\n\r\nGRADE: B-","id":"5b563d1dc3a3685c88029538","url":"https:\/\/www.themoviedb.org\/review\/5b563d1dc3a3685c88029538","movie_id":3527}
{"author":"tmdb47633491","content":"I was 12 when this came out. At the time, Doom 3 was an obsession of mine that my parents could not break. They were semi-Christian, and when I got to the part in the game where pentagrams were spawning demons all over the place, I got nervous and told Mom. I was allowed to play any and all games, as long as they didn't involve demons or satanism. This was because, ostensibly, \"the demons could come out and influence your life in bad ways, and you don't want that.\" So I had to return Doom 3. \r\n\r\nBy the end of that year, I had all kinds of posters and magazines and memorabilia of Doom 3 in my room. An obsession is the only thing you can call it. I had everything Doom related you can think of, except the actual game. So when I heard about this movie, 12 Year Old Me obviously was all over it. And when I found out about they changed the plot from satanic monsters to Experiment Gone Wrong, you bet your ass I got my dad to take me to the local opening midnight screening of DOOM. One of my happiest memories. We were the only ones in the theater.\r\n\r\nFun movie.","id":"5afdf7239251417857000a7a","url":"https:\/\/www.themoviedb.org\/review\/5afdf7239251417857000a7a","movie_id":8814}
{"author":"The Movie Diorama","content":"Mr. & Mrs. Smith explodes with flaming chemistry but assassinated its own script. “Brangelina”. Without Liman’s standard action comedy, we wouldn’t have had the power couple that dominated the tabloids. Several children wouldn’t have been adopted and brought up in a completely different, yet financially stable, environment. Jolie wouldn’t have been the charitable humanitarian she is now. And Shiloh’s first baby photograph wouldn’t have amassed over ten million dollars worldwide. Wow! Suffice to say, the two most beautiful humans in Hollywood have a substantial amount of gratitude to show Liman for his efforts in pairing them. If only his energetic vibrancy was enough to power the lacklustre screenplay, the balance of action and comedy could’ve been a landmark within the sub-genre. A bored upper middle class married couple are astonished to learn that they work for differing assassination organisations, soon to be assigned to kill each other.\r\n\r\nIt’s your standard marriage. Winning a teddy bear at a carnival, falling in love whilst buying the most expensive mansion on the street, succumbing to the same mundane daily routine, destroying the house with an almighty shootout followed by a gas explosion, participating in the feistiest erotic love-making scene ever and naturally ending in marriage counselling. A cruel irony for “Brangelina”, maybe they should’ve watched the film they made together? Cynicism aside, what truly elevates the memorability of this feature is the onscreen (and offscreen, bow chicka wow wow...) chemistry of its leading stars. Jolie and Pitt are exceptionally effortless with their comedic timing, dramatic endeavours and high-octane action. The lightning-fast wit that they inject into Kinberg’s less than impressive script is nothing short of, well, impressive. They make the film. They are the film. And they certainly have solid taste in curtains.\r\n\r\nLiman maintains a light tone throughout, never dabbling into the cracks of the marriage which is vital for retaining a fun buoyancy. This isn’t an analysis on marital breakdown. It’s just a tongue in cheek slice of entertainment.\r\n\r\nHaving said that, despite the tantalising chemistry of its leads, you never quite feel that they are truly in love. Unfortunately, Kinberg’s script is so vacuous in emotional conviction, that both Smiths resemble roommates than a married couple. Understandably the marriage is stale as they conform to their upper middle class lifestyle, but even when they fight and makeup, there’s no real connection. I yearn to see Jolie and Pitt lust over each other. The momentum essentially grinds to a halt after their house explodes, with Kinberg’s script focussing on a central plot point involving “The Tank” and an onslaught of heavily armed operatives raiding a department store. Attention for the splendid couple instantly dissipated with a third act that seemingly refused to end, ultimately losing the acute fun that preceded the underwhelming conclusion. The whole “keeping up appearances” act was tossed out of the smashed window, and that was the sole element that made the film incredibly fun.\r\n\r\nMr. & Mrs. Smith doesn’t conclude with a divorce, as it is sensible light entertainment for the vast majority of its runtime, yet the concluding act and poor screenplay prevent the marriage from flourishing fully. Angelina Jolie man! I would abandon my homosexuality for her...","id":"5e206dcbf04d0100150fd553","url":"https:\/\/www.themoviedb.org\/review\/5e206dcbf04d0100150fd553","movie_id":787}
{"author":"sitenoise","content":"The film begins with Ah Yu, played by Taiwanese singer **Tarcy Su**, being released from prison. We aren’t told why she was there or how long she was in for. She makes her way to the home of a weathered and motherly woman named An-an (Yi-Ching Lu) whom she had come to know in prison. An-an takes her in and gives her job at the hostess bar she operates. After an arranged date doesn’t pan out the way Ah Yu expected, she quits the bar and takes a job at a computer factory. Her relationship with a young supervisor she meets there, along with her ongoing and anchoring relationship with An-an, is the meat of this film.\r\n\r\n_Blue Cha Cha_ requires patience. That’s code for it being an art house film which moves slowly and doesn’t offer a lot of detail as to why things are happening. Beyond an ambiguous statement near the end of the film revealing why Ah Yu was in prison we never learn anything about her past, and throughout the film it is clear that she has no idea nor concrete desires for her future. She just drifts along, medicated, mentally unstable yet always trying to be nice, hoping each day will offer some measure of fulfillment. _Blue Cha Cha_ isn’t a low-budget indie film, tho. It has excellent production values and looks gorgeous. The direction is fluid and creative and the cinematography crisp and colorful.\r\n\r\nThese kinds of films need good characters and good performances in order to succeed. Blue Cha Cha delivers them. Yi-Ching Lu, who has been in a number of films by Ming-liang Tsai, is always reliable. She’s tough and unafraid to do almost anything as an actress. But the real highlight here is **Tarcy Su**. She is able to make us care for a character we never learn much about. We’re not always clear about what is going on inside her head but we’re always sure she is experiencing something. It’s surprising how well she is able to articulate a confused yet committed mind without offering any insight as to the details of the matter. There’s a scene where she is lying in bed with a man, staring at him face to face as he drifts in and out of sleep. There is a frightening authenticity to her gaze which offers no explanation as to its genesis.","id":"55a492bc92514147d8000af8","url":"https:\/\/www.themoviedb.org\/review\/55a492bc92514147d8000af8","movie_id":44707}
{"author":"Andres Gomez","content":"Good Danish black humor.","id":"508ceb17760ee32898000d30","url":"https:\/\/www.themoviedb.org\/review\/508ceb17760ee32898000d30","movie_id":1023}
{"author":"Kenneth Axel Carlsson","content":"Nine lives, which isn't exactly true. There are definitely more than nine lives in this movie, but you could also choose to think of the title a bit differently. Like, they say a cat has nine lives, meaning that you can try and kill it, but its nearly impossible, it will just keep coming back. It is sorta the same thing with the nine women of this movie. They have all endured hardship in their lives, but they are impossible to kill (not that anyone is trying, except maybe one of the women themselves).\r\n\r\nTo break down the plot of this movie is not easily done. It is about people, it is about relationship, love, hatred, betrayal and so many other things, but ultimately, it is about life... and death. When the movie was done, it returned to the main screen of the dvd menu, and something caught my eyes. There were two animals in the picture, a white dove flying (a symbol of peace and live), and a black cat, going in the opposite direction of the dove (often a symbol of bad luck, but I guess, also a symbol of resilience). Those, I guess, are the central themes in this movie.\r\n\r\nThe movie itself is constructed as nine viginettes (small short films really), but where some of the characters are also part of the stories of others. It's not an original idea, but then again, it doesn't have to be, it just needs to be done well. I am not a huge fan of these types of movies, but these stories have enough on their mind to keep you involved. Also, the cast of this movie is great. Solid actors who doesn't steal the picture.\r\n\r\nOne last thing I'd like to point out, is the technique used in this movie. Every scene is a one long shot. I am not sure what, but this way of filming adds something to the movie, also, the music is not overly dominant in the movie, which is another thing I really appreciate.\r\n\r\n_Last words... a solid movie with enough on its mind to keep you involved in the nine (and more) stories. Also, when you are done wathing the movie, you aren't left with the feeling that you have all the answers. No, you have just dipped your toes in each story, but you still have so many questions. That is a brave thing to do these days..._","id":"54a6a9db92514117dd009ba6","url":"https:\/\/www.themoviedb.org\/review\/54a6a9db92514117dd009ba6","movie_id":16022}
{"author":"tmdb47633491","content":"_Match Point, or, Crime & Misdemeanors, Except I Changed Like 4 Things, And the Mistress is Really Hot This Time_","id":"5ac936bb92514162b7044ca6","url":"https:\/\/www.themoviedb.org\/review\/5ac936bb92514162b7044ca6","movie_id":116}
{"author":"Andres Gomez","content":"Interesting social \/ psychological experiment following the trail of Dogville but not as round and imaginative as the previous one.","id":"542e71640e0a261fe9001e1c","url":"https:\/\/www.themoviedb.org\/review\/542e71640e0a261fe9001e1c","movie_id":1951}
{"author":"Gimly","content":"Not a bad little piece, but sort of out of its time. If it wasn't for the cast (and what a cast) I would have assumed this movie was made at least a decade earlier than it actually was. The dialogue's mix of contemporary and faux medieval was also particularly odd, and the effects were... I don't want to say bad... But, again, seems like the sort of quality that might have come about in the early 90s more than mid 00s.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5c8cd7ca9251410fe79e7574","url":"https:\/\/www.themoviedb.org\/review\/5c8cd7ca9251410fe79e7574","movie_id":5471}
{"author":"Andres Gomez","content":"Great drama and great characters for the untold story of Hutus and Tutsis conflict in Rwanda and the naïveness of the good hearted people against the cruel reality and the tough decisions to make.","id":"5245be5819c2953e06246507","url":"https:\/\/www.themoviedb.org\/review\/5245be5819c2953e06246507","movie_id":8588}