{"author":"Wuchak","content":"True love transcends sexual expression\r\n\r\nRELEASED IN 2003 and written & directed by Sofia Coppola, \"Lost in Translation\" was a big hit in 2003-2004. It's about an aging actor, Bob Harris (Bill Murray), who's in Tokyo doing commercials for a week. His home-life is mundane and he's experiencing a bit of the mid-life crisis. He runs into an attractive 20 year-old something woman, Charlotte (Scarlett Johansson), who's in Tokyo with her photog husband (), but he's gone most of the time and takes her for granted.\r\n\r\nThis is a mature, semi-arty film and you have to be in the right mode\/maturity level to appreciate it. I said \"maturity level\" and not \"age\" because some people are pretty mature at 16 while others are completely immature at 50. For me, the story, music and visuals pulled me into these characters’ temporary world for the 102-minute runtime.\r\n\r\nThe film succeeds as an amusing social commentary and a deep love story, as well as a visual\/musical delight. I'll only focus on the deep love element. It's been noted that the story originated from Sofia's experience with an aging actor when she was younger, possibly Harrison Ford. Sofia is obviously Charlotte, while Charlotte's husband is Sofia's ex and Anna Faris plays the role of the other woman, which would be Cameron Diaz in real life. So there's a lot of reality in the picture.\r\n\r\nBut it's not just a cathartic piece. Sofia has some potent insights to offer on the nature of true romantic love. For one, love transcends age difference (Bob is about 35 years older than Charlotte). For another, it's possible to be married and experience romantic love for another. Not that this ever justifies adultery, it's just a fact. As the story progresses you'll see how comfortable Bob and Charlotte are with each other, how they look into each other's eyes, the windows of the soul, in a profoundly naked sense. This can happen in the flash of a moment where the two people just KNOW, or it can take place over a period of time, as is the case with Bob and Charlotte (which is a handful of days). They see the same things and speak the same language, and I don't mean English. But this presents a conundrum for Bob. Bob COULD take advantage of Charlotte because she's so lonely in a sea of people, which is one of the movie's themes; she's also inexperienced and vulnerable. Will he or won't he take advantage? \r\n\r\n***SPOILER ALERT*** Don't read further if you haven't seen the film.\r\n\r\nIf Bob loves Charlotte so much, not to mention his wife & kids, why does he have a one-night stand with the lounge singer (Catherine Lambert)? Bob slept with her to release sexual tension that had been building up between him and Charlotte. This was a moral failure, but keep in mind he was drunk (another failure but, have pity, he was going through a mid-life crisis). While all this is obvious, it goes deeper...\r\n\r\nBob could have taken advantage of Charlotte if he wanted to but didn't because he genuinely loved her, which is revealed at the end. Bob could sleep with the singer because he didn't love her (not that it justifies his actions). Simply put, true love transcends sexual expression and sexual union does not equal love.\r\n\r\nThe ending is powerful and tear-inducing. No CGI, explosion or action stunt can compare. It's just an older man and a too-young woman embracing in the midst of 20 million strangers. Tears flow, kisses are given and unheard words are whispered. They could never be a couple, even if they weren't married, and they know they'll never see each other again, at least on this physical plane, but their love has been expressed and will be treasured for eternity.\r\n\r\nGRADE: A","id":"5abaed2e9251411e9a0089e3","url":"https:\/\/www.themoviedb.org\/review\/5abaed2e9251411e9a0089e3","movie_id":153}
{"author":"John Chard","content":"God only knows what I'd be without you.\r\n\r\nLondon, England, and it's the run up to Christmas, and we are in the company of a number of couples dealing with the joys and problems that love can bring.\r\n\r\nWe open with a narration from Hugh Grant who tells us that when he is troubled by the hate in the world, he thinks of the arrivals area of Heathrow airport. A place where loved ones greet returning loved ones, a place that indeed showcases a strand of love in its joyous form. He further ventures that when the aeroplanes hit the twin towers on 9\/11, as far as he knows, all those phone calls from those sadly involved were messages of love, not hate. Pertinent musings that although somewhat sombre for an opening, sets it up nicely for what Richard Curtis (writer and director) wants to say.\r\n\r\nA roll call of fine British and Irish actors, and American Laura Linney, lend their considerable talents to Curtis' ensemble piece. The structure is surprisingly simple considering the number of stories being woven together, the result being that there is sure to be a story in there to either love, or, yes, even hate. Is it sentimental? Of course. Is it as stuffed as a turkey on Xmas day? Naturally. Does it stretch credibility in some strands? For sure. But only the coldest of hearts could truly decry that Love Actually is all around. Very often it's funny too. Curtis, following on from writing credits such as Four Weddings And A Funeral, continues to show himself to be a very fine writer of comedy. None more so than with Bill Nighy's past his sell by date pop star, Billy Mack. There's something for everyone in here, indeed there's likely to be something that many can associate with.\r\n\r\nIt's a lovely affecting film that should hopefully perk up those that get blue around the holiday season. With perceptive writing, some excellent acting (Nighy, Emma Thomson, Colin Firth et al) and a soundtrack of some worth, Love Actually is a winner. 8\/10","id":"5680738892514131df00bd2d","url":"https:\/\/www.themoviedb.org\/review\/5680738892514131df00bd2d","movie_id":508}
{"author":"JPV852","content":"Lost in Translation is one of my all-time favorite movies. The film grabbed me when I first saw it in the theater (unusual for back then, but my cineplex got this one in) and since I've watched it dozens of times. Bill Murray and Scarlet Johansson are both great and Sofia Coppola's direction taking in the sights and sounds of Tokyo (a city I've always been curious about and wanted to visit) was amazing.","id":"5d6778d16743fa0011d62249","url":"https:\/\/www.themoviedb.org\/review\/5d6778d16743fa0011d62249","movie_id":153}
{"author":"J4stringthang","content":"Ok movie Lovers. If you didn't like The Life Aquatic with Steve Zissou, then don't even bother with Lost in Translation. The jokes are dry and the dialogue is weak. At least in Life Aquatic they wore funny outfits. Being a world traveler myself I could appreciate the jet lag and overall moping around thru out the whole film. You will definatly feel lost. Although I found myself laughing out loud a few times at Bill Murray and his quips, BY NO MEANS should the average movie fans think this is a comedy. It is an independent art film and should be treated as so.","id":"52f31fe5925141132708e326","url":"https:\/\/www.themoviedb.org\/review\/52f31fe5925141132708e326","movie_id":153}
{"author":"JPV852","content":"One of the more emotionally driven of the J-horror genre, One Missed Call is a well done film with some haunting images, which is a staple with these of course, and although I probably prefer The Grudge, still found this one engaging thanks to some fine performances, mainly Ko Shibasaki and Shin'ichi Tsutsumi. **3.75\/5**","id":"5e45b3039603310017f54d21","url":"https:\/\/www.themoviedb.org\/review\/5e45b3039603310017f54d21","movie_id":9694}
{"author":"John Chard","content":"Would you have given it to me if I slept with you?\r\n\r\nOut of Time is directed by Carl Franklin and written by David Collard. It stars Denzel Washington, Eva Mendes, Sanaa Lathan, Dean Cain and John Billingsley. Music is by Graeme Revell and cinematography by Theo Van de Sande.\r\n\r\nMatthias Whitlock (Washington) is chief of police in little Banyan Key, Florida. Respected for his work and basically honest in the line of duty. Away from work, however, his marriage to Alex (Mendes) has failed, he's having an affair with an abused wife and he likes a little drink on duty. So when his lover Anne Harrison (Lathan) springs on him the shocking news that she has been diagnosed with terminal cancer, it naturally shakes his world. But this news is merely the start of something bigger, for pretty soon Matt will be in the unusual situation of having to stay one step of his own kind or face dire consequences.\r\n\r\nIt's a film proudly wearing a badge of homage to film noir of the 40s. In fact it very much plays out as a contemporary riff on John Farrow's excellent Ray Milland starrer of 1948, The Big Clock. But that's fine, especially when you have some knowing craft in front and behind the camera in the shape of Franklin (Devil in a Blue Dress) and Washington (take your pick here really!). Yet as great as Franklin and Washington's work is, they all owe a debt to Collard's screenplay. Inventive in how it plays out as a plot, with it's many tight situations laid down for Washington's duped law enforcer to try and get out of, the screenplay has a knack for deft humour, often sly, which is something that even some of the hardest of noirs from the golden era are tinted with. The secret is being able to blend the humour with quality moments of suspense, and this picture manages to do that with some interest.\r\n\r\nFilm also benefits greatly from the tight atmosphere created by photographer de Sande. Sweaty Florida in daylight doesn't cry out as being a good starting point for an offshoot of film noir (real Florida locations were thankfully used), but the scenic beauty is never realised during the drama sequences, colours are toned down, even for a stunning red sky, and this perfectly becomes at one with a near frantic Washington as the tricksters of Banyan Key start to close in on him. It's nice too see, also, interracial couples forming the core of the story, while the dominance of sexuality is firmly given a shrewd work over by director and writer. There's good thought gone in to making this, enough to steer it away from charges of just being a faux neo-noir production.\r\n\r\nProblems? Yes, a few. Inevitability of outcome is hard to shake off whilst viewing it, especially for those well versed in the genre (sub-genre). Clichés and contrivances are stacked up like a pile of cop thriller 101 books, and Franklin goes smug (daft) by dropping in a couple of slow frame sequences that the film clearly didn't need. While the big showdown in the finale lacks a gut punch. But this is a good viewing, sexy at times and always eye catching, it also pleasingly chooses perky dialogue over action to make its dramatic point. The cast around Washington enhance the quality: Lathan in the tricky role shows a number of layered gears, Cain is imposing as a bully boy husband (where did this Cain go?) and Billingsley almost sneaks in and steals the movie as the loyal and stoic comedy side-kick.\r\n\r\nSo pesky flaws aside, this is a good recommendation as a night in movie for those with a kink for contemporary neo-noir. 7\/10","id":"5353e057c3a3681d81004269","url":"https:\/\/www.themoviedb.org\/review\/5353e057c3a3681d81004269","movie_id":2116}
{"author":"Gimly","content":"I don't think I can go so far as to call _Freddy vs. Jason_ good. But I can still be honest about the fact that I love it. Considering it mad-grabs the humour from both its delivering franchises late-stage entries, with the bizarre, ethereal yet quippy flavour of _Elm Street_, and the body count of a _Friday the 13th_, how could I not?\r\n\r\nCrappy acting, unbelievable SFX, hack script, completely disrespectful to the canon of both parents, yet eminently re-watchable for any occasion.  \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5b10f518c3a3686230016f84","url":"https:\/\/www.themoviedb.org\/review\/5b10f518c3a3686230016f84","movie_id":6466}
{"author":"Wuchak","content":"***Worthy new millennium entry in the Friday & Nightmare franchises, until they clash, that is***\r\n\r\nTo be expected, 2003's \"Freddy vs. Jason\" mixes together elements of the \"Nightmare\" and \"Friday\" franchises. Both franchises had essentially ran out of gas in the early 90s -- the last conventional \"Friday\" movie, before 2001's \"Jason X,\" came out a decade earlier and the last \"Nightmare\" movie almost as long. So mixing up the formats was a great way to introduce these modern monsters to a new generation as well as re-introduce them to the old.\r\n\r\nTHE PLOT: Freddy Krueger, the wicked spirit of a child molester\/serial killer, is trapped in hell and unable to wreak havoc on the youths of Springwood, Ohio, because they have forgotten him and therefore no longer believe. Krueger's diabolical plan is to lure Jason from Crystal Lake, NJ, to Springwood and inspire him to go on a killing spree, which would naturally be blamed on Kruger, thus giving him the power to return.\r\n\r\nSome say \"Freddy vs. Jason\" is more of a \"Nightmare\" film than a \"Friday\" film, and I can see why, but it's really an equal parts crossover. Once Jason is led to Springwood it essentially becomes a \"Nightmare\" movie with Jason as the antagonist until Freddy gains enough power; by that time the story switches to Crystal Lake for the finale and even provides an insightful flashback (via a dream sequence) of Jason's youth and abuse.\r\n\r\nOne of the highlights takes place early in the second act: Jason's flaming attack at a teen party in a cornfield; it's a dynamic sequence and features great opticals.\r\n\r\nAs with all the Friday films, \"FvJ\" features a nice assortment of women, beginning with the cameo of Heather (Odessa Munroe) in the opening reel. She's pretty much on par with the cameo of Agent Marcus (Julie Michaels) at the beginning of \"Jason Goes to Hell.\" From there we have cutie Katharine Isabelle as a secondary protagonist and Monica Keena as the heroine. It took me about half the movie to warm up to Monica but she ultimately won me over.\r\n\r\n\"Freddy vs. Jason\" is a noticeably more technically sophisticated than the first nine \"Friday\" movies. Don't get me wrong, it's very cartoony and hardly scary (except for jump scares and gore), but it LOOKS so much better and has more oomph. The story’s also way more involved than the first eight entries and “Jason X,” which makes the film play better on repeat viewings.\r\n\r\nThe fight between the two monsters in the closing act is a cinematic tradition going back earlier than 1945's \"The Wolf Man vs. Dracula\" (aka \"House of Dracula\"), but it's the weak point of the movie for me because it's just too cartoony. The film works as horror with either Jason or Freddy attacking the youths, but when they finally clash in the action-packed climax it's just too comic booky.\r\n\r\nThe film runs 97 minutes and was shot mostly in British Columbia, Canada (e.g. Buntzen Lake, Anmore), but also Toronto.\r\n\r\nGRADE: B","id":"5d3349f7caab6d779398b05c","url":"https:\/\/www.themoviedb.org\/review\/5d3349f7caab6d779398b05c","movie_id":6466}
{"author":"Gimly","content":"I don't think I can go so far as to call _Freddy vs. Jason_ good. But I can still be honest about the fact that I love it. Considering it mad-grabs the humour from both its delivering franchises late-stage entries, with the bizarre, ethereal yet quippy flavour of _Elm Street_, and the body count of a _Friday the 13th_, how could I not?\r\n\r\nCrappy acting, unbelievable SFX, hack script, completely disrespectful to the canon of both parents, yet eminently re-watchable for any occasion.  \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5b10f5170e0a26307c010279","url":"https:\/\/www.themoviedb.org\/review\/5b10f5170e0a26307c010279","movie_id":6466}
{"author":"John Chard","content":"Buckle up.\r\n\r\nKimberly Corman has a terrifying vision that a highway pile up will claim her life and that of her friends. Blocking the entrance with her car, Kimberly watches in horror as the crash unfolds, thus saving her life and that of the people in the queue behind her. But the grim reaper is not impressed and he's coming to claim the deaths of all those who should have died in the crash.\r\n\r\nFor a sequel to truly work well it has to come up with something fresh, otherwise why do a sequel eh? Well the makers of Final Destination 2 choose to use the basic same formula of the hugely enjoyable first film, only adding more black humour into the crazy death design broth. Opening with a quite horrific highway pile up, FD 2 then takes us on a journey that sees an assortment of folk offed in various and gruesome ways. The story remains the same as the first film, even though writers Bress and Gruber think they are being intricate by weaving this plot into the original story, but ultimately it's just a devilishly nonsense fun picture. Ali Larter returns for a second helping, and she in turn is joined by a bunch of no mark actors waiting for death, which is perfectly fine for the genre discerning fan.\r\n\r\nThis is a riot, and as long as you don't look too deep into it (why would you really?) you may just find yourself having a real good time. 7\/10","id":"55b4697a9251411e0f013bee","url":"https:\/\/www.themoviedb.org\/review\/55b4697a9251411e0f013bee","movie_id":9358}
{"author":"Dave09","content":"One of the best animated films I have ever seen. Great characters, amusing animation, and laugh-out-loud humor. Also, watch for the little skit shown after the credits. It's all great stuff that simply must be seen.","id":"52d4a742760ee30e2d0dac9d","url":"https:\/\/www.themoviedb.org\/review\/52d4a742760ee30e2d0dac9d","movie_id":12}
{"author":"Wuchak","content":"***Solid sequel, maybe a notch better than the first film***\r\n\r\nThe first \"Final Destination\" movie from 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, the Grim Reaper, as an invisible spiritual presence. A group of people, mostly youths, escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying those who cheated Death in various creative ways, usually involving an unlikely chain reaction. The opening tragedy in the first film was a plane crash; in this second film from 2003 it's a horrible highway pile-up; in the third it's a roller-coaster mishap and so on.\r\n\r\nThere are currently five films in the franchise and they all tell the same basic story with different characters and some nuances; they’re all of the same high quality of technical filmmaking. Whether you prefer one or another depends on whether you like the cast and the death sequences (and the locations) because, other than these factors, they're all basically the same, although the fifth film throws in an interesting new twist (Death’s victim can find a substitute).\r\n\r\nAli Larter returns as a secondary protagonist while A.J. Cook takes the reigns of the 'final girl.’ Keegan Connor Tracy also has a considerable role in the female department while Sarah Carter has a smaller part. While this is a quality assortment of women, the creators coulda done more with them. On the opposite side of the gender spectrum Michael Landes stars as a state trooper. Jonathan Cherry, Terrence 'T.C.' Carson and James Kirk are also on hand. Their importance to the story is in that order. Meanwhile Tony Todd makes his second of four appearances in the series as a mortician who curiously knows more than he should.\r\n\r\nI actually like this one a little better than the first one, but like that film, the second half isn’t as strong as the first. Is the final scene supposed to be horrific? Cuz it made me bust out laughing.\r\n\r\nThe film runs 1 hour, 30 minutes and was shot in the Vancouver, British Columbia, area, including Campbell River (although the events take place around New York City).\r\n\r\nGRADE: B\/B-","id":"5bda084d9251411557014758","url":"https:\/\/www.themoviedb.org\/review\/5bda084d9251411557014758","movie_id":9358}
{"author":"Wuchak","content":"***On its final day, the Creeper attacks a school bus full of basketball personnel***\r\n\r\nA basketball team and a few cheerleaders are returning home from a game 30 miles south of Bakersfield, California, when their bus is sabotaged in the countryside by some… thing… with wings. \r\n\r\n\"Jeepers Creepers 2\" (2003) is the best of the trilogy with the highlight being the creative and creepy monster, called the Creeper, which is reminiscent of the chief gargoyle in “Gargoyles” (1972), but more demonic and wholly evil. This is basically a confined location horror flick with the setting being the remote golden fields of Southern Cal (and the school bus).\r\n\r\nThe first film (2001) was hindered by its limited cast while this one tries to make up for it with a whole busload of kids and three school employees (two coaches and a bus driver). But the film generally drops the ball in the female department and, worse, focuses a little too much on shirtless jocks, which can be explained by the writer\/director’s orientation (get real). There’s also zero depth; this is a movie about an evil winged creature that attacks a busload of youths and little else. But it’s very well done for what it is.\r\n\r\nThe film runs 1 hour, 44 minutes and was shot in Southern Cal (Tejon Ranch and Long Beach).\r\n\r\nGRADE: B-","id":"5cc5653e92514151ca04dd68","url":"https:\/\/www.themoviedb.org\/review\/5cc5653e92514151ca04dd68","movie_id":11351}
{"author":"John Chard","content":"We are trapped in a broken down school bus out on East 9. And something is going to kill us if we don't get help out here right away!\r\n\r\nPlot finds the demon known as The Creeper (Jonathan Breck), still having a little time left for feeding and harvesting human parts before his 23 year hibernation. A buffet bar of high school kids on a bus returning from a basketball match are now in his sights. But an avenging father played by Ray Wise is willing to take the fight to the monster. \r\n\r\nIt's a simple as it sounds, really. Creeper picks off various members of the bus, which is the usual array of annoyingly obnoxious teenagers. The tension comes from wondering who is next in line, all while the fractured group (racial\/sexuality tensions) try to come up with some sort of plan to survive until help arrives. Logically it's a laughable nightmare and goofs aplenty are within, but there's a neat gory \"B\" movie vibe about it driving it forward. Plus there's more of Creeper in flying mode and a bad ass Ray Wise to root for.\r\n\r\nAfter the success of the first Jeepers Creepers film it was inevitable that a sequel would follow. With a little sadness we find that this sequel fails to capture the strengths that made the first film a refreshing horror joltathon. But regardless it still has some merits for a fun horror time waster. 6\/10","id":"5619de9bc3a3684837000a64","url":"https:\/\/www.themoviedb.org\/review\/5619de9bc3a3684837000a64","movie_id":11351}
{"author":"VolcanoAl","content":"I loved the way this & the original were both the same \" feeding\".The end was great as the old man waited with his harpoon\/pole puncher in his rocking chair.Waiting for his next awakening.\r\n The car scene & his smile made him a great like Jason or Freddie.The new one is a great idea.23 yr.s for 23 days he feasts.It's about time!!!","id":"51f3a75a760ee36507076cdd","url":"https:\/\/www.themoviedb.org\/review\/51f3a75a760ee36507076cdd","movie_id":11351}
{"author":"Gimly","content":"A most prime example of how to refute the “bigger is better” adage. Not because it’s smaller and better, but because it’s bigger and shithouse.\r\n\r\n_Final rating: ★½: - Boring\/disappointing. Avoid if possible._","id":"5a2ccfb9c3a3680b96145d33","url":"https:\/\/www.themoviedb.org\/review\/5a2ccfb9c3a3680b96145d33","movie_id":11351}
{"author":"John Chard","content":"His story's so unbelievable, I think it just might be true.\r\n\r\nIdentity is directed by James Mangold and written by Michael Cooney. It stars John Cusack, Ray Liotta, Amada Peet, Clea DuVall, Rebecca De Mornay, Alfred Molina, John Hawkes, John C. McGinley, Jake Busey and Pruitt Taylor Vince. Music is by Alan Silvestri and cinematography by Phedon Papamichael Jr.\r\n\r\nInspired by Agatha Christie’s Ten Little Indians, Identity pitches 10 characters trapped at a motel who begin getting killed off one by one...\r\n\r\nIf you are going to do yet another take on Christies superb literary source then at least bring some freshness, so how nice to find that Identity does in fact ironically have its own. Set up is suitably in keeping with murder mystery shenanigans, there’s major flooding and our host of characters are bound to a shabby motel run by a shabby John Hawkes. On the edges of the frame we have another story where multiple killer Malcolm Rivers (the wonderful wobbly eyed P.T. Vince) is under interrogation to test for insanity to stave off his impending execution.\r\n\r\nMangold uses flashbacks to put the various characters at the motel, in how they came to be there. There’s a creative ambitiousness about how Mangold constructs the pic that draws you in, which come the finale will either have you satiated or stupefied. The murder sequences are very well put together, with a couple being well ghoulish, and it’s a very impressive cast of actors working their way through the formulaic but fascinatingly cheat free psychological murk.\r\n\r\nIt’s not as smart as it thinks it is but this has enough of an absorbing pull, and no little intelligence, to lift it higher than many other Agatha 10 copies. 7\/10","id":"5ccb9f950e0a262fcf005b69","url":"https:\/\/www.themoviedb.org\/review\/5ccb9f950e0a262fcf005b69","movie_id":2832}
{"author":"light_michael","content":"It's one of my favorites, I rate it four stars and a half.","id":"5d5ee43e69d2800eb2ff8612","url":"https:\/\/www.themoviedb.org\/review\/5d5ee43e69d2800eb2ff8612","movie_id":2832}
{"author":"Andres Gomez","content":"Tangled and lacking rhythm story. Not that interesting and already told in other movies even being based in true facts.","id":"54de8e88925141027c001c9f","url":"https:\/\/www.themoviedb.org\/review\/54de8e88925141027c001c9f","movie_id":4997}
{"author":"tmdb44006625","content":"X2: X-Men United is an improvement over its predecessor in just about every way. Better story, better effects, better action, and more interesting mutants. It's the best of the original X-Men films and a high point for early 2000s comic book moviemaking. Worth watching for the Wolverine vs Lady Deathstrike fight alone.","id":"5c8429970e0a264303637c60","url":"https:\/\/www.themoviedb.org\/review\/5c8429970e0a264303637c60","movie_id":36658}
{"author":"Wuchak","content":"Too much CGI, redundancy, clichés and drawn out “looks of love” for my tastes.\r\n\r\nRELEASED 2003 and directed by Peter Jackson, “The Lord of the Rings: The Return of the King” adapts the third part of JRR Tolkien’s popular fantasy trilogy about adventures on Middle-Earth: Frodo (Elijah Wood), Sam (Sean Astin) and Gollum (Andy Serkis) continue to try to make their way to Mount Doom to destroy the One Ring. Meanwhile Aragorn (Viggo Mortensen), Legolas the Elf (Orlando Bloom), Gimli the Dwarf (John Rhys-Davies), Gandalf the wizard (Ian McKellen), King Theoden (Bernard Hill) and Faramir (David Wenham) join forces to fight Sauron's army at the stone city of Minas Tirith and, later, draw the forces of Modor out as a distraction for Frodo to accomplish his goal. Billy Boyd and Dominic Monaghan are on hand as Hobbits Pippin and Merry.        \r\n\r\nWhile I’m a casual fantasy\/adventure fan and have read numerous books of the genre (e.g. Conan, Tarzan, Gor, etc.), I’ve never read Tokien, likely because I’m not into Hobbits, Elves and Dwarfs. After viewing the three movies, The Lord of the Rings strikes me as a mixture of Robin Hood, Conan and The Wizard of Oz, which all possibly influenced Tolkien’s writing of the Rings trilogy in 1937-1949. So, if you think a meshing of “Conan the Barbarian” (1982) and “Robin Hood: Prince of Thieves” (1991) with “The Wizard of Oz” (1939) sounds good, then you’ll probably like these movies more than me. \r\n\r\n“The Return of the King” is just more of the same showcased in the first two movies, but even LONGER. Take the Battle of Minas Tirith, for example. It’s basically the same as The Battle at Helms Deep in the previous movie, except with colossal elephant-like creatures and the Army of the Dead. These two battles are similar enough that they could’ve been condensed into one conflict. Speaking of the Army of the Dead, this was an interesting new element, as was the horrifying spider-monster that Frodo & Sam face inside the caves.   \r\n\r\nLike the first two movies, the characters are diverse, the tale is creative, there’s a lot of dark action rounded out by softer scenes and everything LOOKS and SOUNDS magnificent. Unfortunately, as with “The Two Towers,” there’s excessive use of CGI (aka CGI porn). If cartoony CGI is your thang then you’ll likely appreciate this installment more than me.        \r\n\r\nThere are other problems: While the characters are inspired, they’re also thin and rather uninteresting, at least for mature people who require more depth to hold their attention. Take Legolas (Bloom), for example; we never get to know him. Or consider Aragorn: Mortensen is perfect as the noble warrior, but in the ENTIRE trilogy he probably only has like two full pages of dialog, maybe three. Also, I found the story generally disengaging. I was never much enthralled by the characters and their pursuits, although devotees of Tolkien might be. \r\n\r\nThen there are WAY too many “looks of love” between characters, particularly Frodo and Sam (I was so happy to see one character get married and have kids, if you catch my drift). There’s also a sense of redundancy, like the aforementioned battles (Helms Deep and Minas Tirith). Or consider the hokey dangling from a cliff by one’s fingers: This was already done with Gandalf at the end of the first part and beginning of the next. Did we really need the entire trilogy to come down to this type of eye-rolling cliché?    \r\n\r\nAnother problem is the lack of feminine protagonists. There’s Miranda Otto as Éowyn, Théoden's niece, who becomes infatuated with Aragorn and masquerades as a warrior-ess. Other than that all we have are cameos by Liv Tyler (Arwen), Cate Blanchett (Galadriel) and a Hobbit’s wife. “Mythica: A Quest for Heroes” (2014) cost LESS THAN $100,000 to make, which is a mere fraction of the $94 million it cost to make this blockbuster and the creators knew enough to throw in a couple of prominent babes as heroines in the story. So did “Conan the Barbarian” and “Dungeons & Dragons: Wrath of the Dragon God” (2005). It’s not rocket science. \r\n\r\nAs noted above, the movie’s needlessly overlong and things could’ve been condensed in the trilogy or omitted altogether. When the main storyline ultimately ends at Mount Doom I was thinking there was maybe 12-15 minutes left with half of that time being credits. Nope, there was STILL 30 MINUTES LEFT wherein boring goodbyes and “looks of love” are tacked on. \r\n\r\nDespite these honest quibbles, “The Return of the King,” and the trilogy in general, was an ultra-ambitious undertaking and is a must for fantasy\/adventure aficionados, particularly those who favor Tolkien, Hobbits, Elves, Gnomes and the like.                      \r\n\r\nTHE MOVIE RUNS 3 hours 21 minutes and was shot in New Zealand.  \r\n\r\nGRADE: C","id":"5aa586ae0e0a26074b02abf1","url":"https:\/\/www.themoviedb.org\/review\/5aa586ae0e0a26074b02abf1","movie_id":122}
{"author":"JPV852","content":"Decent enough thriller with some violent fight scenes, especially at the end, between Tommy Lee Jones and Benicio Del Toro. Really basic plot (barely one if I'm being honest) but still entertained, partially because it was filmed in my native state of Oregon.","id":"5d66ffc112c60400126f2beb","url":"https:\/\/www.themoviedb.org\/review\/5d66ffc112c60400126f2beb","movie_id":10632}
{"author":"pancine","content":"Easy to identify with Melanie and the end was moving but much of the film is uninvolved and lightweight.","id":"5c609a349251412fbcf98206","url":"https:\/\/www.themoviedb.org\/review\/5c609a349251412fbcf98206","movie_id":6443}
{"author":"Mr. J.","content":"After seeing the Disaster Artist, I had to see this movie! HORRIBLE! Laughing my ass off but HORRIBLE! Good for you Tommy! Live thendream!!! Still laughing that I'm really watching this! Kind of like a porn movie without the porn!!!","id":"5b8d93c80e0a261d70053508","url":"https:\/\/www.themoviedb.org\/review\/5b8d93c80e0a261d70053508","movie_id":17473}
{"author":"NeoBrowser","content":"And so all good things come to an end. For three years in a row, Peter Jackson has banished our winter blues with the individual instalments of his Tolkien trilogy, effectively shifting the focus of our cinematic excitement from the summer months to the end of the year. But now that his epic has been unveiled in its entirety, what will be the lasting effects of his achievement?\r\n\r\nWell, grand-scale fantasy filmmaking is back on the menu, laying down the gauntlet to George Lucas and Star Wars Episode III. Jackson has also proved that notions of risk and ambition needn't be confined to the low-budget, indie end of the spectrum; nor does California have an exclusive stranglehold on groundbreaking special effects.\r\n\r\nAnd then there's the DVD factor. Just as The Lord Of The Rings was upping the stakes in theatres, so too was its DVD release pattern defining what can (and should) be done on disc for major movies.\r\n\r\nIn particular, the four-disc extended editions seem to have affected the director's thinking as to what he can get away with in his theatrical final cut. Hence the public grumbles from Christopher Lee about the non-appearance of Saruman in this final instalment. While it might have been fair to grant Lee a curtain call, Jackson quite rightly realises that it is Sauron, not Saruman, whose fiery eye encompasses all the narrative strands of the climax.\r\n\r\nThe Return Of The King marks the first time in the series when Jackson's roots as a horror filmmaker creep through. As the orcs catapult severed Gondorian heads beyond the walls of Minas Tirith, flesh-rotted ghosts draw swords alongside Aragorn and giant spider Shelob stalks Frodo through dark, web-shrouded tunnels, the film pushes the boundaries of its 12A certificate.\r\n\r\nAnd so it should, because the look and tone must necessarily grow darker as the Hobbits near Mount Doom and Mordor's evil hand grips Middle-earth ever tighter.\r\n\r\nCharacter nuances have been crafted over an unprecedented ten hours-plus of cinematic storytelling: from Strider lurking in the shadowy corner to Aragorn rallying the troops; from Merry and Pippin as bumbling fools to stout-hearted, pint-sized warriors. Only Legolas and Gimli seem to have regressed (in screen time at least) to set-piece archer and comedy sidekick respectively. At least Andy Serkis is rewarded for his Gollum voice work with an early flashback that gets his face on screen, as well as warning us that, under the ring's power, Smeagol can be as murderous as Gollum.\r\n\r\nJackson has kept the momentum of the series rolling on and on though the traditionally 'difficult' middle part and 'weak' finale, delivering a climax to the story that's neater and more affecting than what Tolkien managed on the printed page. Some viewers might feel that the director sprinkles some cheese on his extended coda, adding at least one false ending too many (even if he does ignore the book's Scouring of The Shire).\r\n\r\nBut those who have walked beside these heroes every step of the way on such a long journey deserve the emotional pay-off as well as the action peaks, and they will be genuinely touched as the final credits roll. Yes, the Ring is dead. Long live King Kong.\r\n\r\n\r\nVerdict - The resounding climax to a landmark in cinema history. But the King has now returned, the story is over and the ships are leaving Middle-earth. Ladies and gentlemen, Elvish has left the building.\r\n\r\n5\/5\r\n\r\n- Alan Morrison, Empire Magazine","id":"51ea5256760ee3601d252c51","url":"https:\/\/www.themoviedb.org\/review\/51ea5256760ee3601d252c51","movie_id":122}
{"author":"Anton2k","content":"This movie was amazing! Went to see it at the cinema when it first got released back in 2003. For the time the special effects in this movie are mind blowing. A must watch in my opinion.","id":"501c75c419c2950e6d003887","url":"https:\/\/www.themoviedb.org\/review\/501c75c419c2950e6d003887","movie_id":8698}
{"author":"SkippyTexas77","content":"Boy, this one was quite a chore to sit through. The first and second act move at a snail's pace with drawn-out dialogue \/ exposition scenes that really don't add up or go anywhere. The camera work is boring, being shot in the typical bland, \"flat\" look of 90's action films. Only this was made in 2003, so there's little excuse for that. And Burt Reynolds' bizarrely random cameo only added to the incoherence.\r\n\r\nDaniel Bernhardt is always awesome, though he's not in the movie much. He does have a cage fight with Matthias Hues at one point, but it's done pretty poorly so there's nothing much to see.\r\n\r\nHowever, the climax is fairly well done for this budget and genre and definitely helped save it from being a complete waste of time.","id":"58be0347925141126a0371c8","url":"https:\/\/www.themoviedb.org\/review\/58be0347925141126a0371c8","movie_id":146608}
{"author":"NeoBrowser","content":"And so the much-hyped Year Of The Matrix comes to an end. Truthfully, though, the real Year Of The Matrix was 1999, when the groundbreaking original proved to be the right film in the right place at the right time. Tapping into the cultural zeitgeist and Y2K fears about the power of machines over mankind, The Matrix not only revitalized slo-mo action sequences with its 'bullet-time' style, it had a political relevance that already seems dated in a 21st century world dominated by a war against terror, not technology.\r\n\r\n\r\nThe Matrix Reloaded, for all its faults, did try to up the ante, both in its creation of a wider Matrix myth and its budget-heavy effects. Revolutions, however, is content to follow in its wake, the final couple of hours of a four-and-a-half hour slab to which the original movie, in the makers' minds, is but a pre-title sequence. Granted, there's less philosophical babble and more emphasis on action in Revolutions, but the Wachowskis, having backed themselves into pseud's corner, can only deliver with a formula where spectacle and pretentiousness follow on from each other in steady succession. Gut thrills and intellectual stimulation are never integrated as one.\r\n\r\n\r\nRevolutions' sustained action set-piece - the Sentinels' attack on Zion - is undeniably exciting, but it sure doesn't feel like an episode from a close sequel to the original Matrix. For a start, Zion was off-screen for the entire first movie. Secondly - and dramatically more importantly - this centerpiece relegates the main characters to, at best, mere bystanders. Neo and Trinity are off on a mission of their own. Morpheus - now dressed in what looks like a burgundy Benetton jumper rather an outfit consistent with his standing as the coolest dude on (or under) the planet - takes a literal backseat to Niobe's driving. Instead, the key players are the Kid, whose backstory is apparent only to those dedicated enough to watch The Animatrix cartoons, and Mifune, whose on-screen impact is unfortunately as brief as it is memorable.\r\n\r\n\r\nThat such a primary scene is completely filled with secondary characters isn't just disappointing - it's damaging, because it draws attention away from the protagonists' climactic acts. Basically, this is the bit you remember, more than Neo's vital conversation with the Wizard Of Oz-like face of the machines or his up-in-the-air fisticuffs with Smith (a fight whose sfx impact has dwindled following Reloaded's Burly Brawl).\r\n\r\n\r\nSome viewers will indeed be completely satisfied, their questions answered, as the final credits roll, but they're the ones who have done their homework. Without filling in plot gaps by watching The Animatrix or playing derided computer game Enter The Matrix, a sense of confusion reigns. And those who are confused can't emotionally engage with the characters, thus rendering any amount of sacrifices and love themes null and void. In the original film, the casual viewer could relate to a slave race of pod people and their need to be freed, but the Wachowskis seem to have moved the goalposts as the story has progressed, sidelining what began as a focal point of the plot.\r\n\r\n\r\nIn other words, few box-office-storming blockbusters have been aimed so consciously at such a narrow and precise cult audience. The Year Of The Matrix will be remembered as an indulgence for fans, while the original movie will be affectionately held as a separate entity by a bigger crowd.\r\n\r\n\r\nVerdict - What once represented the future of science fiction cinema has become little more than a solid genre offering. But, hey, it wasn't supposed to be the Second Coming, was it? Oh, hang on...\r\n\r\n3\/5\r\n\r\n- Empire Magazine","id":"51ea4d34760ee3601d24cb9b","url":"https:\/\/www.themoviedb.org\/review\/51ea4d34760ee3601d24cb9b","movie_id":605}
{"author":"Gimly","content":"Everybody knows _The Room_ is bad. That's like, the whole thing. But anybody who says its badness is self-aware is a liar. It's regular bad. It's regular fucking awful. Genuinely, the movies my peers in film class were making when I was **fifteen** are better than _The Room_. Before you say it, yes I did watch The Room in a group, and no I didn't enjoy it.\r\n\r\n_Final rating:½ - So bad it’s offensive. I may never fully recover._","id":"5a45a517c3a36858e4065b8b","url":"https:\/\/www.themoviedb.org\/review\/5a45a517c3a36858e4065b8b","movie_id":17473}
{"author":"TopKek","content":"Edward Zwick's \"The Last Samurai\" is about two warriors whose cultures make them aliens, but whose values make them comrades. The battle scenes are stirring and elegantly mounted, but they are less about who wins than about what can be proven by dying. Beautifully designed, intelligently written, acted with conviction, it's an uncommonly thoughtful epic. Its power is compromised only by an ending that sheepishly backs away from what the film is really about.\r\n\r\nTom Cruise and Ken Watanabe co-star, as a shabby Civil War veteran and a proud samurai warrior. Cruise plays Nathan Algren, a war hero who now drifts and drinks too much, with no purpose in life. He's hired by Americans who are supplying mercenaries to train an army for the Japanese emperor, who wants to move his country into the modern world and is faced with a samurai rebellion.\r\n\r\nThe role of the samurai leader Katsumoto (Watanabe) is complex; he is fighting against the emperor's men, but out of loyalty to the tradition the emperor represents, he would sacrifice his life in an instant, he says, if the emperor requested it. But Japan has been seized with a fever to shake off its medieval ways and copy the West, and the West sees money to be made in the transition: Representatives from the Remington arms company are filling big contracts for weapons, and the U.S. Embassy is a clearinghouse for lucrative trade arrangements.\r\n\r\nInto this cauldron Algren descends as a cynic. He is told the samurai are \"savages with bows and arrows,\" but sees that the American advisers have done a poor job of training the modernized Japanese army to fight them. Leading his untried troops into battle, he is captured and faces death -- but is spared by a word from Katsumoto, who returns him as a prisoner to the village of his son.","id":"5824323b9251411a410066bd","url":"https:\/\/www.themoviedb.org\/review\/5824323b9251411a410066bd","movie_id":616}
{"author":"NickCoIn","content":"Combination action, adventure, broad comedy, and buddy movie has The Rock well-cast as a \"retrieval expert\" fed up with his occupation and looking for a way out. He agrees to one last job in which he travels to a remote village in South America to find his employer's delinquent son, but in the midst of his search he tangles with the town's greedy, megalomaniacal boss, embittered citizens, and gets caught up in a search to find a rare and priceless artifact. Engaging, high-energy action scenes, enthusiastic performances, and moments of genuine humor make this a blast from start to finish. Formulaic to be sure, but lots of fun with Walken adding a hilarious presence as Hatcher. ***","id":"5055fd3e760ee37145000b61","url":"https:\/\/www.themoviedb.org\/review\/5055fd3e760ee37145000b61","movie_id":10159}
{"author":"missmiserys","content":"This movie is special to me, and it probably always will be. It’s one of the first times I remember feeling “seen” in media as a young person that was starting to struggle with mental illness.\r\n\r\nIt’s not a perfect movie, and I think some of the scenes shouldn’t have really been graphically shown like they were bearing in mind that this is a movie directed at teenagers. However, that is a reality for some people, and I do understand the inclusion.\r\n\r\nOverall though, this movie does a great job at depicting what it’s like to develop a mental illness and troubled family dynamics and how a mental illness can develop in a situation like that. Evan Rachel Wood gives such a fantastic performance as Tracy at such a young age.\r\n\r\nI first saw this movie when I was about twelve or thirteen, and although it doesn’t hold quite the same amount of relatability for me that it did then, it still holds up for me close to ten years later. I’m glad it exists and depicts a painful reality, but being able to find something to relate to in that painful reality and that makes you feel “seen” can be something that’s helpful.","id":"5e5ccb0255c9260017530262","url":"https:\/\/www.themoviedb.org\/review\/5e5ccb0255c9260017530262","movie_id":11023}
{"author":"John Chard","content":"There's always the next something, Maggie. And that will take a man away.\r\n\r\nThe Missing is directed by Ron Howard and adapted by Ken Kaufman from the novel The Last Ride written by Thomas Eidson. It stars Tommy Lee Jones, Cate Blanchet, Eric Schweig, Evan Rachel Wood, Jenna Boyd, Ray McKinnon, Val Kilmer & Aaron Eckhart. James Horner scores the music and Salvatore Totino is the cinematographer.\r\n\r\nNew Mexico 1885 and frontier doctor Maggie Gilkeson (Blanchet) has to seek help from her estranged father Samuel Jones\/Chaa-duu-ba-its-iidan (Lee Jones), when her eldest daughter is kidnapped by Pesh-Chidin\/El Brujo (Schweig) an Apache Warlock who sells girls into prostitution.\r\n\r\nAn obvious variation on John Ford's The Searchers, The Missing slipped under the radar some what of Western fans who were greatly served by Kevin Costner's Open Range released the same year. It was a box office flop; which in a genre that has rarely hit great heights in modern times is hardly surprising, but to dismiss Howard's film as a fop is just wrong. True enough it's hardly original on the page, but it manages to not sacrifice character depth as it crams in the Western staples. While there is plenty enough here for none Western fans to enjoy; from the many colourful characters on show (including a great horror movie like villain in Schweig), to the panoramic scenery, and the number of action sequences that flit in and out of the narrative. There's a little something for most movie loving fans.\r\n\r\nThe cast, too, are value for money. Blanchet gives it guts and layers as Maggie, emotionally cold, is forced to put family dissension to one side and take up arms as a Western heroine, and Wood equally holds court with her transference from irksome waif to bold babe. Tommy Jones enjoys himself as he finds a cowboy role to suit his craggy features, features that impressively dovetail with Salvatore's stark photography of the landscapes. Along with the plucky and endearing young Jenna Boyd's performance it obviously only really mounts up to a broken family coming together under duress. But as a quartet, and with Schweig's vile turn as the \"monster\" of the piece in amongst them, they function so well, thus all character arcs are acted skilfully and please the senses. Also to be applauded is the use of genuine Apache language from some of the actors, a nice touch that shows a director taking his material seriously.\r\n\r\nThere's a few endings available to view via DVD etc, but the one that Howard chose for its general release is the right one. It perhaps doesn't hold any great surprise, given the directors reputation and output thus far, but it works well in the context of the story and the period tone set throughout. A safe film, then, one that is very well made and tells its story efficiently in structure and verse. If only the script had dared to take a few more risks then this surely wouldn't have been the monetary flop it was. Still, give it a go and you may find as much to like as I did. 7\/10","id":"5948197cc3a36816c5044f9a","url":"https:\/\/www.themoviedb.org\/review\/5948197cc3a36816c5044f9a","movie_id":12146}
{"author":"NeoBrowser","content":"Commander Lock: \"Not everyone believes what you believe.\" Morpheus: \"My beliefs do not require that they do.\" Characters are always talking like this in \"The Matrix Reloaded,\" which plays like a collaboration involving a geek, a comic book and the smartest kid in Philosophy 101. Morpheus in particular unreels extended speeches that remind me of Laurence Olivier's remarks when he won his honorary Oscar--the speech that had Jon Voight going \"God!\" on TV, but in print turned out to be quasi-Shakespearean doublespeak. The speeches provide not meaning, but the effect of meaning: It sure sounds like those guys are saying some profound things.\r\n\r\nThat will not prevent fanboys from analyzing the philosophy of \"The Matrix Reloaded\" in endless Web postings. Part of the fun is becoming an expert in the deep meaning of shallow pop mythology; there is something refreshingly ironic about becoming an authority on the transient extrusions of mass culture, and Morpheus (Laurence Fishburne) now joins Obi-Wan Kenobi as the Plato of our age.\r\n\r\nI say this not in disapproval, but in amusement. \"The Matrix\" (1999), written and directed by the brothers Andy and Larry Wachowski, inspired so much inflamed pseudo-philosophy that it's all \"The Matrix Reloaded\" can do to stay ahead of its followers. It is an immensely skillful sci-fi adventure, combining the usual elements: heroes and villains, special effects and stunts, chases and explosions, romance and oratory. It develops its world with more detail than the first movie was able to afford, gives us our first glimpse of the underground human city of Zion, burrows closer to the heart of the secret of the Matrix, and promotes its hero, Neo, from confused draftee to a Christ figure in training.\r\n\r\nAs we learned in \"The Matrix,\" the Machines need human bodies, millions and millions of them, for their ability to generate electricity. In an astonishing sequence, we saw countless bodies locked in pods around central cores that extended out of sight above and below. The Matrix is the virtual reality that provides the minds of these sleepers with the illusion that they are active and productive. Questions arise, such as, is there no more efficient way to generate power? And why give the humans dreams when they would generate just as much energy if comatose? And why create such a complex virtual world for each and every one of them, when they could all be given the same illusion and be none the wiser? Why is each dreamer himself or herself, occupying the same body in virtual reality as the one asleep in the pod? But never mind. We are grateful that 250,000 humans have escaped from the grid of the Matrix, and gathered to build Zion, which is \"near the Earth's core--where there is more heat.\" As the movie opens, we are alarmed to learn that the Machines are drilling toward Zion so quickly that they will arrive in 36 hours. We may also wonder if Zion and its free citizens really exist, or if the humans only think so, but that leads to a logical loop ending in madness.\r\n\r\nNeo (Keanu Reeves) has been required to fly, to master martial arts, and to learn that his faith and belief can make things happen. His fights all take place within virtual reality spaces, while he reclines in a chair and is linked to the cyberworld, but he can really be killed, because if the mind thinks it is dead, \"the body is controlled by the mind.\" All of the fight sequences, therefore, are logically contests not between physical bodies, but between video game-players, and the Neo in the big fight scenes is actually his avatar.\r\n\r\nThe visionary Morpheus, inspired by the prophecies of the Oracle, instructed Neo--who gained the confidence to leap great distances, to fly and in \"Reloaded\" destroys dozens of clones of Agent Smith (Hugo Weaving) in martial combat. That fight scene is made with the wonders of digital effects and the choreography of the Hong Kong action director Yuen Wo Ping, who also did the fights in \"Crouching Tiger, Hidden Dragon.\" It provides one of the three great set pieces in the movie.\r\n\r\nThe second comes when Morpheus returns to Zion and addresses the assembled multitude--an audience that looks like a mosh pit crossed with the underground slaves in \"Metropolis.\" After his speech, the citizens dance in a percussion-driven frenzy, which is intercut with Neo and Trinity (Carrie-Anne Moss) having sex. I think their real bodies are having the sex, although you can never be sure.\r\n\r\nThe third sensational sequence is a chase involving cars, motorcycles and trailer trucks, with gloriously choreographed moves including leaps into the air as a truck continues to move underneath. That this scene logically takes place in cyberspace does not diminish its thrilling 14-minute fun ride, although we might wonder--when deadly enemies meet in one of these virtual spaces, who programmed it? (I am sure I will get untold thousands of e-mails explaining it all to me.) I became aware, during the film, that a majority of the major characters were played by African Americans. Neo and Trinity are white, and so is Agent Smith, but consider Morpheus; his superior Commander Lock (Harry Lennix); the beautiful and deadly Niobe (Jada Pinkett Smith), who once loved Morpheus and now is with Lock, although she explains enigmatically that some things never change; the programmer Link (Harold Perrineau); Link's wife, Zee (Nona Gaye), who has the obligatory scene where she complains he's away from home too much, and the Oracle (the late Gloria Foster, very portentous). From what we can see of the extras, the population of Zion is largely black.\r\n\r\nIt has become commonplace for science fiction epics to feature one or two African-American stars, but we've come a long way since Billy Dee Williams in \"Return of the Jedi.\" The Wachowski brothers use so many African Americans, I suspect, not for their box-office appeal, because the Matrix is the star of the movie, and not because they are good actors (which they are), but because to the white teenagers who are the primary audience for this movie, African-Americans embody a cool, a cachet, an authenticy. Morpheus is the power center of the movie, and Neo's role is essentially to study under him and absorb his mojo.\r\n\r\nThe film ends with \"To Be Concluded,\" a reminder that the third film in the trilogy arrives in November. Toward the end, there are scenes involving characters who seem pregnant with possibilities for Part 3. One is the Architect (Helmut Bakaltis), who says he designed the Matrix and revises everything Neo thinks he knows about it. Is the Architect a human, or an avatar of the Machines? The thing is, you can never know for sure. He seems to hint that when you strip away one level of false virtual reality, you find another level beneath. Maybe everything so far is several levels up? Stephen Hawking's A Brief History of Time tells the story of a cosmologist whose speech is interrupted by a little old lady who informs him that the universe rests on the back of a turtle. \"Ah, yes, madame,\" the scientist replies, \"but what does the turtle rest on?\" The old lady shoots back: \"You can't trick me, young man. It's nothing but turtles, turtles, turtles, all the way down.\"\r\n\r\n3.5\/4\r\n\r\n- Roger Ebert","id":"51ea4bba760ee35aab436a09","url":"https:\/\/www.themoviedb.org\/review\/51ea4bba760ee35aab436a09","movie_id":604}
{"author":"Gimly","content":"Oof.\r\n\r\nKind of feels like the pitch meeting for this one basically went:\r\n\r\n\"So I was just reading about the idea of this 'Sin Eater' thing on Wikipedia the other day, it actually sounds really interesting, I'm super keen to put it in a movie!\"\r\n\r\n\"Oh great, so what's the story gonna be?\"\r\n\r\n\"I'm sorry the what?\"\r\n\r\n\"The story. You can't just say you're gonna put a Sin Eater in 'a movie' you have to like... Actually make the movie that it goes in. What's the movie gonna be about?\"\r\n\r\n\"...Oh no.\"\r\n\r\n\"I mean it'll probably be fine.\"\r\n\r\n\"Right? It'll probably be fine.\"\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5d620cb26dea3a001294ed61","url":"https:\/\/www.themoviedb.org\/review\/5d620cb26dea3a001294ed61","movie_id":9616}
{"author":"John Chard","content":"Ocean's Five.\r\n\r\nJohn Bridger's gang of thieves are double crossed and left for dead after a daring gold raid in Venice. The surviving members regroup and convene in L.A. to enact revenge and recapture their gold … the job is on!\r\n\r\nThis could have been a complete disaster, I'm British and the wave of revulsion that boomed in my homeland upon hearing of this remake was explosive; \"how dare they remake a British institution\" was the cry. Things were not helped in the run up to the film's release by  main star (and draw card) Edward Norton, proclaiming that the film was a contractual obligation and that fans of his work would be better advised to give The Italian Job a miss...\r\n\r\nHad to be a stinker then surely? Actually no it isn't. Director F. Gary Gray hasn't remade the \"Italian Job\" of 1969, in fact he hasn't even re-imaged it, the minis are in there, the gold is in there, but all the stand out moments so beloved by many in the 69 film of the same name are not to be seen at all. So what we get is a very cool heist-come revenge movie, that's maybe a tad too glossy at times, but it has got a pretty sharp script, tight action sequences and a group of actors working very well as a team. Mark Wahlberg, Mos Def, Jason Statham, Seth Green and the delectably delicious Charlize Theron all come out smelling of roses, whilst Edward Norton really had no cause for concern because his portrayal as Steve is a smarmy delight.\r\n\r\nI have jokingly titled this film \"Ocean's 5\", but that is in no way detrimental to \"The Italian Job\", it lacks the jazzy coolness of \"Soderbergh's Ocean's 11\", but it's a fun and enjoyable picture all in its own right, thus the rating of just under 7 IMDb is actually spot on. 7\/10","id":"5eb997fccc277c002170b736","url":"https:\/\/www.themoviedb.org\/review\/5eb997fccc277c002170b736","movie_id":9654}
{"author":"John Chard","content":"I was counting on you. You let me down. \r\n\r\nTo Kill a King  is directed by Mike Barker and written by Jenny Mayhew. It stars Tim Roth, Dougray Scott, Olivia Williams, James Bolam and Rupert Everett. Music is by Richard G Mitchell and cinematography by Eigil Bryld. \r\n\r\nIt’s the end of the English Civil War and with King Charles 1st (Everett) held prisoner by the Parliamentarians, Sir Thomas Fairfax (Scott) and Oliver Cromwell (Roth), friends and colleagues, fall out over the best plan of action for the New England.\r\n\r\nA severely troubled production and budgetary constraints left To Kill a King with a mountain to climb just to get acknowledged as a historical epic of worth. Add in the dubious take on this part of English history that so irked the historians, and you would be forgiven for thinking that the film is something of a stinker. Not so actually. For although it’s clearly far from flawless, it’s a literary piece of work that chooses character dynamics over blood and thunder. Suffice to say that those searching for a battle strewn epic should look elsewhere, but if you have a bent for observations on key personalities involved in war politics during times of upheaval in a period setting? Then this delivers the goods. Well performed by the principal players as well. 7\/10","id":"52d178b719c2954c4414396f","url":"https:\/\/www.themoviedb.org\/review\/52d178b719c2954c4414396f","movie_id":18359}
{"author":"Wuchak","content":"Way more than a shallow “chick flick” romcom.\r\n\r\nRELEASED IN 2003 and directed by Boaz Yakin, \"Uptown Girls\" is a dramedy with a little romance about Molly (Brittany Murphy), a fun-loving 22 year-old who suddenly loses her inherited riches and is forced to become a nanny to a stoical neat-freak girl, Ray (Dakota Fanning). Heather Locklear plays Ray’s distant mother who’s an exec in the music biz while Jesse Spencer plays a hunky musician who gets signed. Marley Shelton and Donald Faison are on hand as friends of Molly. \r\n\r\nThe first act didn’t do much for me, but at the halfway point something made me bust out laughing and I busted out four more times before it was over. More importantly, the movie is rich with quality mind\/spirit food. Both Molly and Ray are broken people who handle their grief in opposite ways. And each has what the other needs to heal and escape their disorder.\r\n\r\n“Uptown Girls” boldly reveals that “meds” (drugs) cannot heal or deliver a person; the best they can do is help a person cope. In fact, they usually have negative side-effects, mentally and physically. Sadly, six years after the release of the film Murphy ironically died of cardiac arrest due to inadvertent overdoses of a mixture of over-the-counter & prescription drugs taken (they presume) for a respiratory infection. She was only 32.\r\n\r\nThe flick encourages growing up and achieving true success through (1.) recognizing “golden connections” and taking advantage of them (after all, no one makes it alone, no one; they had help); and (2.) discerning and cultivating one’s special talent(s). I’d say more, but it’s better to see the movie, enjoy it, and quarry the gems for oneself.                                     \r\n\r\nTHE MOVIE RUNS 1 hour 32 minutes and was shot in New York City (Manhattan & Brooklyn with studio work done in Queens). WRITERS: Julia Dahl, Mo Ogrodnik & Lisa Davidowitz wrote the script based on Allison Jacobs’ story.  \r\n\r\nGRADE: B+","id":"5aa9dd65c3a36851f5004fce","url":"https:\/\/www.themoviedb.org\/review\/5aa9dd65c3a36851f5004fce","movie_id":14926}
{"author":"gownpolitician","content":"Story portrayed as interestingly as possible. Christensen well-cast as someone reprehensible.","id":"5441bfef0e0a2663330009ff","url":"https:\/\/www.themoviedb.org\/review\/5441bfef0e0a2663330009ff","movie_id":13537}
{"author":"John Chard","content":"Ah, but you have heard of me.\r\n\r\nThe crew of the Black Pearl are cursed by something most unimaginable, the only way to lift the curse is to return a lost Aztec coin to its treasure chest home. In the way of them achieving their goal is the British Governor's daughter, the son of Bootstrap Turner, oh and a former comrade by the name of Captain Jack Sparrow who the crew had left to die on an island some time ago.\r\n\r\nIt's now common knowledge that Pirates Of The Caribbean is a film based upon a theme park ride of the same name, thoughg that ride is not actually a roller-coaster, it's fair to say that this film most assuredly is. A swashbuckling ripper of an adventure yarn cramming in every pirate film staple it can and pouring on layers of charm at every turn. Into the broth goes romance, comedy and striking adventure, and director Gore Verbinski even manages to give the children watching little slices of horror, not enough to keep them up at night, but enough to bring on an uneasy grin.\r\n\r\nIt's unashamedly commercial, produced by that purveyor of OTT entertainment values, Jerry Bruckheimer, it was to be expected, but few blockbusting movies of the new age can lay claim to being such an out and out reason for having fun. This is the reason why Pirates had few peers at the time of its release, for it knows its reason for being, it's not taking itself seriously. The audience is not being hoodwinked in any way, they are having fun because so is the film and so is, crucially, the impressive cast. Johnny Depp as Sparrow is having the time of his life, basing the character around the dubious mannerisms of Rolling Stone icon, Keith Richards, it works to its highest potential and Depp is simply wonderful in the role. Keira Knightley (perfectly cast), Orlando Bloom, Geoffrey Rush, Jack Davenport, Jonathan Pryce and Mackenzie Crook all do what was asked, which is essentially say your lines right and have a blast with it, it really is that sort of picture.\r\n\r\nThe subsequent sequels would forget what made this first offering so enjoyable, foregoing the outrageous sense of fun for a dark sheen and character development. That is a shame, but at the very least we still have this wonderful picture to go back to time and time again, to lift you up when one is down or to keep one happy when one is already in that happy place. The Curse Of The Black Pearl is a joy from start to finish. 9\/10","id":"5424a49ec3a3681eca002c23","url":"https:\/\/www.themoviedb.org\/review\/5424a49ec3a3681eca002c23","movie_id":22}
{"author":"apesterin","content":"One of the very best movies on this topic. Well executed and the actors are top notch. Deserved the national awards that this movie collected","id":"51ab4dff760ee3357b7a7051","url":"https:\/\/www.themoviedb.org\/review\/51ab4dff760ee3357b7a7051","movie_id":198727}
{"author":"John Chard","content":"You'd do the same. If you saw those kids on the street, you would do the same. \r\n\r\nThe assassination of Dublin crime reporter Veronica Guerin in 1996 shook Ireland to the core, her murder saw a public swell of determination to rid the country of its drug peddlers. Joel Schumacher's film is an in depth interpretation of the woman, her beliefs, her family life, her complexities and her stoicism to root out the drug barons putting liquid death into the arms of the many.\r\n\r\nThankfully avoiding Hollywood clichés, it's often gritty and well thought out, Schumacher and his writers, Carol Doyle and Mary Agnes Donoghue, don't soft soap the Guerin image, her faults are laid bare alongside her searing strengths. The dangers of her work are very prominent throughout, leading to some suspenseful and fearsome scenes. Cate Blanchett as Guerin is inspired casting, an actress capable of covering all facets of the human condition, and in support Ciaran Hinds, Gerard McSorley and Brenda Fricker give powerful performances. 8\/10","id":"5e5ecac455c926001955ab7e","url":"https:\/\/www.themoviedb.org\/review\/5e5ecac455c926001955ab7e","movie_id":10629}
{"author":"TrentTX","content":"I am a big Austen fan, and I love her novel Pride and Prejudice so I like to check out all the movie adaptations.  This movie is very enjoyable especially if you are also an Austen fan.  Their adaptation is very creative and I appreciated the choices they made to update the story.  I don't know what the connection is to the Mormons but it does not detract from the movie.  I don't think the word Mormon is heard in the movie, and the church they visit could be any modern church.  Having religious characters does help the characters stay true to their Austen-era values.  Most of the fun of any P&P adaptation is seeing the characters and I think they are all very consistent to the characters in the book as far as their motivations and personalities.  The biggest disappointment is the lack of a Mr. & Mrs. Bennett but they were probably trying to stay in budget.  The character Lady Catherine is also missing with Caroline Bingley taking over some of that plot drama.  Overall, I can recommend this movie to fans of the book. I prefer the Keira Knightly version but this one is fun too.","id":"59a85e2092514157a501a58f","url":"https:\/\/www.themoviedb.org\/review\/59a85e2092514157a501a58f","movie_id":18087}
{"author":"Wuchak","content":"Fun adventure in the Outback\r\n\r\nRELEASED IN 2003 and directed by David McNally, \"Kangaroo Jack\" is a family-friendly adventure\/comedy about two Brooklyn friends (Jerry O'Connell and Anthony Anderson) who are commissioned by a mob boss (Christopher Walken) to deliver $50,000 to a shady character in the Outback. The operation goes awry when a kangaroo inadvertently runs off with one of the guys’ jacket… and the money. Michael Shannon is on hand as a mob heavy.\r\n\r\nThis is a likable, amusing adventure flick with the typical eye-rolling kid humor (e.g. fart jokes). It’s fun, harmless hokum highlighted by spectacular Australian cinematography and the beautiful Estella Warren as an Outback preservationist. The humorous camaraderie of the protagonists is another highpoint. But the story isn’t as compelling as I hoped it would be and the camera never really captures Estella’s beauty beyond her lovely face and pulchritude.\r\n\r\nTHE FILM RUNS 1 hour, 29 minutes and was shot in Australia and Brooklyn with reshoots done in Los Angeles.\r\n\r\nGRADE: C+","id":"5b256aa7c3a36841fc0073d4","url":"https:\/\/www.themoviedb.org\/review\/5b256aa7c3a36841fc0073d4","movie_id":10628}
{"author":"John Chard","content":"Chop Schlockery.\r\n\r\nChow Yun-Fat and Sean William Scott buddy up to retrieve an ancient scroll from baddies, chop sockery does follow.\r\n\r\nThat’s pretty much it really, the two characters obviously poles apart, but coming together as one in a series of action scenes that are both laughable and enjoyable because of the former. The script is poor, with much of the dialogue of the tripe delivery kind, and in truth Yun-Fat is wasted in a thankless role. Story throws in a Nazi baddie, a girl on girl scrap and Sean William Scott casting off his petty crime ways to become the way of the samurai – or something like that.\r\n\r\nBrainless but fun, but also instantly forgettable into the bargain. 5\/10","id":"53ad4a48c3a3682edb0015d0","url":"https:\/\/www.themoviedb.org\/review\/53ad4a48c3a3682edb0015d0","movie_id":11817}
{"author":"John Chard","content":"Being God can be Hell.\r\n\r\nFans of Jim Carrey can't go wrong with this fun filled picture that's not without serious undertones as well.\r\n\r\nThe Premise is flimsy as such, Carrey plays Nolan, a harried and fed up TV reporter who feels that all of his problems are God's fault. Having enough of his whingeing, God (Morgan Freeman) summons Nolan to his \"residence\" and bestows all his powers to him. This is where the film hits its stride, the makers letting Carrey loose for a number of funny sequences as he plays God to further his own ends.\r\n\r\nIt goes where you expect it to, and nobody else gets a look in as Carrey does his stuff, but the journey is a most pleasant one. 7\/10","id":"53e8067ac3a368399c002405","url":"https:\/\/www.themoviedb.org\/review\/53e8067ac3a368399c002405","movie_id":310}
{"author":"tmdb44006625","content":"I mean, what was everyone expecting? They hired a director who does mostly Asian art-house movies to helm a comic book movie about a green monster who smashes things when he gets angry. Of course Ang Lee was going to delve into Freudian concepts, overtones of Greek tragedy, and strange editing choices.\r\n\r\nMy issues with Hulk are more focused on its painfully slow pace and messy third act. Yes, the whole movie seems a bit pretentious, but you have to at least admire the intent and ambition to make this movie, even if the execution is wonky.","id":"5c8429ba0e0a2642fb63b4f2","url":"https:\/\/www.themoviedb.org\/review\/5c8429ba0e0a2642fb63b4f2","movie_id":1927}
{"author":"Cwf97","content":"Ang Lee helped revolutionize superhero related films forever with Hulk (2003). Rather than just have the hero try to save the world, Lee and James Schamus decided to have Bruce Banner deal with his Freudian psychology, specifically the repressed memories he had thirty years ago about his father.\r\n\r\nThe acting talents of Eric Bana, Jennifer Connelly, Nick Nolte, Sam Elliott and Josh Lucas are perfect for the five main characters. Bana was able to do intentional wooden acting to hide his character's repressed emotions while Connelly conveyed kindness as her Oscar winning role from A Beautiful Mind (2001).\r\n\r\nWhat I loved about Lee's interpretation is that he did not care about faithfulness. He cared about showing a cerebral kind of superhero film that later got imitated with The Dark Knight Trilogy (2005-2012), Watchmen (2009), Logan (2017), Dawn of Justice (2016) and Suicide Squad (2016).\r\n\r\nAng Lee is one of the best directors to have ever lived and Hulk is one of many films he directed for great proof.","id":"599df34a92514148d900177e","url":"https:\/\/www.themoviedb.org\/review\/599df34a92514148d900177e","movie_id":1927}
{"author":"lori007101","content":"The Green Giant is awakening!\r\nAs a little baby, the Offspring Bruce Banner Genmanipulativ is changed. Later, as a young man, he is a scientist himself and is employed with gamma radiation. He wants to try to reach scar tissue and injuries, using the radiations, a healing method. Through an accident with the radiation, banners mutate when he has a tantrum, to a Green Giant: the Hulk!\r\nEric Bana plays the shy and vulnerable Bruce banner. Although he does not really trust the role, he mastered the insecurity in person, sovereign. \r\nJennifer Connelly plays Betty Ross. Connelly embodies Betty cool and sober. It is only when she experiences how banners mutate that she shares a helping emotion.\r\nJosh Lucas plays Glen Talbot. Talbot is fully fixated on his career and is a smug Sesselfurzer. He wants to develop the invention of banners for the military and thus create super soldiers. He has every means right for that. Lucas was arranged as a little villain. Unfortunately, he doesn't necessarily come across like that.\r\nThe military commander Ross, is portrayed by Sam Elliott. Elliott plays his character cool and iron. He really wants to protect his country. That is why he acts defending and patriotic for his country. \r\nAlthough Nick Nolte has at least playtime, he plays his role most deeply. The few minutes of presence, is a pleasure of acting. \r\nThe visual language of the director Ang Lee is very special. His idea of using certain settings as a split screen is also closer to the Marvel Comics. So that you really also realize the Hulk is a comic book template. \r\nThe effects from the year 2003 are good, but you can already notice certain Unperfektheiten.\r\nThe animations are still kitschy. Which seems a bit ridiculous, too. The story leaves a lot to miss. On the one part, because Hulk belongs in the MCU, here the humor and sarcasm is very rare to see. The colourful and colourful MCU can not be classified here. The story is portrayed here rather as a fantasy drama. Which then looks rather dull for a comic book template. \r\nIn the last third, it is right to the point and it is going to be quite an effect thunderstorm. It's really a pity that you have to wait more or less until the end until the Hulk drops off steam. \r\nConclusion: A down-to-earth stand of the character hulk of Marvel Comics. Unfortunately, it diminishes the story through seriousness and dramaturgy that happens!","id":"5b7afcd5c3a36860db0595b5","url":"https:\/\/www.themoviedb.org\/review\/5b7afcd5c3a36860db0595b5","movie_id":1927}
{"author":"John Chard","content":"It’s Regina versus us; The Kelly Gang.\r\n\r\nNed Kelly is directed by Gregor Jordan and written by John Michael McDonagh (based on “Our Sunshine” written by Robert Drewe). It stars Heath Ledger, Orlando Bloom, Naomi Watts, Geoffrey Rush and Joel Edgerton. Music is by Klaus Badelt and cinematography by Oliver Stapleton.\r\n\r\nThe Australian Robin Hood? Well not quite, but Ned Kelly’s name and exploits live on for ever more. As is often the case with film’s of this type, such as Braveheart, it’s best to approach them as interpretations of real events and people, than actual historical facts. The core basis of Ned Kelly the man is here, and the picture built around him is handsomely mounted. Also ripe with strong character portrayals by the key actors (fluctuating accents and dodgy beards aside) and shot through with enough lyrical smarts by Jordan, it’s a film big on atmosphere and authentic feel.\r\n\r\nHowever, obviously hamstrung by budget and running time etc, much of the story feels incomplete. There’s also the problem of under using Geoffrey Rush, who although playing a key character in the Kelly legend, is only on the periphery of things. Still, the evident problems can’t stop it from being an engaging piece of entertainment. It’s consistently beautiful to look at, Badelt’s mournful musical score is an absolute cracker and the action is well staged by the passionate Jordan.\r\n\r\nWe are still waiting for the definitive Ned Kelly Gang movie, because although this is made with care of the source stories, it only scratches the surface of this most interesting period of Australian history. 7\/10","id":"538f87180e0a262976000956","url":"https:\/\/www.themoviedb.org\/review\/538f87180e0a262976000956","movie_id":10544}
{"author":"raistlin3","content":"**This movie is a train wreck.** You watch it in spite of yourself. The only redeeming part of the movie was the interracial scene. The sex was tepid which is more than I can say about the rest of the movie. If I were to give this movie a \"thumbs\" rating, I would chop off any thumb that did not attempt to hitchhike its way away from this disaster.","id":"542ff63cc3a36831ac0005af","url":"https:\/\/www.themoviedb.org\/review\/542ff63cc3a36831ac0005af","movie_id":129308}
{"author":"Wuchak","content":"Mild high school horror flick based on Frank Peretti’s supernatural book for youths\r\n\r\nI originally saw this 2003 movie on DVD a couple of years after its release and, preparing to re-watch, I couldn’t remember anything about it, except the wacky professor, played by the author of the book, Frank Peretti, who comes across as a shorter Dr. Emmett Brown from “Back to the Future.” I saw an interview with him and he’s really IS as eccentrically animated as he appears in the film.\r\n\r\nThe plot revolves around a Spokane, Washington, high school, which is supposedly haunted by the ghost of a kid who committed suicide ten years earlier. Several jocks have freaked out after seeing the apparition and subsequently went into a coma. The school enlists the services of the Veritas Project, a team of investigators who work undercover to unravel paranormal phenomena. They’re like the family version of Mulder & Scully from The X-Files.  David Keith plays the father, Mel Harris the mother and the teen twins are played by Leighton Meester and Douglas Smith. The dad pretends to be a janitor at the school while the kids act as new students.\r\n\r\nTo enjoy this movie you have to accept the highly unlikely premise of a family team of investigators and the fact that this is a tame horror movie from an author who’s writes Christian supernatural fiction with this movie being geared toward youths (tweens, teens & pre-teens). You also have to accept that, while the movie had a limited theatrical release, it had the budget of a TV movie ($2 million) and it shows. \r\n\r\nWith that in mind, there are several things to appreciate about “Hangman’s Curse”: The cast is likable, formidably headed by Keith; for once in a high school flick we get students who actually LOOK like they’re in high school, rather than mid-20s; I like the forbidden wing of the school and its subterranean burrows (reminiscent of the boiler room sequences in the Nightmare on Elm Street flicks); there are loads of creepy arachnids; and there are some quality cuts on the soundtrack.\r\n\r\nOn the downside, the acting of the peripheral teens is understandably weak and the convoluted story could’ve been relayed in a clearer, more compelling manner.\r\n\r\nAs far as the Christian-oriented content goes, it’s so light that I can hardly see how anyone would be offended. For instance, a group prays before their meal. Woo, like that doesn’t happen every day in every community throughout the Americas. Since the protagonists are Christians, it makes sense to portray them accordingly. If anything, the movie plays it too low-key in this regard.\r\n\r\nThe film runs 1 hour, 46 minutes and was shot in Spokane, Washington.\r\n\r\nGRADE: C+","id":"5b9fe6a692514177cc001e25","url":"https:\/\/www.themoviedb.org\/review\/5b9fe6a692514177cc001e25","movie_id":45862}
{"author":"John Chard","content":"Not so hush hush but very much on the QT.\r\n\r\nAfter being gunned down on her wedding day by her former colleagues, assassin Black Mamba (Uma Thurman) rouses from a four year coma with only one thing on her mind, revenge! Striking up a death list of five, she sets off for bloody retribution.\r\n\r\nQuentin Tarrantino writes and directs what is in all truth, a homage to all the cinema conventions close to his heart. Think an amalgamation of chop-socky, sexploitation, samurai, spaghetti Westerns, anime and cop shows of years past, and you get the heart of Kill Bill. A film that was so epic in scope it had to be cut into two films. What it lacks in Tarrantino dialogue dynamite it more than makes up for with action and astute visual flair. And it's bloody, very bloody. Thurman is great as the avenging Mamba\/The Bride, while the inclusion of Sonny Chiba & Lucy Liu adds a touch of class as QT revels in his East meets West berserker narrative. It could have been trimmed down, particularly in the middle section where Tarrantino deals in a calm before the storm ideal, but Volume 1 was one of the most exciting movies of 2003, and most notably it shows Tarrantino to be adept at action directing. His action skills perhaps explains why the script doesn't crackle with the wit and panache of his previous offerings? You sense he wants more than the words \"fine writer\" engraved on his granite mined Curriculum Vitae.\r\n\r\nHugely enjoyable with a neat end of film cliffhanger, roll on part 2... 8\/10","id":"59d532869251414ba501d2b1","url":"https:\/\/www.themoviedb.org\/review\/59d532869251414ba501d2b1","movie_id":24}
{"author":"Manwithnoname123","content":"This is the movie he made after Jackie Brown. I thought I might just point that out. A big budget, larger scale action blockbuster. This is the one that would change the direction of Tarantino's films. And honestly, it might be my favorite besides Pulp Fiction.\r\n\r\nThis movie oozes with style and beautifully choreographed action. This movie has an anime section akin to Japanese anime. That's some cool stuff. Even the non-action parts are some really good stuff. Like the guy from the old Street Fighter movies as Hatori Hanzo and making the Bride's sword. And the fantastic soundtrack. The great opening scene where the Bride gets shot and then the somber \"Bang Bang\" by Nancy Sinatra plays. \r\n\r\nBut of course, the amazingly choreographed action makes this movie. A lot of it is showcased in the Crazy 88 fight and the few fights before it. It has some brilliant uses of the style. Of course, there's black and white which was actually used to avoid an NC-17, but works very effectively. And the beautifully shot battle between the Bride and O-Ren. No music really adds a lot to it. It's quiet and oh so effective compared to the loud blood fest of the Crazy 88. \r\n\r\nBut there's also the opening hand to hand fight scene with Vernita Green which is also very well edited. Very surprising scene as it is interrupted by Green's daughter coming home and then they talk. And it starts back again as quickly as it began and then ends once again with a knife to Vernita's chest. What a brilliant tension filled scene.\r\n\r\nThe movie also never takes itself too seriously. That's for the sequel. But the fun action and style leads the whole way. Also along with Buck, and other fun scenes. Lest we forget other great scenes like the whistle scene as Elle Driver comes to kill the Bride in her sleep. Or interrogating Sophie. \"These will be things you will miss.\" I love it.\r\n\r\nHonestly, it might be the best action movie of the 2000s, at least for me. And Tarantino has a lot of my favorite movies. Maybe I enjoy his movies a bit too much. But even with that, it's one of the my favorites. Kill Bill Vol 1 gets a 10\/10","id":"593c4bb3c3a3680f42011f61","url":"https:\/\/www.themoviedb.org\/review\/593c4bb3c3a3680f42011f61","movie_id":24}
{"author":"Wuchak","content":"Uma Thurman as an anti-superheroine  \r\n\r\nRELEASED IN 2003 and written\/directed by Quentin Tarantino, \"Kill Bill: Vol. 1\" is an action\/thriller\/fantasy starring Uma Thurman as The Bride who seeks vengeance on the team of assassins who betrayed her, a group of which she once belonged. Her journey takes her from El Paso to Pasadena to Okinawa. Vivica A. Fox, Lucy Liu, ravishing Julie Dreyfus and Michael Madsen appear as various assassins or accomplices.\r\n\r\n\"Kill Bill” is a creative mish-mash of 60s-70's Bond-isms, Spaghetti Westerns and martial arts flicks, but with modern production values. It sometimes plays like a superhero movie in that The Bride is essentially an anti-superheroine who mows down literally armies of skilled fighters, e.g. the overly drawn-out B&W fight with the Crazy 88s. I loved the inclusion of Ennio Morricone's \"Death Rides a Horse.\"\r\n\r\nOn the downside, there’s an overlong lame anime sequence and the characters lack substance and realism, but who can deny the film’s pizzazz? Sure, it’s style over substance, but it’s entertaining in a voguish, quirky way. Since both parts were meant to be ONE MOVIE, it’s mandatory to see “Vol. 2” to properly appreciate and appraise “Kill Bill.” The second part fills in the holes.\r\n\r\nTHE MOVIE RUNS 111 minutes and was shot in Texas, California, Mexico, Tokyo, Beijing and Hong Kong.\r\n\r\nGRADE: B\/B- (6.5\/10)","id":"5b50e8c592514112c300231f","url":"https:\/\/www.themoviedb.org\/review\/5b50e8c592514112c300231f","movie_id":24}
{"author":"John Chard","content":"We dig, dig, dig, dig, dig, dig…\r\n\r\nDisney produce and Andrew Davis directs this wonderful adaptation of Louis Sachar’s Holes. Miscreant youths are sent to Camp Green Lake for character building, the bulk of which involves them constantly digging holes in the parched desert. New inmate Stanley Yelnats IV (Shia LeBeouf) is about to set the wheels in motion that will unearth the secret of the digs. \r\n\r\nIt’s a blender is Holes, part drama (there’s plenty of edginess here), part coming of age tale, part action adventure – cum – detective mystery – cum - Western and part comedy, in short it’s a bona fide piece for all the family. The narrative, awash with whimsy and enchantment, is triple pronged, and it’s with great credit that the three story arcs are seamlessly put together to create one delightful whole. The child actors, led by LeBeouf, are excellent, really bringing life to the various characterisations, while Sigourney Weaver, John Voight and Tim Blake Nelson have a great time of things as the camp enforcers, and Patricia Arquette in a two-fold characterisation, scores very favourably with charm, grace and menace in equal measurements.\r\n\r\nMature and intelligent kids films are a rarity, Holes is like a little gem dug up in the desert. 8.5\/10","id":"53ad5510c3a3682eea001650","url":"https:\/\/www.themoviedb.org\/review\/53ad5510c3a3682eea001650","movie_id":8326}
{"author":"Wuchak","content":"Rob Zombie’s comic book non-horror take on “The Texas Chainsaw Massacre” \r\n\r\nRELEASED IN 2003 (but shot in 2000) and written\/directed by Rob Zombie, \"House of 1000 Corpses” is a horror\/black comedy about two young couples who inadvertently visit a house of demented serial killers in backwoods Texas.\r\n\r\nA critic summed the movie up as “a ridiculous horror comedy, but with extremely annoying villains.” It was inspired by (or rips off) “The Texas Chainsaw Massacre” (1974) and combines it with the cartoonish horror comedy of “Evil Dead II” (1987) while throwing in a little “The Funhouse” (1981).\r\n\r\nThe entire first act, including the amusing prologue that introduces Captain Spaulding (Sid Haig), is very entertaining, but the over-the-top approach starts to get dull by the middle of the picture with the overdone events at the demented Firefly abode. The last act gets so cartoonish that I thought maybe the main protagonist (Erin Daniels) was experiencing a nightmare. The fantastical elements strip away any vestige of horror that was hardly there in the first two acts, which were too zany to take as serious horror. As such, I can’t see anyone older than 7 finding this movie “disturbing.” Still, the film pulsates with colorful pizazz and characters, not to mention a quality score\/soundtrack.\r\n\r\nSheri Moon Zombie is effective in her role as Baby Firefly. I liked her voice and didn’t mind her laugh (which many criticize), but she’s a little too thin for my tastes. Daniels works pretty well as the main protagonist. But, considering Zombie’s resources (e.g. the five captive cheerleaders), the flick sorta drops the ball in the female department.\r\n\r\nThe film sat on the shelf so long because Universal feared a NC-17 rating. Lions Gate eventually picked it up, but it was cut & edited in an attempt to achieve an R-rating. The original version was 16 minutes longer.\r\n\r\nTHE MOVIE RUNS 1 hour, 29 minutes and was shot in Southern Cal (Chicken Ranch Backlot, Universal Studios; Palmdale; Santa Clarita; and Saugus).\r\n\r\nGRADE: B-\/C+","id":"5b2159eb0e0a264d8d00fa3b","url":"https:\/\/www.themoviedb.org\/review\/5b2159eb0e0a264d8d00fa3b","movie_id":2662}
{"author":"Reno","content":"> How simple, charming dance flick it is.\r\n\r\nOne of the first films in the revolution of modern dance flicks, though I know I saw it too late. Nowadays there are many films are coming out since the younger generation showing very interest in the dance. I especially don't know how 'Step Up' made a successful franchise, but the sixth is on the way.\r\n\r\nHoney is a main character's name played by Jessica Alba. A passionate dance, choreographer, when her dream coming to true that hits a roadblock for some reason followed by other issues. So now she has to come up with a solution to solve all the problems and that's the film tells how she overcomes them all at once.\r\n\r\nA simple story, even the choreography was ordinary, but not a bad film. I anticipated Alba to give a show that not to forget for the decades. This is now obviously a decade old flick and disappointed with her character, especially with her dance moves. But young Alba in a sexy pose on the poster, no one can just ignore it from watching.\r\n\r\nOverall, I enjoyed it. Since I'm watching it delayed, I should not compare it to the present scenario. Even though it has been only 13 years, in which all the fields rapidly advanced, so the dance. I suggest you just go for it with an empty mind if you want to see it. Soon I'm going to catch up with its sequel, but I know it won't be as decent as this one.\r\n\r\n6\/10","id":"5760268b9251415e2e002ac2","url":"https:\/\/www.themoviedb.org\/review\/5760268b9251415e2e002ac2","movie_id":10028}
{"author":"Gimly","content":"The dialogue is laughable, the acting is horrible, and the only thing worse than these two things is the direction. But I'll be damned if there isn't some genuinely fun practical effects sequences set to music on offer.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"594a203cc3a368613c007fa9","url":"https:\/\/www.themoviedb.org\/review\/594a203cc3a368613c007fa9","movie_id":11059}
{"author":"Gimly","content":"Heavy throwback elements make up most of _House of 1000 Corpses_' runtime, from an era when Zombie was still finding his footing. It maybe leans too heavily on a nostalgia that I simply don't have, but personally I found this to be one of Zombie's weaker entries. Great song! But I don't totally love the movie. I like it. I wish that some of the parts I found more interesting, like Doctor Satan, got a bit more play, and both the acting and video quality often leave something to be desired, but still, I like it. \r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5e072328eda4b700172b6b6f","url":"https:\/\/www.themoviedb.org\/review\/5e072328eda4b700172b6b6f","movie_id":2662}
{"author":"John Chard","content":"We've been partners for what, four months, and now you wanna be my shrink?\r\n\r\nUltimately you have to think that those who have wanted to see Hollywood Homicide would have done so by now, certainly fans of the generational divided lead actors (Josh Hartnett and Harrison Ford) would have long since tuned in to see what it's like. It's fair to say that its reputation is most divisive, with some critics proving to be most ferocious in their summations. Personally I find it to be an enjoyable spin on the buddy buddy cop formula, where director Ron Shelton isn't afraid to put emphasis on characters instead of just filling out the pic with high octane bangs and crashes. The wry portrayal of the police system in a bustling Los Angeles is nicely etched into the froth, with the sidebar of coppers having two jobs being a deft poke in the ribs.\r\n\r\nGood fun with well crafted action scenes, but the main strength is in the writing and to see once again that Ford has been very undervalued as a comedy actor of the years. 6.5\/10","id":"538c30e10e0a266705003b32","url":"https:\/\/www.themoviedb.org\/review\/538c30e10e0a266705003b32","movie_id":11375}
{"author":"The Movie Diorama","content":"Mystic River continuously outflows its poignant crime investigation through a meticulously gritty screenplay. The past haunts us. Experiences and encounters, grossly susceptible and an impressionably young age, returning viciously with psychological detriments. A naive boy that just didn’t know any better. Abducted. An unresolved mystery that manifested itself into an intricately societal Massachusetts neighbourhood, where one disturbance can erupt into a multitude of hatred from the cold concrete beneath them.\r\n\r\nA father’s daughter mercilessly murdered in the streets that he, and his two ex-friends, played hockey in. Anguish. Guilt. Vengeance. His childhood pals, one assigned the task of searching for the killer and the other forced into battling his own justifications for not murdering her, sending their condolences to the grieving father. Yet, Mystic River refuses to tell a simple crime drama. Eastwood, with his insatiably concise attention to the screenplay, elevated the mystery by providing an illustration of emotive complexity. One that many inflict upon themselves. Torment. These three individuals, with one visibly undergoing traumatic bewilderment, exhume indications of self-torment.\r\n\r\nMystic River does not flow water. The elaborate dialogue is too viscous for the aqueous substance. Rather, it flows blood. Bacon’s detective role combating his duties as a justice seeker, that with the liabilities of adolescent friendship. Determining the fate of neighbours within his hands. Robbins’ psychologically damaged husband role, fabricating stories to protect his moral high ground. And Penn’s award-winning performance as the father, embroiled in a plethora of intense emotions that express the full journey of bereavement. As separate souls, these three give life to Helgeland’s script that, whilst frequently becomes overwrought with unnecessary conversations that repeat earlier information, undeniably captivates with its foundational strength in investigation building.\r\n\r\nEastwood takes a differing approach. Instead of the classic yet saturated “who dunnit!?” narrative structure, he settled for displaying the mechanisms of detective fieldwork. Composing a timeline but questioning witnesses and suspects. Revisiting evidence to accurately imagine the murder as it happened. See, Mystic River works not for its “twists” and “turns” so to speak, but for its richly developed characters and constant focus on the investigation itself. The sensational performances, acute direction and gritty aesthetics provide the script with leverage. It exposes the rawness of the situation beautifully. Not to mention the exquisite pacing that made two and half hours flow by quicker than a hockey stick crashing down a raging waterfall.\r\n\r\nThe conclusion should’ve been tighter, with Eastwood diminishing much of the staying power by unnecessarily extending its resolution. By simply ending on Jimmy and Sean coming to terms with what’s just happened, it enables the shock of its ending to simmer much more violently than Linney exclaiming how everyone else is weak compared to her and her husband.\r\n\r\nSo whilst not perfect, Eastwood adapts Lehane’s novel with a sense of emotional urgency. Once the grit settles in, it never lets up, taking you on a roaring ride down a river of torment.","id":"5e206e13e004a60018996c75","url":"https:\/\/www.themoviedb.org\/review\/5e206e13e004a60018996c75","movie_id":322}
{"author":"Wuchak","content":"***Evils of the past and the problems with vigilante justice***\r\n\r\nReleased in 2003 and directed by Clint Eastwood, “Mystic River” tells the story of three men from a working class neighborhood in Boston. While playing in the street as kids, one of them is abducted and sexually abused for days. As adults they’ve drifted apart. Jimmy (Sean Penn) is a reformed con who runs a successful market when his daughter is suddenly murdered (Emmy Rossum). Sean (Kevin Bacon) investigates the murder with his partner, Whitey (Laurence Fishburne), with evidence eventually pointing toward Dave (Timothy Bottoms), the one who was abducted. Marcia Gay Harden plays Dave’s anxious spouse while Laura Linney plays Jimmy’s loyal wife.\r\n\r\nThis is similar in tone & theme to the melancholy “Sleepers” (1996), but less episodic and more dramatically gripping. The movie has the confidence to take its time and flesh-out the characters. It’s a psychological crime drama that works as both a whodunit and a tragedy. The intrinsic problems of vigilante justice are cogently illustrated.\r\n\r\nSome people have misinterpreted the movie because they missed some things. For instance, they criticize the curious Lady Macbeth-like monologue of Annabeth (Linney) at the end. But watch the movie again, pay close attention, and the answers are there. I’d say more, but I don’t want to give anything away (you’re welcome to write me if you’d like some insights). \r\n\r\n“Mystic River” is not something that can be casually watched; it’s a deep drama with three-dimensional characters, potently exploring several intriguing issues: How abuses of the past affect the present; the danger of hiding recesses of your psyche; the folly of not getting spiritual help for deep-rooted psychological concerns; disloyalty\/loyalty; doing the wrong thing for the right reasons; jumping to wrong conclusions based on dubious info; houses divided cannot stand; the importance of encouraging one’s spouse for the sake of familial health & survival; “king of the castle”; etc.\r\n\r\nThe film runs 2 hours, 18 minutes and was shot in Boston.\r\n\r\nGRADE: A","id":"5c180e50c3a36866bd388ea8","url":"https:\/\/www.themoviedb.org\/review\/5c180e50c3a36866bd388ea8","movie_id":322}
{"author":"Uknown","content":"An interesting Telugu movie that doesn't follow the formula and has new faces. Great performances and a good story line mean that it is a must watch for any Telugu-movie fans","id":"57b25c7bc3a3683534006a30","url":"https:\/\/www.themoviedb.org\/review\/57b25c7bc3a3683534006a30","movie_id":311777}
{"author":"j.crawford","content":"Funny as hell movie from one of the best directors working in Hong Kong today. With a clever screenplay, the cast is awesome. Lots of kung fu fun and some serious kick-ass from martial arts director Stephen Tung Wai. Highly recommended!","id":"523755d8760ee3254a0aeb15","url":"https:\/\/www.themoviedb.org\/review\/523755d8760ee3254a0aeb15","movie_id":45413}
{"author":"JPV852","content":"Really poor sequel that has outlandish action scenes and lame jokes. If there's such a thing as a movie that epitomizes the early 2000s, this is it. Maybe it's my older age, but the T&A aspect holds little weight anymore. **1.75\/5**","id":"5daf8f8809dda40013dfa569","url":"https:\/\/www.themoviedb.org\/review\/5daf8f8809dda40013dfa569","movie_id":9471}
{"author":"The Movie Diorama","content":"Charlie’s Angels Full Throttle fully accelerates whilst narratively stuck in second gear. Can I order a McG sandwich please? Huh? You have no filling? Sure, I’ll just take the overly stylised sauce. My personal adoration for this sequel’s predecessor is one that cannot be described fully without tackling the realms of lunacy and diminishing my own critical insight. It’s just a special piece of camp nostalgia for me, even if its construction is more amateurish than Diaz’ dance moves. Interestingly, this continuation was also on repeat as I galloped around the room to the soundtrack of The Prodigy and The Chemical Brothers, witnessing physically impossible aerobatic stunts. However, after all these years, it’s time to succumb to the realisation that Full Throttle is a bad film.\r\n\r\nMuch like the first feature, its plot is a secondary product to the outlandish femme fatale antics. This time the angels must secure two H.A.L.O. rings which probably has something to do with monetisation and greed. Don’t ask me! For I honestly do not know. A stationery Barrymore sliding fully under a low table without the use of her arms had me entranced. Liu leaping sixty feet into the air by just jumping off a table had me hypnotised. And of course, Diaz bopping to MC Hammer’s “U Can’t Touch This” had me salivating. These, including the last point (have you tried side stepping that rapidly!?), are physically impossible to perform.\r\n\r\nThe wired stunts and choreography are so exaggerated that it becomes laughably terrible, juxtaposing the semi-realistic narrative that McG is attempting to convey. Driving off a dam whilst trying to fly into a helicopter and take off (all in mid-air by the way...) before it crashes? Sure. Why not. Performing motocross stunts whilst upside down and shooting the angels? Eh. I’ll let it slide. Using a lace cape as a squirrel suit, throwing a bomb into a film premiere and perfectly landing in a car whilst being pursed by the angels who are hanging onto illuminated wires? Ummm. I guess. Being tossed through a shop window, like a rag doll, and walking it off before getting changed for the premiere? Now wait just a minute! Heightened stunts and ‘Matrix’-styled slow motion is all fine and dandy, but I need an ounce of realism in order to feel threatened by the danger on screen. The angels are invulnerable to everything, making the entire ordeal worthless.\r\n\r\nYes, using a flamethrower to “Firestarter” is bonafide brilliance and shaped me to be the man that I am today. Yet the random action set pieces (to which there are loads!) cannot justify the narrative’s direction. Again, frustrating considering the onscreen chemistry of Diaz, Barrymore and Liu. The one and only Demi Moore is used for an underdeveloped plot twist, as she suggestively licks Diaz’ face. Oh, and Bernie Mac replaced Murray. A fine replacement, but again, under-utilised. Let’s not even discuss Theroux’s insulting Irish accent. The technical aspects, especially the garish green screen and floaty human CGI, unintentionally adds characteristics to the film in general, yet still executed terribly. And the callback “humour”, mostly consisting of the “creepy thin man” and the angels’ relationship, were cringeworthy at best. Although, the ongoing innuendos between Alex and her father did make me chuckle continuously.\r\n\r\nIs it enough to substantiate a sequel that showcases the apparent curse of “more is better”? Absolutely not. Whilst the heart of Charlie’s Angels resides within, its discombobulated exterior diminished most of the heavenly fun to be had.","id":"5e206853b3316b0013032e8c","url":"https:\/\/www.themoviedb.org\/review\/5e206853b3316b0013032e8c","movie_id":9471}
{"author":"Abro","content":"Confidence is a cute movie that won't subvert or rise above your genre expectations. \r\n\r\nI think this movie could have been really great if it had simply done more. the twists should have been twistier. The sex could be sexier. The quips could be quippier. The Style could have been... stylier? \r\n\r\nIts biggest failing is that the stakes aren't high and even if they were you don't care about the characters. You know they'll succeed, no ones gonna die and they'll happily explain how they did it to the audience and drive away grinning in a convertible but not into the sunset. its a noir film they just drive off into the night.     \r\n\r\nBut it doesn't disappoint. This sort of thing is hard to do well and i always appreciate the effort. just don't expect too much, its film by the numbers crime\/grifter movie edition.","id":"5a3e2c100e0a2620e600dc8a","url":"https:\/\/www.themoviedb.org\/review\/5a3e2c100e0a2620e600dc8a","movie_id":10743}
{"author":"Wuchak","content":"***Meditation on the nature of guilt and redemption with Billy Bob Thornton and Morgan Freeman***\r\n\r\nReleased in 2003 and written\/directed by Ed Solomon, “Levity” concerns a man in the Great Lakes region (Billy Bob Thornton) who’s released from prison after 23 years of confinement. He returns to the big city where he murdered a 17 year-old cashier and finds lodging & work at a community house run by a priest with edge (Morgan Freeman). Seeking forgiveness, he pursues a relationship with the sister of the boy he killed (Holly Hunter) while helping a wild young woman who lacks adult guidance and is wasting her life (Kirsten Dunst).\r\n\r\nThe meaning of the title, \"Levity\" can be traced to this conversation: “What are you thinking about?” “Gravity.” “It doesn't last long.” So ‘Levity’ is meant as the opposite of gravity and graveness. It stems from the Latin root ‘levis,’ which means \"light in weight” or even \"changeableness.\" It means \"lightness” in every respect. Life is tragic and painful. We do senseless, unkind things to one another in various states of spiritual growth and immaturity. We spend our whole lives being dragged down to our inescapable end (\"Gravity kills\"). But we sooner or later must let go of this gravity and realize that there is joy to be had. Redemption is the return of that joy, that Levity.\r\n\r\nCritics argued that the flick could really use some levity in light of it being burdened by dour self-importance and a heavy-handed moral. The tone is similar to other spiritual movies, like “Grand Canyon” (1991) and “The Woodsman” (2004), but not as effective in overall quality. One problem is there’s a little too much ambiguity and another is the weakly executed subplot about the woman’s juvenile delinquent son and his violent gang proclivities, which comes off wholly contrived. \r\n\r\nStill, there’s enough good here to recommend to those who appreciate the kinds of films noted above, films that try to balance the reverence and beauty of life with the profane, foolish and ugly. I loved the way Dunst’ character rolled with the inner city youth. Actually, all four main cast members shine in their roles.\r\n\r\nThe movie runs 1 hour, 40 minutes and was shot in Montreal.\r\n\r\nGRADE: B-\/C+","id":"5bc64101c3a3682d4b0880b1","url":"https:\/\/www.themoviedb.org\/review\/5bc64101c3a3682d4b0880b1","movie_id":21052}
{"author":"John Chard","content":"It's not naked it's nude.\r\n\r\nWhen Annie Clarke's beloved husband succumbs to leukaemia, her best friend Chris comes up with a unique idea for raising funds for the hospital that cared for the dearly departed John. They, and fellow members of the Knapely Womens Institute, will pose in some strategically nude pictures and sell them as a calendar!\r\n\r\nBased on a true story, and following on from the roaring success of 1997s The Full Monty, it was a story just begging to be adapted for the big screen. Also boasting a shot in the arm for actresses of a certain age, who sadly are bereft of decent cinematic parts, Calendar Girls may not be a masterpiece of homely cinema values, but it certainly warms the cockles and hits an entertaining spot in spite of the laborious last third. The cast are uniformly excellent, Julie Walters, Helen Mirren (gorgeous), Linda Basset, Annette Crosbie and Geraldine James are particularly memorable in telling this tale of a close-knit village quite unsure on how to deal with a touchy subject. From there the press sensationalism arrives and this shifts the girls (and sadly the film) to another plane.\r\n\r\nThe picture manages to be that rare old thing of a comedy drama actually impacting heavy on both fronts. The comedy moments are joyous and flow frequently for the first two thirds of the picture, whilst the touching drama, of what is a serious subject at its core after all, really touches a nerve. Sadly as we enter the final third, the makers tag on an unnecessary dissection of friendships and relationships, and it nearly costs the film dear. It does survive, mainly due to the wonderful cast and the integrity laden point of view, making it a film that once viewed is clearly not going to be forgotten. So in the main we should all hail those wonderful Calendar Girls. 7\/10","id":"5d59283b1749730016ddb864","url":"https:\/\/www.themoviedb.org\/review\/5d59283b1749730016ddb864","movie_id":8696}
{"author":"John Chard","content":"I ain't going to meet my maker without knowing your real name.\r\n\r\nIt's purely my own opinion of course, but Open Range is a modern day genre classic that stands up to repeat viewings. It's not a flawless Western the Western historians will tell you, and some will pick out the hats or the impact of a rifle to mark the film down, but really we should be embracing a genre piece in the modern age that is clearly being directed with love and respect by the director.\r\n\r\nIt's story is of course a simply structured tale of the underdog rising up against the fat cats who want it all in the name of tyranny. But on its side is the fact that its characters are so interestingly engaging. Within a short time frame I feel that Kevin Costner manages to put us in the saddle with the main protagonists, we understand these guys without actually knowing them, and that is quite an achievement I feel. The film does flesh them out to enhance the film without boring the pants off the viewer, and it's only come the final reel that you realise you have been engaged in a very human and honest Western film.\r\n\r\nMost of the cast do great here, both Robert Duvall & Kevin Costner bounce of each other with moody and world wise aplomb as the two main leads, while in the sole female role of note, Annette Bening is gusto beautiful personified. Sadly it's hard for me to write that Michael Gambon as the villain of the piece is not only underused, but also something of a let down. Such an accomplished actor should know better than to overdo it in the context of this particular story. Yes we get the need for villainy, but gurning and frothing doesn't quite make the grade here. It's a little surprising that director Costner didn't utilise Gambon more wisely.\r\n\r\nStill, I say the film is a wondrous experience because it is, a film to have you cheering and booing in equal measure, and in the main the work on it is top dollar. Some of the shots are gorgeous, the framing that Costner uses in close ups is excellent, and the final reel shoot out ranks as one of the best in Western genre history. So all in all it's a modern day genre piece that actually sits nicely with the best from the golden era. 9\/10","id":"59579332c3a368265d0096e0","url":"https:\/\/www.themoviedb.org\/review\/59579332c3a368265d0096e0","movie_id":2055}
{"author":"John Chard","content":"I ain't going to meet my maker without knowing your real name.\r\n\r\nIt's purely my own opinion of course, but Open Range is a modern day genre classic that stands up to repeat viewings. It's not a flawless Western the Western historians will tell you, and some will pick out the hats or the impact of a rifle to mark the film down, but really we should be embracing a genre piece in the modern age that is clearly being directed with love and respect by the director.\r\n\r\nIt's story is of course a simply structured tale of the underdog rising up against the fat cats who want it all in the name of tyranny. But on its side is the fact that its characters are so interestingly engaging. Within a short time frame I feel that Kevin Costner manages to put us in the saddle with the main protagonists, we understand these guys without actually knowing them, and that is quite an achievement I feel. The film does flesh them out to enhance the film without boring the pants off the viewer, and it's only come the final reel that you realise you have been engaged in a very human and honest Western film.\r\n\r\nMost of the cast do great here, both Robert Duvall & Kevin Costner bounce of each other with moody and world wise aplomb as the two main leads, while in the sole female role of note, Annette Bening is gusto beautiful personified. Sadly it's hard for me to write that Michael Gambon as the villain of the piece is not only underused, but also something of a let down. Such an accomplished actor should know better than to overdo it in the context of this particular story. Yes we get the need for villainy, but gurning and frothing doesn't quite make the grade here. It's a little surprising that director Costner didn't utilise Gambon more wisely.\r\n\r\nStill, I say the film is a wondrous experience because it is, a film to have you cheering and booing in equal measure, and in the main the work on it is top dollar. Some of the shots are gorgeous, the framing that Costner uses in close ups is excellent, and the final reel shoot-out ranks as one of the best in Western genre history. So all in all it's a modern day genre piece that actually sits nicely with the best from the golden era. 9\/10","id":"5958e0a2c3a368253c01e464","url":"https:\/\/www.themoviedb.org\/review\/5958e0a2c3a368253c01e464","movie_id":2055}
{"author":"Gimly","content":"If you like Extreme EXTREME Close Ups filmed on an iPod Shuffle, then oo boy do I have the film for you.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5d789f15069f0e000d33225e","url":"https:\/\/www.themoviedb.org\/review\/5d789f15069f0e000d33225e","movie_id":83}
{"author":"zombieakacris","content":"\"WITHOUT EVIL WE WOULD NEVER RECOGNIZE GOOD\".\r\n\r\nDescription:\r\nA man must survive a prison where hardened criminals battle to the death for the wardens' entertainment.\r\n\r\nReview:\r\nIn Hell is a 2003 Action Drama starring Jean-Claude Van Damme that's surprisingly watchable. Van Damme plays Kyle Leblanc a man sent to a Russian prison after the killing his wife's murderer. Leblanc is sentenced to life in this run down prison where the warden arranges illegal fights.\r\n\r\nVan Damme takes a departure from his usual tough guy who kicks ass in prison like Death Warrant and instead is a troubled mourning prisoner who sees his wife's image as he descends into madness while in solitary confinement. Of course the story becomes predictable as Van Damme becomes the top fighter and the surrounding actors are forgettable including former football star Lawrence Taylor. Similar to the Undisputed series and as serious as Lock-Up, In Hell is a great turn for Van Damme which sets you up for his performance just a few years later in JCVD. Do yourself a favor and peep this shit sometime.","id":"5dd0f12457d3780013d86472","url":"https:\/\/www.themoviedb.org\/review\/5dd0f12457d3780013d86472","movie_id":19277}
{"author":"John Chard","content":"High on action, low on grey matter.\r\n\r\nI guess when push comes to shove it’s an action film that delivers the requisite supply of biff, bam and kerpow action sequences. Yet even allowing for the old “leave the brain at the door” requirement for such action comic malarkey, the script is too poor, the acting equally so, while the choreography is weak. The latter of which a big misstep when you have Jet Li and Mark Dacascos fronting the good guy\/bad guy axis of the story.\r\n\r\nPlot pitches Li’s ass kicking detective with DMX’s urban thief together as an unlikely buddy buddy combo trailing missing diamonds and DMX’s kidnapped daughter, and that’s pretty much it. There’s no attempts to expand the characters or add some emotional depth to what is meant to be a pretty critical situation.\r\n\r\nIt often feels tired, like a recycling of so many other film’s of similar ilk, originality is out the window here, hell they even get Tom Arnold in to reprise a watered down version of his character from True Lies. Gabrielle Union and Kelly Hu are on hand to add the sexy sizzle in thankless roles, while Dacascos barely registers as an uber villain.\r\n\r\nLazy and redundant, all told, a waste of time for cast and viewers alike. 4\/10","id":"539e2d33c3a3683b59004959","url":"https:\/\/www.themoviedb.org\/review\/539e2d33c3a3683b59004959","movie_id":10623}
{"author":"manwhonose","content":"This is definitely one of the films to see before you die. It's seat-squirmingly unsettling, shocking and very violent. \r\n\r\nIt's a journey into a truly disturbed mind; a mind, which - like yours will be - is unable to cope with what it discovers.\r\n\r\nThis film is brilliantly twisted. It has a thread of the most wonderful, blackest humour running through it, a sense of complete disorientation and enough plot twists and turns to sustain your interest.\r\n\r\nNot one of the best revenge thrillers I've seen - simply THE best!","id":"5066662e19c2955bad000697","url":"https:\/\/www.themoviedb.org\/review\/5066662e19c2955bad000697","movie_id":670}
{"author":"Eky","content":"I’m sure that all of you can always spot a film with good acting, superb plot and great cinematography easily but when it comes to a thriller that possesses all those above quality, it would be such a rarity. OldBoy here, second installment from The Vengeance Trilogy directed by  Park Chan-wook (Sympathy for Mr. Vengeance, OldBoy, Sympathy for Lady Vengeance) really have them all, good story, powerful acting and the most horrifying and clever end twist if not genius. In fact no matter how many times you see this, the twist would still be awesome. The theme of revenge here is taken to the next level, to its supremacy for it’s really carefully-planned. OldBoy has a mind-bending assortment of drama, thriller, romance and beautifully spiced up with sadistic plot, shocking elements, ultra violence and clever psychological twist. Imagine yourself captured, locked in a room for 15 years, not knowing why and who did it and when you finally escaped and thought it’s all over, you were wrong and here’s the punching line, the direct punch to your stomach. Min-sik Choi as Oh Dae su really acted well, he really got us carried away by dragging us into the mystery that surrounds his life, into the depression he’s been feeling and into the deep well of his curiosity. Once again, OldBoy is a way too remarkable, when “revenge” isn’t merely knife-chopping or gun-battling. Enough said.","id":"4fdc2408760ee31b8300077b","url":"https:\/\/www.themoviedb.org\/review\/4fdc2408760ee31b8300077b","movie_id":670}
{"author":"Bazzjazz","content":"21 grams the movie was such a beautifully constructed story.\r\nIt had the rawest of emotions that are intense.\r\nSome may find the content a bit heavy but I thought it was pure craft.\r\nThe way the story unfolds into each other is fabulous.\r\n\r\nIt’s a film about the basics of human nature.\r\n\r\n21 grams is the weight of your soul apparently once it leaves your body when you die.","id":"5ae1900e92514124cd009e4a","url":"https:\/\/www.themoviedb.org\/review\/5ae1900e92514124cd009e4a","movie_id":470}
{"author":"Gimly","content":"The worst _Terminator_ movie. Which seeing as what came after it is... Quite the burn.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5e74c704cabfe400151dab69","url":"https:\/\/www.themoviedb.org\/review\/5e74c704cabfe400151dab69","movie_id":296}
{"author":"DRDMovieMusings","content":"SPOILERS \r\n\r\nUnder-rated, worthy chapter to the story, with surprisingly provocative ideas and some stellar acting.\r\n\r\nWhile this movie admittedly has neither the grit of T1 nor the grand vision or pathos of T2, I'd like to share what I believe to be three elements which together cement T3's place in the canon of the Terminator franchise.\r\n\r\nThe first is the way the actors acted the relationship between Connor and the T-800. While Connor has memories that we the audience recall from T2, the T-800, played by Arnold, was not the same T-800 from T2. This is just another machine from off an assembly line of T-800s that were manufactured. Yeah, Arnold looks like Arnold, but this T-800 has no memory of the previous installment because it was not there. And he acts disconnected, distant and mechanical, betraying zero connection to Connor. That was really cool, and helped we the audience appreciate that, where the T-800 comes from, is a much bigger place than we had heretofore really digested. We only ever saw one or two at a time back in our time; the reality we had not yet seen by the time of T3, is that the future was full of these things, and there's nothing personal about them. We the audience wanted to reconnect to all the good feelings from the end of T2, we wanted to get personal with these machines, and that's really hard to do. This movie smacked us back to \"reality\".\r\n\r\nThe second aspect is that this is the movie that puts the transition to SkyNet into a context that we could see. Now we know why and how the government handed control over to SkyNet. T3 displayed what we'd heard a little about in T1, and a little more about in T2, but it did so in a way that did not prompt much in the way of \"where did that come from?\" or \"what are they talking about\" that I've ever come across (Terminator Salvation failed test this miserably, spectacularly).\r\n\r\nThe third and final aspect of the movie that, for me, was rather provocative is that, right up to the end, we the audience are following the stubborn view of Connor that judgment day can be stopped. He was sure they'd stopped it at the end of T2. He was sure they were racing to stop it throughout T3...but, if we the audience stopped ourselves from being emotionally carried away, we'd have come to the realization Connor did earlier that judgment day could not be stopped. The terminators kept coming back from the future because the technology had advanced to where it was both possible and necessary. So judgment day did happen, and the terminator being there meant it couldn't be stopped.\r\n\r\nIs T3 the best in the franchise? Heck no! C'mon, I'm not totally crazy. Is it the worst? I don't think so, at all. (I, personally, lay that crown on Terminator Salvation, but I digress...) T2 is the best, for me, for a few reasons. T1 is the honourable second because it started the story and set up many of the devices that would help make T2 among the great sequals of all time - right up there with Godfather 2 and Star Wars Episode 2, and Blade II :-)","id":"58e08ea99251415e3c014ce0","url":"https:\/\/www.themoviedb.org\/review\/58e08ea99251415e3c014ce0","movie_id":296}
{"author":"edward","content":"A clever little thriller\/black comedy, which holds interest. 11:14 tells the inter-connected stories of a group of people, all revolving around a tragic car-accident. We see the accident, which occurs at 11:14pm, from different perspectives, as the puzzle slowly comes together.\r\n\r\nSure, the story works a lot on coincidence, but it's still a great build up and interesting ending, despite it being somewhat of a let-down.\r\n\r\nThe very black humour includes two sections which might just be some of the most cringing moments for men in cinema history – one of them in particular had me cowering fear.\r\n\r\nGood performances from Patrick Swayze and Hilary Swank make this a good cinematic treat.","id":"589b52229251410c93000042","url":"https:\/\/www.themoviedb.org\/review\/589b52229251410c93000042","movie_id":9282}
{"author":"John Chard","content":"You are not hardcore unless you live hardcore.\r\n\r\nThe perfect vehicle for Jack Black, a film to show that given the right material he’s a bona fide comedic actor of some worth. Plot has Black as Dewey Finn, a wastrel musician who has no job prospects and who spends his time mooching off of his best mate Ned Sheebly (Mike White). When Dewey is fired from his rock band he’s left in limbo and in danger of being homeless. But when he answers a phone call offering Ned a job assignment, Dewey decides to take it upon himself to impersonate Ned and take the employment himself; as a schoolteacher!\r\n\r\nSo it’s Jack Black in a classroom full of kids, it probably shouldn’t work, and even might seem like some sort of cruel and unusual punishment to anyone with an aversion to Black, but this is feel good nirvana and a paean to rock and roll. It’s perhaps unsurprising that it’s crammed with clichés from the classroom splinter of moviedom, the kids a roll call of characters we have seen numerous times. The spoilt swot, the roughneck, the one suffering parental peer pressure, the weight issue one and on it goes, but boy can they play music when Dewey takes them out of classical mode and into rock central.\r\n\r\nHow nice to find that director Richard Linklater and writer Mike White have managed to rise above the clichés and avoid syrupy fodder, there’s such a zest and earnestness to it all, and the kids acting is high in quality as well, led by the big kid himself, Black on full tilt. But most of all, even as the morals and life affirming threads come wading in with the pulsing rock soundtrack, it’s a very funny picture, the gag quota enormously high. Be it Black trying to bluff the kids, the kids trying to bluff everyone else - or the wonderful Joan Cusack as the scatty stickler for the rules Principal Mullins – a laugh is never far away. Rock on! 8.5\/10","id":"539e1fcfc3a3683b410048dc","url":"https:\/\/www.themoviedb.org\/review\/539e1fcfc3a3683b410048dc","movie_id":1584}
{"author":"daisyrowley","content":"Our family loved this movie. While the language is a little strong, compared to other movies that are rated the same, it is relatively mild. If your children like rock, it is a lot of fun. If you are a family who tolerates no swearing whatsoever, or if \"kick some ass\" would shock or offend you, then it's not for you. The overall message is that uptight kids use their skills to create a rock show, a slacker finds a calling and realizes what is really important in life, and forgiveness abounds.\r\n","id":"5b5ef01e925141523704077a","url":"https:\/\/www.themoviedb.org\/review\/5b5ef01e925141523704077a","movie_id":1584}
{"author":"Gimly","content":"Movies like _Underworld_ just don't end up with the calibre of actor that _Underworld_ has under normal circumstances. Somehow, _Underworld_ did though, and yes, it's very much a product of that early '00s industrial inspired age, but it is a solid, solid take on some realistic(ish) aspects of supernatural monster mythos.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5c4484160e0a266d66d38f60","url":"https:\/\/www.themoviedb.org\/review\/5c4484160e0a266d66d38f60","movie_id":277}
{"author":"John Chard","content":"Competent actioner.\r\n\r\nS.W.A.T. is neither here nor there, in that if it was made ten years earlier it would in all probability be better thought of. The problem is that there is such a long line of action movies that entertain without pushing the boat out, some, like S.W.A.T., throw a good cast list at it and hope that carries the film through, others just go over the top with the pyrotechnics and think that is job done. Abandon hope of something fresh and exhilaratingly kinetic and S.W.A.T. passes muster.\r\n\r\nThe plot of S.W.A.T. basically sees Samuel L. Jackson put in charge of a crack team of five cops with attitude and guts. Their main mission, after all the training and baring out of character's respective traits and psychological make-ups, is to ensure an imprisoned drug kingpin doesn't get broken out of jail after said scum-bag offers a huge cash reward to anyone that can break him out of said police custody. Cue crash, bangs, double-crosses and a face from the past coming back into the picture after being telegraphed by an incident that opens the film.\r\n\r\nAlong with Sam are Colin Farrell, Michelle Rodriguez, LL Cool J, Josh Charles and Brian Van Holt. Oliver Martinez slips into the slimy villain shoes and Jeremy Renner does another one of his unhinged characterisations. Director Clark Johnson never breaks free of his TV roots, because the film often feels like a glorified TV episode, but his action construction is competent and he has decent actors to keep the film from sinking down among the dead men. Competent is the key word here, it's a decent time waster for the action movie fan, but really it feels like the action movie hadn't advanced much from the previous decade. A shame because there was much potential in the story. 6\/10","id":"5424a9cb0e0a264576000162","url":"https:\/\/www.themoviedb.org\/review\/5424a9cb0e0a264576000162","movie_id":9257}
{"author":"John Chard","content":"It wears its sentimental heart firmly on its fetlock.  \r\n\r\nAs the depression era kicks in, Americans were grasping for any sort of inspiration they could get, enter equine supreme, Seabiscuit. Considered broken down, too small and untrainable, Seabiscuit went on to become a bastion of great racehorses and in the process bringing solace to those closest to it.\r\n\r\nBack in 2003 upon its initial release, critics were very divided as to the merits of Seabiscuit as a picture. Some were concerned that this adaptation from Laura Hillenbrand's highly thought of novel missed too many crucial elements, others were merely touting the tired old charge of the film purely baiting Oscar (something that is levelled at every film in history about hope and second chances), the more astute critics of the time however lauded it as the delightful and inspiring piece that it is.\r\n\r\nIt would be churlish of me to not agree that Seabiscuit is laced with sentiment, rookie director Gary Ross barely wastes a chance to tug the heart strings and paint an evocative sequence, but if you have got it in you to accept this true story for its base emotional point, then it is one hell of a wonderful experience. Seabiscuit is not just about the equine beauty of the picture, it's also a fusion of three men's personal wavering, who for one reason or another need the horse for far more important crutches than those provided by financial gain, make no bones about it, Seabiscuit is a very human drama. Knowing how the picture will end never once becomes a problem, because the historical accuracy in the story makes one yearn for that grandiose ending, one to gladden the heart in the way it must have done to thousands upon thousands of Americans back in the depression era day.\r\n\r\nRoss wisely chooses to filter in as much realism as he possibly can, archive stills and narration serve as exceptional points of worth to the narrative structure. Then there is the first rate cast to fully form the emotional complexities that Seabiscuit provides. Jeff Bridges, Tobey Maguire (waif like), Chris Cooper, Elizabeth Banks, top American jockey Gary Stevens and a splendidly jaunty William H Macy, all can rightly feel proud of their respective work on this picture. Yet it's with the thundering race sequences that Seabiscuit really triumphs best, magnificent beasts hurtling around the race track are excellently handled by Ross and his cinematographer, John Schwartzman, whilst a nod of approval must go to the sound department's efforts, for this is definitely one to give your sub-woofer a work out.\r\n\r\nSeabiscuit was nominated for seven Academy Awards, winning none, perhaps the Academy also felt like those critics who thought it was trying too hard for a Golden Statue? But now after the dust has settled some years later, it pays to revisit Seabiscuit and judge it on its own emotional terms, for it's a tremendously well crafted picture that is of course as inspirational as it most assuredly is tender, a fine fine picture indeed. 9\/10","id":"5cea60f00e0a265cded46953","url":"https:\/\/www.themoviedb.org\/review\/5cea60f00e0a265cded46953","movie_id":4464}
{"author":"Wuchak","content":"***Hope for the broken via a quirky, forsaken race horse***\r\n\r\nDuring the Depression, an undersized, “lazy” horse named Seabiscuit becomes a champion, lifting the spirits of both its team and that of the nation. Jeff Bridges plays the owner, Tobey Maguire the jockey and Chris Cooper the trainer. Valerie Mahaffey is on hand as the owner’s wife.\r\n\r\nBased on the real story, “Seabiscuit” (2003) is reminiscent in tone of another timeless historical drama starring Bridges, “Tucker: The Man and His Dream” (1988) by Francis Ford Coppola. I prefer the underrated “Tucker” because it’s snappier and less vague, but “Seabiscuit” ain’t no slouch. \r\n\r\nLike the historically-based “Jeremiah Johnson” (1972) the manner of storytelling respects the intelligence of the viewer to sometimes read between the lines. One of the best parts is the build-up to the race with War Admiral and the thrilling race itself. Not knowing the real-life events, a couple of the twists were surprising. The first act, however, seems bogged down by extraneous details about the owner.\r\n\r\nThe film runs 2 hour, 19 minutes and was shot in California, New York and Kentucky.\r\n\r\nGRADE: B","id":"5c52647a92514154485d7f99","url":"https:\/\/www.themoviedb.org\/review\/5c52647a92514154485d7f99","movie_id":4464}
{"author":"Rob","content":"Waste of film stock","id":"55c8cc20c3a36818e2000895","url":"https:\/\/www.themoviedb.org\/review\/55c8cc20c3a36818e2000895","movie_id":9480}
{"author":"talisencrw","content":"This was an interesting watch. Though not great, it had moody ambience in spades, and I'm intrigued of what the future holds for director Liebesman. Worth a watch.","id":"57781cf7925141371c000459","url":"https:\/\/www.themoviedb.org\/review\/57781cf7925141371c000459","movie_id":10727}
{"author":"tmdb44006625","content":"It's not just that Daredevil is a poorly made movie. It's that it takes a great character and turns him into a mishmash of tired clichés, shamelessly copying The Crow, Spider-Man, The Matrix, as well as both Burton and Schumacher's Batman in an attempt to appeal to the teen angst crowd. Don't blame Ben Affleck. He does what he can but the script and terrible production design lets him down as much as it us.","id":"5c8429d992514129191ace14","url":"https:\/\/www.themoviedb.org\/review\/5c8429d992514129191ace14","movie_id":9480}
{"author":"John Chard","content":"Life for a tooth. \r\n\r\nAs a young boy, Kyle Walsh (Chaney Kley) claims to have seen the fearsome Tooth Fairy kill his own mother. He also claims that having seen her, she wont stop until she also kills him. Years later, and still haunted by the experience of that night, Kyle must return to Darkness Falls to aid his childhood sweetheart, Caitlin Greene (Emma Caulfield) and her kid brother Michael, the latter of which who seems to be at risk from the Tooth Fairy this time around. Can Kyle confront his fears and end the 150 years of terror that has blighted Darkness Falls?\r\n\r\nPretty much despised by the discerning horror-phile, Darkness Falls, to me at least, is a creepy, interesting and totally enjoyable thriller\/ghost picture worth reappraisals. From the excellent, and chilling opening credits (where we nicely have a back story to work from), to the final confrontation, Darkness Falls ticks most of the ghostly requisites that is asked of it. Scary demon (troubled children with night terrors should be explored more in cinema I feel), cannon fodder bullies, cannon fodder obnoxious coppers and a constant sense of unease and dread. All of which is provided in Jonathan Liebesman's (\"The Texas Chainsaw Massacre: The Beginning\") film. It's with the sense of dread that I feel that this deserves a better reputation. Hand on my heart I know the film isn't a scary boo jump picture, something that is unforgivable to many genre supporters, but atmosphere goes a long way to creating a good thriller\/ghost story picture. Darkness Falls has it in spades, and it's also a film that is a nice antidote to the blood beast torture sub-genre of film that seep out from the multi-plexes on a seemingly weekly basis.\r\n\r\nAny expectation of an outright horror film should be quickly extinguished prior to a first time viewing, and if noise annoys and staccato editing bugs you? well stay away. Also don't line up if one demands great acting in a budget restricted piece such as this, since both Kley & Caulfield are only adequate at best. But give it a go if you understand that a preposterous plot, and preposterous set pieces are a pre-requisite for horror films of this type. I say that since I've seen many comments decrying Darkness Falls for the unbelievable elements - only to then search their other comments to find praise for even more ludicrously plotted pieces! Or give it a go knowing it's more about the creeping stalking menace side of horror, or that it's also an action thriller as well as an uneasy story. Maybe just maybe you will enjoy it for what it is? Otherwise I guess you will be looking forward to \"Hostel 22\" or another \"Jason Attacks The Eiffel Tower\" movie... 7\/10","id":"5da922d9b2681f00148edf2a","url":"https:\/\/www.themoviedb.org\/review\/5da922d9b2681f00148edf2a","movie_id":10727}
{"author":"John Chard","content":"Rapists and murders may be the victims according to you, but I, I call them dogs. And if they're lapping up their own vomit, the only way to stop them is with a lash. \r\n\r\nA sparse soundstage is stylishly utilized to create a minimalist small-town setting in which a mysterious woman named Grace (Nicole Kidman) hides from the criminals who pursue her. The town locals at first decide to shield Grace, and in return she openly works labour tasks for them to work off her gratitude. It's not long, however, before the residents of Dogville begin to show their true teeth...\r\n\r\nOne thing is an absolute, Lars Von Trier knows how to push the buttons of critics and movie lovers alike. Dogville proved to be a case in point, a film that saw some high profile film critics renounce the director as anti American - even anti human, while others lauded the \"Great Dane\" as a visionary and a director of bravura panache. The point is, and it's a fact, there is no guarantee that Dogville will hit the spot of every first time viewer venturing in for the challenge.\r\n\r\nAs it happens, I'm very much in the plus camp here, to me it's not only brave in style of production, but also it's narratively as caustic as anything so called \"anti human\" directors like Kubrick, Godard etc ever produced. The bareness of the sound stage setting, where we can see the workings of all residents of Dogville going about their respective business, very much shows there is no hiding place, all the bile strewn movements\/ignorance is laid bare for all to see, we are all complicit.\r\n\r\nThere's an outstanding cast assembled, fronted by Kidman (never more beautiful and never better as an actress), with support coming from Paul Bettany, Stellan Skarsgård, Lauren Bacall, Ben Gazzara, Patricia Clarkson, James Caan, Philip Baker Hall and others who give their all for their director. It's often charged that Trier is a misogynist, personally I don't see it that way, more so as Dogville reaches its crushing climax. This easily could have been shaved of 20 minutes from the run time, but it has to be said that Von Trier doesn't waste a single frame here.\r\n\r\nRoll your dice and take your chance, you will either love it or hate it, or admire or admonish, what isn't in doubt is that you will never ever forget watching Dogville. 9\/10","id":"5e8a2f7a3a965000164a123f","url":"https:\/\/www.themoviedb.org\/review\/5e8a2f7a3a965000164a123f","movie_id":553}
{"author":"Killa-What?","content":"The first in the series of on the road tours featuring Jeff Foxworthy, Larry the Cable Guy, Bill Engvall and Ron White. More redneck jokes than you can poke a rednecks retriever at from Jeff. Plenty of \"Here's your sign\" jokes from Bill. Sarcasm from Ron and Larry the cable guys backwards thinking. And like all the series with the four coming together at the end to basically tell jokes to make the others laugh. Highly recommended if you like crude jokes about the less fortunate and the not so smart.","id":"57d4959d92514150d9000fa2","url":"https:\/\/www.themoviedb.org\/review\/57d4959d92514150d9000fa2","movie_id":23626}
{"author":"furious_iz","content":"Doesn't quite deserve all the hate...\r\n\r\nA group of friends with a long history are pitted against an invading alien force, and they use their special gifts and talents to try and save the world.\r\n\r\nSure it is not the best Stephen King adaptation, but it is far from the worst.  Some fairly hammy acting, dodgy CGI and tonnes of cliché Stephen King tropes don't stop this film from being lightweight fun, so long as you are not expecting a work of art.  \r\n\r\nDamien Lewis is a stand-out, especially when he is being the Mr Gray personality and most of the rest of the cast do well enough, with a little bit of coasting from Tom Sizemore and Morgan Freeman.  It is however hard to look past the patronising and mildly offensive portrayal of the idiot savant Duddits, and the ending is completely stupid.  But if you have a spare couple of hours there are worse ways to spend time.  \r\n\r\nB grade film with an A grade cast and a budget somewhere in between.","id":"5a4c7a540e0a2646db0065a9","url":"https:\/\/www.themoviedb.org\/review\/5a4c7a540e0a2646db0065a9","movie_id":6171}
{"author":"John Chard","content":"We can be as different as we wanna be, but you can't kill people!\r\n\r\nMonster is the bleak story of Aileen Wuornos, a prostitute and one of America's most notorious female serial killers. Based around facts of her life and death, the film primarily focuses on the last year of her freedom. Where after entering into a strange lesbian relationship with Selby Wall, Wuornos, fed up of being a abused by men, starts killing those calling on her services.\r\n\r\nSad and potent is Patty Jenkins' first full length directorial effort. Though perhaps a touch guilty of pandering to Wuornos' own self created \"monster\" image, the film none the less has the right blend of sympathy and revulsion to make it a fascinating, if uneasy, experience. Former model Charlize Theron goes through a major transformation to become Wuornos, so much so she's practically unrecognisable. Bulked up in weight and with beaten down make up withering her face, Theron goes on to give a towering performance as the troubled, on the edge killer. \r\n\r\nWithout any thrills or hints of histrionics, Theron is uncompromising throughout the picture. To garner empathy with such an abrasive character is quite a trick, then to switch to monstrosity with conviction seconds later? Well that's almost magical in itself. Theron is backed up well by Christina Ricci as Selby. Selby Wall, an immature young lady oblivious to the dark path she is walking down, is given a great portrayal from Ricci. In light of the powerhouse show from Theron, it's much credit to Ricci that she enhances the film with her own delicate characteristics. Helping to emphasise the strangeness of the union in the process.\r\n\r\nIt's a tough film for sure, and come the final credits one is left with a feeling of sympathy towards Wuornos and the life she lived. If that be right or wrong is of course up to the individual viewer. Or if that was even Jenkins' intention is probably up for debate. But Monster exists and survives as a bitter character study of a desperate woman, which through the medium of cinema, makes us the viewers privy to something very edgy indeed. 7.5\/10","id":"5e80aec01d6c5f00161d499c","url":"https:\/\/www.themoviedb.org\/review\/5e80aec01d6c5f00161d499c","movie_id":504}
{"author":"abaddonhades","content":"I understand the fact that this movie is a crazy-comedy,and it's easy to see that the slapstick-comedy and sight-gags are very much inspired by Tom&Jerry-style cartoons.\r\n\r\nBut is it really necessary to push for a gag once a minute throughout the movie? The movie's pacing leaves the viewer breathless, and grasping in vain for any semblance of a coherent storyline. Aside from the fact that two incompetent agents are searching for a destructive weapon, it is impossible to understand what is really going on in this movie.\r\n\r\nI don't know the source material. In the event that it is exactly as the movie turned out,they should have fleshed it out with something that would have made it work as actual storytelling.\r\n\r\nAs for the characters, none of them are remotely relatable, and the gags aren't really funny. The actors are seemingly just waiting to get squashed, beaten or otherwise manhandled, so they don't have to do any real acting work.\r\n\r\nThe movie hit new lows with cruel torture scenes (especially the one where the mother is tortured), generally misogynist behavior,and racist renditions of several different ethnic groups.\r\n\r\nFrom other reviews on this site, I understand that the movie is based on a very popular Spanish comic,but there must be a better way to adapt the source material than this. As it stands now I can only speculate that the director (Fesser) was experiencing a drug induced delirium during the making of this movie.Mistaking rapid-fire slapstick,and complete nonsense for a flash of genius.\r\n\r\nMostly I am sorry for Dominique Pinon,a quality actor who cannot have known what lay in store for him,participating in this movie.\r\n\r\nI find it hard to recommend this movie even to my worst enemy.","id":"59956d7d92514107c8010af0","url":"https:\/\/www.themoviedb.org\/review\/59956d7d92514107c8010af0","movie_id":8980}
{"author":"John Chard","content":"For England, for home, and for the prize!  \r\n\r\nMaster and Commander: The Far Side of the World is directed by Peter Weir, it stars Russell Crowe as Jack Aubrey and Paul Bettany as Stephen Maturin. It is spliced from various novels in the Aubrey–Maturin series written by Patrick O'Brian. The film takes place during 1805, during the Napoleonic Wars and finds Captain Jack Aubrey and the crew of British frigate HMS Surprise ordered to intercept, destroy or take as a prize the French privateer Acheron. But the Acheron (The Phantom as the crew of the Surprise call her) is no ordinary ship, and her Captain is smart. So Lucky Jack has his work cut out; not only in the pursuit of the Acheron, but in harmonising the crew under his command. Especially his loyal and trusting friend Stephen.\r\n\r\nIt's pretty evident within the first few minutes of Master & Commander that this is no standard blockbusting naval based war movie. If you are after, or was expecting, a wave to wave Bruckheimer carnage a-like piece, well you best, or should have, stay(ed) away. For this is a Peter Weir movie, in fact this is a Peter Weir \"period\" movie, where attention to details and character dynamics are the order of the day. There's battle action here for sure, beginning and end, and terrific they are too, as first cannonballs crack and splinter their targets (note the sound work here), and later as blade meets blade - it's exhilarating stuff alright. However, this is more interested in palpable tension, both on deck and on the waves. Threat is never far away, again, this is is covered by the impending duel with the Acheron and Aubrey's tactical pursuit\/escape of her. As the Aubrey machinations unfurl, the crew give us a series of character dramas to involve us in the make up of a man-o-war's personnel. How different classes and males (there's not one female in the film) of all ages have to work together as one efficient unit in order to survive and triumph. Except for an interlude spent on the lusciously filmed Galapagos Island (Russell Boyd Best Cinematography Academy Award Winner), the film is set 99% of the time out at sea, on a cramped ship, this tells you that Weir is interested in telling a character driven story, one that is cloaked in realism above all else.\r\n\r\nThe teaming of Weir with the highly rated O'Brian material looked a good one, and to someone like me who has never read an O'Brian novel, it is. Unsurprisingly many of O'Brian's fans have been upset by either the stuff missing in the film, the stuff put in to fully form Weir's vision of the characters, or for Crowe not being Pugwashy enough. These complaints were inevitable since they come with practically every adaptation of novels these days. It should be noted, though, that Weir was very much a fan of O'Brian, and in fact always felt inspired by the tight intricate detail of his writings. What of the author himself? Well he passed away three years before the film was released, but he had always envisaged Charlton Heston for the role of Aubrey. So, who in the modern era comes closest to Heston's physical presence on screen, why Russell Crowe of course. Who not only brings that to the character, but also depth, because Aubrey comes with many traits. Strength, honour, stubbornness, leadership and loyalty are a given for a Captain on the high seas. Yet Aubrey is also vulnerable, self aware, playful, knows his limitations and is able to laugh at himself. Crowe peels off each layer and delivers a high quality performance - from our first encounter with Crowe as Aubrey, the realism so loved by Weir is given a shot in the arm - and it stays throughout the movie.\r\n\r\nSo an excellent piece of casting then, as is that of Paul Bettany as ships surgeon, science and nature lover, and best pal of the Captain, Stephen Maturin. Bettany and Crowe had formed a friendship on 2001's A Beautiful Mind, where their on screen chemistry lifted an already fine film, to an even better one. So it be here also. Stephen & Jack's relationship is the core of the piece, two very different men yet as tight as two peas in a pod, with Stephen serving as the code breaker for the audience as sea talk and tactical intrigue weaves in and out of the story. It's there where Bettany excels, for he not only has us believing in this warm (platonic) friendship, he's also got us rooting for him since he is in essence the odd man out on this ship. Our sympathy is firmly with him, our friendly rebel if you please. Of the rest there's note worthy turns from Billy Boyd, James D'Arcy & Edward Woodall, while Lee Ingleby gives a really heartfelt and emotionally engaging turn as the haunted Hollom.\r\n\r\nThe film is not without flaws, though. The pace of the piece does slip from time to time, while the talky middle section may stretch the patience of some, and the film isn't long enough to give the main characters some back story for the audience to work off. Yet it's still a terrific movie, ripe with intelligence and interesting characterisations, and boasting enough adrenalin, humour and upset to fill out a big budgeted 1950s historical epic. So get on board folks, for this is quality film making and it demands to be seen via the best format available. 9\/10","id":"5c43bf3bc3a36819fd236996","url":"https:\/\/www.themoviedb.org\/review\/5c43bf3bc3a36819fd236996","movie_id":8619}
{"author":"narrator56","content":"This is a rousing sea yarn with great camera work, but it also shows comraderie and relationships in a realistic way on board a British fighting ship.\r\n\r\nAs happens sometimes but not always, I enjoyed this movie more than I liked the book it was based upon. O'Brian has written a lot of great sea tales, but this one confused me. I felt like checking to see if the pages were in the correct order. The story seems simplified in this adaptation. (Some may say that is not a good thing!)\r\n\r\nThe first several minutes of the film move the viewer around the ship, and I felt like It was a realistic representation of what it was like to sail on it. The creaking and other ever-present noises, the tight spaces allotted to the crew, all helped me feel like I knew what it was like more than just reading about it.\r\n\r\nThere are a lot of characters aboard ship, so out of necessity some of them never really developed, but even the glimpses we get of them here and there illustrate that they are people, not stereotypes. There were a few rather unlikely plot turns later on in the film, but by then I was drawn into the story and right there with the crew, so I forgave them.  I have watched Master and Commander twice so far, and wouldn't be averse to seeing it again.","id":"5e88572cd55c3d0017512a35","url":"https:\/\/www.themoviedb.org\/review\/5e88572cd55c3d0017512a35","movie_id":8619}
{"author":"portnoyz","content":"Good stuff in this one... a gem.","id":"5dc4c2828d22fc00183f1c39","url":"https:\/\/www.themoviedb.org\/review\/5dc4c2828d22fc00183f1c39","movie_id":11429}
{"author":"Wuchak","content":"***Way better than \"Gettysburg\"***\r\n\r\nEven though I love the Civil War I waited a full six and a half years before catching the prequel \"Gods and Generals\" (2003). Why? Because 1993's \"Gettysburg\" was so unimpressive. While \"Gettysburg\" has some worthwhile scenes it was merely okay on a whole, and sometimes downright tedious. How the filmmakers made the Civil War's biggest battle boring (generally speaking) is beyond me.\r\n\r\nGods and Generals\" is the prequel detailing the battles of First Bull Run, Fredericksburg and Chancellorsville, which are largely viewed through the lens of Stonewall Jackson (Stephan Lang) on the Confederate side and the Chamberlain brothers (Jeff Daniels and C. Thomas Howell) of Maine on the Union side. Also on hand is, of course, Robert E. Lee, played by Robert Duvall, who does a more engaging portrayal than Martin Sheen in \"Gettysburg.\" The film starts off slow and builds momentum. By contrast, \"Gettysburg\" started off slower and never became engaging with the exception of Little Round Top and Pickett's Charge. \r\n\r\nWhere \"Gods and Generals\" really pulled me in was the battle scenes of Fredericksburg and the aftermath. It showed how Civil War troops were required to march, shoot & reload in formation while rifles and friggin’ cannons are blasting their way. The Chamberlain brothers had to sleep on the battlefield that night. Imagine sleeping amongst all those dead bodies and dying, moaning soldiers! This was very well done.\r\n\r\nThere are quite a few other great scenes, like the Yankee and Reb soldiers meeting in the middle of the river to exchange coffee for tobacco; the execution of three deserters; and the \"perfect battle\" for the Confederates at Chancellorsville where General Lee, with a much smaller force, takes the risk of dividing his army and executing a surprise attack. Unfortunately for the Confederates they won at a huge cost as General Jackson loses his \"right arm\" to friendly fire.\r\n\r\nThe story ends on a slow, melancholy note.\r\n\r\nI was impressed with the battle in the town scene. The town looked so authentic. Watching the documentary afterward I learned how they accomplished this: they filmed it at Harpers Ferry, WV.\r\n\r\nSome have complained that the Southern viewpoint is shown in a more positive light than the Northern, but I disagree. While it seems more time is spent with Jackson & Lee's story, considerable time is certainly given to the North as well; the film does an excellent job of taking the middle road between the two positions.\r\n\r\nThe film was shot on location in Virginia, Maryland and Harpers Ferry, WV and runs 3 hours and 39 minutes. The Director's Cut (which I haven't seen) runs a full hour longer and features the bloody battle of Antietam and a subplot with John Wilkes Booth.\r\n\r\nFINAL WORD: If you thought \"Gettysburg\" was boring don't let that prevent you from checking out \"Gods and Generals.\" Yes, you have to be ready for a long movie and it does have some slow, dramatic parts but it builds momentum and it's one of best Civil War films in helping the viewer visualize the battles and many other aspects.\r\n\r\nWARNING: Believe it or not, the film shows overt depictions of Bible reading, citation and prayer!! It also dares to show Christianity and marriage (between a man and woman) in a positive light!! Oh my God!!! \r\n\r\nGRADE: B+\/A-","id":"5d238fa16d4c97273675617a","url":"https:\/\/www.themoviedb.org\/review\/5d238fa16d4c97273675617a","movie_id":16072}
{"author":"John Chard","content":"Time to wash away your sins.\r\n\r\nWhilst hardly being a very good horror film, it's not exactly the stinker some would have you believe.\r\n\r\nThe problems with it are that it becomes overblown, after initially pulsing away as a very moody and atmospherically tight spooker, set to a superbly eerie asylum backdrop, it gets away from itself in the final third. The makers never quite grasp the concept of keeping the mystery aspects of the plot still cloaked in scary tints. Tech credits are dandy, though an impressive cast list are not asked to stretch themselves. \r\n\r\nIt's not ever overtly frightening and lacks suspense in some key areas, but there's still enough of a creepy vibe here to not waste the time of first time viewers. Repeat viewing prospects, though? Unlikely. 6\/10","id":"561622ba92514152500004cd","url":"https:\/\/www.themoviedb.org\/review\/561622ba92514152500004cd","movie_id":4970}
{"author":"Mark Rushow","content":"It is too afraid of reality to depict truths. Rather it hides behind a facade of being artistically 'old filmy' in styling; as too paint the whole in the romanticised vision (whitewash) held by those that love the idea of the Civil War. It was rather unbearable to say the least.","id":"594b2fb29251413115007d33","url":"https:\/\/www.themoviedb.org\/review\/594b2fb29251413115007d33","movie_id":16072}