{"author":"Gimly","content":"I was really hoping a crystal-meth-horror would lead to enjoyment. Instead it just led to confusion.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"593d704f92514105930206e4","url":"https:\/\/www.themoviedb.org\/review\/593d704f92514105930206e4","movie_id":56860}
{"author":"Reno","content":"> 3. The story of Missie LaHaye: Going after the dream.\r\n\r\nThe third one in the Hallmark's 'Love Comes Softly' movie series that followed after 'Love Enduring Promise'. Like the usual the story and the characters continued, but the cast changed. Because most of the characters became adult now. This time the narration followed the Missie Davis turning to Missie LaHaye. Of course now Missie is almost a different woman by appearance as she's all grown up.\r\n\r\nThis film focused only her and her surrounded ones. Still, she's passionate about reading and teaching, but the things are going to change when she meets a little boy in an unexpected circumstance. In the other side, the neighbours dragged into the narration to make a perfect American film, because they are not the ordinary neighbours.\r\n\r\nThe story was based upon a couple of things, like making the dream comes true and facing thieves in the backdrop of celebration of the Christmas and expecting their first child. In a new place, the newly married LaHaye couples set to begin their life. As Willie's dream coming true, to own a ranch and his wife Missie is pregnant, they comfortably settle down with a bunch of fine men who were hired to work with them. The threats are always a surprise, with one knocking their door, how this couple going to face it and the conclusion of the story is the remaining portion.\r\n\r\n> \"For everything, there is a season...\r\n> And a time for every matter under heaven.\"\r\n\r\nSharing the life by helping each other, love was the main theme like the whole movie series supposed to be. The success won't be reached without a struggle, so those were well blended in the beautiful story. It was like effortless performances by everyone, other than riding horses. But anyway, making a movie, even that for the television, is not that simple. The quality was maintained, but there are some minor flaws and technical errors, that are not distracting ones.\r\n\r\nBeside their new beginning, the festival season brings the employee and employer much closer. Followed by the most anticipated moment of their lives where the story concludes. Not like the big screen movie, as a television flick and being a second sequel, the movie really justifies. As usual the slow narration was the key to be a satisfactory product. I liked this part as well and so now the fourth film, let's wait and see where it takes us to\r\n\r\n8\/10","id":"56548884c3a36850f3004633","url":"https:\/\/www.themoviedb.org\/review\/56548884c3a36850f3004633","movie_id":22488}
{"author":"JPV852","content":"Really liked the first two movies of this trilogy, but this third entry, while had some interesting ideas and even some social commentary with characters fighting one another to stay alive, the creepy factor was non-existent, acting was rather bland and had some lame moments, most notably attempting to defeat ghost girl via mass e-mails. Shame it ended this way. **2.0\/5**","id":"5e487e8b35811d001546d301","url":"https:\/\/www.themoviedb.org\/review\/5e487e8b35811d001546d301","movie_id":55470}
{"author":"liquidsnakemi","content":"This is a very dark well made indie film","id":"517036a0760ee33c4108ac88","url":"https:\/\/www.themoviedb.org\/review\/517036a0760ee33c4108ac88","movie_id":186787}
{"author":"Wuchak","content":"Mundane South African biography about a struggling farmer who turns to God.\r\n\r\nRELEASED IN 2006 and directed by Regardt van den Bergh, \"Faith like Potatoes\" is a drama based on the life of Angus Buchan in the late 70s who moved his family from the political unrest of Zambia to eastern South Africa to start a maize farm. Buchan (Frank Rautenbach) and his family\/employees (Jeanne Neilson and Hamilton Dlamini) face many challenges in their new home as Angus eventually feels led by faith to grow potatoes despite a severe drought.  \r\n\r\nThe documentary-like tone is similar to other African autobiographies like “I Dreamed of Africa” (2000) and “Nowhere in Africa” (2001), except with the added faith element. I’ve never heard of Buchan, but he went on to become a fairly significant South African evangelist (with a TV show). The movie focuses on his humble beginnings, his eventual conversion to Christ and service thereof but, surprisingly, the faith element doesn’t even come to the fore until about the halfway point, which is when the film finally gets interesting.\r\n\r\nSpeaking of which, being based on an autobiography, the story lacks the compelling drive of the typical three-act script in preference for real-life mundaneness. Those other two films had the same issue. Yet this can be refreshing in that the movie just shows the way it was without resorting to exaggeration like, say, Oliver Stone’s “The Doors” (1991), which opted for sensationalist (eye-rolling) mythmaking and contains utter fabrications. \r\n\r\nOf course critics argue that this movie ALSO conveys mythmaking fabrications and, furthermore, that the theology is contradictory and troublesome. Does it? Is it? I don’t think so, but I’m not going to explain because it would take too long and, besides, the answers are in the flick in a subdued way. Watch it, reflect on it and make your own call.                                     \r\n\r\nTHE MOVIE RUNS 1 hour 56 minutes and was shot in South Africa. WRITERS: Angus Buchan (book) and Regardt van den Bergh (screenplay).  \r\n\r\nGRADE: B-\/C+","id":"5ab1424692514111d000ef4e","url":"https:\/\/www.themoviedb.org\/review\/5ab1424692514111d000ef4e","movie_id":29697}
{"author":"chtfn","content":"Terrible Christian propaganda movie. The story is ridiculous, the jokes are bad. We nervously laughed while watching it because we could not believe it. A sort of gross USA caricature.","id":"50e3be2b760ee30b571bcad8","url":"https:\/\/www.themoviedb.org\/review\/50e3be2b760ee30b571bcad8","movie_id":18925}
{"author":"TomStensson","content":"An extremely implausible story, where nobody but his bodyguard and a reporter seem to be interested in the killing of the US President. Not even after the two have been violently attacked in the middle of the city, together with a police patrol car, does anyone show any interest in their story.\r\nThe decision to take it directly to DVD was probably very wise, as the film critics would have killed it.","id":"5342df6d0e0a2679ad004331","url":"https:\/\/www.themoviedb.org\/review\/5342df6d0e0a2679ad004331","movie_id":9727}
{"author":"zombieakacris","content":"\"Fuck a lot of woman kid, I have no reason to lie, not just one. A lot of women.\"\r\n\r\nDescription:\r\nA family determined to get their young daughter into the finals of a beauty pageant take a cross-country trip in their VW bus.\r\n\r\nReview:\r\nLittle Miss Sunshine is a 2006 dramatic comedy that delivers all around. With solid cast that includes Greg Kinnear, Toni Collette, Paul Dano, Abigail Breslin, Steve Carrell an oscar winning performance by Allan Arkin and Bryan Cranston and Dean Norris in Albuquerque pre Breaking Bad and a great script Little Miss Sunshine is a film that I missed when it first came out but glad I got around to it.\r\n\r\nKinnear is the loser husband to Collette's Sheryl and Carell is her gay suicidal brother. Dano plays her quiet son and Arkin the heroine addicted dirty Grampa. Breslin's character Olive qualifies for the Little Miss Sunshine competition and it's a race to beat the clock as the family takes a road trip from Albuquerque to California filled with unexpected surprises and personal revelations.\r\n\r\nThe films ending solidifies the families bond and leaves us wanting to see hopefully another chapter in the families life down the road. No Pun intended. Little Miss Sunshine is defiantly worth checking out if you have not already or just a rewatch as a reminder of how good it is.","id":"5dd0f18f2866fa001588cc2d","url":"https:\/\/www.themoviedb.org\/review\/5dd0f18f2866fa001588cc2d","movie_id":773}
{"author":"Law","content":"Although it is a bit ponderous and retreads well-trodden ground of queer cinema--the unrequited, sexually confused love triangles of teenagers--Eternal Summer is more restrained, skillful, and affecting than most attempts to tell this story. The unusual Asian setting helps to further distinguish it. The actors are decent, the writing is decent, the cinematography is competent if amateurish ... It's worth a watch.","id":"5aeeb30bc3a36813fd003427","url":"https:\/\/www.themoviedb.org\/review\/5aeeb30bc3a36813fd003427","movie_id":57005}
{"author":"John Chard","content":"Roller Toaster.\r\n\r\nFinal Destination the series moves into its third instalment without really changing the formula that was working for it. Here the opening disaster involves a Roller Coaster crash that is brought via a premonition to Wendy Christensen (Mary Elizabeth Winstead). As in the previous two films, the visionary and some friends get spooked and get off the coaster to find it actually does crash and a bunch of horrific deaths befall all those on board. Sure enough the survivors start being killed off in equally gruesome ways, it becomes apparent that the old grim reaper is out to claim the deaths that were denied him.\r\n\r\nThe opening section of FD3 is superb, the credits roll to a back drop of various carnival\/fairground attractions that offer up foreboding terror, all backed by an eerie rumbling musical score. Then the crash itself is excellently stage, so much so that anyone frightened of Roller Coasters can point to this as a reason why! Then we revert to type, the youthful cast get bumped off in more ingenious ways, with more gore and lashings of dark humour pumped up this time (the use of Love Roller Coaster by The Ohio Players is genius). The narrative drive this time involves photographs, which is a nice touch and overcomes the triteness of some dialogue exchanges.\r\n\r\nIt's a safe entry in the series, and it boasts in Winstead the best young lead actress of the whole franchise. As with all horror films - franchises, some will love it and some will hate it, but ultimately it really does exactly what the previous two films did. So if a fan of those then this does a good job as well. The 2 disc DVD comes with a delightful choose their fate option, which with a bit of playing around gives you a slightly different version of the film. While it is recommended you turn up your home cinema systems for the Roller Coaster segments. 7\/10","id":"55b7ede89251414e54000379","url":"https:\/\/www.themoviedb.org\/review\/55b7ede89251414e54000379","movie_id":9286}
{"author":"Per Gunnar Jonsson","content":"In short, not a very exciting movie. It was not at all as good as the previous ones. Not that this was very surprising of course since the general consensus on the web seems to be that 1 & 2 are quite good, 3 & 4 not so much while the 5th is supposed to be back in shape.\n\nUnfortunately, in this 3rd installment it seems that the producer took some shortcuts and produced the all to common teenage splatter movie. That is, do not bother about spending time on a decent script nor any acting capabilities to talk about. Replace all that with some wiggling boobs and behinds to appeal to the not too intelligent part of the teenage movie going audience, kill of a few of the bearers of said boobs and behinds at regular intervals in an increasingly goory and spectacular way and you’re done.\n\nI kind of like the goory and violent bit, it’s supposed to be a horror movie after all, but I would prefer that it was strung together in something that at least can be said to be semi-intelligent way. Well, you cannot have a film collection if you do not have all the films in a series can you? So I cannot say that I regret buying the set but I do not think this one will go up on the films to re-watch list any time soon.","id":"5aa19d240e0a260d3f0034c1","url":"https:\/\/www.themoviedb.org\/review\/5aa19d240e0a260d3f0034c1","movie_id":9286}
{"author":"Wuchak","content":"***Decent, but now formulaic entry in this 'Dead Teenager' series***  \r\n\r\nThe first \"Final Destination\" movie in 2000 was a rather innovative 'Dead Teenager Movie' in that the killer was Death itself, as an invisible spirit. A group of people, mostly teens, escape a great tragedy due to a premonition of one of them and the rest of the movie involves the Grim Reaper systematically slaying the kids who cheated Death in various creative ways, usually an unlikely chain of events. The opening tragedy in the first film was a plane crash, in the second it's a horrible highway pile-up while in this third entry it's a rollercoaster mishap.\r\n\r\nAll of the movies in the five-film franchise tell the same basic story with different characters and minor nuances; all of them are of the same high quality of technical filmmaking. Whether you prefer one or another depends on your preference for cast members and the death sequences (and the locations). Other than these factors they're all basically the same.\r\n\r\nReleased in 2006, \"Final Destination 3\" has a quality doe-eyed heroine or 'final girl' in Mary Elizabeth Winstead. There are some other worthy female cast members, like Alexz Johnson, Chelan Simmons, Crystal Lowe and Amanda Crew. These five ladies represent perhaps the best assortment of women in the series yet.\r\n\r\nWhile it’s true that you know exactly how this film plays out if you've seen the first two installments, or any of them, there are some highlights beyond the female cast. For instance, the rollercoaster accident is thrilling and rings true in light of real-life mishaps at amusement parks. There’s also a horrifying tanning booth death sequence, which was done better in “Urban Legends: Bloody Mary” from the previous year (2005). Another death scene occurs at a warehouse where two of the protagonists work. I also liked how an extended sequence outside the teens’ school takes place in the rain, which shows attention to detail (or making the best of a rainy day during shooting, whatever).\r\n\r\nFor me, what makes these movies kinda dull is the fact that it's impossible to cheat Death. Sure, you can escape it here or there, but Death's been in business for millennia and expertly knows what he's doing. As such, everyone's gonna die except maybe the 'final girl,' who will most probably die in the sequel.\r\n\r\nIn case you’re interested, there's an interesting 20-minute documentary about \"Dead Teenager Movies\" on the 'extras' disk with Roger Ebert being a highlight.\r\n\r\nThe film runs 93 minutes and was shot in the Vancouver area, as were all the Final Destination flicks, except the fourth one.\r\n\r\nGRADE: C+\/B-","id":"5bdadbe892514153fb00c29a","url":"https:\/\/www.themoviedb.org\/review\/5bdadbe892514153fb00c29a","movie_id":9286}
{"author":"talisencrw","content":"This was a solid debut for Hazanavicius and a very fun film. There's uneven pacing, but I was very pleased with this, which seemed an interesting hybrid between the James Bond and Pink Panther film series. I loved the scoring and cinematography as well. Dujardin's character was a bit strange and the pacing was a tad uneven, but those are small flaws. This is the first of Hazanavicius' films I have seen, though I have 'The Artist' on blu. I've heard that in the sequel, he jumps a decade to the 60's--it would be interesting, if they decide to eventually continue the series, if each film could be of following decades, straight through to the present day. It was clever of the writers, through parallelism, to subconsciously suggest a linkage of the Nazis to radical Arab terrorists, so soon after 9\/11, and, six years before 'Skyfall', what anyone knowing anything about espionage and counterintelligence would undoubtedly know--that all agents would probably be bisexual. I look forward to checking out Hazanavicius' other films, and hope there are eventually more in this series, for I have loved all kinds of spy films and spoofs of them, in the history of cinema.","id":"5733b7df9251411e96000145","url":"https:\/\/www.themoviedb.org\/review\/5733b7df9251411e96000145","movie_id":15152}
{"author":"Hotsake","content":"I'm going to have to agree with another review that I read which\r\nstates \"Takashi Miike and Hisao Maki make terrible films together, and\r\nWaru could be the worst.\" each and every film collaboration of theirs\r\nI've seen have suffered from the same problem, which is that they are\r\nslow and plodding and without the usual Miike flair. Hisao Maki who is\r\na real Karate expert loves to write himself into his adaptations. Here\r\nhe serves as the original creator of the '70s manga as well as the\r\nscreenwriter. Waru in particular seem very disjointed with scenes\r\nbarely held together with the thinnest of plots. No one including\r\nTakashi Miike, Sho Aikawa and Hisao Maki seem to be trying very hard.","id":"55e795e69251413e450004f3","url":"https:\/\/www.themoviedb.org\/review\/55e795e69251413e450004f3","movie_id":104372}
{"author":"NinjaNakashima","content":"The movie starts of kind of slow as we are introduced to the life of Michiru, but things certainly become interesting when the doorbell rings and nobody answers her.  Unknown to Michiru, Akihiro sneaks into her house and hides out.  This is a sweet tale of a blind girl who hides from the world and a boy who hides in order to avoid the police, but also to find out what really happened.","id":"51dba86c760ee31041022bd1","url":"https:\/\/www.themoviedb.org\/review\/51dba86c760ee31041022bd1","movie_id":206155}
{"author":"John Chard","content":"Brazil Nuts!\r\n\r\nAfter their bus crashes while touring in Brazil, a group of young adults find themselves in a world of misery...\r\n\r\nNot ever likely to be watched by members of the Brazilian Tourist Board, Turistas (AKA: Paradise Lost) is a whole mixed bag of a movie. Narratively it has been done before, a bunch of pretty types end up coming face to face with criminals and psychopaths in a land they don't know and barely understand.\r\n\r\nThe build up to the horror elements is slow, and for some horror fans it takes too long. Yet conversely it's good that the makers have afforded time for the characterisations to build, allowing for some humour, some drama and an insight into a multi national group dynamic. You may not much care what happens to them, but at least you know them!\r\n\r\nActually filmed on location in Brazil, there's a lot of mother nature's natural beauty (and her tough terrain at times) on show, all neatly photographed by Enrique Chediak (28 Weeks Later\/127 Hours). However, the trump card is the underwater sequences, which are superbly put together, including a thrilling extended chase sequence that lifts the film out of horror\/thriller averageville.\r\n\r\nThere's messages in the mix that valiantly try to make a point, but they get lost as things go a bit cuckoo. Yet there's enough good craft on show, and a horror sequence guaranteed to make you squirm, to make this worth a viewing. It is a good bit better than what some of the hate poured on it suggests, though the caveat is that horror fans should know it only gets into horror territory late in the day. 6\/10","id":"56238a1ac3a3680e2000efcc","url":"https:\/\/www.themoviedb.org\/review\/56238a1ac3a3680e2000efcc","movie_id":9796}
{"author":"pancine","content":"Powerful if brutal film about shame,guilt and redemption. Even when one has lost everything and has nothing. Great cinematography.","id":"5c6099b49251412fb8f98009","url":"https:\/\/www.themoviedb.org\/review\/5c6099b49251412fb8f98009","movie_id":85087}
{"author":"John Chard","content":"Something Wicked Thus Way Comes.\r\n\r\nA widow and her daughters move into the inherited family home and get terrorised by “zombie” kids from the local Carlton mining disaster that occurred many years earlier.\r\n\r\nYou know very early from the off that we the audience are going to be asked a lot of as regards character behaviours and rationales. The grieving mother moves herself and her daughters into what can only be described as an isolated pig sty, and right from the off all the warning signs are there for them that all is not well in this part of town.\r\n\r\nStory unravels in standard revenge from the grave formation, but the setting is very much in the film’s favour even if the core story is not. Creepy forest, crumbling abodes and the spectre of the mine disaster ready to unleash its secret. The kids themselves are actually ghosts who eat meat, human or animal, so it was a tenuous marketing strategy to be calling it a zombie film.\r\n\r\nHowever, the kids themselves are splendidly ghoulish, pale faced and dark eyed, these very much are creepy kids. Low tone cinematography and gentle pacing help the mood considerably, and cast performances are fine given that the writing saddles them with weak dialogue exchanges and drawn out sequences obviously used to extend the running time. A teen romance strand involving the eldest daughter also just feels like filler.\r\n\r\nA modest spooker but certainly watchable enough, atmosphere and location setting ensure this is the case. 4\/10","id":"54559518c3a3683e23000b26","url":"https:\/\/www.themoviedb.org\/review\/54559518c3a3683e23000b26","movie_id":10854}
{"author":"Wuchak","content":"***A good finale to the original trilogy***  \r\n\r\nI think the X-Men films have been so popular because the X-Men dare to be different. The concept of the X-Men strays far from superhero conventions. If you approach the X-Men films thinking you're getting something akin to Superman, Spider-Man or Batman, forget it.\r\n\r\nThe unique concept of the X-Men is that humanity is starting to evolve to the next level and humans all over the globe are starting to manifest superhuman powers from the mutant \"X\" gene. Two mutant leaders, who are also old friends, take highly contrasting positions. Charles Xavier starts a school for mutant youths in upstate New York. His attitude is positive and his goal benign. Eric Lensherr or Magneto, on the other hand, is fed up with the paranoia of non-mutants. He starts a \"Brotherhood of Mutants\" with a clear attitude of superiority. And, as they say, power corrupts and absolute power corrupts absolutely.\r\n\r\nYou could say that Xavier takes the approach of Martin Luther King Jr. while Magneto goes the route of Malcolm X, an interesting comparison.\r\n\r\nAlthough everybody has their favorite, I feel all three films in the original trilogy are of the same general quality - \"X-Men\" (2000), \"X2: X-Men United\" (2003) and \"X-Men: The Last Stand\" (2006).\r\n\r\n\"X-Men: The Last Stand\" is generally well-regarded but has a very vocal segment of fans who revile it. This makes little sense since, despite having a new director, the film has the same tone and principle actors as the previous two and brings to culmination the ideas presented therein. Aside from the final fight between Magneto's Brotherhood and Xavier's X-Men we get the resurrection of Jean Grey and her struggle with the dark side of her psyche.\r\n\r\nSome complain of the deaths of two prominent characters, but how often are characters resurrected in comics? Isn't one significant character resurrected in this very film? Others complain about the supposed short runtime and lack of depth but X3 has the exact same runtime as the first film (104 minutes) and there's plenty of depth to mine, take Rogue's dilemma over taking a cure in order to have human intimacy, Phoenix's incredible inner conflict symbolizing the universal clash of flesh and spirit (id and super-ego), Cyclop's grief and astonishing discovery, Pyro's moral degeneration, Mystique's plight after getting kicked out of the Brotherhood and Wolverine's struggle to do the right thing despite his deep love, to name just six.\r\n\r\nOn the downside, the big clash on Alcatraz Island feels routine and dull. They should’ve kept the focus on the Dark Phoenix, but the producers probably felt this would take away from the other characters, plus they wanted the clichéd big battle sequence. Nevertheless, there’s enough good here to appreciate.\r\n\r\nGRADE: B+","id":"5cf8034c0e0a26706ec9df69","url":"https:\/\/www.themoviedb.org\/review\/5cf8034c0e0a26706ec9df69","movie_id":36668}
{"author":"tmdb44006625","content":"X3 is a complete disaster. Worst X-Men movie ever. See rant below:\r\n\r\nNot only is the Phoenix storyline butchered, but the script rewrites the personalities of its key characters. Since when were Cyclops, Xavier, and Magneto such assholes? Halle Berry's demand for more screentime basically means she shows up in more scenes. Her character has no arc and often says lines that contradict what she said in previous scenes. Rogue has also turned into a whiny sidenote, part of a shoehorned in love triangle, which is disappointing given that the trilogy started from her perspective.\r\n\r\nThrowing in as many mutants as you can on the screen, some with powers that would be good if this were an X-Men spoof, but here it's played for absolute seriousness. It also means every character is essentially one note because there's no time to develop anyone. It certainly doesn't help that the movie carelessly removes or kills off half the team from the previous two films. Instead of shocking me, I'm sitting there never sure who I should be rooting for (except for Wolverine).\r\n\r\nX3 hurtles through scene after scene to get from one action set piece to another, and at just 93 minutes, there's never any time to process the plot. Of course the movie has to sequel bait with a final scene that suggests everyone will eventually get their powers back. What a way to render the entire movie pointless.\r\n\r\nLastly, this movie cost $215 million to make. Only about a quarter of that money shows up on the screen. The CGI, green screen, and makeup effects are obvious and look horrible. So the movie looks like crap, tells it's story like crap, and treats it's characters like crap. X3 is crap.","id":"5c84284c0e0a2642fb63b1f7","url":"https:\/\/www.themoviedb.org\/review\/5c84284c0e0a2642fb63b1f7","movie_id":36668}
{"author":"Andres Gomez","content":"This is the stereotypical romantic drama which tries to use the successful mix from Speed between Bullock and Reeves. It doesn't really work.\r\n\r\nThe movie is quite flat and the plot is quite nonsensical. Of course, in a movie with time traveling you cannot think much about that part of the story or will fall apart. Not specifically, the fault of this one. But the behavior of the characters is really, really pointless in some parts.\r\n\r\nAlso, the parallel family struggles of both characters are quite pointless and irrelevant for the main story.\r\n\r\nThe main mistake, however, is the lack of spark that Bullock and Reeves did have in Speed. They are just numb.\r\n\r\nThe best part, the beautiful setting of the Lake House.","id":"5709082392514170fc000820","url":"https:\/\/www.themoviedb.org\/review\/5709082392514170fc000820","movie_id":2044}
{"author":"EmkEyen","content":"Wooden acting and cheesy script but neither get on your nerves. It is a b-movie, there is no doubt about it. But the concept is good, execution is fine and the effects pretty good as well. While the two academics are complete stereotypes, the main four characters are all interesting. And I admit, in the finale I was on the edge of my seat.","id":"5a78fcc5c3a368227b01dac4","url":"https:\/\/www.themoviedb.org\/review\/5a78fcc5c3a368227b01dac4","movie_id":13557}
{"author":"John Chard","content":"Each breath you take is a sin. No shadow will be safe again, for you will be hunted by angels.\r\n\r\nThe Da Vinci Code is directed by Ron Howard and adapted to screenplay by Akiva Goldsman from the novel of the same name written by Dan Brown. It stars Tom Hanks, Audrey Tautou, Ian McKellen, Paul Bettany, Jean Reno, Alfred Molina and Jürgen Prochnow. Music is scored by Hans Zimmer and cinematography by Salvatore Totino.\r\n\r\nWhen a man is murdered inside the Louvre, his body is found to be surrounded by cryptic messages. The police call in American symbology expert Robert Langdon (Hanks) to decode the clues. When he is joined by Parisian cryptologist Sophie Neveu (Tautou), it quickly becomes apparent that nothing is as it first seems and a mystery begins to unravel that could shake Christianity to its very core.\r\n\r\nExtended Cut (Blu-ray) Version Viewed.\r\n\r\nI haven't read the book! And I love treasure hunt\/clue chasing movies! So I came to Ron Howard's hugely successful film (over $600 million in worldwide profit) bereft of literary pressure and with only a modicum of genre expectation. Perhaps this is why I'm apparently only in a small percentage of film lovers who really enjoyed the film? In spite of those gargantuan financial figures.\r\n\r\nUltimately it's very safe film making, with a director and cast guaranteeing professionalism, but it weaves a magical mystery tour full of cryptic clues, secret organisations and cover ups. Yes, there is a good deal of corn thrown in as well, which inevitably stops the adaptation from being hyper intelligent. There's also an understanding on my part as to why many feel it's just too talky, but was the film ever going to be unfurled as an action movie blockbuster for the popcorn munching crowd, like National Treasure et al?\r\n\r\nIt is a clever conspiracy thriller full of twists and turns with a outlandish revelation at the finale. It's also very appropriately performed by the cast (serio brooding and fret), and when McKellen joins the fray after an hour of film it has a little class as well, while Zimmer's score is a majestic blending of choir, strings and synths. I maintain that the film didn't deserve the critical whacking it got, but again I say I had a blank canvas going in for my first viewing. \r\n\r\nI wasn't sold to it because of controversy or had a saliva tinged mouth having worshipped at the altar of Dan Brown, I expected exactly what I got. A flawed but ever so intriguing adult mystery thriller, and not even Hanks' hair stopped me having a great time with the movie. 7\/10","id":"5d6c63ff0e4fc81ce0d9373d","url":"https:\/\/www.themoviedb.org\/review\/5d6c63ff0e4fc81ce0d9373d","movie_id":591}
{"author":"CRCulver","content":"The 2006 film <i>Ostrov<\/i> (The Island) is a story of religious faith in the bleak Russian north. As the film opens, it is 1942 and the young Russian sailor Anatoly is forced by the Germans to shoot his captain Tikhon. Left for dead, Anatoly washes up on the shore of an island where a monastery is located. He spends the next three decades among the monks trying to atone for the killing of his friend and shipmate. Eventually, though he considers himself the lowest of the low, Anatoly is granted clairvoyance and the ability to work miracles. A steady stream of visitors comes to the island to seek his help.\r\n\r\nBut Anatoly is a certain kind of saint specific to the Russian tradition, the holy fool. He does things that make no sense to his fellow monks, to the point they think he's insane, but eventually everything he does is revealed to communicate some key spiritual point. Between ministering to the outsiders who visit him and dealing with his exasperated brethren, Anatoly gets no rest.\r\n\r\nThe film is beautiful in a way. The plot is engaging enough, and for audiences outside Russia (as well as many Russians who grew up under Communism) this is an informative presentation of the realities of Orthodox monastic life. The makeup effects are excellent -- Pyotr Mamonov doesn't look this decrepit in real-life, but on the screen he really is convincing as a starets who has spent decades in an unforgiving environment.\r\n\r\nNonetheless, I found <i>Ostrov<\/i> rather too heavy-handed, seeming at best sappy and at worst outright propaganda for a certain kind of contemporary Russian Orthodoxy that doesn't represent the faith entirely well. When one thinks of Russian Orthodoxy in cinema, one is tempted to draw comparisons with Andrei Tarkovsky, but even when Tarkovsky wasn't directly using Orthodox themes, he still communicated Christian truths more powerfully than anything in this film (think of the climax of Tarkovsky's <i>Stalker<\/i> or the ending of <i>Offret<\/i>). Thus, all in all, <i>Ostrov<\/i> is entertaining but not terribly deep.","id":"5b905f2c0e0a26659c001499","url":"https:\/\/www.themoviedb.org\/review\/5b905f2c0e0a26659c001499","movie_id":22358}
{"author":"The Movie Diorama","content":"The Grudge 2 resents its illogical plot for basic ineffective jump scares. Shimizu’s western remake of his J-horror creation was one littered with promise, albeit irrefutably rough around the edges. Mediocre acting, snooze-inducing storytelling and jump scares aplenty. Japanese ghost children, that either croak as if exhuming a sore throat or scream like a domestic cat, popping their heads out of attics, entangling women in wavering hair and just being a general nuisance. Well, Shimizu begrudgingly brings Kayako and Toshio back for more ghoulish antics, as the fire initiated by Sarah “Buffy or Daphne, your pick...” Michelle Gellar somehow unleashed the dark spirits into the world. Essentially no longer restricted to the abandoned Saeki household, although still only haunt those that enter the house? I don’t know, the logic is tossed out of the shōji at this point.\r\n\r\nInstead of remaking the original sequel for ‘Ju-On’, Shimizu and writer Susco opted for a more original take, answering the fundamental question that we all yearned to ask: “gurl, where did you get that eye liner?”. Turns out, dark spirits is the answer. What I supremely detest about this sequel is the direction the two aforementioned crew members decide to take the story. It’s no longer about greeting death with a deep and powerful rage, cursing the location the spirits resides in. A semi-folklorish strand of Japanese traditions.\r\n\r\nInstead, to appease the simple minds of western mainstream audiences, they settled for a mundane supernatural progression that essentially tarnishes the original’s plot in almost every possible angle available. Sure, Shimizu integrates some well-intentioned imagery that may or may not produce a chill or two. Namely the photograph sequence and bludgeoning someone with a frying pan during breakfast (what a waste of bacon!). Yet these are often accompanied by a predictable jump scare that relinquishes the horror. Kayako pouncing out of a photograph. Kayako wandering the hospital corridors bursting lightbulbs in her wake (not very cost-effective...). Kayako playing footsies in a Love hotel room. Kayako being Kayako. Once or twice was enough. Twenty times? Rapidly becoming unimaginative.\r\n\r\nThe non-linear intersecting sub-plots, imitating its predecessor, provided no twists to the narrative and, if anything, forced the pacing to be inconsistent with its constant switching between character perspectives. A classic peer pressure scenario which is enough to make anyone’s eyes roll a hundred times.\r\n\r\nMagic mirror tricks, very unfashionable hoodies and an absolute waste of Buffy. The three elements that perfectly surmise the contents of this lacklustre sequel that boasts no genuine scares or tolerable execution. Again, stick to the original franchise.","id":"5e206c8e0102c900133c53d5","url":"https:\/\/www.themoviedb.org\/review\/5e206c8e0102c900133c53d5","movie_id":1975}
{"author":"Wuchak","content":"Good plot and haunting ambiance, but mediocre story and weak characters\r\n\r\nRELEASED IN 2006 and directed by Lucky McKee, \"The Woods\" chronicles events in 1965 New England when a troubled teen (Agnes Bruckner) is dropped off at a spooky remote boarding school for girls by her estranged parents (Bruce Campbell & Emma Campbell). Weird, witchy things ensue. Patricia Clarkson plays the dean while Lauren Birkell and Rachel Nichols play fellow students, one nice and the other mean.   \r\n\r\nThis is a mystery\/horror flick that combines “Suspiria” (1977) with elements of “Carrie” (1976) and “The Ruins” (2008) or “Man-Thing” (2005) (yes, I realize “The Ruins” came out later; I’m just trying to give people an idea of what the movie’s like). The haunting atmosphere and the Montreal location are very good, as well as the unsettling creepiness. \r\n\r\nSo the plot is a winner, the film looks good and there’s an effective darkness, if that’s your thang. Unfortunately, the story is underwhelming. It’s too ambiguous and feels incomplete, like a half hour of events were cut from the runtime. The hints of levitation and telekinetic abilities don't amount to much, nor do the leaves on a bed.\r\n\r\nThe characters are either underdeveloped or unlikable, except for maybe the protagonist (Bruckner). All we know about Heather is that she recently set fire to something and there’s enmity between her and her self-absorbed mother. The father is a pushover. We don't learn much about them or anyone else at the academy. Marcy provokes pity while Samantha is too over-the-top as the villain. You’re more curious about WHY she’s so mean than anything else. With all the young females available, the filmmakers drop the ball by not taking advantage of these resources (and I’m not tawkin’ bout nudity or sleaze).   \r\n\r\nThe emotionless deliveries of the all-female faculty don’t help, but I realize they were written that way to create a sense of oddness and it works. The witchcraft elements are decidedly subdued, which I liked; the focus is on the formidableness of the forest itself (hence the title). Speaking of which, the woods F\/X in the last act are well done. \r\n\r\nTHE MOVIE RUNS 1 hour 31 minutes and was shot at McGill University, Montréal, Québec. WRITER: David Ross. \r\n\r\nGRADE: C","id":"5ac2914c92514160180609c7","url":"https:\/\/www.themoviedb.org\/review\/5ac2914c92514160180609c7","movie_id":6948}
{"author":"Andres Gomez","content":"A simple story told in a very complicated way. Not the best of Aronofsky's works.","id":"53184f15c3a3685c560011c2","url":"https:\/\/www.themoviedb.org\/review\/53184f15c3a3685c560011c2","movie_id":1381}
{"author":"Andres Gomez","content":"Maybe too ambitious this drama told through a children's tale.\r\n\r\nPhotography is great, though.","id":"52d4f45e19c29562a013c993","url":"https:\/\/www.themoviedb.org\/review\/52d4f45e19c29562a013c993","movie_id":14784}
{"author":"John Chard","content":"I am the father of Africa.\r\n\r\nBased on Giles Foden's novel of the same name, this filmic version of a period of Idi Amin's presidency of Uganda is a class act - that is if you can accept it as a loose reworking of events in Amin's life? Thus those who filed in for a bona fide history lesson subsequently either got angry or plain disappointed.\r\n\r\nPropelled by Forest Whitaker's barnstorming Oscar winning perf as Amin, Last King of Scotland is riveting and fascinating from first reel to last. The political upheaval at this time in Uganda's history is presented in delicate strokes of dark depressing realisations, and also that of uneasy humour.\r\n\r\nThe portrayal of Amin is most complex, part man child, part greenhorn political suitor and one heartbeat away from despotic lunacy, with Whitaker nailing every single tick. It's key to note that the film does shed some light on Amin, so as a character study it soars and holds you enthral throughout.\r\n\r\nDirector Kevin Macdonald films in kinetic style, which is perfect for the material to hand, and he also deserves a pat on the back for ensuring the characters around Amin (circle of family\/advisors etc) are a constant intrigue as per Amin's agenda machinations. James McAvoy gives sterling support as the key \"fish out of water\" doctor who Amin takes to his bosom, while Kerry Washington as Amin's wife number 3 also strikes the right emotive notes.\r\n\r\nThe finale falters somewhat, where it encompasses the Entebbe Hostage Crisis but fails to do that incident justice - instead using it as a cypher to have us rooting for McAvoy's made up character to get out of harm's way. But this is just a misstep that's not film defining. For this is a fine film, if it's not jolting you with harrowing scenes, or tickling your brain for education purpose, then it's demanding your attention for historical noting. Job done. 8.5\/10","id":"5ca6b2c2925141258ede9685","url":"https:\/\/www.themoviedb.org\/review\/5ca6b2c2925141258ede9685","movie_id":1523}
{"author":"JPV852","content":"Seen this movie several times over the years and still find it so entertaining and satisfying thanks in large part to Edward Norton's performance. In some ways, although not as expertly directed, I prefer this over The Prestige, which is a great movie in its own right.","id":"5d6703b112c60400146f32cd","url":"https:\/\/www.themoviedb.org\/review\/5d6703b112c60400146f32cd","movie_id":1491}
{"author":"Andres Gomez","content":"Intense drama about Ireland's independence from the UK and the ultimate reasons for the need of freedom.","id":"5245bf0019c2953df52424cc","url":"https:\/\/www.themoviedb.org\/review\/5245bf0019c2953df52424cc","movie_id":1116}
{"author":"Gimly","content":"Different take on the genre. The \"twist\" is not only pretty straight forward, it's also straight up given away in the promotional material, and that twist is really the point of _The Hamiltons_. Even so, I was engaged, which is important. Acting could be better, same goes for the AV quality, but you get that with independant horror, and this I can handle.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5c8cd62b0e0a2612ef52eef5","url":"https:\/\/www.themoviedb.org\/review\/5c8cd62b0e0a2612ef52eef5","movie_id":15495}
{"author":"talisencrw","content":"I decided to celebrate the Summer Solstice by watching 'The Departed'. Don't ask me why. I had previously loved the Hong Kong-made 'Infernal Affairs' trilogy on which this is based. Usually I hate when international masterpieces get remade, but this was a sterling exception. This was controversial when it took in a cartload of Oscars, particularly finally a directorial nod for Scorsese, but don't be misled--it's easily one of his finest works.\r\n\r\nThis is my Golden Rule on both remakes in general, but especially American remakes of international (particularly foreign-language) great films. When in doubt, check the label:\r\n\r\n1. Director? (check)\r\n2. Cast? (check)\r\n3. Script? (check)\r\n\r\n'The proof is in the pudding!'","id":"579155ee9251415aab002740","url":"https:\/\/www.themoviedb.org\/review\/579155ee9251415aab002740","movie_id":1422}
{"author":"pancine","content":"Beautiful,bleak location. Excellent cinematography and direction highlights this story of guilt and redemption. Some find it in helping others selflessly. Or devotion to one's higher power. The prayer scenes may have been a bit too long or frequent but overall a good film,story and visual feast.","id":"5c6098a10e0a267ded94d4ae","url":"https:\/\/www.themoviedb.org\/review\/5c6098a10e0a267ded94d4ae","movie_id":22358}
{"author":"John Chard","content":"The only one that can do what I do is me. Lot of people had to die for me to be me. You wanna be me? \r\n\r\nThe Departed is directed by Martin Scorsese and written by William Monahan, Alan Mak and Felix Chong. It stars Jack Nicholson, Matt Damon, Leonardo DiCaprio, Mark Wahlberg, Martin Sheen, Ray Winstone, Vera Farmiga, Anthony Anderson, Mark Rolston and Alec Baldwin. Music is by Howard Shore and cinematography by Michael Ballhaus.\r\n\r\nAn Irish gang in South Boston becomes aware there is a rat in their midst, whilst the police force has a mole to contend with - with each one trying to out each other before the other does...\r\n\r\nMartin Scorsese remakes Hong Kong thriller Infernal Affairs (2002) for the English speaking world, and promptly bagged his first Best Director Oscar in the process. It's a thrilling picture packed with suspense and edginess, a psychological gangster picture driven by two men leading double lives that is leading them to the abyss. When the violence comes it erupts in thunderous strokes, all while the narrative pulses with paranoia. There are some irksome contrivances, but with a uniformly strong set of turns from the cast, great musical accompaniments, and a director returning to gangster form, The Departed is a sure fire winner. 8.5\/10","id":"5ea427886d1bb2001fa38c93","url":"https:\/\/www.themoviedb.org\/review\/5ea427886d1bb2001fa38c93","movie_id":1422}
{"author":"Gimly","content":"One of the best horror remakes to come out in this most recent trend. Rather than ignoring its source material, or taking the other extreme of drearily rehashing it scene for scene, Aja and Levasseur's _The Hills Have Eyes_ simply expands and improves upon the original.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5bd29e980e0a2616e80053a7","url":"https:\/\/www.themoviedb.org\/review\/5bd29e980e0a2616e80053a7","movie_id":9792}
{"author":"Belle Perera","content":"The first Dhanush movie i have watched,I really like it and i enjoyed a lot.","id":"591a94ac925141061e05fdbf","url":"https:\/\/www.themoviedb.org\/review\/591a94ac925141061e05fdbf","movie_id":112309}
{"author":"talisencrw","content":"Normally this sort of film wouldn't interest me, but I was fascinated by the cast (Meryl Streep, Anne Hathaway, Emily Blunt and Stanley Tucci ARE four of my favourite contemporary American actors) AND I liked the three previous films I've seen about the fashion industry ('Ready to Wear', 'Zoolander' and of course 'Death Wish 5: The Face of Death'). I was really pleased by the comedy caused by the bitchiness, pettiness and downright superficiality of everyone involved, which says SO much about contemporary civilization...and the climax and denouement, are both touching and so fitting. The strong writing and acting made this much better than it had any reason to be.","id":"57a3e6ad92514147f30007a9","url":"https:\/\/www.themoviedb.org\/review\/57a3e6ad92514147f30007a9","movie_id":350}
{"author":"Gimly","content":"For some, the lesbian-vampire sex may be enough to get you over the line, for others, the ratcheted up third act will. For most though, neither'll be enough.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"59168dabc3a3683a930283b6","url":"https:\/\/www.themoviedb.org\/review\/59168dabc3a3683a930283b6","movie_id":29691}
{"author":"John Chard","content":"Life and death. Space and time. Fate and chance. Theses are the forces of the universe. \r\n\r\nThe Illusionist is directed by Neil Burger and Burger adapts the screenplay from \"Eisenheim the Illusionist\" written by Steven Millhauser. It stars Edward Norton, Paul Giamatti, Jessica Biel and Rufus Sewell. Music is by Philip Glass and cinematography by Dick Pope.\r\n\r\nHow splendid, a period romantic mystery that's filled with the mysticism of magical conjurings and political volatility. Plot essentially has Norton as Eisenheim The Illusionist, who later in life runs into Sophie (Biel), his childhood sweetheart, and finds that she's on course to marry Crown Prince Leopold (Sewell). Leopold has a bad reputation and it's not long before Eisenheim comes under Leopold's disdain, forcing Eisenheim to try and pull off the ultimate magic act to save Sophie and himself.\r\n\r\nCreator Neil Burger crafts a picture that has everything going for it. The story is rock solid with intrigue credentials, where appropriately for a story based around magic tricks nothing is ever as it seems. The period flavours are smartly assembled, the Czech Republic locations smartly standing in for turn of the century Vienna, the art production is on point with the era of setting, as is the costuming. Glass drifts a tender melancholic score over the piece, while Pope's cinematography is simply gorgeous, offering up colour lensing that's aura enhancing, the kind you could get lost in for days.\r\n\r\nThe magic tricks are beguiling, as they should be and are in fact required since the narrative tantalisingly suggests Eisenheim may have supernatural powers? The story itself has no historical worth, but is fascinating none the less. It all builds towards its revelations, and much hinges on if the pay off is worth the admission fee? Most assuredly so it is, even if from a personal point of view this writer wouldn't have minded if pic had finished five minutes before the final revelation. \r\n\r\nEither way, and with smart acting (Giamatti as the police inspector standing out) without histrionics holding things at the top end, this is delicate film making that engages the emotions fully for entertainment rewards. 8\/10","id":"5c557c760e0a263ccde101ea","url":"https:\/\/www.themoviedb.org\/review\/5c557c760e0a263ccde101ea","movie_id":1491}
{"author":"GeekMasher","content":"When I looked at this film for the first time I was unsure it would be any good... I was completely amazed by how this film was good. The actors all played there role very well. The film has a very good storyline and I was compelled to watch it. All in all a great movie, worth watching.","id":"51429bc619c29576df05c817","url":"https:\/\/www.themoviedb.org\/review\/51429bc619c29576df05c817","movie_id":1491}
{"author":"izgzhen","content":"Perplexed by the storyline at the beginning, deeply attracted to the narratives of the intense rivalry between two actors in the main body of the show, and finally shocked by the revealed truth, or *The Prestige* in the end. This is one of the most mind-blowing mysteries that I've watched in recent years.\r\n\r\nOne of the best part, I think, is how the characters of two young magicians are depicted -- through small but noticeable details like the facial expressions, one or two words, the novels et cetera.\r\n\r\nIn fact, the title of the movie, even being explained by Cutter in the beginning, still puzzles me and I can't stopped thinking about the meaning of it. Not to mention other puzzles. But ultimately, I came to realize that the plot structure corresponds to a epic magic show as well.","id":"5a5b08c5c3a36867e401affe","url":"https:\/\/www.themoviedb.org\/review\/5a5b08c5c3a36867e401affe","movie_id":1124}
{"author":"Wuchak","content":"***Wannabe “Where Eagles Dare” mixed with a little “Kelly’s Heroes”***\r\n\r\nDuring Operation Market Garden in German-occupied Holland (September, 1944), one small unit consisting of several Brits & one Canadian pilot (Billy Zane) vie for a cache of priceless art stolen from Berlin, but a couple Germans have the same idea (Karel Roden and Alexander Skarsgård). Laurence Fox plays a Nazi tasked with protecting the loot by the SS while Michael Madsen has a small role as an American Colonel.    \r\n\r\nA UK production, \"The Last Drop\" (2006) is a WW2 ‘B’ flick that borrows the basic premise of “Where Eagles Dare” (1968), albeit minus the castle, and meshes it with the heist element of “Kelly’s Heroes” (1970), as well as a bit of the humor (just a bit). Unfortunately, it’s nowhere near as compelling or entertaining, yet it’s not as bad as some reviews would suggest. Everyone whines about how “low-budget” it is but, while not of “blockbuster” caliber, it ain’t no Syfy production. And it scores pretty well on the female front.\r\n\r\nOn the downside the plot is complicated with too many players, not to mention the accents make the mumbled dialogue only half intelligible to non-Brits with, regrettably, no option for English subtitles on the disc.\r\n\r\nThe movie runs 1 hour, 43 minutes, and was shot in Bucharest, Romania.  \r\n\r\nGRADE: C+\/B-","id":"5df8f7eabe2d49001750a048","url":"https:\/\/www.themoviedb.org\/review\/5df8f7eabe2d49001750a048","movie_id":2911}
{"author":"Milo_Jeeder","content":"I am honestly surprised that this film got such a high rating on this site and many other sites, for that matter. It seems like I may be one of the few who didn't like it and even though \"The Abandoned\" is a watchable horror\/drama flick that can be mostly appreciated for the nice imagery, I mostly found it redundant and tedious. To me, it was like an hour and a half of pointless sequences and bogus scares and while I do appreciate creative and artistic dark imagery, it can become ineffective when the story is not held properly. I mean, directors like Dario Argento can get away with plain stories, pointless sequences and underdeveloped characters... because he makes his films entertaining and puzzling. Nacho Cerdá, on the other hand, cannot. flawless and the setup is brilliant as well, but the movie still doesn't work. Why? because it's tedious! I'm pretty sure that several \"serious\" movie lovers will claim that people who think this film is dull, it's because they are untrained watchers who can only appreciate torture porn and fast-paced films with a lot of action. Well, it's really not my case, because I actually have great tolerance for low-paced films. The low-pace, in several films serves a purpose, but not with this film.\r\n\r\nIn \"The Abandoned\", a film producer named Marie, who lives in the United States with her young daughter, goes back to her homeland in Russia, when she is informed that she has inherited an old house from her parents. Unfortunately for her, the place is situated in the middle of nowhere and Marie is not exactly familiarized with the Russian language or the culture in general. Without having a clue of anything, she intends to visit the place anyway with the help of a guide, who disappears in the middle of the night under strange circumstances. Completely desperate and with no one else to turn to, Marie starts looking for her guide, without realizing that something is waiting for her out there: Secrets from the past, that have been waiting for over 40 years, and that she's about to discover in the worst possible way.\r\n\r\nThis was really a great disappointment for me. I was expecting a promising story, exploring a family drama and all I got, was the same worn out plot about the impossibility of escaping fate and our past (I think we had enough of that silliness already). I guess \"The Abandoned\" is overall watchable. Definitely not a masterpiece, but still not the worst movie ever. A movie that is going to be appreciated mostly by people who are in favor of those long and unnecessary situations that lead to nothing whatsoever and video-game sequences that don't add anything at all. By the way, the story supposedly takes place in Russia, even though it was actually filmed in Bulgaria and they didn't do a very good job hiding it. It's not the first time that a movie supposedly takes place in one coun","id":"58a396259251414b2c000393","url":"https:\/\/www.themoviedb.org\/review\/58a396259251414b2c000393","movie_id":10790}
{"author":"John Chard","content":"As for Pete, there's a line in the Velveteen Rabbit that reads... Real isn't how you were made. It's the thing that happens to you. I'm Gabriel Noone. Goodnight. \r\n\r\nWell I can add The Night Listener to my list of films that I believe are criminally undervalued. I be genuinely surprised to see this finely crafted tale rated below 6 on some internet movie sites. Is it just the Robin Williams haters dragging this smart film down? Or perhaps it's kids who don't quite understand a film about the complex and eerie nature of the fragile human condition? Either way this film delivers something outside of the norm, something for those to seek out who require a break from the hum drum of the spoon fed Hollywood masses. \r\n\r\nBoasting the ever reliable and undervalued talent of Robin Williams (gusto without histrionics), and the considerable brilliance of Toni Collette, the film delivers a dark look at the yearning for love in some form or another, at the gullibility of those in need of something, making this film is a smart and intriguing nights entertainment. All those interested in the film should seek out the true story it's based on, that of the Anthony Godby Johnson affair, itself an eerie slice of human mystery.\r\n\r\nThis wouldn't be out of place on Hitchcock's CV, and tomorrow when I'm taking on the challenges of another working class day, this film will be at the forefront of my mind - because it did its job handsomely. You may not like it once viewed, but you will at least think about it afterward. Or maybe it's just me that thinks this is a little gem that should be thought of better with the advent of time... 7.5\/10","id":"5e557ef2848eb90014f34959","url":"https:\/\/www.themoviedb.org\/review\/5e557ef2848eb90014f34959","movie_id":9782}
{"author":"Frode Lindeijer","content":"Full of symbolism and pretty pictures this movie will strike your soul if you have one. Once the credits roll it will be like waking from a dream.","id":"5b41fdc9c3a36840a2012f65","url":"https:\/\/www.themoviedb.org\/review\/5b41fdc9c3a36840a2012f65","movie_id":1381}
{"author":"Travis Bell","content":"Contrary to many opinions of this film, The Fountain stands as an all time favourite of mine. The layering of timelines combined with Aronofsky's eye just made for a beautiful experience.\r\n\r\nA truly underrated masterpiece.","id":"53189383c3a3685c430017af","url":"https:\/\/www.themoviedb.org\/review\/53189383c3a3685c430017af","movie_id":1381}
{"author":"Wuchak","content":"No-budget backwoods monster flick is actually pretty innovative and rewarding\r\n\r\nMADE IN 2004 AND RELEASED IN 2006, \"The Lonely Ones\" is an ultra-low budget cabin-in-the-woods slasher chronicling the adventures of nine college students (five girls and four guys) who vacation in a big modern cabin in Arizona owned by the family of one of the girls. Havoc ensues when they discover that they're the prey of someone or something(s) lurking in the woods.\r\n\r\nThis is the kind of micro-budget flick that rises above its limitations and offers something fairly impressive and worthwhile. It only cost $100,000 to make and most of that went into lodging & catering for the cast and crew in the middle of nowhere. For the most part, the first 36 minutes are weak with all the limitations of no-budget fare: dubious sound, bad lighting, fuzzy cinematography from hand-held digital cams, etc. But at the 36-minute mark things spark into motion till the end with numerous effective, moving or thrilling sequences. I'll be honest with you, I was about to give-up on the movie because of its shortcomings in the first act, but I'm glad I stayed with it because it turned everything around for a pretty potent backwoods monster movie.\r\n\r\nDespite the presence of no less than a dozen characters (featuring a nicely diverse cast) and a spare change budget, director\/writer David Michael Quiroz Jr. was able to flesh out the characters with a well-crafted and original script. On top of this, there's a varied score that's pretty effective, even though one long sequence in the second act drones on with the eerie piano. Speaking of the piano, one part is reminiscent of Savatage's \"Storm,\" which is good in my book. The score also includes some moving acoustic guitar pieces and a hard rock\/metal piece.\r\n\r\nOf the five girls, they're all pretty average-looking (not ugly, just average) with the exception of petite cutie Devanny Pinn as Tifa, who's a unique-looking semi-hottie; and maybe the redhead protagonist, Rinoa, played by Heather Conforto, aka Heather Rae.\r\n\r\nFINAL SAY: \"The Lonely Ones\" really surprised; it's a gem in a sea of micro-budget dreck. But you won't be able to appreciate it unless you can adapt to its no-budget style, which I was fully able to do after the first act (I also went back and re-watched the first act whereupon discovering that it's actually a solid set-up for the rest of the movie). Once the second act started I was gripped to the end and very impressed by the proceedings despite the movie's obvious limitations.\r\n\r\nThis would be a great movie if it were redone with a decent budget. The director\/writer should've gone on to better things but, as of this writing, he hasn't directed anything since 2009, and that was a TV episode. That's a shame because \"The Lonely Ones\" shows that he's got the talent to create greatness. He just needs the funds to back up his vision.\r\n\r\nTHE FILM RUNS 97 minutes and was shot in Greer, Arizona.\r\n\r\nGRADE: B-","id":"5b3e6f6cc3a3686714000a8a","url":"https:\/\/www.themoviedb.org\/review\/5b3e6f6cc3a3686714000a8a","movie_id":398747}
{"author":"germish","content":"Was it a revolution? Was it a coup? Who was in control? Was it the military? Was it the armed militia? Nobody really knows actually. But what we do know is that the events depicted in this movie - which took place more than 16 years ago - changed the history of a country.\r\n\r\nThe film tells the story of a young militia force soldier on the night the alleged Romanian revolution takes place. He is young, he is a bit confused, a bit enthusiastic, a bit scared. Yet he decides to disobey his superior and go fight on the side of the people to protect the national television headquarters against the terrorists. Soon after he leaves, his mates decide to abandon their patrolling mission and go in search of him. But somewhere along the way, things turn terribly wrong. For everybody. Because there is fighting on the streets, because its dark and its cold, because nobody knows whose supposed to fight who, where everybody else is (as the soldier, Cristi, never gets to the TV headquarters), who the terrorists are, what the recognition password is...\r\n\r\nThe characters all seem to fit so well with the general confusion but also adding compassion and humor to the whole story that one might think this is almost a documentary of real events. Of course, this is achieved through an attention for detail that only those familiar with Romania would truly appreciate. But do not let that put you off; the real message of this film has nothing to do with specific issues and humor transcends borders.\r\n\r\nTrying to be as objective as possible, given the clever directing, natural and sharp dialog, solid script, I can only give this movie a 9, as nothing that is country-specific will detract from the pleasure of watching this movie. Highly recommended!","id":"510ecf9c760ee34c631b69d8","url":"https:\/\/www.themoviedb.org\/review\/510ecf9c760ee34c631b69d8","movie_id":73682}
{"author":"tricksy","content":"From the beginning I knew a prequel to the PINK PANTHER series would be an abomination. I did not, however, think it would be worse than I expected. I went to see the movie because I am a fan of Steve Martin and his writing. His attempt at either imitating or recreating the Clouseau role (whichever it was) was, in the very least, a failed accomplishment. The beauty of the Sellers \"Clouseau\" was the subtlety that Sellers brought to the character. He was clumsy as opposed to stupid. The real humor in the originals is that Clouseau would solve the case, more or less, by accident through his faults. Thus when he received acclaim it was that much more humorous. Martin's \"Clouseau\" is stupid and vain and has no likable traits. He actually has some police skills that help him in the end, but are not in the vain of Clouseau. He is NOT Clouseau. Why would anyone want to recreate a character that was perfect?","id":"55782205c3a36842ee0014cf","url":"https:\/\/www.themoviedb.org\/review\/55782205c3a36842ee0014cf","movie_id":12096}
{"author":"J4stringthang","content":"SCI-FI Lovers BEWARE! What a MAJOR DISAPPOINTMENT! I thought this was going to be some awesome Sci-fi flick traveling through time and fighting to be with each other. (You know like all the other new Sci-fi flicks today). I was WRONG. Rachel Weisz and Hugh Jackman are both amazing actors, however I found the Fountain to be WAY TO artsy \/ independent film for me.","id":"52f31f08c3a36802220a9746","url":"https:\/\/www.themoviedb.org\/review\/52f31f08c3a36802220a9746","movie_id":1381}
{"author":"John Chard","content":"I have been pointing my gun at a lot of people this week. \r\n\r\nA box office failure and a neo-noir film that confounded critics and fans alike, The Black Dahlia now appears to be a pic that has had its strengths ignored. As the clamour to kick Brian De Palma continues unabated to this day, and the point blank refusal to accept that Josh Hartnett is a better actor than the likes of Pearl Harbor suggests, it's a film worthy of a revisit by genre\/style fans alike. \r\n\r\nPlot revolves around the infamous murder of one Elizabeth Short in Hollywood, 1947. An aspiring actress who was found butchered and her murder to this day remains unsolved. De Palma and his writer Josh Friedman adapt from noir legend James Ellroy's novel of the same name, the crux of the story is about two hot-to-trot detectives who get involved in the Short case, and pretty soon there is a can of worms that has been shaken and opened, and there's dizzying worms everywhere - we think? \r\n\r\nDe Palma loves noir, he has dabbled with it for a long time, not all of it works, but often he delivers for like minded cinephiles. With expectation levels high and following in the slipstream of the critical darling that was L.A. Confidential, Black Dahlia never really had a hope of achieving its lofty ambitions, yet it's a tremendously realised picture from a noir stand point. Whilst it showcases the technical wizardry of the director. \r\n\r\nThe charges of it being convoluted are fair, it's a spinning narrative, stories within stories, characterisations obtuse, but so was The Big Sleep! I know, I know, this is not fit to lace the boots of Hawks' genius movie, but tricksy narratives have always been a fundamental part of many a film noir, so why the distaste for this one? Especially since the period design, costuming, styling, photography and characterisations are so rich in detail? For instance Hartnett's detective is gumshoe nirvana, while Scarlett Johansson and Hilary Swank fatale the femme with mischievous glee. \r\n\r\nBut of course De Palma then spells it out for the finale, explaining things, a sort of macabre wrap up for those that needed it. Either way he was never going to win, it's too complex, it didn't need spelling out, while Mr. De Palma we have to tell you that your characters have been too cold, we don't feel them?! Huh? This is noirville, a place frequented by bad people, idiots and hapless dreamers, of dupes and double crossers. Hell there's even a suggestion of necrophiliac tendencies in this, and that's before we even delve into the machinations of the two femme fatales, a family that's lacking Adams Family Values and coppers of dubious motives. \r\n\r\nYeah, it's cold, and yes De Palma is guilty of trying to please all parties by covering all bases, but it's far from being a stinker. Haters of De Palma, Hartnett and complex noir narratives can knock two points off of my own personal rating, otherwise it's 7\/10.","id":"55ea26d5c3a3682c76006e6c","url":"https:\/\/www.themoviedb.org\/review\/55ea26d5c3a3682c76006e6c","movie_id":9676}
{"author":"JPV852","content":"Even by remake standards, this was creatively bankrupt on top of utilizing the terrible techniques of 21st century horror with jump scares. The cast I guess tried their best but having just recently watched the original, I was mostly bored as this pretty much follows the same exact plot, scene for scene. **1.0\/5**","id":"5da25711e860170017ae2ae5","url":"https:\/\/www.themoviedb.org\/review\/5da25711e860170017ae2ae5","movie_id":806}
{"author":"CRCulver","content":"<i>To Get to Heaven...<\/i> (2006) is a film by Jamshed Usmonov set in the director's native Tajikistan. Kamal (Khurshed Golibekov) is a young man who has recently married, but he suffers from impotence and has been unable to consummate his marriage. After three months, he visits a doctor and then undertakes to learn the art of love from some older woman in the capital. The first half of the film has him stalking various women around Dushanbe. This odyssey in an American film would probably have been portrayed in a goofy underdog fashion, but Kamal's attempts are creepy, though we do feel his pain.\r\n\r\nAbout halfway through the film, Kamal ends up sleeping with the wife (Dinara Drukarova) of a thug (Maruf Pulodzoda). This lowlife finds out, he doesn't mind as he had been separated from his wife for some time anyway, and takes Kamal under his wing as they burgle their way around town. After witnessing the full extent of his partner's brutality, Kamal turns on him in a bloody fashion, which happens to cure his sexual dysfunction.\r\n\r\nAll in all, I can't recommend <i>To Get to Heaven<\/i> to general audiences. This isn't the first film I've seen by a young director that begins in one way and then transitions too suddenly into mobsters and violence. Yes, I get the Oedipal allusions and the probing of the male psyche, but the plot arc chosen for this study just screams \"immature scriptwriter\". The cinematography is also unimaginative.\r\n\r\nI could compliment only two aspects, which will probably only interest a rather niche audience. I was bound for Tajikistan in less than a week as I watched this, and there are few internationally available films from the country, so I guess <i>To Get to Heaven<\/i> was useful as a glimpse of Tajikistan. The acting by Drukarova and Pulodzoda was competent, and perhaps the same could be said for Golibekov if the character he portrays weren't too cringingly awkward to really appreciate.","id":"5b917fcec3a3687ae200583b","url":"https:\/\/www.themoviedb.org\/review\/5b917fcec3a3687ae200583b","movie_id":120393}
{"author":"John Chard","content":"I wouldn't put a lot of faith on what the captain says. I'm an architect, and these boats weren't designed to float upside down. \r\n\r\nAfter playing water games with \"The Perfect Storm\" six years previously, director Wolfgang Petersen returns to the water to reimage 1972's \"The Poseidon Adventure\" (novel by Paul Gallico). Story essentially finds a cruise liner capsized by chaotic weather and survivors try to make their way out of an upside world before the boat either sinks or the inrushing water drowns them.\r\n\r\nThe original is one of the highlights of the disaster genre that burst forth in the 1970s, so it really didn't need remaking, but Hollywood insists on remaking old films for cash cow purpose. As it is, this is hardly a terrible movie, it lacks character development, the plot is stripped bare without any additional depth, and ultimately it's the CGI effects (that do work handsomely enough and were Oscar Nominated) that carries the picture to just above average status.\r\n\r\nHardly a must see disaster film but enough excitement and suspense to make it a dent time waster for fans of the genre. 6\/10","id":"5e1b44ebd5dbc20015f204e7","url":"https:\/\/www.themoviedb.org\/review\/5e1b44ebd5dbc20015f204e7","movie_id":503}
{"author":"J4stringthang","content":"This Movie is exactly what you think it is, Although there was actually a plot. If you like Sam Jackson in Formula 51, then you should see his. The snakes CAN be a little over the top. But I found this flick to be more Comedy Thriller than Action Thriller. I gave it 2.5 stars but can be a 3 star if in the right mood.","id":"52f31ddd92514113300ad98a","url":"https:\/\/www.themoviedb.org\/review\/52f31ddd92514113300ad98a","movie_id":326}
{"author":"Gimly","content":"Better than _Snakes on a Train_.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"58e3af86c3a3684a790118f0","url":"https:\/\/www.themoviedb.org\/review\/58e3af86c3a3684a790118f0","movie_id":326}
{"author":"The Movie Diorama","content":"Paprika sprinkles its spicy originality across a sprawling vibrant fever dream. Dreams are windows to the imaginative capacity of the subconscious. Manipulating memories to fabricate worlds unbounded by the physical laws of reality. An endless wave of colours and possibilities, requiring no legitimacy for their existence. In psychology, dreams are a method for interrogating the mentality of its subject. Recurring nightmares could be a sign of stress-induced anxiety, fear or mental disorders. The late Satoshi Kon, in what was his last full feature, harnessed the concept of Tsutsui’s novel and challenged the limitations of Japanese animation once again.\r\n\r\nPaprika is the equivalent of a hallucinogenic warped mind-bending drug-induced fever dream that tests the attentive abilities of its audience. This is as “anime” as Kon’s work gets. Bashfully bonkers. Colourfully confusing. And plenty of Paprika. Whilst ‘Perfect Blue’ is his most accessible feature for adults, Paprika tends to engage itself with fans of the art form instead. That’s not a derogatory trait to have, as it allows Kon to exercise his visionary ingenuity one last time, but the narrative requires patience. A quaint approach that resembles the personality of doctor Chiba, the head scientist of a revolutionary new psychotherapy treatment creatively entitled “Dream Therapy”. But when a dream recording device is stolen, a plague of nonsensical dreams start to merge with the realms of reality. A parade of dancing frogs, strange dolls, wiggling electronic appliances, colossal Shinto gates and golden cat statues just to name a few composites of the ominous fever dream that plagues the minds of unsuspecting dreamers.\r\n\r\nInfiltrating such a cluster bomb of visual splendour would be no simple task for Chiba’s dream alter-ego Paprika, when at one point she is groped by a colleague who physically splits her fleshed shell in half (not nearly as traumatic as it sounds though...). Yet beneath the mesmerising dream-bending extravaganza is a narrative centralising on the sophisticated theme of control. Taking one’s life back. Detective Konakawa represents this exquisitely when trialling out the “DC Mini” device to treat his anxiety. The recurring nightmarish dream regarding his homicide case prevents him from being in control of his life, unable to watch films at the cinema due to past trauma in his childhood. The amalgamation of present and past within his dream perfectly illustrates the haunting abilities that our subconscious infects our mind with. From a non-scientific perspective, it’s a large reasoning for the development of mental disorders.\r\n\r\nOf course, the underdeveloped affection Chiba has for her obese child-at-heart genius colleague Tokita somewhat negates the central narrative on psychotherapy, but still focuses on the action of taking control. She finally manages her emotions during a time of distress, and that’s exactly what Paprika revolves around. The whole dream within a dream concept, which apparently was inspiration for Nolan’s epic ‘Inception’, is just a science-fiction shell that enabled Kon to express his creativity without diminishing the novel’s sense of originality. Not to mention Hirasawa’s euphoric score which inventively utilised a vocaloid name “Lola”.\r\n\r\nWill you fully understand the story on your first watch? Unlikely. Even with the occasionally clunky dialogue that explains the psychotherapy concept. This was the first anime feature film I ever watched (excluding the likes of Pokémon...), and now four watches later I finally understand every single detail of Kon’s cinematic piece of expressionistic art. It’s science-fiction at its most gentle. It’s psychology at its most cerebral. And it’s anime at its most “anime”. Satoshi Kon, you’re a legendary visionary, and always will be.","id":"5e206b3cb3316b0015037ab7","url":"https:\/\/www.themoviedb.org\/review\/5e206b3cb3316b0015037ab7","movie_id":4977}
{"author":"JPV852","content":"Beautiful movie from Guillermo del Toro and while I did like the movie and its World War II-era plot, I can't say I was totally in love, feeling this was more style over substance, though the acting from the young Ivana Baquero was really good. **4.0\/5**","id":"5d93dcbdd2b2090012123650","url":"https:\/\/www.themoviedb.org\/review\/5d93dcbdd2b2090012123650","movie_id":1417}
{"author":"Gimly","content":"Leather underwear and a cape is honestly such a Look™.\r\n\r\n_300_ cops a lot of flak for being all style and no substance, and I'm not gonna stand here and lie to you by refuting that. What I will say however, is that style over substance does not inherently make a movie bad. _300_ is a lot of fun, you get what's going on, and there's some genuine rewatch value.\r\n\r\nFinal rating:★★★½ - I really liked it. Would strongly recommend you give it your time.","id":"5bb5c44b0e0a263397009bf8","url":"https:\/\/www.themoviedb.org\/review\/5bb5c44b0e0a263397009bf8","movie_id":1271}
{"author":"CRCulver","content":"<i>300<\/i>, the 2007 story of the three hundred Spartans who held off a massive Persian offensive in Ancient Greece, proved a disappointing film. In spite of my Classics degree, I won't complain about the divergences from recorded fact. The film is clearly meant to be a fantasy on historical themes instead of a faithful account of the event. Rather, what irked me was the hammy dialogue. There were the tropes of recent Hollywood battle scenes: warriors on the good guys' side defending themselves with little exertion as they trade silly quips about how they've got each other's backs. A queen gives an address to a council that is all melodrama -- are we back in George Lucas' \"Star Wars\" prequels?\r\n\r\nHaving enjoyed <i>Sin City<\/i>, a film with a similar green screen approach, I thought that <i>300<\/i> would be enjoyable on the basis of its special effects, but alas it wasn't. For one, the cinematography is claustrophobic. All outdoor scenes but one were filmed with a green screen, and the digital backdrops add no depth. Even when supposedly standing on the Greek coast under a big sky, everyone seems like they are just standing around in a fairly small room. Also, the fight scenes seem more primitive than considering that this film followed years after <i>The Matrix Reloaded<\/i>.\r\n\r\nThe little I can recommend <i>300<\/i> for is the variety of demonic monsters and exotic costumed assassins that fill the Persian army. As I said, this is a fantasy on historical themes, and the additions are often interesting. Still, I had a hard time sitting through the whole film.","id":"5b948b0dc3a368567c0172e3","url":"https:\/\/www.themoviedb.org\/review\/5b948b0dc3a368567c0172e3","movie_id":1271}
{"author":"Wuchak","content":"***The Passion of the Christ, I mean Superman***\r\n\r\nSuperman returns to Earth after five years trying to find out what happened to his homeworld. As Clark Kent he gets his job back at the Daily Planet newspaper, but finds out Lois Lane has moved on without him -- having a live-in fiancé and a five-year-old child, not to mention winning a Pulitzer for her article \"Why the World Doesn't Need Superman.\" Meanwhile Lex Luthor and his henchmen discover Superman's Fortress of Solitude and steal some of the alien crystals. Luthor's mad scheme is to create a new continent, killing billions of people in the process.\r\n\r\nThe story is a superhero retelling of the Christ story:\r\n\r\n- Jor-el gives his only son to protect (save) humankind. \r\n- Superman repeatedly states that he's everywhere and will always be around (i.e. omnipresent). \r\n- Luthor and his henchmen's beating of Supes is reminiscent of Christ's beating before his crucifixion. \r\n- Superman sacrifices himself to save humanity from Luthor's new continent. \r\n- When superman \"dies\" above the atmosphere of Earth he is shown in a cross posture.\r\n\r\nMeanwhile Lois Lane is an obvious type of atheism. Although she once believed in and even loved Superman, she's now convinced the world doesn't really need him. She's obviously unhappy and bitter; she lacks the pizazz she had when she once believed.\r\n\r\nOf course, all this heavy symbolism is useless if the story itself fails to capture the viewer's attention. This is especially vital when the picture runs 2 hours and 34 minutes. \r\n\r\nThe film definitely has an epic vibe to it, even more so than the first in the series. It seems more serious, i.e. less campy, especially where Luthor and his team are concerned. The film also possesses an imperceptible reverent quality. Even though the whole Superman mythos is totally absurd, the film somehow enables the viewer to accept it as real. On top of all this there are numerous humorous bits, which are laugh-out-loud funny (watch out for the hilarious \"It's a bird,\" \"It's a plane\" piece).\r\n\r\nOther things worth commenting on:\r\n\r\n- Some complain that Kate Bosworth lacks charisma as Lois Lane, but this all fits into the bitter \"I no longer believe\" subplot. Bosworth is fine in the role. \r\n- Some complain about Superman's 5-year visit to Krypton. What's the problem? Part of my youth was spent in Minneapolis and I've gone back there numerous times to quell my curiosity. Why wouldn't Superman feel the same way? Why was he gone so long and why did he need a crystalized craft? Because he was potentially exposing himself to large amounts of Kryptonite (radioactive pieces of his homeworld) which would severely weaken him, not to mention he gets his powers from the Earth's sun. \r\n- Some complain about Lois' fiancé and her son, the latter of whom may or may not be the offspring of Supes. Wouldn't it be natural for Lois to move on after about two years waiting? Her \"shacking up\" before marriage can be attributed to her new \"I no longer believe\" mentality. \r\n- Love is a strong theme here as is fitting for any retelling of the Christ story. Superman loves Lois and vice versa, even though Lois is initially in denial. Love gives life and saves from death. \r\n- I liked the fact that Lois' fiancé, Richard (Marsden), isn't made out to be a villain. Interestingly, Lois picked a man who, as a pilot, could fly her around like Supes, albeit less spectacularly. I also like the fact that the film shows Lois being faithful to Richard even though she discovers she still loves Superman. The human heart is capable of loving more than one person, but can only be faithful or committed to one, if you know what I mean. \r\n- Frank Langella is his usual charismatic self as Perry White. \r\n- Kevin Spacey is excellent as Luthor and arguably superior to Hackman; this is especially evident as the story progresses. His larger-than-life lunatic scheme is truly fitting for Supe's main foe. \r\n- There are numerous dramatic parts where the film takes its time to tell the story; there's obviously no rush to get to the next CGI action scene. Those with ADD beware. Needless to say, this is a film for adults even though kids will enjoy many aspects. \r\n- \"Superman Returns\" was one of the most expensive films ever made at $209 million but made most of it back in North America ($200 million) while almost doubling it worldwide ($392 million). What's strange is studio heads were disappointed with these numbers, claiming it should have made $500 million.\r\n\r\nBOTTOM LINE: I was surprised to discover how good \"Superman Returns\" is. This is an epic and moving superhero film; sci-fi\/fantasy at its best. Is it as good or better than the best superhero films? Not only is it as good, it's deeper.\r\n\r\nGRADE: A-","id":"5e4771a91e9225001dbf0fa7","url":"https:\/\/www.themoviedb.org\/review\/5e4771a91e9225001dbf0fa7","movie_id":1452}
{"author":"John Chard","content":"The light to show the way. \r\n\r\nAfter a five year hiatus, Superman returns to Earth to find that Lois Lane is now a soon to be married mother, but some things don't change, loony Lex Luthor is loose and his latest plan will kill billions of people.\r\n\r\nI first reviewed Superman Returns some two years after its initial release, I had first caught it on release back in 2006 and was really taken with Bryan Singer's approach to a subject he clearly loves. I was awash with nostalgic fervour back then and the moment the theme tune kicked in (great move by Singer to use the John Williams original) I was grinning like a Cheshire cat, yet it seemed I was in a minority back then as regards the film's worth, and with each passing year I find I still am.\r\n\r\nSuperman Returns will forever be known as the franchise entry that has too much heart, because it finds Singer giving Superman emotional fortitude and, crucially, making it the heart of the story. Those that purely wanted a big colourful popcorn explosion will forever be unfulfilled it seems. Yet it has to be said that fans of Singer's work (such as I) totally get the emotionally heavy approach he has taken, watching Superman shred himself after learning of Lois' love for another, makes for compulsive viewing. Because our man of steel is conflicted, not only with his sense of protective being, but also in the rigours of love, it's this conflict of Superman that drives the film on. Not to say that there isn't any action here, though, in fact some of the sequences here are truly exhilarating. Oh yes, the popcorn crowd are well catered for, planes, space shuttles and a tension filled helicopter, all figure in and around Superman and Luthor's world.\r\n\r\nBrandon Routh dons the cape worn so brilliantly by Christopher Reeve in the 70s, and smartly Routh takes the route of \"if it isn't broke then don't fix it\", there's no need to put ones own stamp on a character already so well defined and well loved. Looking like Reeve, and playing out uncannily like him, Routh studied Reeve's performances to get as close to the Reeve incarnation as he could, and he gets it down pat whilst adding a bit of brooding honesty into the mix. Kate Bosworth gets to be Lois Lane, it's a very solid and controlled performance that would have seen her as a shoe in for the role again if Singer had of taken the reins for a sequel. Taking up the role of Lex Luthor, and clearly having a great time, is Kevin Spacey, this is a more clever Luthor incarnation, it's spiteful and devoid of campery. While along for the ride as Luthor's moll is Parker Posey, she's sparky with a hint of devilish sexiness.\r\n\r\nBryan Singer reinvigorated the Superman franchise, and in doing so brought a new verve to the characterisation of an American icon. It has proved to be divisive amongst the fans and critics alike, so much so that Singer has left the Superman world. But viewing it even now brings many rewards, it is a damn fine Superman movie. You can never have too much heart at your film's core, that is as long as one remembers what made prior efforts work in the first place, Singer did to my mind fuse both very admirably indeed. 8\/10","id":"5e94e84f66a7c30016036557","url":"https:\/\/www.themoviedb.org\/review\/5e94e84f66a7c30016036557","movie_id":1452}
{"author":"Andres Gomez","content":"A fresh idea that, however, becomes a bit of a boring movie.\r\n\r\nThe best part is the good performances by the cast. Specially surprising is Ferrell.","id":"5804e52ec3a36868520001c1","url":"https:\/\/www.themoviedb.org\/review\/5804e52ec3a36868520001c1","movie_id":1262}
{"author":"John Chard","content":"Sometimes it's not about knowing the right answer.\r\n\r\nStarter for 10 is directed by Tom Vaughan and adapted to screenplay by David Nicholls from his own novel of the same name. It stars James McAvoy, Alice Eve, Rebecca Hall, Dominic Cooper, Benedict Cumberbatch, Catherine Tate and Elaine Tan. Music is by Blake Neely and cinematography by Ashley Rowe.\r\n\r\nSet in 1985 England, working-class student Brian Jackson (McAvoy) navigates his first year at Bristol University - which lends him the opportunity to feature on his favourite ever TV Quiz Show - University Challenge.\r\n\r\nI have never read the book so have no frame of reference there, thus the complaints from devotees of the written source are null and void to me. For I absolutely loved this film, a fresh and breezy coming of age comedy that's tinted with dramatic intelligence. How nice to have a pic of this genre ilk that's not built around trying to lose one's virginity, or standing up to bullies etc. For sure there's a whole load of angst on show, a bit of class distinction dichotomy, the perils of formative fumbling romances, and of course whimsy. Yet the framework of education, the thirst for knowledge and an understanding of the problems evident in the world at time of pic's setting, all make this a smarter than your average bear British rites of passage piece.\r\n\r\nCast are on splendid form to make the multidimensional characters work (each main character moves away from being mere caricatures). McAvoy is splendidly affable as Brian, who is still nursing the loss of his father years previously, and then has to watch as his mother (Tate) takes a lover - the local ice-cream man (John Henshaw). It's no easier at University, where he lusts after the blonde bomber (Eve) when in fact he obviously should cop on to the fact that the girl for him is bleeding heart socialist Rebecca Epstein (Hall) - but she isn't the quiz type! McAvoy has a good comedy way about him, gawkish but lovable and perfect when portraying Brian out of his depth in certain scenarios.\r\n\r\nOf the others it's Cumberbatch who steals the show as Patrick Watts, an absolute toff, an upper class twit who has no comprehension of the working class system and the perils within that structure. He is burned by his miserable failure on University Challenge the previous year, his inadequacies and stubborness blinding him to the benefits that others around him can afford him. The facial expressions, the posh vocab speak and the need to be in charge are brought vividly to comic life by Cumberbatch. Eve smoulders as Alice, but deftly plays her vulnerabilities, Hall has her character down pat, while Cooper, Tate and James Corden leave favourable marks. As do Charles Dance and Lindsay Duncan in unforgettable scenes as Alice's parents.\r\n\r\nThe whole play is covered over with an 80s soundtrack, mixing student favourites with punky pop tunes, while the period detail for Brian's home life prior to going to University (Southend-On-Sea) has been given great nostalgic thought. A lot of the humour is sure to be too British for none UK folk, more so those not familiar with what the mid 1980s were like in Britain, while it has to be acknowledged that where the story ends up holds no surprises. Yet this holds many pleasures for the right audience, so fingers on the button and see if you get this starter for 10.","id":"5cb2445ec3a3683c20ae85b3","url":"https:\/\/www.themoviedb.org\/review\/5cb2445ec3a3683c20ae85b3","movie_id":14055}
{"author":"portnoyz","content":"Standard horror genre fare. Not terrible, not great.","id":"5c54fca00e0a26567ac6230c","url":"https:\/\/www.themoviedb.org\/review\/5c54fca00e0a26567ac6230c","movie_id":10069}
{"author":"CRCulver","content":"HIPPIE MASALA: Forever in India is a documentary film by Ulrich Grossenbacher and Damaris Lüthi about six people who went on the overland trail to India in the late 1960s\/early 1970s and decided to stay. Cesare from Italy became a sadhu (a religious beggar) and spends his days chanting in the company of his Indian peers. Meera from Belgium did the same, though as a woman her experience has been quite different. Hanspeter from Switzerland settled down the Himalayas, maintaining a dairy farm and going hunting and fishing. Robert from Holland got into trouble as a youth running away from home and selling drugs, but once he made it to India he established a career as a painter. Finally, Erica and Gillian are South African twins who now design clothes in Goa, though we mostly view these two lushes enjoying their drinks.\r\n\r\nThe film has a number of interesting moments. Hanspeter and Robert have Indian wives, and the documentary discusses in some detail the cultural clashes of marrying a local. Some of the subjects speak of conflicts with their family that led them to leave Europe.\r\n\r\nHowever, what stops this from being a great documentary, at least in my opinion, is that it gives very little information on the years between the overland trail and wherever they are now, especially their changing attitudes to the counterculture of 40 years ago. Hanspeter, for example, complains about people seeking a good time in India and says \"Couldn't you have a techno party in Switzerland instead of coming here?\" but we don't get a deeper glimpse into how his feelings have changed. Furthermore, anyone looking for more trivia on the overland trail will be disappointed. The first couple of minutes of the film show some fascinating footage of e.g. the Pie Shop in Istanbul and roads in Afghanistan (I'd love to know where these came from), but none of the interview subjects go into detail on this great migration.\r\n\r\nUltimately this documentary will appeal mostly to those interested in how foreigners adapt to Indian society and how they are accepted by the local people around them. The fact that these are hippies who came on the great overland trail four decades ago is pretty irrelevant -- the same sort of documentary could be made about people who arrived on a jet plane in the 1980s or 1990s.","id":"5b8c7036c3a36851fd041662","url":"https:\/\/www.themoviedb.org\/review\/5b8c7036c3a36851fd041662","movie_id":34630}
{"author":"Gimly","content":"Pretty good fun given the incredibly limited resources _Devil's Den_ has to work with. But you have to watch it through that incredibly narrow, generous lens, or else the fact that it's really bad might start to get to you.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5b14f4ddc3a3685349008254","url":"https:\/\/www.themoviedb.org\/review\/5b14f4ddc3a3685349008254","movie_id":28640}
{"author":"Wuchak","content":"***Denzel Washington tries to deter a terrorist attack upon looking back in time***\r\n\r\nAfter a terrorist explosion of a ferry in New Orleans, an ATF agent (Denzel Washington) joins an experimental FBI surveillance unit that uses space-folding technology to find the culprit and maybe even avert the disaster. While looking in the past he starts to fall for a notable victim of the tragedy (Paula Patton). Val Kilmer plays the head FBI agent and Jim Caviezel the antagonist. Adam Goldberg is on hand as a tech geek.\r\n\r\nWhile watching \"Deja Vu\" (2006) I couldn’t help thinking of “Enemy of the State” (1998) because of the kinetic editing and advanced surveillance technology. Turns out they were made by the same director, Tony Scott, Ridley Scott’s brother, who unfortunately jumped off a bridge in Los Angeles in 2012, ending his life at 68 years-old. (Ridley claimed it was due to his secret struggles with cancer while others say it was due to two antidepressants known to cause suicidal thoughts or paranoid ideation). \r\n\r\n“Deja Vu” is good, especially the compelling last act. Although it may not be as great as “Enemy of the State,” the filmmaking expertise is off the charts, particularly in regards to the depictions of surveillance technology. It’s mind-boggling to think of the effort that was put into making everything gel and dynamically move along without confusing the viewer. However, it admittedly does get a little convoluted in the second act with the experimental observation equipment, which culminates with a thrilling-but-highly-unbelievable past\/present car-chase sequence.      \r\n\r\nAnother problem, a minor one, is the revelation of the terrorist, which brings to mind someone like the infamous Timothy McVeigh. Never mind that 99% of the terrorist attacks the world over are by radical Islamists (e.g. 9\/11, Orlando, San Bernardino, Chattanooga, Fort Hood, Boston Marathon, Paris, Nice, etc.). Shh, don’t tell anyone.    \r\n\r\nThe film runs 2 hours, 6 minutes and was shot in New Orleans.\r\n\r\nGRADE: B","id":"5cd07987c3a368472dd9a796","url":"https:\/\/www.themoviedb.org\/review\/5cd07987c3a368472dd9a796","movie_id":7551}
{"author":"Splinter","content":"For anyone interested in the story of Donald Crowhurst and his fateful voyage in the Golden Globe round the world sailing challenge of 1968, this is a must see.\r\nWith circumstances conspiring to force him into rash decisions and, ultimately the final confrontation with his truth, this detailed and sometimes heart wrenching documentary shows interviews with some of his family, protagonists in the quest as well as original film and audio footage of Mr Crowhurst before and during his perilous journey into the South Atlantic and beyond.\r\nA couple of years ago I visited Rio Salado in Argentina and spoke with some of the prefectura coast guard and indeed one of the officers who met the man is still around.\r\nThis is one of those documentaries that will pull you in and remain with you for much longer than its duration, such is its impact.","id":"5b1537a59251417891008e2a","url":"https:\/\/www.themoviedb.org\/review\/5b1537a59251417891008e2a","movie_id":15030}
{"author":"CRCulver","content":"Although the two countries are located very far away from each other, there is a special link between Finland and Japan. After living in Finland for a few years, I have come to think of the Finns as the \"Japanese of Europe\" for their culture that seems alien to the rest of the West, a very reserved and homogeneous society that foreigners find nearly impossible to enter. In Japan, Finnish exports like the designers Ittala and Marimekko and the Moomins children's books have proved huge successes. The Japanese film KAMOME DINER celebrates this kinship by offering native audiences a fish-out-of-water film about Japanese women in Helsinki, but on universal themes that could appeal to viewers in Finland and beyond. The film is director Naoko Ogigami's adaptation of a novel by Yôko Mure.\r\n\r\nAs the film opens, we meet Sachie (Satomi Kobayashi), who has inexplicably decided to move from Japan to Finland and open a bare-bones eatery. That she has decided to serve rice balls (onigiri), a Japanese dish virtually unknown to the rest of the world, instead of the usual sushi or tempura only makes the premise all the more absurdist. After a month, she finally gets her first customer, but it is only a local fan of Japanese culture (Jarkko Niemi) who, by long tradition, gets his coffee for free everyday since he was its first patron, and he never brings any friends. When she meets with Midori (Hairi Katagiri), a Japanese woman who has just arrived in Finland and seems lost in life, Sachie decides to bring her on at the diner. They make an odd couple, these two, as as Sachie is petite and self-confident, while Midori is tall (gigantism tall) and awkward. Nevertheless, they gradually turn their restaurant into a success while discovering something of the Finnish society around them.\r\n\r\nAny filmmaker taking on the subject of Finland is likely to pay homage to Aki Kaurismäki, Finland's most prominent filmmaker. Certainly the design of the diner, with its austerity, bleached pastel tones, and old-time decor is a typically Kaurismäkian touch. Some of the dry humor is also comparable to the the Finnish auteur, and a minor character is played by Markku Pelota, part of Kaurismäki stable. However, mainly this film lacks the bleakness or bitterness of Kaurismäki's work, and has a more straightforwardly heartwarming and cute ambiance.\r\n\r\nAs a Helsinki resident who knows the quirks of the culture and can recognize all of the shooting locations, I found this an occasionally amusing film, something worthwhile. However, it doesn't feel very deep, and it may be that its themes of female solidarity will prove accessible mainly to female viewers (author Yôko Mure has a mainly female readership in Japan). There is also the frustration that, in spite of the film's attempt to attract a female audience as well, some aspects of it must be based in references to Japanese culture that foreigners won't understand. For example, is Jarkko Niemi's character being lampooned as a typical Western \"wapanese\", or is the tension between him and Midori based on some other factor?","id":"5b1606d90e0a262dd0012567","url":"https:\/\/www.themoviedb.org\/review\/5b1606d90e0a262dd0012567","movie_id":25657}
{"author":"Steve Butterworth","content":"I loved this movie.  The beautiful Anna Wilding captures the essence of joy with effortless flair.  Beautifully filmed, one walks away from Buddha Wild with vivid, memorable images etched in their mind.  I have actually watched this film, end to end, four times.  Each time, I come away with little details I didn't catch before.  A great introduction for anyone first discovering Asian cultures, and equally satisfying for those well versed in Buddhism.  It plays brilliantly on the big screen, but is also compelling on DVD.","id":"58f417e4c3a3680835019ea8","url":"https:\/\/www.themoviedb.org\/review\/58f417e4c3a3680835019ea8","movie_id":274175}
{"author":"Gimly","content":"If you make a film called _Big Nothing_ you really have to offer something interesting, otherwise you're just opening up yourself to that really easy joke. For Simon Pegg completionists only.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5a8399d29251410b4d001d6a","url":"https:\/\/www.themoviedb.org\/review\/5a8399d29251410b4d001d6a","movie_id":9843}
{"author":"Wuchak","content":"***Ranks with the best werewolf movies***  \r\n\r\n\"Big Bad Wolf\" (2006) begins with a group of college teens going out to a desolate cabin to party. The bulk of the group is unlikable frat trash and the film goes over-the-top with the gore, nudity and naughtiness as a werewolf attacks. There's also a semi-campy edge that prevents the viewer from taking the material seriously; as such, it's thrilling, but not really scary.\r\n\r\nThe cabin angle of the story, however, ends by the close of the first act. The typical horror flick would use this for the entire plot (e.g. “Evil Dead”). I was wondering where they were going to go from here?\r\n\r\nDespite the above negatives and the cartoonish CGI of the eventual transformation scene, everything comes together for an excellent werewolf flick. It all makes sense if you stick with it. Sam (the mechanic girl) comes off too-gruff at first, and it's a turn-off, but then it becomes clear that she was just able to see through the fakeness and superficiality of the frat trash and refused to take their sheet. Derek's the likable protagonist who's uncertain, but rises to the challenge when necessary. I found myself caring about these two and their potential relationship as the story progressed.\r\n\r\nWhereas \"Big Bad Wolf\" shares similarities to \"Fright Night” (1985), \"Never Cry Werewolf\" (2008) rips it off wholesale, just substituting a werewolf for a vampire (still, “Never Cry Werewolf” is a worthy werewolf flick).\r\n\r\nWhat impressed me with \"Fright Night\" was the hideousness and wickedness of the vampire; \"Big Bad Wolf\" does the same thing with the werewolf, but ups the ante. The werewolf retains the intelligence of the man to a large degree, which is an interesting addition to werewolf lore, although I’m sure it’s been done before. Even more, they give dimension to the man who's infected by the werewolf curse. Good writing and attention to detail propels \"Big Bad Wolf\" to the head of the pack.\r\n\r\nThere's a rockin' soundtrack with an excellent cut that plays during the end credits, \"Shelter\" by Green Vinyl Dream.\r\n\r\nThis is a hard R-rated film with some very crude moments, mainly because the werewolf is thoroughly evil and some of the youths are frat trash, but if you can look beneath its gruff exterior it's got a good heart.\r\n\r\nThe film was shot in Semi Valley and Los Angeles, California, and runs 95 minutes.\r\n\r\nGRADE: A-","id":"5be1fdf10e0a2614ac004355","url":"https:\/\/www.themoviedb.org\/review\/5be1fdf10e0a2614ac004355","movie_id":39341}
{"author":"Wuchak","content":"***Melancholy, drama, romance, ghosts and thrills on the secluded British coast***\r\n\r\nAfter the death of her son and impending divorce, a successful writer (Demi Moore) moves to a cottage on the remote Scottish coast where strange, sometimes ghostly things start happening as she develops a relationship with the handsome lighthouse attendant (Hans Matheson). Henry Ian Cusick plays her husband, a failed writer, while Kate Isitt plays her close friend from London. Other important characters include a woman with second sight and the constable of the village.\r\n\r\nAs you can probably tell, “Half Light” (2006) is a drama\/mystery with ghostly elements and even some thrills in the last act. I wouldn’t call it horror. It’s not far removed from films like “Dark Water” (2005), “The Wicker Man” (1973\/2006), “The Fog” (1980\/2005), “The Haunting of Seacliff Inn” (1994), “The Sixth Sense” (1999) and “Loch Ness” (1996). If you liked those movies you’ll probably like this one. It features a haunting ambiance combined with magnificent British coastal locations.\r\n\r\nEarly on there are a couple of predictable clichés, like a creepy event that turns out to be a nightmare, which itself is a nightmare, but this only happens once. At the midpoint there’s a twist that I didn’t see coming and another Hollywoodized one in the last act. Despite the magnificent locations, the first half is lugubrious and mundane with slow drama that pretty much morphs into a romance novel, but everything perks up with the twist in the middle.  From there to the end it’s quite compelling.\r\n\r\nSome viewers have complained about the unlikely conspiracy of the last act, as well as it containing too many uncertain variables. But it makes sense when you factor in the great success of a certain person and the “little foxes” of envy, bitterness and greed, not to mention other things that I can’t share without spoiling. As for the “variables,” they can be easily explained away when you consider the fluidness of the root scheme. It might be Hollywoodish, but Forensic Files shows that these kinds of diabolic trickeries aren’t as unlikely as we might think.\r\n\r\nThe movie runs 1 hour, 50 minutes and was in Wales and England (Cromwell & London), none of it in Scotland.\r\n\r\nGRADE: B","id":"5cbcb53a0e0a2654e9ed6438","url":"https:\/\/www.themoviedb.org\/review\/5cbcb53a0e0a2654e9ed6438","movie_id":9756}
{"author":"John Chard","content":"The Yoof of today eh!\r\n\r\n \r\n\r\nBritain’s answer to Larry Clark’s Kids, Kidulthood works hard for realism and shock value but falls somewhere in between. Story focuses on a group of London youngsters who have been given the day off school when one of their classmates commits suicide after being bullied. The various groups of friends spin off to do their own thing, which invariably involves drugs, violence, casual sex, teenage pregnancy angst, revenge and lots of cussing in street speak. All this is crammed into a 24 hour period, suggesting that the yoof of today never live a dull moment when not at school.\r\n\r\n \r\n\r\nWriter Noel Clarke (who also stars) and director Menhaj Huda clearly want to keep things raw and authentic, but it eventually comes off as wholly unbelievable. In fact it at times feels like it’s a bunch of mates making a film and living out some fantasies where they get to be wicked for a day. There’s some messages in the mix trying to break out of the hysteria, to be a wake-up call to parents and elders as to what is happening under our noses, but ultimately sensationalism wins the day.\r\n\r\nIt’s a film strung together by a number of instances, characterisation and reasoning is given short shrift, the makers over egging the pudding in their unrelenting mission to shock. Some scenes are undeniably attention grabbing, while the soundtrack pulses away with verve and Brian Tufano’s cinematography is right on the money, but come the preachy finale you may feel you really haven’t learned anything new about the unruly and unfeeling kids of today. 6\/10","id":"52de44e3760ee30ae600e4a4","url":"https:\/\/www.themoviedb.org\/review\/52de44e3760ee30ae600e4a4","movie_id":13185}
{"author":"kwoonhei","content":"The perfect movie to watch alone at midnight. I gave 9 because sometimes the ghost looks too pretty to scare me but that's my taste.  It have a rustic mood but at the same time have some great visuals and photography.","id":"5067ec93760ee33ea0000551","url":"https:\/\/www.themoviedb.org\/review\/5067ec93760ee33ea0000551","movie_id":33794}
{"author":"Per Gunnar Jonsson","content":"An Awful Lie would be a better title. The BS spewed out by Al Gore has been debunked numerous of times. His campaign was a \"I lost the campaign for presidency so now I have to find some way of getting people to notice me\". News flash: You lost the presidency because your politics sucks and so does you green preaching!","id":"59a00d8a92514177a7010728","url":"https:\/\/www.themoviedb.org\/review\/59a00d8a92514177a7010728","movie_id":1781}
{"author":"wlharman","content":"This documentary about Gore and his presentation are as relevant now as when this was shot. We continue to pump CO2 into our atmosphere even as a majority of Americans have come around on the facts of global warming. Gore takes the optimistic position in \"An Inconvenient Truth,\" but today we see that it is not \"political will\" that holds us back but the will of a few powerful, monied interests. In America science must bow to money, even when the future of our wellbeing is on the line. I think the average billionaire would rather be rich than healthy, rather make money than have a gorgeous Earth to live on.\r\n\r\nThe second lesson, ten years later, is that elections matter. George W. Bush and Donald Trump, the great presidential mistakes of the 21st Century, have dropped a ball that Al Gore and Hillary Clinton would have caught handily. Imagine where we would be with consistent, pro-environmental leadership for the last 20 years. \"An Inconvenient Truth\" isn't just a lesson in climate change. It shows the importance of our election in American later this year.","id":"5eb6465dfd7aa4001c5c19f3","url":"https:\/\/www.themoviedb.org\/review\/5eb6465dfd7aa4001c5c19f3","movie_id":1781}
{"author":"Wuchak","content":"***Americans volunteers become fighter pilots in France during WW1***  \r\n\r\nBefore the USA enters WW1, a young Texas cowboy (James Franco) joins the Lafayette Escadrille in France, a squadron of American fighter pilots. The volunteers are trained and soon experience the glory, anxieties and horrors that go with air combat.  \r\n\r\n“Flyboys\" (2006) was inspired by real events and comes in the tradition of similar WW1 aviation flicks “The Blue Max” (1966) and “Aces High\" (1976). Whilst not great like the exceptional “Blue Max,” the blockbuster-ish “Flyboys” is more compelling than the mundane “Aces High,” albeit a little marred by comic book storytelling (think “Legends of the Fall”). It’s also significantly superior to the curiously unabsorbing “The Red Baron” (2008). \r\n\r\nThe movie’s ambitious and nigh epic, but there are some contrived, unconvincing moments. For instance, the “German spy” part could’ve been cut with no harm done, not to mention make for a more streamlined viewing experience. Yet I’m glad that the film’s not as one-dimensional as the realistic “Aces High” (which, don’t get me wrong, is a quality WW1 fighter pilot flick). For instance, “Flyboys” throws in a good trench sequence involving ‘No Man’s Land’ that LOOKS convincing; too bad it’s not believable at all (the way so-and-so easily saves so-and-so). \r\n\r\nEugene Skinner, the black pilot, was based on the real-life Eugene Jacques Bullard (the filmmakers just changed the surname). In real life Eugene hoped to join the Lafayette Escadrille, but they stopped receiving applicants by the summer of 1916 after accepting 38 American pilots. So, a few months later, Eugene joined the Lafayette Flying Corps on November 15, 1916.\r\n\r\nAs far as strafing downed aviators goes, it was considered dishonorable, but the movie suggests that a minority of ignoble pilots did so, which is reasonable.  In the film an ignoble German pilot strafes & kills an American, which is what later spurs an honorable German pilot to make amends in a pretty powerful scene. \r\n\r\nThe film runs 2 hours, 20 minutes, and was shot in England (Buckinghamshire, Essex, Bedfordshire & Somerset House, Strand, London, with studio work done in Hertfordshire). PS: The lion, Whisky, was a real mascot for the squad, along with another named Soda.\r\n\r\nGRADE: B\/B+","id":"5de18acb3faba0001308f612","url":"https:\/\/www.themoviedb.org\/review\/5de18acb3faba0001308f612","movie_id":9664}
{"author":"Shreyance Parakh","content":"**Thought provoking piece of art !!**\r\n\r\n**CHILDREN OF MEN**....How a baby's cry can make the whole world stop, the bullets stop flying in a war, people forget all their pain, the only thing that matters is how to make that precious gift of god smile again..The movie depicts it beautifully! When the world is falling apart, coming to its end, how a THEO does things that he otherwise would have not done for anything or anybody else...It doesn't seems practical that how at every point of time there is somebody to see them sail through, but that is all LIFE is about...HOPE...There's a THEO in everyone of us...It's in our hands...to choose, THEO or Luke...The world will surely end someday but till then we must all protect the CHILDREN OF MEN, protect the world...Do our bit for the mother earth..!!\r\n\r\n**P.S. - loved the laughter of the babies in the end!!**\r\n\r\nScenes I LOVED - \r\n\r\n1. When Julian was shot.\r\n2. When Theo thought Jasper was dead.\r\n3. When Dylan was born.\r\n4. When Theo said to Luke \"It's a GIRL\"\r\n5. When Marichka expressed she isn't coming.\r\n\r\n\r\nThere may be more, but these are all I remembered.\r\n\r\nMichael Caine was adorable as always, Julianne Moore was pretty, Clive Owen was perfect, Kee was sweet, Miriam was, don't know, clean...at heart !","id":"590b2be89251414fa8014a96","url":"https:\/\/www.themoviedb.org\/review\/590b2be89251414fa8014a96","movie_id":9693}
{"author":"Joe","content":"This is a lovely film :) Julia Roberts is lovely as the eponymous character, Dakota Fanning is a delightful Fern, and Dominic Scott Kay is an adorable Wilbur- if you see the special features, he does come across as quite a shy little boy\r\n\r\nLovely film :) <3","id":"58ebb44c925141351f04e15b","url":"https:\/\/www.themoviedb.org\/review\/58ebb44c925141351f04e15b","movie_id":9986}
{"author":"talisencrw","content":"Cuaron's masterpiece so far (including Gravity, which was gravely miscast). This film is: a) easily the best film of the decade of the 2000's; b) the finest dystopia film since 'A Clockwork Orange' and probably the best sci-fi since '2001: A Space Odyssey'; and c) all the evidence you need that Clive Owen should have been selected as James Bond in place of Daniel Craig. Heartily recommended to anyone interested in how great both science fiction and cinema can possibly be. You may be depressed with the state of both the world and mankind, after watching it, but you won't be disappointed in the possibilities of cinema.","id":"570885ea9251417216000184","url":"https:\/\/www.themoviedb.org\/review\/570885ea9251417216000184","movie_id":9693}
{"author":"lkredhat","content":"A strong premise and great cast prompted my interest, but the movie falls short of its promise. Clive Owens gives a great performance and a few of the scenes are remarkably memorable and resonant. However, there are very long stretches where the movie simply stagnates and the plot drifts away, especially towards the end. Overall, it's rather melancholy and despite the \"action\" scenes, not especially thrilling. If you like sci-fi movies set in dystopian futures, or are a big Clive Owen fan, you may still find it worth watching despite its flaws.\r\n\r\nAn aside: One of the \"extras\" on the DVD has some heavily accented academic trilling at length about the movie's philosophical meaning. It's entertainingly over-the-top and almost unintelligible: jargon piled into a Dagwood sandwich of contradictory abstractions. Anyway, if you don't watch too much of it, its good for a laugh.","id":"56d2da85c3a3681e5000db59","url":"https:\/\/www.themoviedb.org\/review\/56d2da85c3a3681e5000db59","movie_id":9693}
{"author":"krismdb","content":"i liked Daniel Craig more as the right bond with action, charm, cunning all in one","id":"5e939ff38e87020016ccd75c","url":"https:\/\/www.themoviedb.org\/review\/5e939ff38e87020016ccd75c","movie_id":36557}
{"author":"John Chard","content":"Arrogance and self-awareness seldom go hand in hand.\r\n\r\nCasino Royale is directed by Martin Campbell and adapted by Neil Purvis, Robert Wade & Paul Haggis from a story written by Ian Fleming. It stars Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright & Giancarlo Giannini. It's the 21st film in the James Bond franchise.\r\n\r\nPlot finds Craig as Bond, newly promoted to 00 status, he is thrust into the murky world of high financed terrorism.\r\n\r\nOne of the hardest series of films to get right, with some of the most committed of fans, is that of the James Bond series. To wit, there will never ever be a Bond film that will appease every fan across the board. The complaints will range from not enough gadgets, too far removed from Fleming's essence, not serious enough and vice a versa: too darn serious. Then there is the usual round of arguments concerning the leading man stepping into the tuxedo, for every Bond fan ready to fight to the death in the name of Sean Connery, I'll find you another prepared to back Timothy Dalton's take on the Martini swigging legend. Once it became clear that Pierce Brosnan had run his course as Bond, bowing out with the super silly Die Another Day in 2002, the pressure for any new Bond, both the actor and the makers, was immense. 2006 and time had moved on, and we live in different cinema times, spy movies are a different breed to what went before, The Bourne Identity had raised the bar. The news filtered thru that Bond was to be rebooted and that Daniel Craig was the man to be Bond. The howls of derision could be heard from as far as the tropical locations so in keeping with a James Bond plot. Too Blonde, too craggy faced, not tall enough, and why reboot a much loved franchise anyway? It was war and the heat was turned up to full.\r\n\r\nCasino Royale still has its critics, but as majorities go as regards a Bond film, this one has the biggest sway. Sure, the Daniel Craig haters will not be bowed, they can't after all lose face after such a vitriolic campaign against his casting, but few, I suspect, can seriously deny Casino Royale is not a magnificent Bond movie. Just a peak at the Worldwide box office figures shows you how well received it was, making nearly $600 million, those are figures that do not lie. The truth is that Casino Royale has almost everything you could wish for from a Bond movie, and a little more. Gorgeous locations, beautiful women and reams of action; where, the stunt department reach new heights. It's also refreshingly in keeping with Fleming's original story, only major difference here is that the makers have upgraded it to a post 9\/11 world. There's nods to traditional franchise staples, whilst also neatly streamlining some of the previous film's comedy scene fillers. Smart villain too, Mads Mikkelsen's Le Chiffre, complete with creepy eye issue and loyal girlfriend, is a villain not trying to blow up the world because he's mad, but trying to outwit Bond to stay alive! That's great stuff that keeps a Bond thriller alive and well.\r\n\r\nBut for all the energy and pyrotechnics (there's enough in this one film to have filled half a dozen of previous Bond entries), a Bond film can only succeed if the leading man is up to scratch. Thankfully, and joyously, Craig nails it, both in physicality, swagger and raw egotistical aggression. More telling is that Craig's Bond is more human that what we are used too, at one time suave and appearing unruffled, the next, bruised battered and emotionally conflicted. This is a new and rounded Bond, given impetus by Craig's powerful presence. He is helped by Eva Green putting brains and slinkiness into Vesper Lynd, a Bond girl to turn Bond's head in a way not seen since Diana Rigg's Tracy di Vicenzo in OHMSS. Though one of the film's rare missteps is to under write the part. Felix Leiter also gets a quality tune up in the form of Jeffrey Wright, Judi Dench's M kicks arse and Giancarlo Giannini adds a touch of continental class as Bond's Montenegro contact René Mathis. Layered over the top is a nifty score by David Arnold, blending traditional Bond flavours with high energy bursts and Phil Meheux's photography brings optical delights in the Bahamas, Czech Republic and Italy.\r\n\r\nOpening with the best chase sequence in the whole franchise and closing with an ultimate Bond moment, this is reboot supreme. It's high energy with intelligent humanistic smarts and Bond is back: blonder, brutal and most assuredly better. 9\/10","id":"5d09ce370e0a2678fcca1238","url":"https:\/\/www.themoviedb.org\/review\/5d09ce370e0a2678fcca1238","movie_id":36557}
{"author":"Potential Kermode","content":"**2006 - the year they turned Bond into a common soccer hooligan.**\r\n\r\nIn 2006, the film makers - no longer under the watchful eye of the late Cubby Broccoli decided to run away from making James Bond movies. They also cast a short blonde man as 007.  They screwed with the gun barrel and the tone of the once lively, over the top and amusing series was now one of tedium.\r\n\r\n\r\nIt's all over for Bond films now unless they decide to make real Bond films again and not this monotonous  and bland rubbish.\r\n\r\nIt's  shame that Cubby was not still around to keep Eon Productions in line and stop them ruining 40 years of hard work.\r\n\r\n\r\n- Potential Kermode","id":"58d9475c925141445f026b91","url":"https:\/\/www.themoviedb.org\/review\/58d9475c925141445f026b91","movie_id":36557}
{"author":"JPV852","content":"Great James Bond movie and perfect debut for Daniel Craig. He may, at least in the last couple outings, resent the role, he makes for a bruiser version of the character. Pierce Brosnan is still my favorite as his movies came out in the 90s (i.e. the years for watching Bond movies), but this was an all around great film, not to mention the lovely Eva Green coming on to the scene. **4.5\/5**","id":"5e9549d187f3f2001449e440","url":"https:\/\/www.themoviedb.org\/review\/5e9549d187f3f2001449e440","movie_id":36557}
{"author":"MrJago","content":"My favourite Johnnie To movie. Friendship and Brotherhood. Anthony Wong is incredibly cool.\r\n\r\nThe final shootout is poetry in bullets.","id":"55cbbe579251417645000927","url":"https:\/\/www.themoviedb.org\/review\/55cbbe579251417645000927","movie_id":13807}
{"author":"Gimly","content":"The jump in video quality from the first _Open Water_ movie to this one is **astounding**. But it's still real bad. Plus, this isn't even a shark movie! I know it isn't specifically touted to be one, but I was still very surprised. Honestly, I think what happened here was someone wanted to make a very stupid movie, but were then informed that a movie, near identical in both plot and stupidity, already existed, and to cover their tracks, they quickly decide all of a sudden that this movie was a \"sequel\" to the original _Open Water_. I guess it was kind of cool seeing the guy that plays Loki\/Gabriel in Supernatural in another role, but I can't imagine that's a thing that'll carry much weight with audiences in general.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5d78d34139549a001297ec4b","url":"https:\/\/www.themoviedb.org\/review\/5d78d34139549a001297ec4b","movie_id":9592}
{"author":"rajashanmugam83","content":"A decent thriller which keeps you at edge of the seat till the end. It's worth watching. Go for it.","id":"57a0d7c19251413e910006f6","url":"https:\/\/www.themoviedb.org\/review\/57a0d7c19251413e910006f6","movie_id":16170}
{"author":"Gimly","content":"The psycho-sexual here is nothing but uncomfortable. I could probably have handled that if there was anything else going on, but there's not. _In a Dark Place_ might have left me feeling unfulfilled, if I had had any positive expectations left by the final act.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"593d759092514105e202022c","url":"https:\/\/www.themoviedb.org\/review\/593d759092514105e202022c","movie_id":21794}
{"author":"John Chard","content":"A violent and vulgar distraction.\r\n \r\nIndeed, British magazine Radio Times reviewed Crank and called it a violent and vulgar distraction, maybe so if you be a little prudish and timid of stomach for high octane thrills. Crank is utterly bonkers fun, and it knows it, star Jason Statham knows it, directors Mark Neveldine and Brian Taylor know it, and quite frankly any action movie junkie fan knows it.\r\n\r\nThe tongue is planted so firmly into cheek it is in danger of breaking skin, it's a film that lives to take you on a most improbable thrill ride and succeeds admirably in doing so. Plot is kind of incidental, but Statham has been injected with a Chinese drug that will kill him if his adrenalin levels drop. So off he goes in search of vengeance and maybe an antidote? He runs, he jumps, he snorts drugs, has sex with Amy Smart in public, rides a motorbike like Evel Knievel, flashes his arse a lot and gets a major league erection.\r\n\r\nHe, much like the film, never pauses for breath, it's all very breakneck and kinetic. The makers are guilty of acting like kids locked in a sweet shop, with all the flashy tricks of the action movie trade used wherever possible, but so what? Sit back with a good drink and some movie snacks and enjoy one of the best action movie rides of 2006. 8\/10","id":"52b9824319c2957e1f01f2d8","url":"https:\/\/www.themoviedb.org\/review\/52b9824319c2957e1f01f2d8","movie_id":1948}
{"author":"The Movie Diorama","content":"Rocky Balboa, much like the titular character, throws tired punches within the constraints of its clichéd boxing ring. Thirty years since Rocky, the underdog from Philadelphia, graciously climbed into the ring and gave Apollo Creed a run for his money. Then a sequel was commissioned. And another one. And another. Until the negligently produced ‘Rocky V’ was released with its disappointing conclusion, leaving fans underwhelmed. Stallone too, discontent with the final product. Thus, the sixth title in the series was conceived, with Stallone starring, writing and directing the feature. Throughout the sequels, many tropes were repeatedly utilised to capitalise on the resounding success of the original instalment, after all it received the Best Picture award of ‘76. The training montage to “Gonna Fly Now”, the awkward conversational exchanges between Rocky and a potential love interest, the old optimistic monologue and Stallone attempting to demonstrate he isn’t just a masterpiece wax work by shedding one tear. All culminating into an emotional boxing match where it doesn’t matter who wins, “it’s about how many hits you can take, and still keep moving forward”.\r\n\r\nThe narrative difference in all these thirty years? Rocky is older now. Fine, that was somewhat harsh. Stallone implements some note-worthy additions to the linear storytelling. The brooding aura of melancholy that envelops Rocky and Philadelphia, struggling to move on from the passing of his wife Adrian. This sorrowful force restraining Balboa to a mere relic within the sport that he fought so viciously in. Guests visiting his restaurant (aptly names “Adrian’s”) to intently listen to his tales, as if a museum piece for all to reminisce. Struggling to retain his symbolic status within boxing.\r\n\r\nThe problem is, Stallone never progresses the plot. In fact, he maintained the narrative to be a simple yet dull nostalgia trip that relied heavily on sentimentality. A wearisome derivative of the original that, unfortunately, felt fatigued in terms of homaging certain plot points. The entire first act was Balboa moping around, despite Adrian passing years ago, embodying remorse. Stallone, as Rocky, nailed the consistency of his character. From the awkward dialogue to his emphatic mannerisms, he constantly reminded us that he is the only actor available to play this legendary cinematic character. Whilst Stallone’s performance was commendable, others not so much.\r\n\r\nThere’s an underlying issue with insufficient chemistry between the actors. Stallone and Hughes, reprising the character of Marie, were decent if undercooked. Stallone and Ventimiglia on the other hand, who portrays his son, had nothing. All dialogue exchanges between them felt forced and lacked emotionality, particularly when Ventimiglia was “supporting” his father outside the ring. Young was passable as Paulie, although acting talent has diminished considerably over the years with his constant shouting.\r\n\r\nThe third act boxing match was filmed concisely, with Stallone taking a distant approach in order to exploit the energy within the room. The corny punching sound effects were removed, with Stallone and Tarver actually throwing real punches. It certainly exhumed realism, if a tad pedestrian. However, Stallone then opted to embed unusual visualised effects within the fight to indicate Rocky’s thought process as he remembers past fights in search for vigour. Far too cheesy and cumbersome, breaking up the flow of the match with unnecessary slow motion. Rocky’s opponent Mason Dixon was severely underdeveloped, lacking strength within his motives as he yearns to be taken seriously as a heavyweight champion.\r\n\r\nRocky Balboa will entertain fans of the franchise. It encompasses several vital narrative elements that many have learned to adore. However, for the casual audience who are neither here nor there regarding the series, it’s a drained formulaic story that depends too heavily on paying homage to its predecessors. Ultimately exhausting itself before the penultimate fight commences.","id":"5e206fa7b3316b00150388a7","url":"https:\/\/www.themoviedb.org\/review\/5e206fa7b3316b00150388a7","movie_id":1246}
{"author":"Uknown","content":"One of the best Bollywood movie of 2006. A must watch for Bollywood fans. The performances are top notch, the soundtrack is great, the visuals are iconic.","id":"57a5d360c3a3681d1f0007a9","url":"https:\/\/www.themoviedb.org\/review\/57a5d360c3a3681d1f0007a9","movie_id":7913}
{"author":"J4stringthang","content":"Although I am to young to remember the accident, It sure didn't take long for \"We Are Marshall\" to become, damn \"We Are Dead\". I did enjoy this film, however at no point did I feel engrossed by the town. They tried so hard to make you cry they almost made me forget about football. Kind of a mix between Remember the Titans and Friday Night Lights. Can be watched by all.","id":"52f31d8f9251411334095da6","url":"https:\/\/www.themoviedb.org\/review\/52f31d8f9251411334095da6","movie_id":11170}
{"author":"Wuchak","content":"A small film that somehow restores your faith in life, in people, in, well,… everything\r\n\r\nRELEASED IN 2006 and written & directed by Brad Silberling, “10 Items or Less” is a drama about an aged has-been actor (Morgan Freeman) who researches for an indie gig after a four-year dry spell. He meets a spitfire checkout clerk named Scarlet (Paz Vega) at a supermarket in a Latino community of Los Angeles. Impressed by the young woman, he decides to help her while psyching-up for the role.          \r\n\r\nThe plot is obviously borrowed from 2003’s “Lost in Translation.” To key you off, the girl is named after Scarlett Johansson. But don’t let that keep you from seeing this minor gem because the characters are very different, plus other nuances. For instance, Morgan’s character (simply called “Him” in the cast list) reflects the “joy of living” (joie de vivre) as opposed to Bill Murray’s amusing curmudgeon in “Lost in Translation.” \r\n\r\nMoreover, “10 Items” is less melancholy; and the girl isn’t naïve and overly sweet like Charlotte (Johansson) in “Lost.” It’s a small film, with the end credits rolling a mere ten minutes after the hour mark, and so it lacks the depth of “Lost” and isn’t as moving (at least as far as pulling your romantic heartstrings), but it’s more heartwarming and overall inspiring.              \r\n\r\nTHE MOVIE RUNS 1 hour 21 minutes and was shot in Brentwood, Los Angeles, and nearby Carson (to the south). \r\n\r\nGRADE: A-","id":"5aba836e0e0a2609e1003494","url":"https:\/\/www.themoviedb.org\/review\/5aba836e0e0a2609e1003494","movie_id":2357}
{"author":"Gimly","content":"Rarely is something this elaborate, this mundane. Some laughs are present, and the story is just engaging enough to keep you the bare-minimum of invested, but mostly it seems like its just a platform for Milla Jovovich's nudity.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"592eed49c3a36860b9010155","url":"https:\/\/www.themoviedb.org\/review\/592eed49c3a36860b9010155","movie_id":14062}
{"author":"CRCulver","content":"Mohsen Makhmalbaf had gradually won acclaim in his native Iran and eventually stood among the foremost representatives of Iranian cinema, but starting in the late 1990s he began to shoot abroad, keen to make films more daring than what his country's censors would allow, and in search of themes that, underneath the exotic locale, might have some universal meaning.\r\n\r\n<i>Scream of the Ants<\/i>, shot in India in 2006, is one of these. An Iranian married couple goes to India in search of a \"perfect man\" whose guidance the wife's meditation teacher recommended. The wife (Mahnour Shadzi) believes in India's spiritual promise and that its poor multitudes are happier than those with money. The husband (Mamhoud Chokrollahi) is a skeptic, who finds it hard to swallow claims of divinity and believes India's poor masses would benefit from a communist revolution.\r\n\r\nThe film tracks the pair through a series of poetic scenes that are more Makhmalbaf's fantasy of India than any claim to documentary realism. The subcontinent is wildly mixed, for example, with a Tibetan monk wandering the deserts of Rajastan. One can understand Makhmalbaf's lack of interest in grappling with Indian culture as it is, because the tension between the two married foreigners is where the drama really lies. Nonetheless, the \"profound spiritual wisdom\" that they finally receive in this exotic country, which must have stemmed mainly from Makhmalbaf's own imagination, is pretty cheap and cliche. As the couple reaches the climax of their journey in Varanasi along the Ganges, it is actually a German man (who dropped out of European society to become a seeker in India) who has the role of describing Indian religion. This makes one wonder if Makhmalbaf simply couldn't find any Indians willing to help because his overall approach was offensive to them.\r\n\r\nAnother flaw of the film lies with its acting, or rather the lack thereof. Makhmalbaf's brand of cinema is extremely tolerant of wooden delivery, perhaps because the characters are often speaking in English which native Iranian audiences wouldn't always understand. Yet when the dialogue is already risible with these fortune-cookie insights, the actors delivering it in such a stilted fashion simply makes these scenes in the film repugnant to English-speaking viewers.\r\n\r\n<i>Scream of the Ants<\/i> is overall a misstep, but it still holds some interest for cinephiles who have seen other Makhmalbaf films. Some of the poetry and humor here is engaging, even if it is not much. Also, this is a surprisingly sexually daring film, with female nudity, something which I mention not to exhort viewers to prurience but rather because it is interesting that this director now wanted to explore these areas.","id":"5b7df4580e0a2615bf008eb1","url":"https:\/\/www.themoviedb.org\/review\/5b7df4580e0a2615bf008eb1","movie_id":56952}
{"author":"Wuchak","content":"***Enjoyable mystery\/comedy with Scarlett Johansson***  \r\n\r\n\"Scoop\" (2006) is a mystery\/dramedy\/romance written and directed by Woody Allen. Scarlett Johansson stars as Sondra Pransky, a geeky college journalist vacationing in England. She gets a tip from the ghost of a dead newsman (Ian McShane) on the identity of a local serial killer and proceeds to partner with bumbling magician Sid Waterman (Woody Allen); the tip leads them to the rich son of a prominent lord, Peter Lyman (Hugh Jackman), whom Sondra starts to date to acquire information. Is Lyman the notorious killer or isn't he? \r\n\r\nAlthough fantastical and somewhat goofy, \"Scoop\" is first and foremost a mystery and I did enjoy trying to figure out if Peter Lyman is the \"Tarot Card killer.\" In the story we perceive Peter Lyman largely through the lens of Sondra, who is falling for the guy; hence, the viewer warms up to him.\r\n\r\n\"Scoop\" is a comedy but not in the laugh-out-loud sense of, say, \"Ace Ventura: Pet Detective\"; it's mildly amusing, witty and fun but not knee-slapping funny. So if you're looking for the latter don't bother.\r\n\r\nThe three stars and their chemistry are a highlight. I enjoyed the team-up of Woody (Sid) & Scarlett (Sondra) and their surrogate father\/daughter relationship. I knew when I saw \"The Horse Whisperer\" that Scarlett would grow up to be one of cinema's leading beauties, and so she is! Scarlett was 21 while filming \"Scoop\" and the film is worth catching solely for her; just don't expect any raunch or t&a exploitation (although she does have a one-piece bathing suit scene and a nightie sequence, which are rather modest).\r\n\r\nHugh Jackman is a great modern masculine actor, of course, and he does fine here, although I couldn't help wondering if long metal claws would suddenly shoot out of his knuckles! \r\n\r\n\"Scoop\" is an enjoyable mystery\/dramedy highlighted by refreshing originality, a quality cast with good chemistry and English locations. I admit that I didn't think I'd like the film during the first 25 minutes or so, but then I caught on to the movie’s vibe. The interactions between the three main characters, their story and the mounting mystery pulled me in and glued me until the end. I also enjoyed the creative zany elements (e.g. crossing the River Styx with the Grim Reaper and the reappearing ghost reporter) and the film's overall refreshing air. \r\n\r\nThe movie runs 96 minutes and was shot in London & the English countryside.\r\n\r\nGRADE: B+","id":"5c6d3b3f0e0a2617779faa78","url":"https:\/\/www.themoviedb.org\/review\/5c6d3b3f0e0a2617779faa78","movie_id":512}
{"author":"GHeart","content":"Perfume: The Story of a Murderer is a 2006 German period psychological crime thriller film directed by Tom Tykwer and starring Ben Whishaw, Alan Rickman, Rachel Hurd-Wood, and Dustin Hoffman. Tykwer, with Johnny Klimek and Reinhold Heil, also composed the music. The screenplay by Tykwer, Andrew Birkin, and Bernd Eichinger is based on Patrick Süskind's 1985 novel Perfume. Set in 18th century France, the film tells the story of Jean-Baptiste Grenouille (Whishaw), an olfactory genius, and his homicidal quest for the perfect scent.\r\n\r\nBasically, I can say that this movie isn't for the emotional ones. It is a gently reminder that the perfection doesn't have to be shown or made in the real life. It should stay on a shelf and don't be touched by anyone. ","id":"5b62fcb60e0a267ef1030b37","url":"https:\/\/www.themoviedb.org\/review\/5b62fcb60e0a267ef1030b37","movie_id":1427}
{"author":"Milo_Jeeder","content":"After reading and analyzing some negative reviews concerning this film, my wild guess is that \"Penny Dreadful\" turned out to be a disappointment to those who were looking forward to a movie that would desperately try to follow the \"twists in the end\" trend. It appears that many people are somehow disappointed by the fact that this film had an ending that wasn't complex or 'surprising' enough. In my case, however, as the film was coming to an end, I was hoping for a simple ending without an unnecessary twist. To my pleasant surprise, I got exactly what I wanted and the ending wasn't far-fetched and insulting like most horror films that are being released these days.\r\n\r\nIn \"Penny Dreadful\", the story is about a young girl named Penny, who has a severe fear of cars, as a result of a traumatic accident. Willing to overcome her phobia, Penny goes on a road trip with Orianna, her psychologist, as a way of overcoming her fear. During an argument, Orianna accidentally hits a hitchhiker who was walking in the middle of the road and decides to stop to help him out. When she realizes that the traveler is actually in perfect conditions, Orianna decides to give him a ride as a modest way of apologizing. Unfortunately, the hitchhiker turns out to be a raging murderer who will turn the therapeutic experience into Hell on Earth. Given the circumstances, the thing that Penny fears the most, ends up becoming her only saving shelter from the psychopath who lurks outside.\r\n\r\nLike I stated before, one of the things that I praise the most about \"Penny Dreadful\", is the fact that there were several ways to turn the whole thing upside down towards the end and \"shock\" the audience with an ending that would make a villain out of the least expected character. \"Penny Dreadful\" is a very simple and yet compelling little film with an uncomplicated ending that despite of its simplicity, it still contains a small surprise that doesn't ruin the entire thing. I won't say it, of course... but there is one little surprise regarding the killer. I enjoyed this movie a lot, regardless of a few little things that I didn't quite get. For instance, I would have to point out the meaningless background story about a young folk having extramarital sex with a married woman and the old man who is aware of this act of adultery. It doesn't have any kind of connection to the story of Penny and Orianna. Perhaps the only reason why these three secondary characters appear, it's because otherwise, it would be ultimately uninteresting to see the hitchhiker and Penny throughout the entire film. Regarding the characters, I was glad to actually felt compelled to root for the good guys. These days, a lot of horror movies are released where the 'villains' are more empathetic, which leads to lack of interest for the main characters. Even though there were moments in which I felt like jumping into the screen and punch both Penny and Orianna for being so stupid, I felt empathy for the heroine of the story the whole time. I can't deny that she was a very irritating, but at the same time, I could empathize with her and I wanted her to survive, through a gruesome type of redemption.\r\n\r\nIf you're in the mood for an enjoyable film that doesn't desperately try to shock the audience with a \"wonderful twist\", give \"Penny Dreadful\" a chance. But most of all....brace yourself, put on your seat-belt and don't forget your breathing exercises, because this is going to be one hell of a ride!","id":"58a395459251414b1e00034c","url":"https:\/\/www.themoviedb.org\/review\/58a395459251414b1e00034c","movie_id":15543}
{"author":"g6pictures","content":"\"At the alternative Bluestockings Bookstore on the Lower East Side of Manhattan early this month, several dozen women gathered for the New York premiere of Period: The End of Menstruation?,” Ms. Chesler’s hourlong documentary. It explores the idea of suppressing the menstrual period but leaves the viewer to make up her own mind.\" S. Saul, The New York Times http:\/\/www.nytimes.com\/2007\/04\/20\/health\/20period.html","id":"55e0bee2c3a36805da00081e","url":"https:\/\/www.themoviedb.org\/review\/55e0bee2c3a36805da00081e","movie_id":356567}
{"author":"John Chard","content":"Good Cop - Vampire Cop.\r\n\r\nPerfect Creature is ironically far from being a perfect movie. It's one of those frustrating cases where on the page it looks a smart premise, while the visuals and atmospherics are classy and inventive. Yet it's told in such a dull and uneventful way, managing to strangle the cast's skills whilst wasting the serial killer - cum - rogue vampire promise. Then there's the thematics that are given over to exposition drivel, the science, the ethics, and tolerance and evolution, wasted as we had towards an action scene, none of which is particularly special.\r\n\r\nIt's bold attempt at steampunkish horror, but sadly it's not all it can be. 5\/10","id":"56221949c3a3680e0e00b761","url":"https:\/\/www.themoviedb.org\/review\/56221949c3a3680e0e00b761","movie_id":18726}
{"author":"Gimly","content":"I don't think I can tell you that _Smokin' Aces_ is **good**. But I have seen the movie on three seperate occasions in the past thirteen years, roughly evenly spread apart. And each time I have not only enjoyed it, I enjoyed it more than the last time. This movie is **very** dumb. But fast and fun and oh boy what a cast.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5d6258a56dea3a1851937e28","url":"https:\/\/www.themoviedb.org\/review\/5d6258a56dea3a1851937e28","movie_id":7516}
{"author":"JPV852","content":"Sometimes wild, sometimes confusing action-thriller that boasts a great cast, but in the end, this wasn't a Carnahan movie that really did it for me. **2.75\/5**","id":"5e9ccfd11941860025d1c549","url":"https:\/\/www.themoviedb.org\/review\/5e9ccfd11941860025d1c549","movie_id":7516}
{"author":"Gimly","content":"Has pretty much all the same negatives as the original _Van Wilder_, only without the boon of Ryan Reynolds. It's an interesting idea to hold on to the name of the character in your sequel\/spinoff when they don't actually appear in any way. And by interesting I mean stupid and a transparent attempt to cash in on brand recognition. Seriously you could play this exact same movie only call it \"England School Dumb Time\" and get 100% the same story across. The script calls\/builds upon the original in exactly zero ways. Now, that might be a big deal if the original _Van Wilder_ had some sort of actual value, but seeing as it doesn't, _Rise of Taj_ is just another bad, watchable US comedy like so many others, only this one has the rare inclusion of a non-white lead.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5aae30a5c3a36846d5020fee","url":"https:\/\/www.themoviedb.org\/review\/5aae30a5c3a36846d5020fee","movie_id":10032}
{"author":"JPV852","content":"Certainly not great and some so-so acting and lines of dialogue (save for Jordan Madley who actually wasn't half bad), but I found it mildly entertaining which says something as I'm generally not a big fan of possession-type movies.","id":"5d6709eb06f9840010a78436","url":"https:\/\/www.themoviedb.org\/review\/5d6709eb06f9840010a78436","movie_id":10251}
{"author":"John Chard","content":"I think there's something wrong with my corpse.\r\n\r\nCould it be that the spirit of a dead cadaver is killing off all those who have medical dealings with her body?\r\n\r\nJudging by the unfairly low rating it has on the main internet movie sites, it's very likely that the slow pace and lack of gore has counted against Unrest, which is a big shame. Jason Todd Ipson (director) draws on his real life experiences as a Boston general surgery employee to produce a film of skin itching substance. The premise is nifty and the real location shooting really adds weight to this mortality gone awry tinged horror.\r\n\r\nThere's a freshness to the film that leaps out, finding a film maker not merely content to pander to the formulaic hordes to win plaudits. Having an impossibly gorgeous female lead (Corri English) as the main protagonist would lend one to think that is not the case, but there's a rawness to English's acting that suits the character perfectly. There's a splendid realism factor to the picture, the blend of the real and the smart effects work nestling nicely together on the mortuary slab.\r\n\r\nAtmosphere is a word that has always been key in non blood letting horror parlance, and Unrest has it in abundance. It would have been easy for Ipson to rely on boo-jump shocks, but he doesn't, he uses his knowledge of setting and subject matter to craft a tight and tense thriller that manages to gnaw away at the senses, even ensuring that the cadaver, as dead as she apparently is, is a full and rich character holding court as the body count starts to tot up.\r\n\r\nThe musical score (Michael Cohen) is a bit intrusive at times, a romantic sub-plot a little pointless, while the finale doesn't quite hit great heights given what has led up to it, but this is a smart dark mood accentuated piece and it is well worth checking out. 7.5\/10","id":"5464c01ac3a36804c5001ed9","url":"https:\/\/www.themoviedb.org\/review\/5464c01ac3a36804c5001ed9","movie_id":10085}
{"author":"John Chard","content":"Oh Brother!\r\n\r\nThe sequel to cult fave Underworld (2003) finds vampire warrior Selene (Kate Beckinsale) and half werewolf Michael (Scott Speedman) unravelling the truth about their respective blood lines. Just what caused the feud between the vampires and the lycans?\r\n\r\nUnsurprisingly reviews for this sequel are mixed, it's either a smart action popcorner that was warranted, or it's a huge let down after the first film. Personally I'm in the first camp, personally because it does pretty much the same things, only the story has a bit of complexity about it to try and bluff us that it's cerebral.\r\n\r\nFor a film about vampires and werewolves at war it delivers all that is required in the modern era. There's lots of high energy action, blood and guts galore, CGI overdrive, fast pacing and a sexy lead actress fronting the piece. The story ticks along nicely, introducing new and interesting characters, while flashbacks fill in the gaps for any newcomers to the series. The main villain is one bad-ass winged mofo, a genuine terror that our protagonists have right to fear, and the finale is as expected a bonkers array of bloody chaos.\r\n\r\nSmartly put together by director Len Wiseman and coolly photographed by Simon Duggan (steel blues and greys), it isn't ground breaking cinema, but it's a wail of a time for those with expectation levels set at popcorn bonanza. 7\/10","id":"5627ee93c3a36872900003db","url":"https:\/\/www.themoviedb.org\/review\/5627ee93c3a36872900003db","movie_id":834}
{"author":"SoapboxQuantez08","content":"Skinwalkers is simply superb. \r\nThe late Stan Winston (creature-makeup wizard) was acquired for this film. That's right folks, these aren't CGI werewolves, they're the real thing. Well, you know what I mean.\r\n\r\nElias Koteas (you might remember him from The Prophecy) stars as Jonas Talbot, uncle of the prophesized 12-year-old who's destiny is to become a werewolf-cure on the eve of his 13th birthday. There are many shoot-outs for a werewolf film, to the point where the director said that it was \"shot as a western\". In _the shooting at Huguenot_, the tranquility preceding the chaos is as described in The Professional (in other words, there's a \"peaceful little moment before the storm\").\r\n\r\nThere are many unique elements to this film, such as a falcon that seeks out the kid's presence for the _villainous_ skinwalkers (the ones who prefer death over a cure).\r\n\r\nThroughout the film, it's unclear how the kid is supposed to be a werewolf-fix, but imo, the twist at the end is quite clever and grounded in reality. So if you like originality, suspense, and Natassia Malthe in a biker top, you might want to check this one out, per se. 7.5\/10","id":"58dd1d32c3a368228300bde2","url":"https:\/\/www.themoviedb.org\/review\/58dd1d32c3a368228300bde2","movie_id":14219}
{"author":"John Chard","content":"Go as you wish. That which is yours will always return to you. That which you take will always be taken from you.\r\n\r\nSeraphim Falls is directed by David Von Ancken who also co-writes with Abby Everett Jaques. It stars Liam Neeson, Pierce Brosnan, Michael Wincott, Xander Berkeley, Tom Noonan, Kevin J. O'Connor, John Robinson, Ed Lauter, Wes Studi and Anjelica Huston. Music is by Harry Gregson-Williams and cinematography by John Toll.\r\n\r\nIt's post American Civil War, 1868, the Rocky Mountains, and Gideon (Brosnan) is being hunted by Colonel Morsman Carver (Neeson) and his hired killers. The reason why is not yet known, but it's the beginning of a relentless pursuit that's propelled by rage and hatred, a pursuit that will force both men to the day of reckoning.\r\n\r\nThe premise is as simple as it gets and on the surface the film holds no surprises until the divisive ending. However, before taking in the thematics of the story, it's refreshing to find a film of this genre type utilising the scenery to the max, whilst simultaneously playing out with sparse dialogue as two grizzled actors tell the story. An obvious forebear to \"The Outlaw Josey Wales\", Seraphim Falls is ultimately a meditation on revenge and remorse. Moments of violence flit in and out of proceedings, these moments cloaked magnificently by natural surroundings, where the expansive wilderness plays host to the intimate human drama unfolding. It's also a film that pulses with mythical atmosphere, where Carver's pursuit of Gideon plays out like that of the Grim Reaper and his charges sent to capture the soul of the fleeing man. The falls of the title clearly indicates man's decent into hell, because it's not for nothing that the finale is played out on a blistering plain, which as you cast your eyes upon it, it is indeed hellish.\r\n\r\nIt's also worth noting that we the viewers are never sure who we should be rooting for - if either of them!? Gideon is out on his own, but he is an immensely skilled mountain man, one who is seemingly out skilling his pursuers. Is he the bad guy here? Or is it Neeson's Carver? One is ex Union, the other Confederate, this gives added spice to what then develops into a most intriguing journey. Where the film has irked some critics is with the ending, with some calling it pretentious and a very weak pay off. It's true enough to say that Ancken has slackened the grip slightly, as the tight gritty tone gives way to something more open and even airy. Yet I personally like it a lot, it helps to round out the supernatural feel that appears to loom as we have headed towards the day of reckoning. It lacks dramatic impact for sure, but thematically and for tonal bedfellow process, it pays off on what had gone before it.\r\n\r\nBrosnan (stepping in when Richard Gere bailed out) and Neeson revel in the roles, seemingly enjoying the complexities and war torn burdens that their characters carry. Their scenes together are as professional as one could wish, both men comfortably doing world weary characterisations. Wincott is on hand for gravel voiced villain duties, his portrayal of Hayes is cold and in keeping with the movie. The other notable names in the cast drop in and out of the narrative, each important, and in the case of Huston and Studi, suitably weird. But the real star of the show is John Toll (Braveheart\/Legends of the Fall), whose photography is pristine and  always remaining atmospheric, he captures the natural beauty of Oregon and New Mexico with great keen eyed skill. Switiching seamlessly from the blue, grey and whites of the mountain pursuit to the browns and yellows of the salt flats, we witness a master cinematographer at work. \r\n\r\nLikely to infuriate as much as it enthrals, one just hopes that it's the latter that anyone reading this does indeed find to be the case. 8\/10","id":"5d5cb4c4a3d02700140b2e34","url":"https:\/\/www.themoviedb.org\/review\/5d5cb4c4a3d02700140b2e34","movie_id":13249}
{"author":"John Chard","content":"Biting British Brutality.  \r\n\r\nEastern Europe wilderness and the sales division of weapons company Palisade Defence are meant to be having a team building weekend. But once they reach their less than luxurious lodge out in the forest, it becomes apparent they are not alone...\r\n\r\nWe open with a chase that results in a brutal murder, all played out to the wonderful strains of The Small Faces singing \"Itchycoo park,\" it's obvious from this moment that this is no ordinary horror comedy. Comedy as everyone knows is hugely subjective, even more so when it involves horror, some attempts have been roundly accepted such as parody supreme Shaun Of The Dead or nervous titillation in the Evil Dead series, while others are so bad they don't need a mention here. Severance, happily, is as sharp with its humour as one of the knives used in the piece itself, perfectly tuned into the modern world and the bizarreness of it all.\r\n\r\nWhat started out as a working script called \"P45\", where Christopher Smith's film was to be about these \"yuppie\" types literally team building for a weekend where if they didn't pass the tests they lost their jobs, escalated to a slasher with a wry satirical edge. The characters, as the makers point out on the DVD, are the perfect blend of the archetypal office workers. Each of them can readily be found in any Brirtish office on any given day. The ineffective leader who's wormed his way into the position, the jocular wide boy, the creep, the babe attracting all the sexual attention and on it goes. Each character rich with British office traditions thrust together for one bubbling comedy stew.\r\n\r\nEnter the central theme of weapons making companies firmly under the microscope and Severance has much to say. As a promo video made by the managing director plays, the irony is absolutely hilarious and sets the film up a treat. Even as the film gets bloody, and it's certainly bloody at times, the smiling assassin nature of the script continues to be bitingly funny. There's reams of clever jokes in the piece, so many in fact that even now after my third viewing experience I'm still finding new stuff. So with that I would urge anyone who has only seen it the one time, and been less than enamoured with the premise, to try again and observe and listen without interruption. \r\n\r\nThere's even self mocking of the genre it belongs in, and this from the director of 2004s culter, Creep. The cast are uniformly strong, from Tim McInnerny's weasel team leader portrayal to Danny Dyer's with type drug taking \"cockernee\" boy, all playing off each other with smart and mirth inducing results. A fine fine entry in the horror comedy pantheon, one that just gets better and better with each and every viewing. 9\/10","id":"5bd4cc9cc3a368211201ca70","url":"https:\/\/www.themoviedb.org\/review\/5bd4cc9cc3a368211201ca70","movie_id":5072}
{"author":"Wuchak","content":"Grim, relentless pursuit Western turns mystical in the last act\r\n\r\nA vengeful former Confederate colonel (Liam Neeson) leads a small group of hirelings in an unyielding hunt for the former Union officer who horribly wronged him three years earlier (Pierce Brosnan). The only problem is that the latter is an expert fighter and survivalist.\r\n\r\nThis is a well done revenge Western with spectacular and varied remote Western locations (detailed below). If you thought Brosnan was a pretty boy as James Bond this movie will change your mind as he’s virtually unrecognizable as the skilled Rambo-like militarist. The tone is similar to contemporaneous Westerns like “The Missing” (2003) and “September Dawn” (2007), but with a revenge-chase plot. The final act throws in supernatural elements with characters like Mr. Charon (Wes Studi) and Louise C. Fair (Angelica Huston). You don’t have to think too hard to figure out who they really are. \r\n\r\nThe movie runs 1 hour, 55 minutes and was shot in Oregon (McKenzie River, Sahalie Falls and Koosah Falls), New Mexico (Lordsburg, Taos, Bramlett and Santa Fe), Arizona (Willcox Playa, Pirtleville, San Bernardino Valley and Chiricahua National Monument) and Death Valley National Park, California.\r\n\r\nGRADE: B\/B-","id":"5bb10e0f0e0a2633a40027c3","url":"https:\/\/www.themoviedb.org\/review\/5bb10e0f0e0a2633a40027c3","movie_id":13249}
{"author":"badelf","content":"This is one of those films like a great pasta dish where everything is just right but somehow you still don't feel the restaurant is justified charging $21.95 for a plate of noodles and tomato sauce. The direction is top notch, Cate Blanchett as Sheba Hart is great and Bill Nighy supporting just works. As much as I usually adore Judi \r\nDench's acting, I thought she was a little too one-dimensional in this role. But given her choice, she executed the role with the usual Dench precision.\r\n\r\nThis is a twisted love triangle story with very real characters. If you're the kind that picks up the dirt rags in the checkout line at the supermarket, you'll probably love the story. I gave it a 7 on my scale. It won't blow you away, but you won't feel like you've wasted your time either.","id":"501d3a5819c2950d2c004e0e","url":"https:\/\/www.themoviedb.org\/review\/501d3a5819c2950d2c004e0e","movie_id":1259}
{"author":"DoryDarko","content":"Going into this film, I had no idea what it was about, only that it was based on a true story. And the more I think about this fact, the truth behind it all, the more it saddens me.\r\n\r\nThe story that unfolded before my eyes last night is not one I'm likely to forget anytime soon. The characters, as I understand, are eerily like the real life people depicted, and all of the actors have done a great job terrifying me, surprising me, and making me feel sadder than any other film I can remember in recent history. Which is by no means meant to discourage you from watching this film, as I believe it is an absolute must-see for anyone who cares about the society we live in.\r\n\r\nJake Mazursky, an explosively charged skinhead, owes a large sum of drug money to a young thug called Johnny Truelove. After they get into a fight, Jake retaliates by trashing Johnny's house. Johnny then takes revenge by kidnapping Jake's 15-year-old brother Zack. Surprisingly though, Zack is OK with this, as he trusts his brother to come up with the ransom. In the meantime, Zack forms an unlikely friendship with one of Johnny's cronies, Frankie. But then, as fear starts to spread of having to do hard time, Johnny and his allies make a decision that spins the situation horribly out of control...\r\n\r\nThe character of Jake is played by Ben Foster, and I think he did an amazing job. Some people have suggested that he overacted his part, but I disagree. I think he was very convincing as a strung-out, aggressive, creep of a skinhead. Johnny Truelove, the young gangster, is played by Emile Hirsch, and his role is light years removed from anything he's done so far, and he's as equally impressive and convincing as Ben Foster - just as menacing and intimidating. Actually, he appears almost as though it's not a part he's playing, he's really some thug they plucked off the streets and put in front of a camera. Very impressive. This character in real life is known as Jesse James Hollywood, and he is the youngest person ever to be on the FBI's 'most wanted' list.\r\n\r\nZack is played by Anton Yelchin, and he's is everything his character requires him to be; young, naive, even a little endearing, and most of all desperate for a little excitement in his life. The role of Frankie is performed by Justin Timberlake, and I must admit, he was better than I would have initially given him credit for. Actually, there wasn't a single actor or actress who was miscast in my opinion. All roles, big and small, were equally well played. I must not forget to mention the parents: Johnny's father is played by Bruce Willis, and even though his part is small, is it crucial. Sharon Stone plays Zack's mother, in a role that is gut wrenchingly emotional and very well played. Although there is one scene at the end where she wears a fat suit, and it's so obvious that it's distracting, and this is a discredit to an otherwise excellent and very important scene (but that's not her fault, of course).\r\n\r\nWhat makes Alpha Dog so important, I think, is that's it's a testament of the times we live in. A time where, apparently nobody seems to be shocked anymore about the fact that young people in their teens and twenties lead a lifestyle of drugs and guns and no respect whatsoever for other people's lives and wellbeing. The ease with which some ideas and actions are executed, exemplifies and also amplifies the anarchy and devil-may-care attitude that lives within the hearts and minds of these people. Who cares if you beat a person to within an inch of his life. Who cares if you hurt, damage or even kill another human being, just so long as you can save your own neck. It's dog eat dog in the hierarchical food chain that is life, and this film is a disturbing reminder of that. I thought we'd moved on since the Dark Ages, but apparently I'm mistaken.\r\n\r\nAside from the heavy, moral message of this film (which, for once didn't tick me off, but really engaged me), I must also praise it on a technical level. It really is very well made, and it draws you in from the very first second with the beautifully edited opening scene. Director Nick Cassavetes ('John Q') has constructed the story into a balanced, properly paced whole, seemingly letting his actors run free and do what they do best, creating a spontaneous, natural feel and environment. The music is excellent and well dosed.\r\n\r\nAlpha Dog is a film that you must see at least once if you care about this world and the people in it. It is a portrait of frighteningly laconic individuals and the shockingly low bar to unnecessary violence, and it shows just how easy it is for young people to get involved with all the wrong influences, simply because they have not yet lived enough to know any better, or lack the proper role models to show them alternative ways.\r\n\r\nI cannot recommend this film enough. It's heavy - but very, very much worth it.\r\n_(October 2012)_","id":"58a9b62cc3a3680be50089e7","url":"https:\/\/www.themoviedb.org\/review\/58a9b62cc3a3680be50089e7","movie_id":7457}
{"author":"tmdb63938527","content":"If any of you have seen El Mariachi or Into the Woods, then you will know what can be done on a very limited budget with little professional equipment. As long as you have some skill, talent and vision. I always cite those as a benchmark for any low budget indie film to aspire to. So much crap is made these days (perhaps more than in the late Seventies and early to mid Eighties I think), but not so much due to budget, but more the people involved.\r\n\r\nI now have another film to add to them. Is it as good? Nowhere near no, is it crazy, with a wicked script, nice transition effects and a killer soundtrack? Very much so. I think all those involved in this weird and wonderful little flick knew what they were making, and because of that it works. It is not a good film by any stretch of the imagination. It is not well acted (they’re atrocious). The production values are not good either. Some of the effects are truly terrible.\r\n\r\nBut having said all that, it’s just bad, crazy, and tongue-in-cheek enough to be quite enjoyable and to wonder exactly where this mad ride will take you next. It is a ridiculous film with an equally ridiculous plot. Some of the dialogue would not be amiss in a Seventies Grindhouse film. Quotes such as ‘Are you wet and mushy just like them oatmeal?’ and ‘You got amnesia? Well don’t be passing that shit around’ are par for the course in this mad romp.\r\n\r\nOur plot consists of Alice (Sondrup) trying to get out of town. A failed robbery lands her in a coma courtesy of power-mad cop Jill Robbe (Beisner). After a truly terrible escape scene (played majorly tongue-in-cheek) from the local detention center, Alice then runs into the local pimp boss Ramrod. From there things escalate in silliness and madness. At one point (and I wish she appeared earlier in the film) TNT (a perfectly cast Gentle Fritz) turns up as a type of Kill Bill Bond villain wearing a short Dirndl dress with a penchant for strangulation. She even comes complete with eerie smile and pigtails. The film switches between general action fare to a Seventies El Mariachi exploitation flick (complete with Mexican music) and even throws in a little Thirties pathé for good measure, along with numerous nods to other films and genres. Not a very good film, but one so mad and crazy it is well worth a watch.","id":"58a605c9c3a3681bf9001ccf","url":"https:\/\/www.themoviedb.org\/review\/58a605c9c3a3681bf9001ccf","movie_id":60512}
{"author":"Wuchak","content":"***Several teens go to a cabin-in-the-woods to party (no, really)…***\r\n\r\n… actually it’s a ranch house, but close enough.  Anyway, they start getting picked off by a mad slasher with the most promiscuous ones dying first. Sound familiar?\r\n\r\n“All the Boys Love Mandy Lane” debuted at film festivals in 2006 but curiously wasn’t released to theaters until 2013. I’m surprised this was even released to theaters because it’s a low-budget indie slasher, nothing more. It cost $750,000, which is more than enough to make a competent film. The well-done “Another Kind” (2013), for instance, only cost $120,000. But “Mandy Lane” is just too all-around hackneyed and meh, which isn’t helped by the fact that half the characters are repellent (e.g. Jake, Marlin & Chloe).\r\n\r\nThankfully, the filmmaking is competent with some nice cinematography of central Texas and Amber Heard in an early role is a highlight. Plus there’s a surprise at the end, but it makes you question the person’s motives. If you reflect on the material, though, it all makes sense and shows that some thought was put into the script. Of course this doesn’t help the dull shallowness of most of the characters (who are SUPPOSED to be shallow, I get it).\r\n\r\nThe film runs 1 hour, 30 minutes and was shot in the heart of Texas (Austin & Bastrop) with other stuff done in Santa Clarita, CA.\r\n\r\nGRADE: C","id":"5bf041910e0a26266103b223","url":"https:\/\/www.themoviedb.org\/review\/5bf041910e0a26266103b223","movie_id":9022}
{"author":"J4stringthang","content":"OK Timberlake fans and haters alike, Calm Down! Largely regarded as \"you know, that movie with Timberlake in it.\" Alpha Dog was enjoyable. And Timberlake did a great job. He is definitely all grown up now. A strong supporting cast of Sharon Stone and Bruce Willis sure didn't hurt. I loved how the cast worked so good together. They were very believable. The movie did a great job of showing us just how crazy and out of control a simple misunderstanding can get. Hopeful Hollywood does force Ben Foster down our throat! Small doses please! NOTE: Alpha Dog has a lot of language in it.","id":"52f3216f925141133a09fa07","url":"https:\/\/www.themoviedb.org\/review\/52f3216f925141133a09fa07","movie_id":7457}
{"author":"John Chard","content":"You ever have that dream: the one where you did something... You don't know why, but you can never go back?\r\n\r\nAlpha Dog is a filmic interpretation of the real life Jesse James Hollywood\/Nicholas Markowitz case of 2000.\r\n\r\nWe are in the company of young dope dealers, a group of wannabe gangsters who ultimately are way out of their depth, whose decisions are so moronically misguided they form the basis for what is the tragedy of this story. Directed by Nick Cassavetes, the pic has serious intentions but never quite gets to reach the greatest heights for dramatic verve purpose. Yet for all that, after being in the company of genuine lost boys and girls, watching them as 24 hour party people bluster for majority of the piece, it means that once the tragedy strikes the film has done its job. It becomes something to last in the memory, where Cassavetes' flashy techniques (split-screens - freeze frames etc) don't detract from the harsh reality of it all. There's a bunch of committed exuberant performances on show, with a roll call of then up and coming young actors to note. 7\/10","id":"5d2c1a440745e1000e774417","url":"https:\/\/www.themoviedb.org\/review\/5d2c1a440745e1000e774417","movie_id":7457}
{"author":"Gimly","content":"I would say it is the strongest entry of the first three Mission: Impossible films (the only ones I've seen to date). Even a decade later, it's strengths are still that which the franchise has always been known for, and its weakness are much the same. Much more akin plot-wise to the first film, _M:I:III_ has the one advantage over its predecessors that it's villain is much stronger than any we have seen before. Though arguably not the primary antagonist, Seymour-Hoffman (RIP) is actually pretty terrifying as international arms dealer, Owen Davian.\r\n\r\nThat said, while this third entry is certainly the most engaging thus far, it still had me checking my watch before the end of the movie, so I can hardly give it a glowing review.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"57b2f696c3a36835340099cb","url":"https:\/\/www.themoviedb.org\/review\/57b2f696c3a36835340099cb","movie_id":956}
{"author":"Gimly","content":"I don't know if there is a better example of dedication in filmmaking out there than there is in _Apocalypto_. Brilliant, if overrated.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._","id":"57ef71f7c3a3683f72000d05","url":"https:\/\/www.themoviedb.org\/review\/57ef71f7c3a3683f72000d05","movie_id":1579}
{"author":"Gimly","content":"A legendary movie for a hangover-day, but one that I will never begrudge others for disliking. This is really not my usual sort of movie, but for whatever reason, _Accepted_ somehow totally works for me?\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5b99c6b10e0a266282000007","url":"https:\/\/www.themoviedb.org\/review\/5b99c6b10e0a266282000007","movie_id":9788}
{"author":"YouShouldKnow","content":"I connected more with the concept a lot. Though the movie is a dramatization (as films are) and therefore it is cliché-laden, colorful and hyperbolic. But it explores an idea.\r\n\r\nWe are raised to follow certain paths, categorized and rejected if we are different and take different paths. What if a place of higher education existed where that wasn't the case?\r\n\r\nThis film explores that idea. A place of informal education and personal growth.","id":"5afb41420e0a262b1100524a","url":"https:\/\/www.themoviedb.org\/review\/5afb41420e0a262b1100524a","movie_id":9788}
{"author":"Milo_Jeeder","content":"In \"Bloody Reunion\", a group of South Korean former class mates are invited to a reunion in a nice cottage located in the countryside. Mrs. Park, an old teacher from elementary school, who happens to be very ill and crippled, wants to see her favorite students reunited again. However, when these former class mates arrive to the cottage, the plot thickens and we realize that Mrs. Park actually wasn't exactly very nice to her students and as a consequence, they still hold a big grudge against her. Unfortunately, the old woman doesn't seem to remember much of it, maybe due to her illness or perhaps it's just a fake reaction in order to cause sympathy and avoid having her head chopped off. The only truth that can't be denied is that Mrs. Park has caused an immense scar on her students and they're all in the mood for revenge.\r\n\r\nEven though I really enjoy Asian horror films for what they are, with their repeated and yet somehow dissimilar premises, I still wanted to see something completely different. If we keep in mind that some of the finest Asian flicks were remade in the United States, frankly, I don't see why we should bash a movie that falls into the slasher category. Especially, if we keep in mind that the ending, somehow turns the whole thing around in a matter of seconds and what seemed to be a slasher at first, quickly turns into a gory drama flick with a big mystery revealed. In order to avoid possible spoilers, that's all I have to say regarding the genre of this film and its ending. While \"Bloody Reunion\" doesn't exactly belong to my all time favorite horror movies, I still appreciate the director's dignified effort of leaving the ghosts aside for a second and mostly focusing on a graciously gory tale about revenge. With some obvious winks to \"Friday the 13th\", this film somehow tricks the audience into believing something that ends up being the complete opposite. Even though I'm not a big fan of these \"incredibly amazing twists\" (notice the sarcasm, please) that horror movies tend to include nowadays, I dislike insulting predictable endings a lot more. These predictable endings are even more blameworthy when we're talking about a slasher or a giallo, which are two horror sub-genres that are mostly captivating because of the mystery and uncertainness. In \"Bloody Reunion\", the ending turns out to be pretty one-dimensional and yet quite dramatic. I will not spoil it, but it's perhaps one of the highest points in the movie and one of the main reasons why \"Bloody Reunions\" separates itself from the typical American slashers.","id":"58a396439251414b70000384","url":"https:\/\/www.themoviedb.org\/review\/58a396439251414b70000384","movie_id":27428}
{"author":"Gimly","content":"Obviously doesn't hold a candle to the original, and some of the acting is pretty genuinely bad, but it knows what it wants and it goes for it. What it wants, here being: To be hamstrung to keeping in step with its predecessor but also being wildly different enough to piss anyone off who was expecting an actual \"remake\".\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"5e21443e397df00016977a8e","url":"https:\/\/www.themoviedb.org\/review\/5e21443e397df00016977a8e","movie_id":9656}
{"author":"John Chard","content":"Ovinaphobia in Wairarapa!\r\n\r\nBlack Sheep, written and directed by Jonathan King is a wonderfully kooky horror comedy filmed out of New Zealand. Premise is simple, genetic tampering by unstable farmer man-child type has produced psychotic zombie sheep who like to chow down on human flesh. If you are \"lucky\" to still be alive after being bitten, you turn into a human\/sheep hybrid - who likes to chow down on human flesh! All inhabitants of this island are doomed unless three spunky young heroes in waiting can overcome monumental odds and save the day!\r\n\r\nWith effects done by Weta being no bad thing, Black Sheep is a whole bunch of popcorn munching fun. Many of the jokes aren't really surprising but they hit the mark because the comedy is drawn nice and broad. It helps as well that much of it carries a sense of mischievous depravity about it, while the snarky asides to scientists and tree hugging environmentalists shows King to have a semblance of world awareness about him. The cinematography (Richard Bluck) is gorgeous, capturing the magnificent landscapes as a backdrop to the ovine carnage, and Victoria Kelly's musical score is jovial supreme.\r\n\r\nNothing earth shattering here, so those horror\/comedy fans who venture in for the first time expecting otherwise will be disappointed. However, at under 90 minutes in length King's movie never once sags in pace or gasp for new comedic air. It's a short sharp shocker of a rib tickler and well worthy of a look if in the requisite mood. 7\/10","id":"534e889ec3a368678200140b","url":"https:\/\/www.themoviedb.org\/review\/534e889ec3a368678200140b","movie_id":3603}
{"author":"John Chard","content":"Eye eye, what we got ere then?\r\n\r\nThere's a running eyeball motif throughout this revamp\/reimaging of Bob Clark's much revered culter of the same name (1974), after sitting through it you may, like me, feel like extracting your own eyeballs and playing ping-pong with them! \r\n\r\nBunch of pretty sorority girls get menaced and mangled by a deranged killer who has come home for Christmas...\r\n\r\nThis lacks everything that made Bob Clark's film so effective. The less is more approach has gone, thus there is very little suspense, and in place is a gigantic back story for the killer. The characterisation of the girls, some acted by some very capable actresses, is practically non existent, so very little emotional heft to draw you into a state of caring for them. There's some good gore on show, but since tonally the pic is all over the place, it's never once scary or ironically funny.\r\n\r\nA poor show all round. 3\/10","id":"560ecce09251414779003c6c","url":"https:\/\/www.themoviedb.org\/review\/560ecce09251414779003c6c","movie_id":9656}
{"author":"CRCulver","content":"DR BRONNER'S MAGIC SOAPBOX is a documentary on the life and thought of Emmanuel Bronner (1908-1997), the German immigrant who made the soap popular with 1960s counter-culture and now alternative people everywhere. Dr. Bronner infamously covered his soap labels with rambling statements in tiny print, preaching the unity of mankind in an \"all-one-god religion\". This is an individual with a fascinating story, well worth a documentary film. He left Germany before the Holocaust (in which his parents perished), worked as a chemist before being hospitalized in Elgin Asylum, and escaped to California to set up the now-famous soap brand. In the 1940s, he had two sons which grew up in foster care, since their father considered his spiritual calling much more important than a couple of children. Jim and Ralph eventually reconciled with their father and inherited the company.\r\n\r\nFilmmaker Sara Lamm has assembled video footage of Dr. Bronner and carried out interviews with his employees and acquaintances, as well as everyday Americans who love his soap. She also follows Ralph (the current owner of the company) as he travels the country, telling stories about his father and turning people on to Dr. Bronner's Soap. While other interviews focus on Dr. Bronner's history of mental illness, Ralph speaks of his father as an eccentric and perennial non-comformist.\r\n\r\nRalph has also tried to emulate his father's sense of idealism, albeit not his religious ideals, and some attention is given to his philantrophic endeavours. It is heartwarming that this head of a multi-million dollar business is so ready to help those he encounters, but I feel that there's too much attention on Ralph's kindness to people in the street, and insufficient attention to the structure of the company. Ralph mentions in passing that it's something of a cooperative endeavour, but we don't really get details.\r\n\r\nStill, except for that quibble, I enjoyed this film greatly. It certainly puts the bizarre labels on the bottles into perspective, and makes you muse on the thin line between incapacitating madness and an eccentricity that still spurs a man on to great things.","id":"5b90b5710e0a2665a8007510","url":"https:\/\/www.themoviedb.org\/review\/5b90b5710e0a2665a8007510","movie_id":45360}
{"author":"Andres Gomez","content":"The cut is a little bit tangled making hard to follow every hop in time.\r\n\r\nOtherwise, script and photography are good and the cast does a good job.","id":"54466f7cc3a368216a000351","url":"https:\/\/www.themoviedb.org\/review\/54466f7cc3a368216a000351","movie_id":15163}
{"author":"John Chard","content":"I'm made of wax, Larry. What are you made of?\r\n\r\nNight at the Museum is directed by Shaun Levy and jointly written by Robert Ben Garant & Thomas Lennon who adapt from the book by Milan Trenc. It stars Ben Stiller, Carla Gugino, Dick Van Dyke, Mickey Rooney, Bill Cobbs, Ricky Gervais, Robin Williams, Owen Wilson and Steve Coogan. Plot sees Stiller as a newly recruited night security guard at the Museum of Natural History, who discovers that an ancient curse causes the animals and exhibits on display to come to life and wreak havoc. \r\n\r\nNot really one night at the museum, but three nights, it's a film that's enjoyable enough if expectation is set at the level for standard family action\/comedy fare. All the elements for such are within, protagonist with something to prove to his son, magical animals and historical characters coming to life; and of course the general malarkey that comes with such a premise. Trouble is is that the premise is stronger than the execution. Sure it's energetic and Stiller makes for a likable loser-cum-hero type, and the effects will no doubt dazzle the kids, but it comes over as an excuse for the latter. Is it fun? Yes, yes it is, when it's in flow, but it does grow tiresome towards the run in and the pay off is as formulaic as it gets. It garnered enough coin to warrant a sequel, something that firms up the belief that the market for action\/adventure\/family movies is currently starved of portions.\r\n\r\nIt's hoped that better directors, and better films, are forthcoming in this genre, so as to show the latest generation of fun seekers that efforts such as this are not high points. 6\/10","id":"5d7e3bd22866fa001139dcff","url":"https:\/\/www.themoviedb.org\/review\/5d7e3bd22866fa001139dcff","movie_id":1593}
{"author":"DoubleUK","content":"In this movie, Ben Affleck shows he has a convincingly knack for comedy. He plays Jack Giamoro, who is heading a big agency for writers and actors in Hollywood. He is married to a beautiful woman (Nina, played by Rebecca Romijn) and takes care of his father, who needs attendance, suffering from a stroke.\r\n\r\nJack secretly attends a course in writing journals in order to get grips with his life. The movie starts with Nina confessing that she has been unfaithful to him. Jack cannot cope with this, especially when he hears that she did it with one of his clients. He throws her out of the house and threatens to end the contract with his client, a very, very successful comedy writer and very important to the agency. What follows is the world of Jack falling apart, his colleagues and friends taking different sides.\r\n\r\nA rejected Chinese screenwriter tries to get back at him by exposing the fraudulent basis on which the agency is founded. A burglary, a really horrendous but very funny dental job, John Cleese making easy money as a teacher and an audition of 'Basic Instinct'. It's all there and more.\r\nThis movie is at times funny, hilarious, touching but all the time convincing and engaging. I loved it.\r\n\r\nIf you had your doubts about Ben's comedic skills, see this flick. You won't regret it.","id":"589d773f9251412cc3005b79","url":"https:\/\/www.themoviedb.org\/review\/589d773f9251412cc3005b79","movie_id":9784}
{"author":"Gimly","content":"Not one of Broken Lizard's strongest entries, but perhaps classic viewing for those in the state that it's characters are: Drunk.\r\n\r\n_Final rating:★★½ - Not quite for me, but I definitely get the appeal._","id":"5a6940bc9251414a2e009179","url":"https:\/\/www.themoviedb.org\/review\/5a6940bc9251414a2e009179","movie_id":9988}