{"author":"Gimly","content":"Doesn't hold a candle to Broken Lizards magnum opus: _Super Troopers_, but still an entertaining movie. _Club Dread_ leans real damn hard into the \"comedy\" side of this horror\/comedy, but that was probably the better way to play Broken Lizards particular sensibilities.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5a693ebf9251414a2e008fb5","url":"https:\/\/www.themoviedb.org\/review\/5a693ebf9251414a2e008fb5","movie_id":11217}
{"author":"tmdb39513728","content":"**Menage a Quatre**\r\n\r\nYou may like _Closer_ because of its flawed characters and their doomed relationships. I like it because it's square. The assorted combinations of love and friendship, scorn and resentment, among two males and two females are literally geometrical. Typically, the dependable love triangle pits three characters together, often a heterosexual convention establishing a male lead zig-zagging between two females, or a female lead choosing between two male suitors. What if we include an extra character? How many triangles can be made with four individuals? Four! And _Closer_ expertly covers them all. Next time you see it, draw out a square with each character occupying a corner. Then connect each of the couplings and triangles as they occur, beginning with Julia-Jude-Natalie. Jude falls for Natalie, introduces her to Julia who gets intimate with her camera. The Jude-Clive-Julia triangle is a clever one. Clive is introduced when Jude seduces him online pretending to be Julia who he meets at the aquarium. Often when a movie script or stage play adheres to a strict formula, it turns out flat and predictable. Not _Closer_. Applying a quadrangular network forces each character to cover all the bases, tagging up every way possible, pushing each juncture to the limit.","id":"54d1fa7f9251411b650022cf","url":"https:\/\/www.themoviedb.org\/review\/54d1fa7f9251411b650022cf","movie_id":2288}
{"author":"Andres Gomez","content":"The thrill and drama is tasted from the first minute and Brühl, Diehl and Mühe do a really good job but it is somehow slow and the promise of the suspense is not completely delivered.\r\n\r\nIt had potential but it was not totally well developed.","id":"547d99b4c3a3685aed005a78","url":"https:\/\/www.themoviedb.org\/review\/547d99b4c3a3685aed005a78","movie_id":1962}
{"author":"John Chard","content":"I'm not a gangster, just a businessman. And my commodity happens to be cocaine.\r\n\r\nWith a considerable amount of cash saved from his, ahem, dealings. A London drug dealer is all set to retire abroad and start a new life. However his mob boss Jimmy Price has two jobs for him to do immediately...\r\n\r\nLayer Cake is directed by Matthew Vaughn. Vaughn is more well known as Guy Ritchie's producer on his early British gangster genre forays. Suffice to say he had some insight into what made those films {Snatch et al} hugely popular with the watching British public. How pleasing it is then to say that Vaughn, by showing restraint and an unfussy approach, has crafted a film that's more than equal to the best of Britain gangster faves, and actually sets new parameters for toning a film. By focusing more on mood and atmosphere over bombastic scenarios, Vaughn, aided by a superlative Daniel Craig as the nameless dealer, lifts the film above its conventional plot arc. In what could have been a standard tale of a man doing one last job before going straight, we, along with Craig, find that all roads are blocked, it's as if there is some higher force at work here.\r\n\r\nLayer Cake also scores high for its more easy on the eye filming of London, this is no destitute capital where tower blocks loom like monsters over the characters. This London is thriving, vim and vitality, the place to be, seediness is far from the ebullient crowd. Ben Davis' photography perfectly complimenting the engrossing score from Lisa Gerrard & Ilan Eshkeri, both of which serve to make London an extra character in the story. The film however is not perfect, at 105 minutes it's actually too short, something that only becomes apparent when all the plot strands come crashing together in a rushed last quarter. Yet in spite of that failing, the ending delivers a jolt to the system, to crown, what to me at least, is one of Britain's finest and tidiest gangster offerings. 9\/10","id":"553ea0e99251416874008083","url":"https:\/\/www.themoviedb.org\/review\/553ea0e99251416874008083","movie_id":4836}
{"author":"Wuchak","content":"***Inventive drama\/romance with Jim Carrey, Kate Winslet and so much more***\r\n\r\nA man (Jim Carrey) discovers that his babe (Kate Winslet) had her memory of their relationship removed via the medical procedures of an innovative company. He decides to get the surgery as well, but as the technicians (Mark Ruffalo & Elijah Wood) conduct the procedure he changes his mind! Can he escape with his memory intact and possibly save the relationship? Tom Wilkinson plays the doctor and Kirsten Dunst the secretary.    \r\n\r\n“Eternal Sunshine of the Spotless Mind” (2004) is a drama\/sci-fi\/romance hybrid that’s so confusing during its first half that it fails to captivate (and is even annoying) but, if you persevere, everything starts making sense by the midpoint, ushering in an entertaining and insightful second half. The movie’s depth naturally makes it improve on repeat viewings wherein it’s more understandable as you put the pieces together.  \r\n\r\nViewers who complain that a certain person is too dramatic, selfish and high maintenance to put up with for more than a month didn’t get the closing moral, which is both true and profound: Couples can (and should) realize the flaws of their mate, which they genuinely don't like, but it's \"Okay.\" That's true love.\r\n\r\nThere are also unexpected peripheral gems on unethical behavior in a supposedly professional environment, secret relationships, discarding unwanted skeletons, and more. Lastly, curvy, vivacious Winslet shines and it’s nice to see Carrey in a serious role.\r\n\r\nThe film runs 1 hour, 48 minutes, and was shot in the New York City area (Yonkers, Montauk, Mount Vernon, Manhattan and Brooklyn).\r\n\r\nGRADE: A-","id":"5dd59a03d55c3d0014327096","url":"https:\/\/www.themoviedb.org\/review\/5dd59a03d55c3d0014327096","movie_id":38}
{"author":"Andres Gomez","content":"Fresh and surprising with great script, dialogues and cut. The cast is also fantastic.","id":"54d9b1829251410a4b00101e","url":"https:\/\/www.themoviedb.org\/review\/54d9b1829251410a4b00101e","movie_id":38}
{"author":"John Chard","content":"He is the irrepressible spirit of youth.\r\n\r\nUnder pressure due to his success, in a token socialite marriage, playwright J.M. Barrie is less than enamoured with his lot. Then whilst out walking his dog in Kensington Gardens, he meets widowed Sylvia Llewelyn Davies and her four young sons, George, Jack, Peter and Michael. It is the start of a long lasting friendship that revitalises Barrie and brings about his masterpiece, Peter Pan.\r\n\r\nOK, lets get the grumble out the way, you know the one, the one that so many are quick to mention. No this is not a definitive take on J.M. Barrie and this time in his life. Much like Allan Knee's play, \"The Man Who Was Peter Pan\", from which this is adapted, there are liberties taken and it's most definitely chronologically unsound.\r\n\r\nBut this is not a biography is it? This is basically asking what sort of man conceived the magical world of Peter Pan? It's a celebration of childhood, life, whimsically asking us if it's wrong to keep the inner child in us all locked away as adulthood takes control? A tale of comedy blended with tragedy, from which glorious art is born to live long and forever, the kind that will be touching generations long after we have left this mortal coil.\r\n\r\nElegantly crafted by director Marc Forster and his screenwriter David Magee, Finding Neverland could so easily have given way to over sentiment and floundered in the search for emotional kickers. Yet it doesn't because Forster (immeasurably aided by the lush cinematography by Roberto Schafer) has created a quaint Victorian world, a world where fantasy is never far away. What emotion is here (and there is lots of it) sits perfect within this setting. We are actually being asked to be Barrie himself, the makers daring us to not be swept up in the magic being born. Wonderful, wonderful stuff.\r\n\r\nJohnny Depp is perfectly cast as Barrie, delicately fusing childish playfulness with inner sorrow, Depp doesn't put a foot wrong. It will be a crime if this multi talented actor doesn't finish his career with the highest acting honour on offer, the Academy Award for Best Actor (nominated three times, including this performance), it's practically impossible to imagine another actor in this generation nailing the role of Barrie like Depp does. Playing off him expertly is Kate Winslet as Sylvia, raw and honest like, it's emotionally driven and gnaws away at the audience's heart strings. Yet it's young Freddie Highmore as Peter that steals the show. Very much the film's heart, his relationship with Barrie has a grace about it, with Highmore (just 12 at the time) able to portray a subtle tenderness that drives the relationship forward.\r\n\r\nNominated for seven Academy Awards (including Best Picture), Finding Neverland won just the one for Jan Kaczmarek's poignant score. It matters not, because to me at least, this will forever be a personal favourite film. Something that just like Peter Pan himself, will never ever get old. 10\/10","id":"5ea13db50b5fd6001a813acc","url":"https:\/\/www.themoviedb.org\/review\/5ea13db50b5fd6001a813acc","movie_id":866}
{"author":"Per Gunnar Jonsson","content":"When I sat down to watch this movie last evening I expected a fairly ordinary direct-to-video (actually it was released to cinema in France) action movie with Jean-Claude Van Damme that would, at best, be somewhat entertaining. Well I was wrong. After having watched the movie I had to say: Wow that was a good movie! Now the threshold for that wow was of course a bit lower than usual since I was not expecting that much from the movie but still, this is a surprisingly good movie.\r\n\r\nSure it has its silly moves and plot holes like most movies of this kind but it is miles away from the usual brain-dead run-of-the-mill action movie.\r\n\r\nFirst of all, Jean-Claude Van Dame makes a quite decent, even good, performance. Personally I am not much for these sentimental cry-scenes but Jean-Claude manages to make these parts well and at the same time he is brutally cool when he is out seeking his revenge.\r\n\r\nThe action in the movie is also very enjoyable whether it is car chases, motorcycle chases or martial art displays. When it comes to the latter Jean-Claude proves that he is still good at making these scenes unlike for instance Steven Seagal who mostly stands in one spot waving his hands while trying to hide his beer belly. At times the movie is quite cruel. There is a torture scene which is really good without being unnecessarily graphic. Speaking of graphics, the entire movie is well shot. The cinematography is simply very good. I would even say that for this kind of movie it is great. At times this is a very dark movie and those parts of the movie are really the best.\r\n\r\nFor me this was a very positive surprise and I found this movie very well worth watching","id":"546618e90e0a264a3c00019e","url":"https:\/\/www.themoviedb.org\/review\/546618e90e0a264a3c00019e","movie_id":14172}
{"author":"Per Gunnar Jonsson","content":"There is absolutely nothing special about this movie. It is average all the way. It is however a decent enough off-the-shelf action flick which fulfils its purpose. That is to provide an hour and a half of decent entertainment.\r\n\r\nOur hero comes back from being away for quite a while and finds the bad guys are in control. A pretty classical story which have been used since the first movies were made (and even before that). The movie can easily be said to be a modern day Western movie as far as the story goes.\r\n\r\nOur hero, Dwayne Johnson, is doing a decent job of being a hero. The actions scenes, which is really why you are watching this movie after all, are reasonably well done. Of course they are more of TV-movie quality than anything else but good enough in the context of this movie.\r\n\r\nThe movie plays out more or less exactly as you would expect. Hero comes home, find bad guys in control, gets into shuffle with bad guys, bad guys tries to take on hero via family and friends, fails, hero goes after main bad guy in a long chase\/fight, happy ending, roll after texts. As I wrote, it could just as well have been an old Western movie. The traditional western saloon is replaced by a casino and the whisky and cattle is replaced with crooked gambling and some modern drug dealing.\r\n\r\nThe one part I though was silly, as in bad silly, was the trial in the first half of the movie. Warning, spoiler ahead! I mean, come on. Hero demolishes Casino and gets put on trial, hero shows jury his scars and asks to get a non-guilty verdict, jury happily obliges him. What the f…?\r\n\r\nApart from this the movie completed its mission of knocking and hour and a half off my life while keeping me from being bored in front of the TV.","id":"541be75b0e0a260e98002d66","url":"https:\/\/www.themoviedb.org\/review\/541be75b0e0a260e98002d66","movie_id":11358}
{"author":"Sheldon Nylander","content":"Baloney sandwich with a side of baloney! Pretending at first to be about quantum mechanics it starts out innocently enough, seeming to look at small curiosities of \"science.\" It isn't long before it takes a hard left into full-blown crap, ultimately ending in a cultish world view as a precursor to \"The Secret,\" another \"documentary\" steeped in psuedoscience. This is not a documentary about quantum mechanics but rather a gross, gross distortion of it. I really wish I had known more about this film before sitting down to watch it. Like \"The Secret,\" avoid if you value your brain cells.","id":"5d6dadebefcea959189aabbe","url":"https:\/\/www.themoviedb.org\/review\/5d6dadebefcea959189aabbe","movie_id":8357}
{"author":"Reno","content":"**The two shades of white!**\r\n\r\nI've heard this film a long ago, but I never interested to watch it. We can't avoid them, because when we look for a particular type of film for the occasion, they will pop-up and that is how I watched this now. I know it is a silly comedy, because in a real world this thing never happen. So knowing this is only for cinema, I prepared to enjoy whatever it offers. But I must say, even though my rating is not big, I kind of enjoyed it.\r\n\r\nNobody watches this without knowing its synopsis. So you will already know the fifty per cent of the story when you do. The rest is how it is developed; including how good the jokes are that comes with our watch. So much cliché, but entertaining with some good scenes and lines. The actors were excellent. The make-ups were not flawless, but worked okay, especially for a comedy. Because if there is an error, it will going to appeals from the comedic side.\r\n\r\nSo the overall film was better than what I presumed all these years. Glad I saw it, it's nothing like those silly comedies I've seen. I've seen many imposter themes, but this is refreshing. All the above, this is a one off film, that's the best thing about it. You know, sequels are what degrades the original film in most of the scenarios. Thanks for that, there's no follow-up for this with a B movie cast and crew. This is a very much watchable film, not comedy riot, but fairly does its job.\r\n\r\n_6\/10_","id":"57ed883fc3a3686d050003aa","url":"https:\/\/www.themoviedb.org\/review\/57ed883fc3a3686d050003aa","movie_id":12153}
{"author":"John Chard","content":"It's yours, take it. \r\n\r\nTrojan prince Paris is not only having an affair with Spartan Menelaus' woman, Helen. He also lures her away to live with him in Troy. Thus giving the global domination obsessed King Agamenon the launch pad to war with Troy. Which in turn brings into conflict Spartan hero Achilles and Hector of Troy, two of the greatest warriors that ever lived.\r\n\r\nTroy, budgeted at $175 million, and given to director Wolfgang Petersen with orders to craft a swordplay epic based on Homer's Illiad, is not the truly great picture it really should have been. It is, however, a spectacle of sorts, that by way of the extended directors cut, becomes a fine enough addition to the genre it so clearly wanted to crown.\r\n\r\nThe problems are evident from the off. The casting of Brad Pitt as Achilles always looked to have been based purely on looks. Nicely toned body and brooding close ups do not a warrior make, and thus, as good an actor as Pitt definitely is, this is a role (and genre) too far. Diane Kruger as Helen is under written, which since at the time was a poor actress yet to bloom turns out to be a bonus here, and Orlando Bloom playing the wimp like Lothario Paris the way he should do - still gets out acted and swamped by all around him. The other main problem is how uneven the story telling is. Petersen looks confused as how to condense the Trojan war in the running time, whilst also juggling the emphasis of the two great warriors at its core. That Eric Bana's excellent portrayal of Hector comes through the jumble is a testament to Bana's ability and nothing else.\r\n\r\nThe good is, well, rather good though. Agamemnon, courtesy of a nasty turn from Brian Cox, is well formed. It gives the picture a reason for being outside of it being a war about some bloke stealing a woman from another bloke. Imperial cravings and a genuine thirst for blood helps lift Troy out of the rocky waters it had found itself in. Peter O'Toole, Brendan Gleeson and Sean Bean do fine work with what little they have got, and the production values on offer are hugely impressive. The fight sequences impact and are full of gusto. The fight off between Hector and Achilles is superbly choreographed (fought out to a score that James Horner has lifted from the one Danny Elfman used for Planet Of The Apes three years earlier) and the battle between the armies outside the walls of troy sits with the best in the genre. CGI is often called the bane of cinema, but when used so well as it is here (see the ships approaching Troy for instance) it proves to be an effective and entertaining tool.\r\n\r\nTroy has problems, of that there is no doubt. But come the end one knows that it has been entertained, one knows that this was a time of heroes. So with that, and the knowledge that the film made a profit of just over £320 million worldwide, Petersen can smugly sit in his chair musing it was job done. 7\/10","id":"5e80ba0daf85de0019603497","url":"https:\/\/www.themoviedb.org\/review\/5e80ba0daf85de0019603497","movie_id":652}
{"author":"Wuchak","content":"***\"Where does it end?\" -- \"It never ends.\"***\r\n\r\nIf Homer's mythical epic \"The Iliad\" is based on a factual story, that story is magnificently depicted in Wolfgang Petersen's 2004 epic \"Troy.\" In other words, don't expect any goofy 'gods' or 'goddesses' like Athena popping out of thin air because \"Troy\" is a realistic portrayal of the Trojan war.\r\n\r\nMore than that, \"Troy\" is arguably the best sword & sandal epic ever put to film. You name the picture -- \"Samson and Delilah,\" \"Spartacus,\" \"Ben-Hur,\" \"Ulysses,\" \"The Viking Queen,\" “Conan the Barbarian,” \"Braveheart,\" \"Attila,\" \"The Odyssey,\" \"Gladiator,\" etc. -- \"Troy\" is superior. At the very least it’s as good as some of the better flicks just noted, like \"Ben-Hur,\" and far edges out \"Spartacus\" and \"Samson and Delilah.\" As for more recent sword & sandal epics, like the overrated \"Braveheart\" or \"Gladiator,\" \"Troy\" blows 'em out of the water. \r\n\r\nRoger Ebert is a great writer and critic, but his mediocre review of \"Troy\" is all wrong. Ebert's major criticisms, believe it or not, are the main reasons I have such high respect for this film: He complains that Petersen omitted the many Greek 'gods' & 'goddesses' and gripes that the actors perform their roles as believable people and not larger-than-life caricatures. This can, of course, be respectably done, as in the 1955 film \"Ulysses,\" but this is not what Petersen was shooting for in \"Troy.\" His goal, as already noted, was to depict the actual Trojan War on which Homer's myth is based. (Even if it never really took place, wars LIKE IT did).\r\n\r\nRegarding Brad Pitt's heavily criticized performance as Achilles, I couldn’t care less about Pitt until seeing this movie as he does an outstanding job portraying Greece's greatest warrior. No, he's not the bulkiest warrior to ever grace the earth, but he's fast as lightning, confident, expertly skilled and deadly accurate. Even his voice completely fits the role. Eric Bana (from \"Hulk\") is also great as Hector, Achilles' Trojan counterpart, who's sick of war and just wants to live a life of peace with his family. These two have a showdown in the film and it is without a doubt the greatest mano-a-mano sword & sandal duel ever filmed.\r\n\r\nWhat's interesting about the picture is that you never really end up rooting for one side or the other. When Achilles and Hector have their powerful face-off, my wife and I couldn't decide for whom to root. Maybe that's the point. Don't get me wrong, Agamemnon could be viewed as the villain in this picture, and I wasn't rooting for Menelaus when he fights Paris (Orlando Bloom, who seduces Helen, Menelaus' wife), but neither the Greeks nor the Trojans are painted as the 'good guys' or 'bad guys.' They're just people at war, and in war there's no real glory, as Hector points out... and it never ends, as Achilles states. An additional point is that living in a state of war is a JOYLESS existence. And both Bana and Pitt get this across well.\r\n\r\nAs for beautiful women, there are only a couple mentionable: Diane Kruger plays Helen, \"the face that launched a thousand ships.\" Some have complained that she's too plain for the role, but I disagree. I’m not a fan of hers or anything, but she looks pretty dang sharp to me (not to mention has an impressive behind shot). Besides, beauty is in the eyes of the beholder. If Paris deems her worthy of starting a war, who are we to disagree? Also on hand is cutie Rose Byrne who plays Briseis, the virgin priestess whom Achilles converts to the pleasures of the flesh.\r\n\r\nI should point out that \"Troy\" was one of the most expensive pictures ever made at the time and it definitely SHOWS on the screen. Make no mistake, \"Troy\" is breath-taking just to WATCH -- the colossal armies, ships and battles are awe-inspiring to behold, not to mention the Maltan and Mexican locations. And the CGI effects are outstanding for the time, not fake-looking like the Rome & Coliseum scenes in \"Gladiator.\" \r\n\r\nAnother complaint by Ebert is that the dialogue is lousy; nothing could be further from the truth. There are great pieces of dialogue interspersed throughout, including Achilles' comment that the 'gods' envy people because we're mortal and \"Everything's beautiful because we're doomed.\" Thankfully, there's not one goofy one-liner anywhere to be found.\r\n\r\nJames Horner's score should also be mentioned. If you enjoyed the soundtrack of \"The Passion of the Christ\" you'll love this one because it's just as good\/serious\/reverent\/powerful. For instance, the intense percussion during Achilles and Hector's showdown is magnificent.\r\n\r\nInterestingly, Brad Pitt, who plays Achilles, injured his Achilles tendon during shooting. Fitting, no? \r\n\r\nFINAL WORD: If you're in the mood for a sword & sandal epic, \"Troy\" more than fills the bill. The story captivates from the get-to and never lets up the entire 2.5 hour runtime (technically 2 hours, 42 minutes, with credits). It extravagantly visualizes the Trojan War for you, something I never did until seeing this mind-blowing, outstanding piece of cinema.\r\n\r\nGRADE: A+","id":"5dc6e3177d2bc10011434879","url":"https:\/\/www.themoviedb.org\/review\/5dc6e3177d2bc10011434879","movie_id":652}
{"author":"dave_buffalo","content":"A clever and sexy non-linear love-story \/ love-triangle that definitely has to be viewed twice in order to understand the correct linear sequence of events.\r\n\r\nThe women will love Josh Hartnett and the men will love both Diane Kruger and Rose Byrne.  Personally, Diane Kruger makes this movie for me, and her beauty and sex appeal is off the charts.\r\n\r\nIt's a fun movie that just wouldn't be possible if they all had cellphones, but try not to think about it!  Don't forget to watch it twice.  The 2nd time will be the \"ahh ha\" moment for you, trust me.","id":"5cef245d0e0a2615b5cbbfdb","url":"https:\/\/www.themoviedb.org\/review\/5cef245d0e0a2615b5cbbfdb","movie_id":11208}
{"author":"AusFem","content":"**SENSATIONAL**\r\n\r\nGreat cast, fantastic music, beautiful storyline. Can't help but watch it over and over. The music just stays with you and haunts you for days after.\r\n\r\nThe Phantom just draws you in... this movie has everything going for it. It's a drama, comedy and romantic, and a great looking cast. The stage production was fabulous, it's so much better watching it on the big screen. \r\n\r\nThe phantom being the villain, you just feel for him and his love for Christine. Not to mention that fact that he's so hot. That's something I wasn't expecting. I couldn't keep my eyes off him. \r\n\r\nThe movie is stunning, the music absolutely superb. The cast WOW especially Gerard...what a hunk. \r\n\r\nI must say I bought the DVD, which had extras of the original phantom with the original stage cast. The movie I think is so much better. Gerard is superb, his emotional state was so believable. As were the rest of the cast. I still cry at the final scene.\r\n\r\nDefinitely a movie to watch and don't forget the tissue.\r\n\r\nA wonderful love story. Andrew Lloyd Webber is a genius and I've fallen in love with Gerard.\r\n\r\n(This was my only IMDB review and I pinched it back)","id":"58ace1b69251411fcc001bf4","url":"https:\/\/www.themoviedb.org\/review\/58ace1b69251411fcc001bf4","movie_id":9833}
{"author":"Wuchak","content":"***Some kids with creepy dead eyes take a dreamlike trip to the North Pole on The Polar Express*** \r\n\r\nA boy from Grand Rapids, Michigan, is at the age where he no longer believes in Christmas, as far as Santa, his elves and flying reindeer go, but a magical train appears in front of his home on Christmas Eve and whisks him away on an adventurous trip to the North Pole with several other kids.\r\n\r\n“The Polar Express” (2004) was based on the 1985 Christmas book and was the first mainline movie to use motion capture animation for all its characters beginning to end (think Gollum from “The Lord of the Rings” trilogy). Some people think the animation is weak, but I feel it creates its own world and has its own charm. It holds up as long as you can adapt to those creepy dead eyes of the characters.\r\n\r\nSome people love this movie while others think it’s weird, like a Twilight Zone Christmas flick. Roger Ebert, for instance, loved it and gave it a perfect grade. I’m sorta in the middle. I see its good points and appreciate them, like the haunting winter ambiance, parts of the trip to the North Pole (e.g. the quasi-rollercoaster ride) and the kids’ investigation of the Christmas factory. But there are some meh parts and dubious sections like the whole last act with the multitude of elves and the towering Santa who looked like he was modeled after 6’5” Christopher Lee with a pillow strapped to his mid-section.\r\n\r\nThe movie’s interesting in some ways but also quaint in a cheesy way, as well as peculiar and lifeless.\r\n\r\nThe film runs 1 hour, 40 minutes.\r\n\r\nGRADE: C","id":"5c01842c0e0a262cfb07771b","url":"https:\/\/www.themoviedb.org\/review\/5c01842c0e0a262cfb07771b","movie_id":5255}
{"author":"John Chard","content":"Hardly Kissing Cousins.\r\n\r\nKenneth Bianchi and Angelo Buono were two cousins who were convicted of the rape, torture and murder of 10 females of various ages in LA 1977\/78. This film is an interpretation of their reign of terror.\r\n\r\nUnpleasant. If you are going to do a serial killer movie, one based on real life perpetrators, then you surely have to make the characterisations of fascination value away from their despicable crimes. Unfortunately director Chuck Parello and co-writer Stephen Johnston fail to do this, leaving the film with a paucity of worthwhile human story moments. It’s not helped by the fact Nicholas Torturro as Buono is badly miscast, he’s just impossible to take serious in a role that calls for the ultimate seriousness. \r\n\r\nOn the plus side, C. Thomas Howell as Bianchi hits the right notes. Howell is something of an undervalued actor in dark roles, as far back as 1990 where he played a vengeful killer in a film called Kid, he’s been doing good moody work in thrillers. Elsewhere John Pirozzi’s cinematography is on the money, keeping the murky tones of the film in harness, while Gregg Gibbs’ production design has all the late 1970s requisites. 5\/10","id":"547bc3eac3a3685afd00142a","url":"https:\/\/www.themoviedb.org\/review\/547bc3eac3a3685afd00142a","movie_id":24196}
{"author":"Wuchak","content":"_**Great psychological study**_\r\n\r\nReleased in 2004, \"The Woodsman\" tells the story of Walter (Kevin Bacon) who's trying to make a life for himself in Philadelphia after spending 12 years in prison due to his abnormal predilection for 10-12 year-old girls. When news gets out of why he was in prison it causes problems with his girlfriend (Kyra Sedgwick) and at his new job. Walter desperately seeks healing from his condition even while he occasionally flirts with his sick desires. On top of this is Walter's parole officer who doesn't believe the ex-con can be trusted in conventional society. Meanwhile Walter spots a pedophile preying on kids near the local elementary school. What should he do? And is there any hope for him to escape his condition?\r\n\r\nThere are two things potential viewers should know up front: Walter is aware of his problem and desires freedom from it. In other words, he's repentant: He WANTS to turn from his negative desires and channel his sexual energy positively and responsibly. Secondly, it becomes clear that Walter is not guilty of raping any girls but rather molesting them. Yes, it's still bad, but not as bad as raping or killing. These are important points which help the viewer have compassion on Walter and root for his success (because, if he was impenitent or guilty of actually raping or killing girls, then please fry his butt and get it over with; or, at least, lock him up and throw away the key).\r\n\r\nAs noted in the title blurb, the film is a dramatic psychological study. It spotlights the classic struggle of flesh & spirit or id & superego. It's dialogue-driven and plot-driven rather than action-driven or cgi-driven. In other words, this is a thinking-person's drama.\r\n\r\nIn a way, Walter's struggle is universal and most of us can relate to it on one level or another. For example, we may not have a predilection for tweenage girls but we might struggle with other destructive tendencies, like alcoholism, drugs, adultery, fits of rage, porn addiction, gluttony, sloth, depression, lying, etc. The film subtly makes it clear that without love & belief there's little hope of spiritual metamorphosis.\r\n\r\n**MINOR SPOILER** (The next two paragraphs explore one of the main insights of the story and comments on one important scene).\r\n\r\nOne of the main points of the film is distinguishing a repentant pedophile from a non-repentant one. Walter has come to a place where he understands that his pedophile desires are of his flesh (id or destructive carnal nature) and should not be embraced, fed and acted upon (although, again, he flirts with the idea on a couple occasions). Walter KNOWS that to take advantage of young girls to get his jollies is wrong, and is trying to walk free of such desires. This is contrasted by the predatory pedophile who hangs out by the school preying on boys. This guy obviously embraces, feeds and acts on his pedophile desires. There's a big difference between these two. The attitude of the heart makes all the difference. Walter deserves a second chance because he's repentant and trying to change for the positive, even while he should be monitored closely. The other guy, on the other hand, has totally given himself over to his perverted desires and deserves the snot beat out of him.\r\n\r\nOne critic argues that it's not realistic that a 45 year-old guy sits on a bench in the park and a cute 11 year-old girl sits herself next to him and asks, \"How's the view?\" But, wait a second, Walter had previously met the girl so she was already familiar with him; he didn't hurt her before, why would he hurt her now? Besides, the girl comes from a dysfunctional home where she suffers molestation from her dad; hence, it's not likely that she has the best understanding and discretion concerning social situations, not to mention her inner need and compulsion for undefiled masculine love and attention. In addition, Walter was obviously drawn to and comfortable around girls, which helped make the girl feel safe around him.\r\n\r\nBe sure to catch the deleted scene of Walter and Robin's discussion at the bench. The fuller version should never have been deleted; you'll see why when you compare the sequences.\r\n\r\nAnother criticism is that the film is melancholy and plays out in a flat manner. This is true but don't you think a bit o' melancholy fits the subject matter? As for the story being flat, the filmmakers (Nichole Kassell and Steven Fechter) were obviously shooting for realism. Isn't real life kind of flat? Personally I prefer realism over the goofiness, overkill action\/cgi and generally unbelievable tone of many modern “blockbusters.”\r\n\r\nInteresting tidbit: Kevin Bacon and co-star Kyra Sedgwick have been married since 1988 and have 2 children.\r\n\r\nFINAL WORD: As long as you can handle the subject matter and a couple of cringe-inducing spots, \"The Woodsman\" is outstanding if you're in the mood for a serious drama or psychological study.\r\n\r\nThe film doesn’t overstay its welcome at a mere 1 hour, 27 minutes, and was shot on location in Philadelphia.\r\n\r\nGRADE: A-","id":"5ebd85c1c50ad2002585e787","url":"https:\/\/www.themoviedb.org\/review\/5ebd85c1c50ad2002585e787","movie_id":9692}
{"author":"allanjv","content":"Paige Morgan (Julia Stiles) tem seu futuro perfeitamente esquematizado. Trabalhando duro para alcançar seu objetivo de se tornar uma médica que viaja pelo mundo para ajudar os carentes, a aluna da Universidade de Wisconsin jura que nada vai atrapalhar o seu sonho. O que ela não esperava era conhecer Eddie (Luke Mably), um estrangeiro fascinante que, sem que ela tenha conhecimento disso, é, na verdade, Edvard Valdemar, o príncipe da Dinamarca!","id":"519ada0b760ee32c39034f06","url":"https:\/\/www.themoviedb.org\/review\/519ada0b760ee32c39034f06","movie_id":11137}
{"author":"Wuchak","content":"Love vs. cold analytical thought\r\n\r\nRELEASED IN 2004 and directed by Joseph Ruben, \"The Forgotten\" relays the story of Telly (Julianne Moore), a mother who discovers all traces of her deceased 9 year-old son have been erased, including photos, videos, documents and the memories of other people. Her psychologist (Gary Sinise) and husband tell her she's delusional, but she KNOWS otherwise. Thus begins a thrilling search for the truth wherein she teams-up with Ash (Dominic West) and tangles with NSA agents and more.\r\n\r\nThe reviews to “The Forgotten” couldn't be more opposite, which isn't necessarily a bad thing since some of the best artistic items polarize opinion. The film admittedly has weaknesses and those who don’t like it zero-in on these flaws.\r\n\r\nIn style, it is similar to \"The Mothman Prophesies\" (2002), but not as good, intricate or artistic. There are similarities to The X-Files with the two protagonists, one being a female redhead, searching for the truth in what is essentially a sci-fi\/mystery tale with the government somehow being involved.\r\n\r\nBecause of the highly mixed reviews I was watching the first 15 minutes only half-attentive, but when Telly (Moore) confronts Ash (West) and subsequently teams-up with him my attention perked up. Ash is an ex-NHL player who's given up on life and turned to alcohol to drown out his sorrows. What tragic event happened that would cause him to throw in the towel and turn to the bottle? I'll leave that to you to discover.\r\n\r\nAnyway, remember the great masculine actors of the past, like Charlton Heston, Clint Eastwood, Burt Reynolds and perhaps even Marlon Brando? There was just something about them that set ’em apart and made you take notice when they were on screen. Dominic West is such an actor. He's reminiscent of James Remar, whom you might remember as Ajax in \"The Warriors\" (1979).\r\n\r\nThe subplot of Ash's drunkenness struck a chord with me because I know people, incredibly talented people like Ash, who've essentially given up and given in to alcohol, wasting their lives away. Not to mention the fact that I've been seriously tempted to give up as well at times (albeit not to alcohol). I can relate and I'm sure you can too.\r\n\r\nAs noted, the film is a sci-fi\/mystery tale and therefore the explanation (no spoilers) is rather outlandish, but not necessarily unbelievable. \"Flightplan\" (2005) was a similarly-themed film; although its explanation was not outlandish, just totally unbelievable. So if you can't handle outlandishness I suggest you forget \"The Forgotten.\"\r\n\r\n\"The Forgotten\" is essentially a story of love v.s. cold analytical thought. Personally I fall right in the middle between these two dynamics. This conflict is what made the character of Spock so fascinating. Remember the Star Trek episode \"This Side of Paradise\" where he was able to walk free of his strict adherence to logic and experience the warmth & joy of love for the first time? At the end of the episode he sadly states that it was the first time in his life that he was truly happy.\r\n\r\n\"The Forgotten\" is a story of tortuous struggle and potential triumph, for both Telly and Ash. Although logic is important, love is more powerful. Not to mention warmer and life-inducing.\r\n\r\nThe film is short and sweet at a mere 1 hour and 26 minutes before credits. The DVD features an extended cut with an alternative ending wherein the possible conspiracy is less malevolent. Watch the theatrical cut first and then simply go to the deleted scenes section and watch the two deleted scenes and the alternate ending (unless you want to watch the ENTIRE film twice, that is; it's just not necessary). I'll say this: the kissing scene should have never been omitted. It works. But perhaps the filmmakers didn't want to paint Telly as a potential adulterer, which isn't a bad thing.\r\n\r\nDon't listen to the grumps who didn't 'get' \"The Forgotten.\" The reason they didn't 'get' it is because their pendulum veers too heavily toward cold logic, but they don't have to stay that way. :)\r\n\r\nTHE MOVIE RUNS 1 hour, 39 minutes and was shot in the New York City area. WRITER: Gerald Di Pego.\r\n\r\nGRADE: B\/B-","id":"5b3918810e0a2675e0005f78","url":"https:\/\/www.themoviedb.org\/review\/5b3918810e0a2675e0005f78","movie_id":10145}
{"author":"narrator56","content":"Welcome to the murky middle ground where legend and history meet. I enjoyed this movie as an earnest attempt to tell this iconic legend in a slightly different way. Its variance from the legend may make cinema purists uncomfortable, but I have read a lot about the Alamo over the past 40 years and don't feel threatened by it. History, after all, is written by the winners. I think the last scene with Davy Crockett is based on a book by a Mexican soldier, but I am not 100% sure. Some historians suggest the battle was begun while everyone slept and was over in minutes. The first best selling biography of David Crockett (his descendants say he never went by Davy, that that was a Walt Disney concept) may have made up some of the legend now accepted as nearly factual.\r\n\r\nI like the line Billy Bob Thornton as David Crockett gives about the burden of being Crockett, the legendary Crockett, that is, rather than the private Crockett he is not allowed to be. It is just as well that the battle turned out to be such a rallying cry for Sam Houston's army, because it doesn't feel like it accomplished much else. Well, except for providing material for an entertaining movie, that is.","id":"5e89c6b5d207f3001898caf5","url":"https:\/\/www.themoviedb.org\/review\/5e89c6b5d207f3001898caf5","movie_id":10733}
{"author":"tmdb44006625","content":"Thomas Jane and John Travolta are good in this, but man is The Punisher one stupid movie.\r\n\r\nI'm willing to suspend my disbelief quite a bit but how is it a gangster assassin doesn't double tap and headshot their target when they have them at point blank? This mafia family soon proves to be one of the dumbest in all of gangster cinema, leaving their loved ones completely open to be followed by Frank Castle, falling for a really terrible manipulation scheme, and how did they find out where Frank Castle's apartment was?\r\n\r\nThis is the kind of try-hard movie that Hollywood makes every so often when they have a revenge story script, an alpha-male protagonist, and all the rights to heavy metal tracks. It tries so hard to be cool and fails so spectacularly it's actually painful to watch.","id":"5c84292592514127661f1fc3","url":"https:\/\/www.themoviedb.org\/review\/5c84292592514127661f1fc3","movie_id":7220}
{"author":"John Chard","content":"It threatened and promised to be a  politically (wooly) mammoth disaster picture.\r\n\r\nJack Hall is certain that another ice age is imminent due to the effects of global warming, but the government just will not listen to him. Sure enough the climate changes and the world is at threat from perilous frozen weather, worse still for Jack is that his son is trapped in New York City!\r\n\r\nRoland Emmerich was the perfect choice to direct this particular piece. There is no denying that he has no little panache when it comes to destroying and blowing things up, think Independence Day, Stargate, Universal Soldier and Godzilla. What runs true through an Emmerich picture is that he is great on the CGI money shots and knows how to whet an appetite for destruction. Sadly, what is also true is that his second halves rarely deliver on their promise, so shall it be with The Day After Tomorrow. Even allowing for the expected mawkishness that comes with disaster\/survival pictures, this picture relies too much on its contrivances, thus completely losing sight of its eco-conscious heart, something that I'm sure the politically aware Emmerich set out to deliver at the start.\r\n\r\nPacking his picture with solid and professional performers (led by the always watchable Dennis Quaid as Jack Hall), Emmerich is all too aware that his money shots are what the popcorn masses have chiefly paid to see. Tornados, floods and the subsequent freeze are all excellent moments in the piece, but now, some years later the film has to be called out for being the shallow showcase that it is, in fact the CGI looks unintentionally artificial. It's a missed opportunity to make a blockbuster with an intelligent heart, and sadly Emmerich, either through boredom or ignorance? failed to seal the deal and craft one of the better genre entries.\r\n\r\nJust about average for the destruction sequences, but very little else to recommend here I'm afraid. 5\/10","id":"5cfede8b0e0a263f96c9ac0f","url":"https:\/\/www.themoviedb.org\/review\/5cfede8b0e0a263f96c9ac0f","movie_id":435}
{"author":"pancine","content":"A voyage without energy.\r\nI see many Film Movement releases and this is among the weakest I've seen. Listless. It failed at everything it tried, whether road,father\/son or spiritual journey. The huge throngs at Mecca at the end were impressive but otherwise I can't recommend.","id":"5c609a75c3a3684f92d4b9b5","url":"https:\/\/www.themoviedb.org\/review\/5c609a75c3a3684f92d4b9b5","movie_id":44003}
{"author":"Gimly","content":"It's hard for me to say that _The Chronicles of Riddick_ is **good**. Especially taking into the stunning origin it has in _Pitch Black_. But it tries really hard. It tries to be good, it tries to be original, it tries to appeal to so many disparate groups, it tries to go in a completely new direction. This trying mostly translates to failure, and I guess I can see that, but _Chronicles of Riddick_ still had such a massive impact on me, that I still have to recommend it.\r\n\r\n_\"Threshold! Take us to the Threshold!\"_\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5bacc6d192514150f5037396","url":"https:\/\/www.themoviedb.org\/review\/5bacc6d192514150f5037396","movie_id":2789}
{"author":"John Chard","content":"A lovely shot tale that has resonance in the modern age.\r\n\r\nThis user comment is my own personal feelings, it is not a review that I make in the hope of turning anyone's opinion to that of my own, no mater what anyone says or does, my feelings for the film will never change.\r\n\r\nI see a smartly crafted movie about fear and hope, a community living in fear of the outside world, I see involving characters to follow with interest, I see a gorgeous setting that intrigues and engages me.\r\n\r\nManoj Night Shyamalan's fourth mainstream picture is now, as we can all agree, a victim of a terrible marketing campaign, wasn't it? For there are horror elements in the film, of which I don't wish to spoiler write about, the horror elements are there, they just aren't the boo jump scary monster variety that many had hoped for. The ending to the film disappoints many it would seem, but it doesn't to me because it is here that the film has most resonance and the point is well and truly made. It's acted out with style from the majority of the cast, and Shyamalan directs with a steady caring approach. It's not without flaws for sure, but this is a very tidy piece that's saying quite a bit if the viewer is so inclined to jump on board. All told, it's a very solid and thought provoking piece that's made with much film making care. 8\/10","id":"5c5ba8cec3a3683cd188e50b","url":"https:\/\/www.themoviedb.org\/review\/5c5ba8cec3a3683cd188e50b","movie_id":6947}
{"author":"The Movie Diorama","content":"The Grudge begrudgingly latches onto croaky jump scares without logical cohesion. This, is an unusual horror to review. It’s rather uncommon for the same director, in this case Takashi Shimizu, to remake his own original film for an entirely different audience. Most would push their original creation onto the masses and convince them, with glorified persuasion, to withstand subtitles and invest the time into the chilling ghost story.\r\n\r\nYet Shimizu thought it would be apt to direct his own film again. Admirable? Yes, it ensured he received total creative control over the studio and producers. Necessary? No. Somehow, by remaking the exact story with essentially the same spine-tingling sequences, Shimizu downgraded the atmospheric aura of ‘Ju-On’, resulting in nothing more than a Japanese ghost boy releasing his inner cat and his ethereal mother croaking the life out of anyone who visits the cursed house. That’s the plot synopsis, right there.\r\n\r\nWell, there’s a tad bit more to the mystery, however Shimizu’s insistence on haphazardly fracturing the narrative between present day and the past week consequently confused audiences rather than enthral. There’s no logic behind the structure. No foundational development. And certainly no characterisation. So the abrupt switching back and forth held no purpose, other than to illustrate a host of jumpy death sequences. Some effective apparitional imagery heightened the tension, particularly the surveillance footage sequence and bedroom scene that made me frightened of my own bloody duvet when I was an innocent boy, yet negated by the bland acting from every single actor.\r\n\r\nBuffy has no more vampires to slay or Daphne has solved all remaining mysteries (take your pick...), and so she’s left wandering aimlessly around Tokyo with just one facial expression. Confusion. Pullman contributed nothing. And even Kayako herself, Fuji, was grossly misused during moments of tension-raising buildup. The final expositional flashback sequence, revealing to us why the house is now essentially cursed, was rushed and overwrought. Then concluding the entire feature on a frickin’ jump scare that looked cheaper than Kayako’s mascara. By the time the credits roll, you’ll be thinking to yourself “...why are these Americans in Tokyo anyway?”.\r\n\r\nI just...don’t understand how Shimizu can make his remake so unprogressive in terms of quality. He had another shot at bettering his original, overcoming previous criticisms, yet failed miserably. I’m open to the idea that The Grudge is a product of its time, comprising of several horror traits that the previous decade had commonly exploited. And I appreciate it stuck to its J-horror roots. But damn, this has not aged well in the slightest. The core is there. I can visibly see the contents. Yet, either due to Shimizu’s inability to improve in directorial control or studio interference, The Grudge growled like a ghoulish kitten instead of exhuming a ghostly lion’s roar. Y’know, because Toshio opens his CGI mouth and a cat noise comes out? Urgh, whatever. Couldn’t think of anything...","id":"5e207189b3316b0015038fea","url":"https:\/\/www.themoviedb.org\/review\/5e207189b3316b0015038fea","movie_id":1970}
{"author":"markuspm","content":"The movie could be about anything and I would like it. It is Vin Diesel!!","id":"52b7dad0760ee3709b00c5a2","url":"https:\/\/www.themoviedb.org\/review\/52b7dad0760ee3709b00c5a2","movie_id":2789}
{"author":"John Chard","content":"You can't change who people are without destroying who they were. \r\n\r\nThe Butterfly Effect - Directors Cut\r\n\r\nThe Butterfly Effect is directed by Eric Bress and Bress co-writes the screenplay with J. Mackye Gruber. It stars Ashton Kutcher, Melora Walters, Amy Smart, Elden Henson, William Lee Scott, Eric Stoltz and Ethan Suplee. Music is by Michael Suby and cinematography by Matthew F. Leonetti. \r\n\r\n\r\nThe title refers to the butterfly effect, the chaos theory of a popular hypothetical situation that illustrates how small initial differences may lead to large unforeseen consequences over time. The plot pitches Kutcher as Evan Treborn who suffers blackouts during critical mments in his life. When older he finds that through reading the journals he has written since a child, that he can go back in time to the significant events and change what happens. Unfortunately each time he does it comes at a great cost...\r\n\r\nIt was mercilessly kicked by the pro critics upon release, not helped by coming at a time when Kucher was something of a kicking post to critics. To compound the misery for the makers, they released a theatrical cut that featured a quite apalling ending. Inspite of these trevails at the time of release, the pic made a pot load of cash at the box office. Once the Directors Cut surfaced, with a key scene added to cement the different - quality - ending, time has seen the stock of the pic rise considerably. So much so that it currently sits at a 7.6 rating on IMDb and a 75% rating on TMDB, wile there are some critics who have come out and admitted they were too quick to judge the first release back in 2004.\r\n\r\nWhat we have is a time travelling corkscrew narrative that is immensely sombre in telling how ones actions can have far-reaching consequences. It's a compelling and often thrilling picture, one that can spark hearty debate about the thematics at work - notably we the audience being forced to contemplate our own actions in life. The pic demands the utmost attention, switching off for a few minutes is a definite no no. Some scenes linger long in the memory as we trawl through the evil that kids and men do, right up to the unforgettable finale.\r\n\r\nThere's plot and logic holes, that are small irritants, and even though this definitely could have been better cast with more senior actors, none of the youthful cast members hurt the picture. It packs a punch, that is on proviso you only see the directors cut. 7.5\/10","id":"5ea5794035c30a001dbeda5f","url":"https:\/\/www.themoviedb.org\/review\/5ea5794035c30a001dbeda5f","movie_id":1954}
{"author":"viciouslollipop","content":"Toolbox Murders-Tobes's Done Better...\r\n\r\nI wasn't sure how I felt about this movie until about a day after I watched it. I've come to the conclusion that it was mediocre. It felt like a revisit of every bad slasher flick I'd seen for the last 20 years. I do have to give credit to Tobe for humanizing some of the victims. Let's be honest, in the typical slasher flick the victims are usually drunken or doped up, teen-age sex fiends that you could care less about(and may actually enjoy seeing them get taken out:) The killer is equal parts psycho\/supernatural, and his origins, limitations, and needs are never fully explained. Overall, there were some fairly grisly offings, decent character acting, but too many plot holes for me to overlook. Rent, don't buy.","id":"58da8c9ac3a36846500001f7","url":"https:\/\/www.themoviedb.org\/review\/58da8c9ac3a36846500001f7","movie_id":16764}
{"author":"SierraKiloBravo","content":"Click here for a video version of this review: https:\/\/youtu.be\/GDnLyf2Dr18\r\n\r\nWhen it first came out in 2004 _Super Size Me_ was a hit due to its simple concept and exposé of the fast food industry, specifically McDonalds. To refresh your memory about this documentary classic, here is the official description:\r\n\r\n_Morgan Spurlock subjects himself to a diet based only on McDonald's fast food three times a day for thirty days without exercising to try to prove why so many Americans are fat or obese. He submits himself to a complete check-up by three doctors, comparing his weight along the way, resulting in a scary conclusion._\r\n\r\nIt is a pretty straightforward documentary, Spurlock films himself eating McDonald's for a month and intercuts this with doctor's visits, information on the fast food industry and McDonald's as a company, and conversations with various health professionals. One of the stand out parts for me was when he paid a visit to a school showed the rubbish the kids were being served, and the reaction of the school administrators was interesting. One tried to justify it and laugh it off, whereas one of the ladies from the kitchen was quite resigned to having to serve up this stuff to the kids. She even says something along the lines of \"the kitchen tool we use here the most is a box cutter to open this stuff up\". Spurlock doesn't just leave it at that, he shows another school that serves healthy lunches to its students for around the same price, to show that it can be done.\r\n\r\nThroughout, Spurlock doesn't put his own spin on things, but relies on the information presented to speak for itself. The physical effects his diet had were quite shocking. It is by far not a scientific experiment or approach, but it does show what effect regular long term consumption of fast food can have on your body. As such it is a useful reminder of information we already know. Heck, we knew it back then, and if anything, the consumption of junk of shows no signs of slowing down.\r\n\r\nI enjoyed watching this again, and definitely think its worth checking out if its been a while since you saw it. In fact with a sequel now out, perhaps this is a great time for a second look.","id":"5ea76e72b7fbbd001b3878e8","url":"https:\/\/www.themoviedb.org\/review\/5ea76e72b7fbbd001b3878e8","movie_id":9372}
{"author":"viciouslollipop","content":"Shaun of the Dead-If U like Romero\/Python Pick This Up:D\r\n\r\nThis was one of the best movies I saw in the last year or two. The acting was good, the plot was fairly well thought out, and it was very funny. It helps if you are a zombie movie(i.e. G. Romero)fan and enjoy British type humor(like the Monty Python troupe), but if you are neither it will not stop you from enjoying this movie. It is a weird mix of several genres(coming of age, buddy movie, comedy, love, horror)but it definitely works on all levels. The main characters(Shaun and Ed)will definitely remind you of some slacker you knew(or know) The facial expressions, dialogue, and general behavior of these two make for some of the best scenes in the movie. There are also some very good make-up effects, and a decent amount of gore. This is definitely one worth owning.","id":"58da8ce392514121fe00022d","url":"https:\/\/www.themoviedb.org\/review\/58da8ce392514121fe00022d","movie_id":747}
{"author":"Andres Gomez","content":"Fun and quite smart.","id":"52776e3519c29551d803573e","url":"https:\/\/www.themoviedb.org\/review\/52776e3519c29551d803573e","movie_id":747}
{"author":"talisencrw","content":"Though I tend to go for both older films (those made before 1970) and\r\nespecially so when it comes to the horror\/thriller genre, I saw parts 3\r\nand 5 upon theatrical release (yes, I know it's really not right to see\r\nfilm series out of sequence but I simply don't care) and they were\r\nintriguing and decent, don't ask me why. Now that I both date a horror\r\nfilm aficionado and my 13-year-old son himself is one as well, I have\r\ndecided to check out the contemporarily well-received original (I may\r\ndecide now to see the entire series, and in order, but really who's to\r\nsay?). Instantly, such trusted, bankable actors as Cary Elwes and Danny\r\nGlover give it credibility, just as Bette Davis and Joan Crawford gave\r\nsuch films as 'What Ever Happened to Baby Jane?' way back in days gone\r\nby. This was much better than I felt parts 3 and 5 were, by the way.","id":"57bb8a9192514176dc000475","url":"https:\/\/www.themoviedb.org\/review\/57bb8a9192514176dc000475","movie_id":176}
{"author":"stackkorora","content":"It is just as goofy as one would expect a Thai-indie self-aware zombie spoof comedy to be. If you want serious acting and a solid storyline - go watch something else. If you want a laugh involving zombie babies, a CGI snake, and absurd situations - then this may be what you are looking for. :-)","id":"5be325a29251415c69017a90","url":"https:\/\/www.themoviedb.org\/review\/5be325a29251415c69017a90","movie_id":50108}
{"author":"Wuchak","content":"***Arty, surreal indie about wandering the Euro wasteland in the closing days of WW2***\r\n\r\nSometime after the Battle of the Bulge in Western Europe, two lost American deserters journey the ruined landscape: Losey (Ryan Francis) is a sensitive man haunted by memories while Deming (Scott MacDonald) is a half-psycho brute. They are eventually forced to make a stand with a group of orphans and a skeptical French couple (David Warner & Linda Thorson).\r\n\r\nWritten & directed by Jeff Burr, \"Straight into Darkness\" (2004) is a low-budget indie, (financed mostly by Burr). You can tell this immediately in the opening credits, so I wasn’t sure if I wanted to keep watching, but I’m glad I did because the filmmaking is otherwise professional and the cast rose to the challenge.\r\n\r\nThe tone is melancholic and surreal. To get a good picture, imagine the arty style of “The Thin Red Line” (1998) and the setting of “When Trumpets Fade” (1998), but on a smaller budget, mixed with the plot of a few soldiers wandering the war-ridden landscape à la “Anzio” (1968) and “Saving Private Ryan” (1998).\r\n\r\nLow budget indie or not, “Straight into Darkness” is deep, moody, brooding and memorable.\r\n\r\nThe film runs 1 hour, 35 minutes and took two years to make, shot in Romania; Mammoth Mountain, California; and Chattanooga, Tennessee.\r\n\r\nGRADE: B","id":"5ceae8bc9251416a3fbbfe1f","url":"https:\/\/www.themoviedb.org\/review\/5ceae8bc9251416a3fbbfe1f","movie_id":41849}
{"author":"Reno","content":"**In an unfamiliar territory, everything's a big challenge.**\r\n\r\nThe film was inspired by the American legend Frank Hopkins and his horse Hidalgo. They sail across the oceans to the Arabian desert to take part in a race. This adventure tells their new experience in an unknown territory competing with the greatest riders of the region. Alongside a misunderstanding leads to an unexpected confrontation. From there, how they escape and make back to home halfway across the world is the remaining film to disclose.\r\n\r\nA different kind of western that takes place in the original timeline of the cowboy culture which is the late 19th century. But the film has only one cowboy, because of where the story sets in. This film came straight after LOTR. Viggo Mortensen was good and his stunts were excellent. The initial parts that commence in America was heartbreaking and I liked the conclusion as well. It reminded me the animation film 'Spirit: Stallion of the Cimarron'. Though the film was more about Frank Hopkins and the horse had a good influence on the story as the film title suggests. Long film, but worth it. Surely won't be a waste of time to give it a try.\r\n\r\n_7\/10_","id":"58a3774092514177430012e9","url":"https:\/\/www.themoviedb.org\/review\/58a3774092514177430012e9","movie_id":2023}
{"author":"Andres Gomez","content":"Predictable events on a still very nice story embedding the viewer into the (rural) Swedish society. The cast works really well and the director makes a fantastic job.","id":"5677ab9dc3a368167a008a8f","url":"https:\/\/www.themoviedb.org\/review\/5677ab9dc3a368167a008a8f","movie_id":464}
{"author":"viciouslollipop","content":"Dead Birds-Worth a Look, But Not Much More?\r\n\r\nGreat atmosphere, good acting, decent ending twist, so-so plot. Worth a rent but not much more. Not too confusing if you pay attention and like horror movies anyway. I also thought it would be more scary, but the kids were creepy. The hollowed-out eye-sockets were what got me. The score also set a great sense of dread and foreboding. I suppose for a first time director it wasn't absolutely awful. But as I said before, strong performances(especially Isiah Washington and Patrick Fugit), the location(great Southern period \"feel\"), a very creepy score, and the little twist at the end are what saves this movie from being very mediocre to just plain bad.","id":"58da8c0a92514121c30001a4","url":"https:\/\/www.themoviedb.org\/review\/58da8c0a92514121c30001a4","movie_id":19592}
{"author":"Wuchak","content":"***Frat house slasher influenced by “The Evil Dead” featuring Tiffany Shepis and Nectar Rose*** \r\n\r\nDuring a hazing on Halloween, seven college students get trapped in a Fraternity house with an unholy book that attracts the spirit of a crazy professor who threatens to possess them. Can any of them make it out alive? \r\n\r\n“The Hazing” (2004), retitled “Dead Scared,” is a low-budget slasher with an amusing edge. It borrows from the first two “Evil Dead” flicks and is just as good or better. One of the highlights is brunette Tiffany Shepis as Marsha and blonde Nectar Rose as Delia, the former in a shining silver bodysuit and the latter in a playboy bunny costume. It was wise on the director’s part to clothe them in this manner as they can be clearly observed even in the dim light of the creepy frat house. Horror directors take note.\r\n\r\nThe movie runs 1 hour, 27 minutes and was shot in Los Angeles.\r\n\r\nGRADE: B-","id":"5cd7300e92514111decf0f0d","url":"https:\/\/www.themoviedb.org\/review\/5cd7300e92514111decf0f0d","movie_id":27619}
{"author":"John Chard","content":"Damnation and Doom at the Plantation of the Dead.\r\n\r\nDead Birds is directed by Alex Turner and written by Simon Barrett. It stars Henry Thomas, Nicki Aycox, Isaiah Washington, Patrick Fugit, Michael Shannon, Mark Boone Junior, Harris Mann and Muse Watson. Music is scored by Peter Lopez and cinematography by Steve Yedlin.\r\n\r\n1863 and it's the back end of the American Civil War, a group of Confederate deserters rob their own army's gold being delivered to the bank of Fairhope. Leaving a bloody trail in their wake, the group set off for Mexico but must stop for rest and recuperation at a deserted farm mansion over looking a long dead plantation. With a storm moving in and tempers among the thieves running high, it soon becomes evident that something otherworldly resides at the house and the surrounding area…\r\n\r\nDead Birds is a little cracker, a straight to video horror film that to my mind puts to shame some of the big budgeted piles of crap that get released to the multiplexes on a seemingly weekly basis. Of course, horror is very subjective, where along with comedy it forms a pair of genres guaranteed to produce films that will never ever please everyone. Falling into the haunted house sub-genre of horror, Dead Birds, in spite of its unique Civil War period setting, has been lambasted by many a horror fan for not being fresh, that it's a collage of other horror movies. There's some truth to that, but we could level that charge at 98% of horror movies anyway! But Dead Birds (crap title btw) does have a cult fan base, a fan base I'm very much proud to be part of.\r\n\r\nAlex Turner, for his first feature length debut, has crafted a haunted house picture that positively pulses with dread, with its slow deliberate pacing and hushed conversational tones, the atmosphere crackles with unease. The opening credits are jet black and rise from the earth like spectral portents of death. Then after the fireworks of the robbery, things settle into a sort of ethereal rhythm. The gang make their way to their doom through a murky landscape until they reach what they don't know is their final destination; the plantation, a place that just reeks of death and disharmony.\r\n\r\nThe cornfield is long dead and home to a strange creature, the battered old scarecrow looks ripe for a fright and a dead bird on the floor is ominous. The house itself is a two story wooden type not used often in tales of this type. It looks moody, as does the servants quarters, there's also a creepy barn with its hayloft and a water well of course. These are genre staples for sure, but Turner gathers all the clichés and gives them a new lease of life in a new period setting. The secret is in the lighting, Turner and Yedlin (Brick\/Looper) light from down low, giving off a wonderful eerie effect as the gang trudge around this place of misery. It may sound like an oxy-moronic statement, but this is one beautifully shot horror film.\r\n\r\nThen there's the shocks, the boo-jump moments (sadly revealed in the trailer for those unfortunate to not see the film first), these are not frequent so as to make the film reliant on them, they are used sparingly and only to advance the plot as the plantation's history literally comes to life. The cast are on fine form (Thomas and Washington standing out), working well with a dynamic infused with greed, mistrust, jealousy and racism. Lopez's musical score blends foreboding rumbles with spine chilling shards of noise, while Turner slots in some oblique angles to further enhance the feeling of hopeless disorientation. It may cover familiar ground, that of a bunch of folk in a spooky house being bumped off one by one, with suspicions aroused, but Dead Birds is very much its own animal. Hee, literally. 8\/10","id":"58a8b5dd9251410a390021fb","url":"https:\/\/www.themoviedb.org\/review\/58a8b5dd9251410a390021fb","movie_id":19592}
{"author":"Gimly","content":"If multiverse theory is correct, somewhere there is a reality in which _D.E.B.S._ isn't gay, and that must truly be the darkest timeline.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5bd28d5ac3a36874350040e1","url":"https:\/\/www.themoviedb.org\/review\/5bd28d5ac3a36874350040e1","movie_id":540}
{"author":"mattwilde123","content":"‘Dead Man’s Shoes’ is the fourth full-length feature film directed and written by Shane Meadows in 2004. Starring Paddy Considine, it tells the story of an ex-soldier who returns home to a small town in the Midlands seeking revenge on a group of thugs who have terrorised his younger brother. The film, at first, embraces the ultimate act of revenge with dark humour and disturbing violence, but soon turns out to criticise what effect vengeance has on the protagonist.\r\n\r\nThe film questions the role of masculinity in British working-class society by having very different male stereotypes thrown together in a very isolated environment. Not only does the film make a statement about gender roles, but more importantly, it tackles the issue of honour and justice. The audience’s allegiances sway dramatically throughout the film as Richard (Considine) becomes more brutal in his execution styles. A similar British film that challenges the audience’s perception of who is right is Stanley Kubrick’s ‘A Clockwork Orange’.\r\n\r\nOn simple viewing of this film, you could say that it is a revenge slasher-flick with plenty of gore; however, I feel that this film is a powerful piece of cinema that is a statement for the immorality of British society and the ideologies it imposes but it also uses Uttoxeter to show the corruption of human nature.\r\n\r\n★★★★★","id":"58c14e679251417327009907","url":"https:\/\/www.themoviedb.org\/review\/58c14e679251417327009907","movie_id":12877}
{"author":"DoubleUK","content":"This is a surprisingly relaxed Dutch movie about a group of young Maroccan people, living in the Netherlands. Like many European countries, who has seen an increase of immigrants from North Africa and Turkey the last couple of decades, Netherlands also has it's own share of imported culture. But this has not always been without conflict. Especially the last few years young Maroccans are getting a bad rep. So it's refreshing to see this movie, (the first one in Dutch history who has a predominant Maroccan cast), that deals with these much discussed, heavy topics and much more in a remarkable light tone.\r\n\r\nThe story centers around Ab (-dullah) and his family. He is considering of finally 'getting serious' just like his older brother Sam (played by well-known Dutch comedian Najib Amhali) who is a respectable cop. So Ab wants to get a proper job and marry a legitimate Maroccan wife (in Marocco). But his criminal friends are constantly trying to lure him back to a life of petty crime.\r\n\r\nMeanwhile there are some other little things going on: his mother's growing impatience with her nagging husband, his sister Leila (the beautiful Touriya Haoud) who is hanging around a Dutch boy, meanwhile resisting an arranged marriage her father wants to impose on her.\r\n\r\nAnd of course there is the kidbrother who makes a living by taking photographs of Maroccan girls who wear make-up just to blackmail 'em. (Most Maroccan girls in the Netherlands are living a double life: timid and traditional at home, sexy and modern when they are outside their parents radar-range)\r\n\r\nIn many respects this movie is a first. It's the first movie that deals with Maroccan-Dutch prejudices. And the first movie with so many Maroccan lead players. Seeing this movie in a theatre with both Dutch and Maroccan viewers can be very interesting. At times you hear parts of the audience laugh or cheer when other parts don't get it. But all in all, this movie is a fun movie to watch, has a lot of endearing characters. A bit of drama in the last part of the movie however is not perceived properly by the audience who are in 'laugh-mode' and don't always pick up on the other issues being presented. The last part drags on a little bit, but it has a very good ending. Both upbeat and cynical.","id":"589d76f3c3a3685f870051c5","url":"https:\/\/www.themoviedb.org\/review\/589d76f3c3a3685f870051c5","movie_id":21022}
{"author":"Jeff_34","content":"Epic film.  Dark, crazy, real, real-life. **Hilarious.**\r\n\r\nIt helps to speak French since it's hard to find a version with good subtitles. That bar scene is too funny but hard to follow if you don't ask your friendly neighbourhood frog what's going on.\r\n\r\nIt's best to go into it knowing absolutely nothing and staying until the very end.\r\n\r\nWhat a ride, it's really worth it.  ;)","id":"589dccc09251412ccc0085db","url":"https:\/\/www.themoviedb.org\/review\/589dccc09251412ccc0085db","movie_id":12249}
{"author":"John Chard","content":"You know I loved Sean so much, and its been so long that I still can't get him out of my system.\r\n\r\nI remember when it was released in 2004, there was a big hurrah about \"the\" bath scene, many vitriolic complaints about how slow it was, how not scary it was et al. Birth is many wonderful film making things, of course not all of those things will resonate or enthral many of the movie watching populace, yet there is such craft on both sides of the camera here, and an atmospherically ambiguous bloodline pulsing throughout, that marks it out as a particularly striking film.\r\n\r\nPlot finds Nicole Kidman as Anna, who is about to be re-married but finds her world tipped upside down when a young boy (Cameron Bright) arrives on the scene and announces he is the reincarnation of her dead first husband...\r\n\r\nDirector Jonathan Glazer and his co-writers Jean-Claude Carrière & Milo Addica are purposely being vague, I mean lets face it, the topic to hand is exactly that, vague, and ripe for countless hours of discussion. The film simmers along deftly, meditations on love, grief and anger are skilfully portrayed by all involved. Even a birthing tunnel metaphor doesn't come off as self indulgent, from the off Glazer wants and gets those interested in the story to buy into the hypnotic qualities on show. To jump on board with Anna's fragility while all around her battle for rhyme or reason with her mindset.\r\n\r\nIn truth it's a hard sell as a piece of entertainment, there's still today, over a decade since it was released, people miffed that the hinted at supernatural elements are not key to the narrative. While the thin line of good and bad taste - and maybe even pretentiousness - is being tested by the makers, but the charges of Birth being dull are just wrong. It never shows its hand, the mystery always remains strong, while Kidman and Lauren Bacall are reason enough to admire the acting craft on show.\r\n\r\nHated by many, inducing even anger in some quarters, Birth is a tantalising picture. A conundrum designed to get a response, for better or worse. 8\/10","id":"550c9ccfc3a3687c11001cf2","url":"https:\/\/www.themoviedb.org\/review\/550c9ccfc3a3687c11001cf2","movie_id":10740}
{"author":"Binayak","content":"I really loved this movie.","id":"5e667d1e459ad600115adee3","url":"https:\/\/www.themoviedb.org\/review\/5e667d1e459ad600115adee3","movie_id":673}
{"author":"Wuchak","content":"Tarantino's amusing super-assassin bizarro world  \r\n\r\nRELEASED IN 2004 and written\/directed by Quentin Tarantino, \"Kill Bill Vol. 2\" completes the story of 2003's \"Vol. 1\" and fills in the holes. Former assassin, The Bride (Uma Thurmon), seeks vengeance after the murder of her fiancé & friends at a wedding rehearsal in El Paso. She takes on formidable thugs Budd (Michael Madsen) and Elle (Daryl Hannah) to finally get to ringleader Bill (David Carradine). Gordon Liu plays master martial artist Pai Mei while Michael Parks is on hand as Esteban Vihaio.\r\n\r\nThis part of the duology is more dialogue-driven than \"Vol. 1,” fleshing-out the characters and answering many questions. Such as: How is The Bride such an unconquerable fighter? How did Elle lose her right eye? Why did Bill conduct the wedding massacre? How does Budd spend his retirement? The problem is that the characters are all cartoony caricatures, and merciless assassins to boot. It's impossible to give criminal scum \"more depth,\" at least as far as caring for them goes. Let 'em all kill each other for all I care. Moreover, the story is too shallow to warrant such epic treatment and would've been more effective if both films were condensed into a 2.5 hour flick, cutting out the fat.\r\n\r\nStill, the movie's so offbeat that it's entertaining in the manner of 1996's \"Mojave Moon,\" but better. It's an interesting combo of spaghetti Westerns, 70's martial arts flicks, Bond-isms and all-around Tarantino quirkiness. But suggesting that the \"Kill Bill\" flicks are cinematic masterpieces of auteurism is overdoing it. Take, for instance, the ridiculous closing credits, which run well over 12 minutes: The plot and characters are unworthy of such pretentious veneration. If you want masterworks by Tarantino, see “Django Unchained” (2012) and “Pulp Fiction” (1994); or even “Inglourious Basterds” (2009) and “Jackie Brown” (1997).\r\n\r\nStill, the movie's strangely amusing, the cast is good (especially Carradine) and Bill's Superman analysis is insightful. The Bride’s training with Pai Mei is arguably the best bit.\r\n\r\nTHE MOVIE RUNS 137 minutes and was shot in Southern California; Beijing, China; and Mexico.\r\n\r\nGRADE: B\/B- (6.5\/10)","id":"5b50e9090e0a262594002847","url":"https:\/\/www.themoviedb.org\/review\/5b50e9090e0a262594002847","movie_id":393}
{"author":"Gimly","content":"Do yourself a favour and grab the **extended **edition of this movie, It's like a whole new film and it is way way better.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5b15018ac3a368535d00a4e1","url":"https:\/\/www.themoviedb.org\/review\/5b15018ac3a368535d00a4e1","movie_id":9477}
{"author":"Andres Gomez","content":"Really good movie staging in a fictional center European country. The drawings are great and the story is as delicate as any other from Miyazaki.","id":"52945b72760ee3019203b59d","url":"https:\/\/www.themoviedb.org\/review\/52945b72760ee3019203b59d","movie_id":4935}
{"author":"John Chard","content":"Quite an experience, and in a great way as well!\r\n \r\nWent into this one totally blind as to its contents, truth is, is that I was mooching round the shops yesterday and came across an Asian triple pack DVD at a bargain price, since one of the films was Jet Li starrer Unleashed, i thought it was worth the cheap price on offer. Got home and the write up on the back of the case didn't give much away as regards plot for Kung Fu Hustle, an Axe Gang, some guy named Sing wants to be in the gang, and that some creaky old residents in a place called Pig Sty Ally are tougher than they look.\r\n\r\nWhat I got was what I can only describe as a live cartoon full of class and style, the sort of flip side to the more arty Asian films that have (rightly) become massively popular in the subsequent decadse. Written, directed, produced and starring Stephen Chow (Sing), Kung Fu Hustle is a remarkably breathless piece of work, the plot is threadbare for sure, but it really matters not, because Chow has fused the grand old genre staple punch up with balletic comedy, it's quite something to behold. It's as loud as a face off between Motorhead & Iron Maiden, yet it's just so flipping tender at the same time! Incredible sequences will dazzle you one moment and then have you laughing the next, I'm quite annoyed that I didn't catch on to this film back in 2004, but even now some years later this film is still a breath of fresh air on the home format release. See it and roll with it, enjoy. 9\/10","id":"541aff530e0a261ca30000b3","url":"https:\/\/www.themoviedb.org\/review\/541aff530e0a261ca30000b3","movie_id":9470}
{"author":"talisencrw","content":"I hardly ever watch contemporary American comedies in which most of the top cast are women (I still haven't seen either 'Clueless', 'Bridesmaids' or 'Heathers', for example), but recently I enjoyed 'The Devil Wears Prada', I have liked both Lindsay Lohan (especially in 'Bobby' and 'The Prairie Home Companion') and Rachel McAdams (most significantly in 'Redeye' and 'Passion'), so knowing that one of my favourite SNL comediennes, Tina Fey, both wrote and co-starred in this, made me give it a shot. It being critically lauded by some male cinephiles I trust didn't hurt matters, either.\r\n\r\nIt was full of laughs and subtly got across its points about 21st-century American society and of the growing pains for young women in its high school shenanigans. 'Mean Girls' is definitely worth the trouble to find and to give a try yourself. It left me enthusiastically wishing Ms. Lohan can sort out her personal troubles and get back to acting, where she belongs.","id":"57b0cd85c3a3684323000efc","url":"https:\/\/www.themoviedb.org\/review\/57b0cd85c3a3684323000efc","movie_id":10625}
{"author":"Gimly","content":"I pretty much never turn down a movie that purports to be in the \"Fucked-Up-Coming-of-Age-Movie\" category, and rarely am I disappointed. _Mean Creek_ does absolutely nothing to buck that trend, being a completely engaging movie that I started recommending to people before I'd even finished watching it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5b96046bc3a368568802a36e","url":"https:\/\/www.themoviedb.org\/review\/5b96046bc3a368568802a36e","movie_id":12281}
{"author":"Gimly","content":"_Mean Girls_ has absolutely no business being as phenomenal as it is. None at all. If you've read many enough my reviews to get any sort of indication as to the sort of cinema I am in to, then you could be forgiven for assuming I wouldn't be a fan. After all, _Mean Girls_ is about as far away from my wheelhouse as a movie could conceivably be. But I fucking **love** it. And I honestly can't tell you why. Every single piece of _Mean Girls_ examined in isolation, is something I despise. Every trope, formula, format, cliche, device and style choice is something I have ragged on a hundred times before in different reviews, but for whatever reason, I cannot put _Mean Girls_ down. I don't think a single year has gone by since I first saw it in the late '00s that I haven't rewatched it. Usually, multiple times a year. Inexplicable, but there it is.\r\n\r\n_Final rating:★★★★½ - Ridiculously strong appeal. I can’t stop thinking about it._","id":"5cb07e609251412fb023c6f6","url":"https:\/\/www.themoviedb.org\/review\/5cb07e609251412fb023c6f6","movie_id":10625}
{"author":"John Chard","content":"Convoluted Cack!\r\n\r\nOcean's 11 was a slick movie, ultra cool and up there with the best as regards superior remakes. Ocean's Twelve is a waste, a film coasting on star appeal, a picture desperately trying to cram as much into its screenplay for fear of failing.\r\n\r\nThe plot shoots off in a number of directions, yet incredibly it still wastes most of the cast who have all been held over from Ocean's 11. This time Catherine Zeta-Jones joins in for some weighty dressage and Vincent Cassel is along as some sort of break-dancing Raffles dude. There's the odd in-joke that works, while the by-ply between the principal players (Clooney\/Pitt\/Damon) holds a modicum of entertainment value. However, once the dust settles on the myriad of schemes and scrapes, you are left with a sequel of a remake that is almost everything the other film was not. Boo. 4\/10","id":"550ca9b0c3a368487d0045d7","url":"https:\/\/www.themoviedb.org\/review\/550ca9b0c3a368487d0045d7","movie_id":163}
{"author":"Gimly","content":"Pretty good for a Tom Cruise led movie, but he's still bloody playing Tom Cruise. Just Tom Cruise with even stupider hair.\r\n\r\nTom Cruise.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5c56dbb89251410e1d4f7e89","url":"https:\/\/www.themoviedb.org\/review\/5c56dbb89251410e1d4f7e89","movie_id":1538}
{"author":"Stashdragon","content":"This movie is one of the main reasons I decided to study film in college. It uses, CG, matte paintings, green screen, and claymation to do all the effects. It's a very stylish take. \r\n\r\nThe story is very powerful. Each time I've watched the movie I am always left thinking about the plot and it's overarching meaning. I highly recommend this film. Just have an open mind to the world and directing choices.","id":"5d77b94f39549a001396a6fe","url":"https:\/\/www.themoviedb.org\/review\/5d77b94f39549a001396a6fe","movie_id":11662}
{"author":"Andres Gomez","content":"A terrible mix including the myth of Frankenstein (there is even an Igor), 1984 and the Nazi holocaust and an ultra-violent video game a la Final Fantasy, cooked for advocating in favor of world peace (?).\r\n\r\nAlso, terrible monologues, the typical Japanese over-drama and an OST to be burnt.\r\n\r\nJust giving it some points for its aesthetic which I don't like but I can see the effort on it, as it was also done in \"300\".","id":"531af9d4c3a3685c56004734","url":"https:\/\/www.themoviedb.org\/review\/531af9d4c3a3685c56004734","movie_id":11662}
{"author":"CRCulver","content":"This is a 2004 documentary film by Jessica Yu introducing the life and work of Henry Darger. A major figure of \"outsider art\", Darger's work was only discovered after his death when his landlords found thousands of pages of text and paintings in his room. Through his long life, he was known to his few friends and associates only as a janitor in a local hospital. Secretly, he wrote a massive manuscript chronicling the rebellion of girl slaves in a fantasy world, painted with watercolors of the heroines and battles.\r\n\r\nYu has chosen three main narrators for the documentary. A little girl (Dakota Fanning, even) narrates Darger's biographical facts, while excerpts from Darger's autobiography are reads by an old man (Larry Pine), and texts from his fantasy epic are read by some fellow with a radio play delivery. In addition, we find interviews with people who knew Darger. Kiyoko Lerner, his landlady and now the caretaker of his legacy, is of course featured, as are some of his neighbours and an altar boy from his church. While everyone reports him to be an odd fellow, Yu avoids the controversial issue of Darger's mental health, preserving the ambiguity of whether he was mad or a mere eccentric. Similarly, the relation of Darger's work to sexual frustrations or the possibility of sexual abuse as a child are left out. But this is a mere introduction, and it's reasonable to expect the viewer to move on to other sources for contentious matters. My only real complaint is that Yu is not always content to let Darger's paintings speak for themselves. Rather, she has animated certain of Darger's scenes, which I feel distorts the paintings to a degree. While I think the film does not deserve a one-star rating for this as another reviewer awarded it, it is troubling.\r\n\r\nNonetheless, all in all this is a fine presentation of a remarkable figure. And if Darger's intrigues you, I'd recommend also discovering Adolf Wolfli, a Swiss madman whose life and work resembles Darger in several years.","id":"5b9b9589c3a3686c0e012cfa","url":"https:\/\/www.themoviedb.org\/review\/5b9b9589c3a3686c0e012cfa","movie_id":1853}
{"author":"Norsk","content":"Cube Zero completes the trilogy of Cube movies which are based upon people waking up inside of giant multiroom cubes filled with death traps and having no knowledge of how they got there or how to get out. In this film, the viewer finally sees what goes on behind the scenes (save for a snippet at the end of Hypercube), though since this is the first film chronologically, it does not necessarily follow that this is how things worked in the other two films. However, you will finally learn a little about the likely backstory of Kazan from Cube 1.\r\n\r\nIf you are looking for a film with a feel good ending then you've chosen the wrong trilogy. The ending of this one is a mixed bag. Who the bad guys and good guys are is a matter of opinion and you may change your view from the other two films. I personally feel this film was the weakest in the trilogy since there is a lot of focus on what goes on outside the cube and less focus on character development inside the cube.  It is still well worth watching. If you have not watched the other two Cube films, I do recommend watching them first and saving this one for last so the background revealed here doesn't spoil their viewing.","id":"59e8a89cc3a36827e7012e93","url":"https:\/\/www.themoviedb.org\/review\/59e8a89cc3a36827e7012e93","movie_id":438}
{"author":"John Chard","content":"Twister? Alledgedly...\r\n\r\nFrom the middle tier of what we know as being Neo-Noir, Twisted is a frustrating experience. Right off the bat the cast list boasts weighty worth, giving us the promise of a dramatic thriller, filmed on location in Frisco, with misty lenses, lamp lights, waterside moods etc, it's set up a treat. As is the premise...\r\n\r\nAshley Judd stars as a newly promoted hot-shot police detective, who in quality noir traditions has a whole heap of problems going on. Her family back story is shattering, she herself is heavily reliant on alcohol and she likes casual sex with strangers, strangers who start turning up dead, the kicker of which sees her basically investigating herself as a the prime suspect! Unfortunately with everything in place the pic never shifts out of first gear. The red herrings stack up, but nothing with any real conviction, and the whole premise starts to get monotonous, worse still the big reveal really isn't a surprise. There was a raft of these type of films in the 80s and 90s that were done much better, and on completion of viewing this effort one hankers for those pics - not to mention for the film noir of old!\r\n\r\nAshley Judd always frustrates, one can see a very good actress in her body of work, but she's more often than not starring in so so thrillers. It can possibly argued that her co-star Andy Garcia is a great actor who hasn't reached the heights he should have, the days of The Untouchables and Godfather III seeming to be fleeting glimpses of talent. Here he gets a thankless role that's poorly written, while both Samuel L. Jackson and David Strathairn add nice touches but aren't asked to extend themselves. Directed by Phillip Kaufman who as with Rising Sun, here also looks out of his comfort zone with the genre. But the presence of Mulholland Dr DOP Peter Deming is noticeable and one of the pics strengths. 5\/10","id":"59c229fbc3a3682c6f00976f","url":"https:\/\/www.themoviedb.org\/review\/59c229fbc3a3682c6f00976f","movie_id":13572}
{"author":"waimoku","content":"Well, you wonder, how dangerous could the \"graveyard\" be if Clark survived it solo for 15 years? Then word of Mavericks gets around, and legendary surfers from Hawaii's North Shore come to visit. One of the sport's champions, Mark Foo, is killed after wiping out on a medium wave. One theory is that the tether to his board got caught on rocks and he drowned. Another surfer thinks he felt or sensed somebody under the water who shouldn't have been there. Exactly one year later, during a memorial to Foo, another surfer is drowned.\r\n\r\nThe documentary \"Riding Giants\" shows surfers gathered to discuss and mourn the lost men. It does not show Jeff Clark during those previous 15 years because, of course, he was alone. And what a species of aloneness it was, to plunge into the cold ocean and swim out 45 minutes for a few seconds of exhilaration at the risk of your life. Clark and his kind live at the intersection of courage, madness, skill and obsession.\r\n\r\nConsider Laird Hamilton, the current golden boy of the sport, who has cashed in with endorsement contracts, modeling assignments and magazine covers. But no, I am not comparing him unfavorably to Clark, because Hamilton is also a superb athlete and a driven man. Hanging around as a kid with Hawaii's big wave riders of the 1960s, he introduced his divorced mom to one of them, who became his stepfather and tutor; Laird grew up to become surfing's first superstar.\r\n\r\nWhat Hamilton has done is go farther from land than any rider had thought to go, seeking \"remote offshore reefs capable of producing unimaginable waves.\" At first this involved paddling two hours and then waiting up to two hours for a wave. Then Hamilton invents \"towing surfing,\" in which a jet ski tows him out to the far reefs, and slingshots him onto waves moving so fast it is impossible to access them any other way.\r\n\r\nThe jet ski driver's other job is to pick up Hamilton again after the ride, or be prepared to rescue him. The current thriller \"Open Water\" shows a couple lost at sea after being left behind on a scuba-diving tour. For Hamilton, being lost at sea is a possibility several times a day. \"Riding Giants\" was directed by Stacy Peralta, whose \"Dogtown and Z-Boys\" (2002) documented the invention and culture of Southern California skateboarding. In both films his archival work is the key; he seems to have access to limitless historical footage, sometimes in home movie form; we see Hamilton at the dawn of towing surfing, when at first it was scorned and then embraced by the sport's champions.\r\n\r\nIn August 2000, Hamilton goes to Tahiti in search of a legendary wave so big it is \"a freak of hydroponics.\" He finds it and rides it, and we see him precariously balanced on its terrifying immensity in what the movie calls \"the most significant ride in surfing history.\" Other surfers, providing voiceover commentary, say the wave's characteristics were so different from ordinary waves that Hamilton had to improvise new techniques, some of them violating years of surfing theory and instinct, right there on the wave.\r\n\r\nWhat a long time it seems since that summer of 1967, when I sat in a Chicago beer garden with the suntanned and cheerful Bruce Brown. He'd just made a documentary named \"The Endless Summer,\" and was touring the country with it, at the moment when surfing was exploding (there were 5,000 surfers in 1959, 2 million today). For Brown, surfing was a lark. With a $50,000 budget, he followed two surfers on an odyssey that led to Senegal, Ghana, South Africa, Australia, New Zealand, Tahiti and Hawaii. They were searching for the \"perfect wave,\" and found it off Durban, South Africa: \"A 4-foot curl that gave rides of 15 minutes and came in so steadily it looked like it was made by a machine.\"\r\n\r\nA 4-foot curl? Hamilton and his contemporaries challenge waves of 60 or 70 feet. \"The Endless Summer\" charts a world of beaches and babes, brews and Beach Boys songs, and surfers who live to \"get stoked.\" In \"Riding Giants\" the sport is more like an endless winter -- solitary and dangerous. Even as Brown was making \"The Endless Summer,\" modern surfing was being invented by pioneers like Greg Noll of Hawaii, who ventured 15 miles up the coast from Honolulu to Waimea Bay. It was thought to be unsurfable; a surfer asks himself, \"can the human body survive the wipeout?\" It could. The discovery of the North Shore of Oahu, the movie says, \"was surfing's equivalent of Columbus discovering the New World.\"\r\n\r\nMore vintage footage. The \"storm of the century\" descends upon Hawaii, and Noll, known as \"The Bull,\" determines to surf it. His chances of surviving are rated at 50\/50 by the movie, at zero by any reasonable person watching it. He survived. It was \"the biggest wave ever ridden\" -- until, perhaps, the monster that Hamilton found off Tahiti, too big to be measured.\r\n\r\nAfter Bruce Brown finds his Perfect Wave in \"The Endless Summer,\" he marvels: \"The odds against a wave like this are 20 million to one!\" The odds that Laird Hamilton could get stoked on a 4-foot curl are higher than that. Before seeing \"Riding Giants,\" my ideas about surfing were formed by the Gidget movies, \"The Endless Summer,\" the Beach Boys, Elvis and lots of TV commercials. \"Surfin' Safari\" was actually running through my head on the way into the screening.\r\n\r\n\"Riding Giants\" is about altogether another reality. The overarching fact about these surfers is the degree of their obsession. They live to ride, and grow depressed when there are no waves. They haunt the edge of the sea like the mariners Melville describes on the first pages of Moby Dick. They seek the rush of those moments when they balance on top of a wave's fury and feel themselves in precarious harmony with the ungovernable force of the ocean. They are cold and tired, battered by waves, thrown against rocks, visited by sharks, held under so long they believe they are drowning -- and over and over, year after year, they go back into the sea to do it again.","id":"52d20a1d760ee34cc00f9964","url":"https:\/\/www.themoviedb.org\/review\/52d20a1d760ee34cc00f9964","movie_id":291}
{"author":"Gimly","content":"Might have the only genuinely funny \"bodily-fluid gag\" ever put to screen. Which really speaks to _Team America_ overall, and even to the entire career of Matt Stone and Trey Parker. The only thing it is more than idiotic, is genius.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"59f2847ec3a3687126001626","url":"https:\/\/www.themoviedb.org\/review\/59f2847ec3a3687126001626","movie_id":3989}
{"author":"John Chard","content":"Absinthe Actioner!\r\n\r\nVan Helsing is written and directed by Stephen Sommers. It stars Hugh Jackman, Kate Beckinsale, Richard Roxburgh, David Wenham, Shuler Hensley, Elena Anaya, Will Kemp, Kevin J. O'Connor and Alun Armstrong. Music is by Alan Silvestri and cinematography by Allen Daviau.\r\n\r\nFamed monster hunter Van Helsing (Jackman) is sent to Transylvania to stop Count Dracula's (Roxburgh) fiendish plan involving the Frankenstein Monster and the Wolf Man.\r\n\r\nWell it was universally savaged by the pro critics and is considered a flop. Yet whilst understanding those things, it does for a reason hold above average ratings on the big internet movie sites. It did find a market (and continues to do so), it's like one big long MTV video, a sort of chaotic monster fun frolic in rock opera style. \r\n\r\nIt's effects laden, which is no great thing since they are shoddy, and the dialogue is often as cringe worthy as some of the accents are. Yet it's still a thrilling ride, a strap yourself in and run with it job, to be in the company of sexy lead actors in Gothic garb and devilish period surrounds.\r\n\r\nLoud and boisterous for sure, and tacky at times, but exhilarating all the same for those after some pure escapist carnage. 5\/10","id":"5dc74f99470ead00189475ab","url":"https:\/\/www.themoviedb.org\/review\/5dc74f99470ead00189475ab","movie_id":7131}
{"author":"Wuchak","content":"***Big Dumb Blockbuster Monster Fun***\r\n\r\nAlthough writer\/director Stephen Sommers had an unexpected hit with 1999's \"The Mummy,\" he went overKILL with the 2001 sequel \"The Mummy Returns,\" a prime example of modern blockbuster dreck that's full of explosions and \"exciting\" things going on, but somehow is strangely boring. That's the problem with 2004's \"Van Helsing,\" although not as bad.\r\n\r\nTHE PLOT: In 1887 Van Helsing (Hugh Jackman) teams up with Anna (Kate Beckinsale) in Transylvania to fight Dracula, his three lovely but vicious brides, the Frankenstein monster, werewolves, vampire babies, etc.\r\n\r\nIt won't take long for the viewer to perceive that \"Van Helsing\" shouldn't be taken too seriously. It's a partial parody\/homage of the classic Universal monster movies and part serious, just barely. Imagine \"Bram Stoker's Dracula\" (1992) with the over-the-top thrills of Indiana Jones and the flair of classic monster parodies like “The Vampire Happening” (1971) or \"Young Frankenstein” (1974) and you'd have a good approximation.\r\n\r\nThe film looks good, but there's too much CGI and some of the monsters look really cartoony, like Mr. Hyde and the werewolves. Others look quite good, like the flying vampire brides and Frankenstein's monster. As was the case with \"The Mummy Returns\" the film is strangely tedious despite all the manic happenings. Thankfully, there are worthy hints of depth, e.g. the Frankenstein monster and Anna. I wish there was more.\r\n\r\nSpeaking of Anna, Kate Beckinsale is definitely one of the highlights here as she looks stunning throughout in an amazing form-fitting costume and thigh-high boots seemingly appropriate for the late 1800s (speaking as someone who’s not even a Beckinsale fan). Josie Maran and Elena Anaya are also striking as two of Dracula's wives, Marishka and Aleera. Needless to say, excellent job on the female front. On the other side of the spectrum, Jackman is a great, masculine leading man, perfect for the role. Richard Roxburgh (Dracula), David Wenham (Carl), Kevin J. O'Connor (Igor) and Shuler Hensley (Frankenstein’s monster) are all entertaining or effective.  \r\n\r\nAt the end of the day, though, \"Van Helsing\" barely rises above the limitations of what it is: a big, dumb modern blockbuster with all its over-the-top trappings. Considering the $160 million thrown into it, it shoulda\/coulda been better. The story needed time to breathe and less constant mania. The movie’s also over-long at 2 hours and 11 minutes. Still, it's better than \"The Mummy Returns\" and there's enough here to make it worthwhile, if you're in the mood for this type of fare.\r\n\r\nTHE FILM WAS SHOT in the Czech Republic, Rome and Paris with studio work done in Southern Cal and Orlando, Florida.\r\n\r\nGRADE: B-\/C+","id":"5afc6f95c3a3685fd1000415","url":"https:\/\/www.themoviedb.org\/review\/5afc6f95c3a3685fd1000415","movie_id":7131}
{"author":"Wuchak","content":"***Haunting and surreal Southern Gothic is nigh post-apocalyptic***\r\n\r\nTwo boys living with their father (Dermot Mulroney) in rural Georgia near Savannah (where the film was shot) try to eke out a living off the land. Chris (Jamie Bell) is about 16 and Tim around 10; both manifest their grief over their dead mother and the challenges of their destitute isolation in different ways: Chris gets in trouble with the law while Tim strangely seems preoccupied with consuming non-edible items. Their father's brother (Josh Lucas) comes to visit and seems affable enough, but there's a wild, sinister glint in his eyes. No wonder, he's inwardly frothing with hostility and greed.\r\n\r\nDavid Gordon Green's \"Undertow\" (2004) is a bit reminiscent of Terrence Malick's \"Days of Heaven\" (1978) in that both are realistic dramas focusing on youths in rural areas and both offer a dreamy viewing experience. Each tries hard to enchant with their movie magic. Unlike \"Days,\" however, \"Undertow\" is rooted in Southern Gothic. Of the two, I favor \"Undertow.\"\r\n\r\nAfter viewing the director’s awesome \"Snow Angels\" (2007), easily one of the greatest dramas ever filmed, I decided to give this one, his previous film, another chance. I'm glad I did because \"Undertow\" is the type of movie that improves on repeat viewings.\r\n\r\nBut these types of arty flicks aren't for everyone. Those bred on modern blockbusters will likely find \"Undertow\" dull, meandering and pointless. I myself wasn't all that impressed the first time I watched it. I didn't hate it; I just didn't \"get\" it. I'm glad I gave it a second (and third) chance, however, because \"Undertow\" succeeded in pulling me in under its spell. You just have to be in the right mode for a film of this ilk.\r\n\r\nThe \"dreamy\" quality noted above is facilitated by Philip Glass' mesmerizing score that plays during the opening and closing credits. It's simple and repetitive, but spellbinding. I've gone to the credits a few times just to enjoy this brilliant piece.\r\n\r\nBeing a Southern Gothic drama\/thriller, \"Undertow\" has a cool Southern ambiance with focus on the rural underbelly. Other films that are successful in this regard come to mind: \"The General's Daughter,\" \"Ode to Billy Joe,\" \"I Walk the Line\" (with Gregory Peck, 1970), \"Mississippi Burning,\" \"Squirm,\" \"The Man in the Moon\" and \"The Skeleton Key.\" If you have a taste for these types of films, including the aforementioned \"Days of Heaven,\" you'll likely appreciate \"Undertow.\" The difference with “Undertow” is that it concentrates so exclusively on pastoral paucity that it cops a poetic post-apocalyptic ambiance.\r\n\r\nThe film runs 1 hour, 48 minutes. Kristen Stewart has a small role in the first act.\r\n\r\nGRADE: B\/B-","id":"5dd81be728723c0014550a72","url":"https:\/\/www.themoviedb.org\/review\/5dd81be728723c0014550a72","movie_id":16131}
{"author":"dskc","content":"This is a story about brothers, famous for music. The trouble arises when the younger gets married to another character. The movie shows the sensitive emotions of a newly wed couple and how they resolve to be with the family, as together. <br \/>\r\nThis is a musical treat is provided by various great singers of film industry, such as, SP Balasubrahmanyam, KL Yesudas, Shankar Mahadevan, Mano, KS Chithra as well as SP Sailaja. These were supported by, Sunitha, Madhu Bala Krishnan, Sri Ram Partha Sarthy and Radhika.","id":"59e98de1c3a3687f32008f14","url":"https:\/\/www.themoviedb.org\/review\/59e98de1c3a3687f32008f14","movie_id":307964}
{"author":"WilliamJones","content":"Big shoutout to Tobey Maguire for giving so much life and soul to Peter Parker. I can't imagine anyone else doing so well like he did.","id":"5e011b9175110d0011d89295","url":"https:\/\/www.themoviedb.org\/review\/5e011b9175110d0011d89295","movie_id":558}
{"author":"BenjaminCollins","content":"Never have I seen so much realism in a film, let alone a superhero film. Amazing director!","id":"5e12ca38fc5f0600179086c1","url":"https:\/\/www.themoviedb.org\/review\/5e12ca38fc5f0600179086c1","movie_id":558}
{"author":"richardmiller","content":"Tobey Maguire did a great job making Peter Parker a young man that you would feel for, wince with, and watch slowly as he turns from this young boy into a man.","id":"5e0923de2fccee00105da017","url":"https:\/\/www.themoviedb.org\/review\/5e0923de2fccee00105da017","movie_id":558}
{"author":"JessieCollins","content":"To me, it felt like what Uncle Ben imparted to Peter in the first film - with great power comes great responsibility - was the very essence of this film. He had too much power, too much responsibility, and he needed to find a way to balance all of that.","id":"5dc56f667d2bc1001740b1b3","url":"https:\/\/www.themoviedb.org\/review\/5dc56f667d2bc1001740b1b3","movie_id":558}
{"author":"tmdb39513728","content":"**Superheroes Anonymous**\r\n\r\nTragically I am a Batman. An obsessive Caped Crusader comic-book collector until 1972 when my evil mother tossed the entire bunch in the garbage. My cousin was Spider-man. His noble mother preserved his collection with plastic envelopes and to this day they remain in pristine condition. \r\n\r\nWhat's truly tragic about being a Batman is that, despite Nolan's recent attempts (and questionable sincerity), the best Batman movie hasn't been made yet. As far as we know, with Batman's fate resting with Warner Bros, David Goyer, Zak Snider and Ben Affleck, the best Batman movie will not be possible for another decade or two, maybe three. I await thee Dark Knight.\r\n\r\nAgain to my cousin's good fortune, the best movie about Spider-man has been established for quite some time. In fact, as a benchmark, it is arguably the best comic-book super-hero movie ever made. I didn't much love Sam Raimi's first Spider-man, and wished my mother could have disposed of his last entry, but _Spider-Man 2_ was, and is, the ultimate movie adaptation from comic-books to the movie screen. \r\n\r\nI was living in Shanghai in the summer of 2004 where I had to commute 3 hours on a hot and dizzy day to see it in English, and was fully rewarded for the effort. I was thrust into a imaginary super-hero world far more pleasing than anything I could remember since childhood. The 3 hour commute back home seemed like a breeze because Spider-man 2 awoke the wonder-struck boy inside me. It reminded me of a happy youth I forgot I had. It felt like Spidey was on the subway with me and would protect me from any harm. And he was just a boy himself! Batman? Who's that?\r\n\r\nFor a super-hero story, nearly everything is perfect in this movie. Doc Ock couldn't have been better. He looked exactly the way he did, at the height of Stan Lee's eminence, in the brightly coloured panels fighting Spider-man in 1968. And sounded just like I imagined he would. Peter and Mary Jane were in their element and their friendship and romantic undertaking actually mattered. The story and action played out the way a comic book should. It was both intimate and fantastic. Trippy, wonderful and scary. It was like growing up all over again. The climax was a bit too flashy, loud and over-the-top at that time, but by today's standards, when compared to climactic train-wrecks in _Man of Steel_, _Iron Man 3_ and _The Avengers_, it's perfectly splendid.\r\n\r\nWe are now being helplessly bombarded with comic book movies attacking us from every direction, all of them trying to out-do each other, jumping one shark after another. Every marginal superhero from Dr Strange to Shazam is being dusted off and hurled onto the big screen for our insatiable happy-childhood-appeasing appetite. The Marvel of Disney is launching at us one theme-park roller-coaster ride after another. Sony, with their Amazing Spider-man abominations, has completely lost it. Fox's X-Men and Fantastic Four proliferations hit the wall long ago. And DC, under the reigns of Warner Bros, has transfigured into its own worst enemy. A wretched mutation not even the Joker finds amusing.\r\n\r\nTurns out Sam Raimi's _Spider-Man 2_ is the gold standard by which all comic-book movies, certainly those of the super-hero variety, are and, evidently, will be set. Lucky cousin.","id":"54afa069c3a3682e40001674","url":"https:\/\/www.themoviedb.org\/review\/54afa069c3a3682e40001674","movie_id":558}
{"author":"BradleyStewart","content":"Is it me or does MJ get more and more annoying with every film? Still a 10\/10 film for me because I'm not here for her, I'm here for my boy, Peter Parker!","id":"5dc393b77d2bc100113c8ed1","url":"https:\/\/www.themoviedb.org\/review\/5dc393b77d2bc100113c8ed1","movie_id":558}
{"author":"JeffreyYoung","content":"Definitely a fan's dream-come-true! Studios of today should take notes from films like this if they want to produce a successful superhero film.","id":"5e0e0cc56dc6c000184cff71","url":"https:\/\/www.themoviedb.org\/review\/5e0e0cc56dc6c000184cff71","movie_id":558}
{"author":"JustinCampbell","content":"All the action, comedy, and drama had such a delicate balance. It's pretty amazing to see such a precise blend of these emotions in a superhero film.","id":"5e0e53069974ee0015a6c692","url":"https:\/\/www.themoviedb.org\/review\/5e0e53069974ee0015a6c692","movie_id":558}
{"author":"MarkMartin","content":"Alfred Molina delivered a top performance in this film! Even with the short screen time, he made such a great impact on the overall quality of the movie.","id":"5e20d701397df00012964cae","url":"https:\/\/www.themoviedb.org\/review\/5e20d701397df00012964cae","movie_id":558}
{"author":"AnthonyWhite","content":"Rather than trying to top the first film, Spider Man 2 builds upon each of the elements of it. Better fight scenes, better effects, better script, better acting, etc.","id":"5e124c17fc5f0600198f81d8","url":"https:\/\/www.themoviedb.org\/review\/5e124c17fc5f0600198f81d8","movie_id":558}
{"author":"DonaldHarris","content":"Spider Man 2 has it all - a great story line, action that'll leave you at the edge of your seats, more romance, humor, fine acting, and excellent pacing.","id":"5e1267aad8af670014bd672b","url":"https:\/\/www.themoviedb.org\/review\/5e1267aad8af670014bd672b","movie_id":558}
{"author":"SamuelSanchez","content":"Read the comic book and you'll appreciate more how they stayed true to the book!","id":"5e12ce36fc5f060017908d7b","url":"https:\/\/www.themoviedb.org\/review\/5e12ce36fc5f060017908d7b","movie_id":558}
{"author":"CharlesTaylor","content":"If you ask me, this is leaps and bounds better than the Superhero films - even the Batman films. Spider-Man is that person anyone can relate to. He has such a big human side to him that it's hard not to resonate with him.","id":"5e0f0ce26818880012594d53","url":"https:\/\/www.themoviedb.org\/review\/5e0f0ce26818880012594d53","movie_id":558}
{"author":"JacobKing1","content":"Here in this movie, we see more of the human side of Spider-Man and saw how this boy turned into a man trying his best to fulfill his responsibilities being a human and superhero at the same time.","id":"5e0e16dd6dc6c000134d2120","url":"https:\/\/www.themoviedb.org\/review\/5e0e16dd6dc6c000134d2120","movie_id":558}
{"author":"RaymondMorris","content":"One of the nearly-flawless superhero movies we have and is a definite must-watch for all generations.","id":"5e12d2a9d64ac20014651719","url":"https:\/\/www.themoviedb.org\/review\/5e12d2a9d64ac20014651719","movie_id":558}
{"author":"ThomasMoore","content":"This is one of the OG films that paved the way for the superhero films of today. I can't express how thankful I am for Tobey Maguire for being the pioneer!","id":"5e09c241d35dea00162112d8","url":"https:\/\/www.themoviedb.org\/review\/5e09c241d35dea00162112d8","movie_id":558}
{"author":"SamuelSanchez","content":"Read the comic book and you'll appreciate more how they stayed true to the book!","id":"5e12ce36d64ac200146501e5","url":"https:\/\/www.themoviedb.org\/review\/5e12ce36d64ac200146501e5","movie_id":558}
{"author":"ChristopherAndersen","content":"Wanna see what a flawless film looks like? Go see this one now!","id":"5e0f409658361b0015bfd5a5","url":"https:\/\/www.themoviedb.org\/review\/5e0f409658361b0015bfd5a5","movie_id":558}
{"author":"LarryAdams","content":"A surprisingly outstanding sequel to the first Spider-Man film.","id":"5e0e47cec2f44b0011305e99","url":"https:\/\/www.themoviedb.org\/review\/5e0e47cec2f44b0011305e99","movie_id":558}
{"author":"NicholasLopez","content":"I thoroughly enjoyed it and I think it's one of the most engrossing superhero movies there is.","id":"5e0e210c6dc6c000154cce74","url":"https:\/\/www.themoviedb.org\/review\/5e0e210c6dc6c000154cce74","movie_id":558}
{"author":"DanielThomas","content":"More than just a comic book hero, Spider Man is a person with human problems, responsibilities, and the same human struggles each of us go through. This is exactly the reason why a lot of people like him so much.","id":"5e107dd85907de0012da5c19","url":"https:\/\/www.themoviedb.org\/review\/5e107dd85907de0012da5c19","movie_id":558}
{"author":"DavidBrown1","content":"You can definitely feel the effort that the studio put into every scene in the movie.","id":"5e028690c5840d0015093f3e","url":"https:\/\/www.themoviedb.org\/review\/5e028690c5840d0015093f3e","movie_id":558}
{"author":"Justin Lopez","content":"Sony did a great job of focusing on what really matters in this movie - the character. Here we see a relatable Peter Parker who can't seem to catch a break and when he does it just feels so satisfying to watch him rise up from all the challenges he faced.","id":"5dc330b89d893900183427f4","url":"https:\/\/www.themoviedb.org\/review\/5dc330b89d893900183427f4","movie_id":558}
{"author":"1RobertJohnson1","content":"I was completely blown away! The 11-year-old in me definitely connected with this film on another level and made me remember just how much I loved superheroes.","id":"5e00ef25d236e60016918cfc","url":"https:\/\/www.themoviedb.org\/review\/5e00ef25d236e60016918cfc","movie_id":558}
{"author":"LoganWright","content":"It was amazing to see what they did to Harry's character. He went from being Peter's best friend to mortal enemy. I can't blame him though cause what do you expect would happen if you found out your best friend was the one who killed your father?","id":"5dc38a728d22fc00143d1eb2","url":"https:\/\/www.themoviedb.org\/review\/5dc38a728d22fc00143d1eb2","movie_id":558}
{"author":"PaulThompson","content":"Full of action, plenty of adventure, and  even with the technology back then, this still has award winning special effects for its time.","id":"5e20e072cf4b8b0017ef20fa","url":"https:\/\/www.themoviedb.org\/review\/5e20e072cf4b8b0017ef20fa","movie_id":558}
{"author":"MatthewJackson","content":"Sequels usually have this thing where they end up being total garbage compared to the first, but surprisingly, Spider Man 2 was on point. Same quality, same amazing plot, and same award-winning performance by Tobey Maguire.","id":"5e1219d9d8af670014bcdb03","url":"https:\/\/www.themoviedb.org\/review\/5e1219d9d8af670014bcdb03","movie_id":558}
{"author":"StephenScott","content":"I really, really appreciate that they highlight character development and storyline more than the fight scenes.","id":"5e0e2b9668b1ea00137fc7b1","url":"https:\/\/www.themoviedb.org\/review\/5e0e2b9668b1ea00137fc7b1","movie_id":558}
{"author":"tmdb44006625","content":"I don't think anyone can review this movie better than what Roger Ebert said about it back in 2004: \"It's a real movie, full-blooded and smart, with qualities even for those who have no idea who Stan Lee is. It's a superhero movie for people who don't go to superhero movies, and for those who do, it's the one they've been yearning for.\"\r\n\r\nI also don't think any film has so eloquently defined a hero the way Aunt May does in a wonderfully heartfelt and poignant scene half way through the film.\r\n\r\nI do think the villain of Doctor Octopus is underdeveloped in both logic and motivation (although Alfred Molina is great), Mary Jane Watson is too dependent on the men in her life, and the friendship arc between Peter and Harry is a bit contrived, but none of these flaws affect what is otherwise a beautifully constructed film and a worthy sequel to the original.","id":"5c8429660e0a26430562cce2","url":"https:\/\/www.themoviedb.org\/review\/5c8429660e0a26430562cce2","movie_id":558}
{"author":"markuspm","content":"The overview says \"A woman and her daughter emigrate from Mexico for a better life in America, where they start working for a family where the patriarch is a newly celebrated chef with an insecure wife.\" OMG this so does not catch what this movie is all about! What a boring description for such a passionate movie!","id":"52b7e9fb760ee37a6d01d7c9","url":"https:\/\/www.themoviedb.org\/review\/52b7e9fb760ee37a6d01d7c9","movie_id":2539}
{"author":"BrandonEvans","content":"Not only did they have great storytelling and scriptwriting, but they also had amazing actors as well! They definitely brought so much emotions out of every scene.","id":"5e12c6215907de0017df98ac","url":"https:\/\/www.themoviedb.org\/review\/5e12c6215907de0017df98ac","movie_id":558}
{"author":"John Smith","content":"You're not a real Spider-Man fan if you haven't watched this.","id":"5dc57a4d6f8d950013c2f477","url":"https:\/\/www.themoviedb.org\/review\/5dc57a4d6f8d950013c2f477","movie_id":558}
{"author":"John Chard","content":"Chucky has gone to seed!\r\n\r\nIt would be pure folly to have expected Seed of Chucky to be a brilliant entry in the Chucky franchise, the big-wigs pulling the financial strings behind the scenes clearly had no idea what had made the series popular in horror circles in the first place.\r\n\r\nBride of Chucky (part 4 for anyone counting) was bold and it worked, it managed to be that rare old thing of a horror film able to marry up horror and comedy for good entertainment purpose. Unfortunately everything about Seed of Chucky is lazy and weak. There is no story of substance here, it is neither funny or scary, the parody and self awareness the makers go for runs out of steam after 15 minutes! When the writers are reduced to a masturbation sequence to get their meta kicks then you know there's problems. 3\/10, and that is purely for Jennifer Tilly and her delightful way of not taking herself seriously.","id":"5bb26c6a925141167201e589","url":"https:\/\/www.themoviedb.org\/review\/5bb26c6a925141167201e589","movie_id":11249}
{"author":"Reno","content":"**A successful writer who accused of plagiarism.**\r\n\r\nIt was based on the novel, though the original title makes more sense than this film. Maybe they wanted to avert the spoiler. But I don't think it would have affected much, because the twist comes at the final segment. The tale of a writer who is in the middle of divorce and now living alone is the lake house got threatened by a stranger, because according to him he stole his story. Followed by many unpleasant events, how he gets out of the trouble told in the next half.\r\n\r\nFeels just an okay kind. Though Johnny Depp was good. The suspense was good, particularly in the first half, but later it comes falling down. The second half was average, the twist was not interesting enough. After some point, you might predict it, but the point is it was too familiar. I especially did not like the finale, it was like not in detail. Still a watchable film, because of the actor and for decently made. So I think worth a watch if you keep a low expectation.\r\n\r\n_6\/10_","id":"5851a371c3a36827a501848d","url":"https:\/\/www.themoviedb.org\/review\/5851a371c3a36827a501848d","movie_id":1586}
{"author":"Gimly","content":"A couple of the _Child's Play_ movies delve into the comedy genre, but _Seed of Chucky_ is the only one that leans into it fully. It's not a funny horror film, it's a comedy with some blood in it. Where the past two movies dip their toe into comedy, _Seed of Chucky_ **is** a comedy, and that complete dedication to a genre pays off. It's not great, but it works.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"59f27e75c3a368719f000c7e","url":"https:\/\/www.themoviedb.org\/review\/59f27e75c3a368719f000c7e","movie_id":11249}
{"author":"John Chard","content":"You strike me as the kind of guy who's on the lookout for a head he can knock off with a shovel.\r\n\r\nIt's actually a film that shows both the good and bad sides of Johnny Depp and Stephen King adaptations to film form.\r\n\r\nDepp plays a writer who whilst going through a divorce and living out in the country in isolation, is suddenly menaced by John Turturo, who claims he is the victim of plagiarism perpetrated by Depp. Mysteries and murky shenanigans to follow...\r\n\r\nThat the film, in spite of its flimsy heart, is watchable, is down to the two stars, both are filing in for eccentricities and spooky menace respectively. Yet it's a bit of a one trick pony and difficult to take seriously, while it's also surprisingly bloodless, negating the interest of the potential Stephen King blood-lust crowd. The reveal is something of a cheat given what has gone before, belief of suspension is so stretched to breaking point, you literally should be wondering just what all other characters were doing in the film?!\r\n\r\nStill, Johnny and John, resplendent with weird hats and hairdo's, give good camera time and save David Koepp's movie from stinker damnation. 6\/10","id":"550ca59692514133c300205c","url":"https:\/\/www.themoviedb.org\/review\/550ca59692514133c300205c","movie_id":1586}
{"author":"John Chard","content":"Alexander Revisited: The Final Cut.\r\n\r\nAlexander is directed by Oliver Stone and Stone co-writes the screenplay with Christopher Kyle and Laeta Kalogridis. It stars Colin Farrell, Val Kilmer, Angelina Jolie, Jared Leto, Anthony Hopkins, Rosario Dawson, Jonathan Rhys Meyers and Christopher Plummer. Music is by Vangelis and cinematography by Rodrigo Prieto.\r\n\r\nAlexander is an historical epic based on the life of Alexander the Great.\r\nOff the bat I have to say that this \"Final Cut\" version of the film is the only one I have seen. Upon its initial home format release - the first theatrical version - I lasted an hour and 15 minutes before growing restless and sought enjoyment elsewhere. Consequently as a massive fan of historical epics through the years, it has been a constant nagging itch for me to see Alexander in its entirety. So with Oliver Stone tinkering away with versions - convinced he has made a worthwhile epic - I finally delved in.\r\n\r\nThe Final Cut, as far as I'm aware, is a vast improvement on that savagely received theatrical release, well that is said by those who tried again instead of calling quits at the first production. Straight away I could see the difference, where once was a plodding first hour, now sits a vibrancy, with Stone seemingly saying that he can do great action and drama, just please hang around during all the historical chatter, sexual connotation, family strife and conquering machinations, and I will enthral you as a whole.\r\n\r\nBy his own admission, Stone reveals he took on a most complex historical character and in his eyes has made a film to befit such complexity. We get a splintered narrative, as we kick off with the crux of Alexander the Great, the leader, while Alexander's childhood and family forming is interspersed at various junctures. The battles are high in intensity and blood letting - exhilarating at times - but more crucially they let us engage with the tactical \"ahead of their time\" manoeuvres of Alexander the Great. This version mostly flows alright, and I got to feel how Alexander's mind was working in the process, even if come pics closure I didn't fully know the man.\r\n\r\nEpically cast of course, some of them work, others not so much. Farrell's looked odd, in the way that Pitt's was in Troy (released this same year as Alexander), but apart from the accent issue he grows into the role and is fiercely committed. Jolie is just wrong for the role of domineering Olympias, worse still the scenes she does with Farrell are damp and threaten to derail the drama already built up. This latter point is more annoying given a great thread involving Dawson as Alexander's wife Roxanne is built up superbly, only to not be pulled until some drama very late in the play. The rest of the cast come through as ok for period flavours (expected for Hopkins, Plummer and Meyers, interesting as regards Leto).\r\n\r\nThis is not the life ambition masterpiece Stone wanted to make, even if he proclaims on the extras that he's happy and content with The Final Cut version. This cut still shows some cracks, but these are not seismic enough to hurt the film. For there's a lot of grandeur, blood stirring and thought gone into the production, and there's a lot to be said for that in this day and age of soulless cash making filmic exercises. Honourable failure then? Yes for sure, but a better film in this form than some may have thought possible back in 2004. 7\/10","id":"5d0e0b04c3a36822c31e753b","url":"https:\/\/www.themoviedb.org\/review\/5d0e0b04c3a36822c31e753b","movie_id":1966}
{"author":"John Chard","content":"Monstrous - but not a total monstrosity.\r\n\r\nAntartica, and an expedition is about to uncover a battleground for Aliens and Predators.\r\n\r\nWhoever wins, we lose! So ran the tag line for Paul W. S. Anderson's prequel (?) to two fanatically worshipped franchises. Little was Anderson to know that it was the majority of cinema goers who would feel that they had \"lost\" their cash on coming out after watching this miss-matched effort. Though in truth nobody could seriously have expected a film to rival the best of both serials (Alien, Aliens & Predator), it's still right that us fans should expect the formula to be respectfully adhered too. We want character build up, we expect a group dynamic to function, and we definitely want the baddies to stay just that, as baddies.\r\n\r\nIt's not a total loss, though, even as Anderson all too quickly hurtles towards his \"humans caught in a cube like puzzle box\" blood bath, there is just enough back story and anticipation to tickle the tongue. In fact, when it all goes pear shaped and Xenomorphs, Pred-Rastas and humans are all lined up for slotting, it's damn near exciting stuff. While the pyramid\/cube\/maze design is pretty awesome. However, then the plus points are vanquished as the film quickly becomes kiddie friendly as gloop gives way to strawberry jelly, featuring a turn of events with our \"heroine\" that's so clumsy I'd be surprised if Anderson sleeps at night.\r\n\r\nStill, it's obvious that Anderson loves both franchises and he in no way would have wanted to make a stinker. But he has made a very average movie, one that's got two things in its favour. One being that is the neat middle section, the other that it's not half as bad as the messy hack job that was AVPR: Aliens vs Predator - Requiem in 2007. 5\/10","id":"56de19d492514134f40005fa","url":"https:\/\/www.themoviedb.org\/review\/56de19d492514134f40005fa","movie_id":395}
{"author":"Per Gunnar Jonsson","content":"My wife picked this one up together with the weekly TV magazine. Luckily we didn't pay full price. I hoped for a film about one of the greatest warlord of all time but what I got was something about a crying homosexual wimp.","id":"594262aec3a3686c2c0099f7","url":"https:\/\/www.themoviedb.org\/review\/594262aec3a3686c2c0099f7","movie_id":1966}
{"author":"Gimly","content":"I can honestly say, that this is one of the most under-rated films of 2004.\r\n\r\nNot because it was good, just because it was panned so fucking hard by critics! I think this is mostly due to the fact that it was being compared to both the Alien and Predator series, which is fair enough, but it was never going to be what either of those films was.\r\n\r\nUltimately it's downfall came from some poor dialogue, and trying to reach a larger audience. Where Predators was a film that you didn't need to have watched all the others in order to follow, it was still fundamentally a Predator film, aimed at the Predator-loving market. AVP on the other hand used references to the older films, but then completely threw the canon out the window and went for a larger fanbase. And whilst it worked to some degree (my grandma liked it) it wasn't enough of a step in either direction. AVP was complicated as a stand alone, and disastrous when compared to anything else in the franchise except perhaps its sequel Requiem (and maybe Predator 2 or Alien3).\r\n\r\nHonestly I think the film works as an archetypal film in the realm of both Alien and Predator, just not a sequel or prequel to either. The lead protagonist is a woman by the name of Alexa Woods, portayed by Sanaa Lathan (Blade, Contagion) who was clearly meant to be a modern day Ripley, and catastrophically failed at doing so. The Predators were as cool as ever, and people complained that in the latter half of the film they weren't as ghostly as in Predator\/Predator 2, but we've already had two whole films of that, and these were juvenile Predators, so it sort of made sense that they were a tad more restless.\r\n\r\nBringing Lance Henriksen (Damien: Omen II, Piranha II: The Spawning, The Terminator, Aliens, Alien 3, Pumpkinhead, The Quick and the Dead, Mind Ripper, Scream 3, The Lost Tribe) back was an awesome decision, one that was probably lost on the audience who had not seen the Alien series.\r\n\r\nTommy Flanagan (Smokin' Aces 1 and 2, Sin City, When a Stranger Calls [2006], Gladiator, Braveheart) is another an actor I love, it was a shame his character (Mark Verheiden) was so underused. Ultimately, the film is a good one to pick up and put down, don't think about it too much, don't compare it to the others, go in with your only expectation being that it's a monster-movie, then you won't come out too disappointed.\r\n\r\n59%\r\n\r\n-Gimly","id":"5aaf6a6492514116c0034006","url":"https:\/\/www.themoviedb.org\/review\/5aaf6a6492514116c0034006","movie_id":395}
{"author":"John Chard","content":"Disney doing what they do best with this sort of material.\r\n\r\nIt's a feel good sports movie based around the true story of Coach Herb Brooks (Kurt Russell) who had the unenviable task of leading the 1980 U.S. Olympic hockey team in the Winter Olympics at Lake Placid. Where the all conquering Russian squad were waiting.\r\n\r\nWe follow Brooks as he assembles a youthful squad then pushes them to the limits, mentally and physically, all while facing pressures in his home life as he gives his all on the ice rinks. If you know your sports history then there's obviously no surprise factor here, but there's good insight into squad dynamics, of coaching and toughness involved in the many facets of high level sport. Russell leads his young cast admirably, while the action scenes during the matches have a kinetic energy that's most impressive. 7\/10","id":"550cad289251414691004180","url":"https:\/\/www.themoviedb.org\/review\/550cad289251414691004180","movie_id":14292}
{"author":"Wuchak","content":"***Female “Rocky” with a downbeat and contradictory close***\r\n\r\nReleased in 2004 and directed by Clint Eastwood, “Million Dollar Baby” stars Eastwood as a cantankerous boxing trainer who owns a working class gym in Los Angeles, which is maintained by one of his former boxers, the narrator of the story (Morgan Freeman). A waitress from the sticks of Missouri (Hilary Swank) shows up and asks that Frankie (Eastwood) train her, which he refuses to do because she’s too old at 32 and he “doesn’t train girls,” probably because he had an unexplained falling out with his daughter years earlier. Eventually he begrudgingly agrees.\r\n\r\nThe bulk of the film is basically a female version of “Rocky” (1976), except that I prefer the potent drama in this one. The three main characters are well fleshed-out with an all-around reverent tone, not to mention an occasional bit of mild amusement. Frankie and Maggie (Swank) slowly develop a father\/daughter-type relationship and it’s touching.\r\n\r\nThe third act, however, takes a left turn that is seriously downbeat. It departs from sports movie formula with a message that contradicts everything the first two acts pushed, which is inexplicable. Sure, I ‘get’ the point: A certain person basically sacrifices everything to do what’s (supposedly) best for the situation and honor the will of a dearly loved soul. Nevertheless, it’s a dark turn that leaves a sour taste because it refutes the positive message of the first two-thirds of the story.\r\n\r\nThe film runs 2 hours, 12 minutes and was shot in Los Angeles.\r\n\r\nGRADE: B-\/C+","id":"5c1a63310e0a2657b61c54a7","url":"https:\/\/www.themoviedb.org\/review\/5c1a63310e0a2657b61c54a7","movie_id":70}
{"author":"John Chard","content":"Brain Drain!\r\n\r\nThe Mindhunters of the title are a group of FBI profilers who as part of their training are sent to a remote island to solve a mock crime in a mock town. Their mission is to form a profile of a serial killer known as The Puppeteer, trouble is, is that The Puppeteer turns out to be real and starts picking them off one by one.\r\n\r\nDirected by Renny Harlin and featuring a bonkers story written by Wayne Kramer, it doesn't take an FBI profiler to know what sort of film this is going to be. Featuring a cast that contains LL Cool J, Jonny Lee Miller, Patricia Velásquez, Val Kilmer and Christian Slater, Mindhunters is undeniably preposterous cinema for the easily pleased masses, and yet it's still hugely enjoyable and isn't found wanting in the ingenuity stakes. \r\n\r\nThe killers secret is closely guarded, which keeps the Ten Little Indians (yes this is another Agatha cover version) like mystery going, and the manner of the deaths have a morbid freshness about them - with one in particular being outrageously thrilling. A few scenes are neatly crafted by Harlin, who is after all is no slouch in the action genre (Die Hard 2, Cliffhanger, The Long Kiss Goodnight), while the swimming pool finale is taut and tight and the killer reveal genuinely a surprise. \r\n\r\nYes there's problems abound in the film, but isn't there always in this kind of \"B\" movie hogwash? The cast do what is required as they work through some pretty naff dialogue, and any expectation about caring for any of these characters should be set at option zero. However, it's a nice fit for Harlin, as it finds him comfortable in the knowledge that we want whizz bang murder death kill, and thus he delivers. Expectation of anything else is pure folly and one directs you towards René Clair's excellent 1945 film, And Then There Were None if you need something a bit more solid in your murder mystery diet. 7\/10","id":"5cce8a4fc3a3683697d8d9c4","url":"https:\/\/www.themoviedb.org\/review\/5cce8a4fc3a3683697d8d9c4","movie_id":16617}
{"author":"HotelCharliHill","content":"Definitely better than \"Alpha\", and certainly having some great aspects, but there are a number of detractors inhibiting me from giving it a higher score.\r\n\r\nCheck out my full review at https:\/\/geekyngodly.blogspot.com\/2020\/04\/appleseed-2004-was-it-better.html","id":"5e92173ad55e4d001a17df52","url":"https:\/\/www.themoviedb.org\/review\/5e92173ad55e4d001a17df52","movie_id":11633}
{"author":"Andres Gomez","content":"Crappy stereotypical story, bad and cheesy dialogues and an animation that shows some quality when representing non living characters: people have not facial expression whatsoever.","id":"50cb1166760ee330a0145c06","url":"https:\/\/www.themoviedb.org\/review\/50cb1166760ee330a0145c06","movie_id":11633}
{"author":"John Chard","content":"Come on, man. You must've heard the priest say something about life and death.\r\n\r\nGeorge Romero fans feared the worst, another one of his sacred original zombie trilogy films was being remade, this even though the remake of Night of the Living Dead didn't disgrace itself. As it happened, the fears were unfounded, for Zack Snyder and his team crafted one of the best horror remakes going.\r\n\r\nThe premise follows Romero's wonderful version, a mysterious epidemic is causing the populace to turn into undead zombies, the bite of which transfers the illness to another. A small group of survivors make it to the Crossroads Mall and hole up there whilst trying to keep at bay the zombie hordes, but inner fighting threatens the group whilst they know they can't stay there for ever.\r\n\r\nRight from the off the film grabs you around the throat, it's a blistering and terrifying opening which brings heartbreak and terror in equal measure. It also announces to us that these zombies are different to Romero's, these suckers can run, and run fast. After some chaos and blood, the introductions to our survivors is set up and the pic settles into a superb group dynamic situation, where machismo and brains meet dumb and dumber, all while little devilish moments trickle away in the background.\r\n\r\nIt's the focus on the survivors that really lifts it to greater heights, how they variously react to their plight, there's good thought gone into the screenplay (James Gunn). The natural progression of this type of film calls for horror moments, and Snyder deftly slots them in when the pic needs them, which again brings about scenes of terror and genuine heartbreaking moments. Some neat cameos will be cheered by fans of Romero's work, while the cast are superb here, with Sarah Polley the standout fulfilling the believable promise of the character as written.\r\n\r\nA remake that is its own beast yet still pays homage to what inspired it, and good at both! Now that's a rare thing in horror! 8\/10","id":"5627f5d692514116a20004c6","url":"https:\/\/www.themoviedb.org\/review\/5627f5d692514116a20004c6","movie_id":924}
{"author":"Per Gunnar Jonsson","content":"It might (barely) have gotten one more star if it hadn’t been the third one in the Blade trilogy. As such it has some mighty good movies to live up to and that it doesn’t.\r\n\r\nThis time David S Goyer took to both write and direct the movie. I guess he should have stuck to script writing or something. The action scenes are not too bad. However, that’s all there is. Just a string of actions scenes barely strung together.\r\n\r\nThe worst offence of them all is Dracula. When I first learned that they brought in Dracula as the chief nemesis I thought that sounded cool. Wrong! Apart from a fairly cool look when he get really pissed off the film’s portrayal of Dracula is a joke. It’s an insult to the Dracula legends.\r\n\r\nTo sum it up, it’s 2 hours of not too bad action but a disappointment as a Blade movie.","id":"5a626649c3a36836b9005bfa","url":"https:\/\/www.themoviedb.org\/review\/5a626649c3a36836b9005bfa","movie_id":36648}
{"author":"tmdb44006625","content":"When a horror movie has to resort to vampire dogs, you know they're completely out of ideas. That's the least stupid part of Blade Trinity.","id":"5c842807c3a36839d4d284d2","url":"https:\/\/www.themoviedb.org\/review\/5c842807c3a36839d4d284d2","movie_id":36648}
{"author":"Gimly","content":"Blade: Trinity completes the Blade trilogy in cinematic grandeur, and brings about Dracula, an inevitable source in almost every Vampire franchise ever conceived of.\r\n\r\nIt was refreshing to have the \"Elder\" ruling-class\/vampire-nation-lord\/shadow-council thing dropped, since they were in both Blade and Blade II, and in both movies they were completely killed off, and ignored the existence of each other. Instead we have a group of happy-go-lucky vamps, who have one way or another made a mark in the world. You never find out how they managed to buy a skyscraper and a museum's worth of ancient art, but I'd imagine they had quite a lot of time to get their finances in order.\r\n\r\nAnyway, deal is these vamps, right? Danica Talos (Posey \"Queen of the Indies\" Parker; Scream 3, A Mighty Wind), her brother Asher Talos (Callum Keith Rennie; Case 39, The X-Files: I Want To Believe), Jarko Grimwood (wrestler Paul \"Triple H\" Levesque), and their offsider vampires go to Syria in order to dig up the slumbering Dracula (Dominic Purcell; Straw Dogs, Blood Creek)... Or Drake... Or Dagon... They keep changing their mind. Anyway, after Dracula kills a bunch of them, he eventually agrees to join the team after he hears about the defender of humanity Blade (Wesley Snipes; New Jack City, Chaos) whom he believes may be a worthy adversary. Blade in turn gets together with the vampire hunting cell called \"Nightstalkers\", led by Abigail Whistler (Jessica Biel; the The Texas Chainsaw Massacre, Cellular) and Hannibal King (Ryan Reynolds; Waiting..., Buried) and together they continue the war for humankind.\r\n\r\nWith me so far? No? Well you should be, because this plot is about as run of the mill as they get. While I'm on that, it's worth pointing out that where Blade's saving grace was this awesome mythos and story, and totally failed at character-ing, Blade: Trinity had fantastically written characters, in a sort of non-event storyline. Where Blade II blended them, making it the best in the series. Trinity was okay, but it lacked a lot of the engaging elements from the previous two films.\r\n\r\nI think in part this is because the film is meant to sort of cater to the cinema audience. After the success of Blade II, it's like they knew that people were going to go to the theatre for Trinity so they tailored the film accordingly. You know, just little things, cheesy lines come across in a way more badass way on the big screen. Montages can get tedious on the computer, but can often blow you away in theatres. Explosions and action and CG backflips always translate better in cinema than on DVD. Unfortunately, I own the DVD, not a cinema. Maybe the goddamn vampire pomeranian they threw in would've seemed less ridiculous if I'd seen Trinity when it came out in theatres, but I doubt it.\r\n\r\nI'd like to bring up the issue of names. Not that people have unbelievably crazy names in these films, it's the' Super Hero genre after all, of course they've got stupid names! I love it! But the Blade series seems to be populated entirely by characters with the \"Saying Names\" fetish. It's all \"Hannibal King! Die\", \"Blade! There you are\", \"Whistler! Come save us.\" \"Drake! It's him\" and gets pretty unbelievably dramatic rather swiftly.\r\n\r\nIt'll be interesting to see how Ryan Reynolds fairs. This Marvel film came out quite a while ago, since then he's played Wade Wilson in Origins: Wolverine, Green Lantern for DC Films, he was the protagonist in R.I.P.D. He's set to return to the X-Men universe for Deadpool. I suppose if Chris Evans can get away with playing The Human Torch in Fantastic 4 and Rise of the Silver Surfer then move on to playing Captain America in The First Avenger I don't see why Reynolds can't pull it off. Hannibal was great, Ryan Reynolds is great but I'd be fine to see this be the end of it all here.\r\n\r\n-Gimly","id":"5d624cc17f6c8d0016ee0bfa","url":"https:\/\/www.themoviedb.org\/review\/5d624cc17f6c8d0016ee0bfa","movie_id":36648}
{"author":"YYMBR","content":"After watching all 3 of the Blade movies in a row, it gives a lot of perspective. The first was before all the Marvel boxoffice stuff took off, the second was having some Reaper stuff which was cool, but Trinity was the best in the series for sure. It needs better writing as Snipes has attested. We can tone down the Deadpool a bit and have more Wesley being a badass and not trail off into side projects. Whistler's family origins type things as well as Hannibal King's, but focusing more on Blade because he seriously can carry the whole film like he should have been doing since day 1.","id":"5b01046e92514109c9006a9f","url":"https:\/\/www.themoviedb.org\/review\/5b01046e92514109c9006a9f","movie_id":36648}
{"author":"kwoonhei","content":"Little pretentious but still sick enough to get me interested. A little slow for my taste.","id":"5067f178760ee320350005aa","url":"https:\/\/www.themoviedb.org\/review\/5067f178760ee320350005aa","movie_id":52398}
{"author":"John Chard","content":"We all go a little crazy sometimes.\r\n \r\nStraight to DVD fare it may be, but it has some merit as a spooker to make it worth spending time with. Plot finds Joshua Leonard as a psychiatric intern who arrives at Cunningham Hall Mental Facility and quickly finds that all is not as it seems.\r\n \r\nIt’s hardly an original concept, that of a mental asylum housing something sinister, either supernatural or of human origin, but director and co-writer William Butler has a good feel for a chilly atmosphere, while he’s not scrimping on the shocks and terrifying imagery either.\r\n \r\nThe asylum is a suitably depressing place, unhealthily cold to look at and the patients milling about the place are the requisite hot-pot of sad cases and the disturbed. Then there is the basement ward, of course, where the extreme cases are kept in cells, and it looks like something straight out of Hades.\r\n \r\nJordan Ladd is on hand for eye candy and romantic thread duties, and Lance Henriksen adds his horror weight to the role of Governor of Cunningham Hall. It’s all very competently performed and constructed, the screenplay full of killings, dark corridor peril, secrets and a curveball twist thrown in as well.\r\n \r\nIt doesn’t push any boundaries, so searching for anything new here will only end up in disappointment. Yet it’s stylish and creepy enough to warrant a night in with the lights turned off. 6\/10","id":"52d1798119c295096c16bdc5","url":"https:\/\/www.themoviedb.org\/review\/52d1798119c295096c16bdc5","movie_id":17209}
{"author":"GWS_Compsoft","content":"Captivating and moving. Excellent. 8\/10","id":"5742ce0d925141111a001870","url":"https:\/\/www.themoviedb.org\/review\/5742ce0d925141111a001870","movie_id":436}
{"author":"JPV852","content":"I get what writer-director (and producer, editor, composer) Stevan Mena was trying to do (at least I think): an homage to 1980s slashers right down to the killer wearing a burlap-like sack over his head and a score straight out of Friday the 13th. For an independent horror movie, wasn't terrible and some of the acting was okay (more or less) but the ADR was laughably bad and there was nothing all that memorable. Passably entertainment but not much more than that.","id":"5ddb21c40cd44600142af1a7","url":"https:\/\/www.themoviedb.org\/review\/5ddb21c40cd44600142af1a7","movie_id":54702}
{"author":"tmdb44006625","content":"Hellboy is not a movie for everyone, no matter how much humour is in the screenplay. Nevertheless, Guillermo del Toro's usual knack for outstanding visuals, cool looking action, and focus on character development makes Hellboy unique and entertaining af.\r\n\r\nAlso, Ron Perlman is an amazing leading man. His charisma makes him one of the most underrated actors of our time.","id":"5c84294292514127631f9e78","url":"https:\/\/www.themoviedb.org\/review\/5c84294292514127631f9e78","movie_id":1487}
{"author":"Gimly","content":"I love the Mike Mignola _Hellboy_ comics, and this movie is a pretty massive deviation from that source material. Oddly though, I'm kind of not bothered by that. In fact in some cases, like that of the character of Karl Ruprecht Kroenen, the film version is actually an improvement. A regular re-watch of _Hellboy_ is a pretty frequent occurrence in my household.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._","id":"5bb6e2979251410dd101f7e7","url":"https:\/\/www.themoviedb.org\/review\/5bb6e2979251410dd101f7e7","movie_id":1487}
{"author":"Andres Gomez","content":"Interesting and sometimes funny but with an aim of being more transcendental than what it actually is.","id":"52ef64d719c295086e0407af","url":"https:\/\/www.themoviedb.org\/review\/52ef64d719c295086e0407af","movie_id":401}
{"author":"Ruslan","content":"Well, first of all, this movie is a good project. There is no science-fiction film in the history of Turkish cinema, and if you think about the budget, which was about 4 Mio. USD and nevertheless huge for Turkish proportions, George Lucas wasted a budget of 125 Mio USD for Star Wars Episode III, then it is the optimum of what has been created.\r\n\r\nThe story is no revolution, but no one ever expected that. Cem Yilmaz realised his vision of \"Turks in space\" and made his work well. His love for details is average.\r\n\r\nTo understand everything in that film, first you gotta be Turkish, since a big part of the humor is based on the street language that Cem Yilmaz is using perfectly. The second thing is, you have to know some US Science-Fiction movies like Star Wars, Matrix or Star Trek. Only the combination of these two requirements makes the movie really funny.\r\n\r\nG.O.R.A is unusual to the Turkish public, so this is why some people didn't like it I think. I consider this work as new era of special fx in Turkish movies.\r\n\r\nIn the end, it is a solid Turkish space movie.","id":"50f48ac019c2954ad50a83ed","url":"https:\/\/www.themoviedb.org\/review\/50f48ac019c2954ad50a83ed","movie_id":27275}