{"author":"lmao7","content":"Not done with the 1st month of 2017 when I saw this but this is officially my first new fave movie to watch this year. It has been on my ‘films to watch’ list for like a while after watching **Sing Street** - another **John Carney** film. And i did like his other film **Begin Again **(love the song Lost Stars). All have similar themes…not just music, but the process of making music. \r\n\r\n**I love the simplicity of Once** -  feels more raw and natural (than Sing Steet and Begin Again). And the songs are really beautiful. I have been listening to it everyday. My top 2 favorite scenes are: Falling Slowly (video above) at the music shop - instant connection through music! Doesn’t have to be a love story between the guy and the girl, just relate and connect for their love for making music. Second one would be the recording studio scene: When Your Mind’s Made Up. I love how the guy who’s ‘pressing the buttons’ was like meh just here to work with whatever wannabee band, and then when they start to play he’s like…what is this? this is actually good - support! And from there it’s just something magical for all of them, that you know these musicians are in their element and will remember it for the rest of their lives, doing something that they are all so passionate about. Everyone inside the studio - just very endearing characters.  \r\n\r\nWell I love the whole film so all the scenes are great. My favorite emotional song, Lies. It’s so powerful and heartbreaking, I think most relateable scene as well. \r\n\r\nJust might replace Garden State as my background film to play when I am doing something else, just to hear it. A must see for musicians and just music lovers like me.","id":"589acc15925141237b004192","url":"https:\/\/www.themoviedb.org\/review\/589acc15925141237b004192","movie_id":5723}
{"author":"Andres Gomez","content":"Interesting and psychological dark movie in spite of the glacial surrounding.\r\n\r\nThe isolation feeling is well executed and the cast works quite well.\r\n\r\nHowever, you cannot help feeling that something is missing and could have been done better at the end of the story.","id":"54241dab0e0a263b84003950","url":"https:\/\/www.themoviedb.org\/review\/54241dab0e0a263b84003950","movie_id":8471}
{"author":"John Chard","content":"Show off! \r\n\r\nA sequel to 2005 box office winner, \"The Fantastic Four\", \"Rise Of The Silver Surfer\" sees director Tim Story and the original cast principals return for more super hero schlocky fun. The story is based around the Marvel stories that featured the first appearance of said \"Silver Surfer\" in the comic book franchise. Silver Surfer (Doug Jones with Laurence Fishburne dubbing the voice) is acting as a herald for the planet devouring Galactus, the next target? Earth. Which is a bit untimely as Reed Richards\/Mr Fantastic (Ioan Gruffudd) and Susan Storm\/Invisible Woman (Jessica Alba) are trying to get married. Things are further problematic when after his first encounter with the Silver Surfer, Johnny Storm\/Human Torch (Chris Evans) finds his powers a bit off - in fact when he touches any of the others I the team their powers are exchanged, much to Ben Grimm\/The Thing's (Michael Chiklis) amusement. Not only that, but the military are starting to get heavy and annoyed with the four - and who is this back on the scene? Doctor Doom! (Julian McMahon) Thought he was dead, and how come he's in league with the military now? All of this issues must be addressed or the Earth will suffer the direst of consequences.\r\n\r\nBudgeted at $130 million, this sequel only just made its money back domestically, however, the Worldwide takings gave it an overall profit of nearly $160 million. Which when you consider that the first film (again raking the coin in) was met with very disdainful reviews (mostly warranted outside of Evans & Chiklis' efforts), it's somewhat surprising. Yet, and it's certainly no towering genre picture, \"Silver Surfer\" is a hugely enjoyable movie for fans of the source comics and the undemanding popcorn muncher. The fans, and I don't speak for all of them of course, should in the main be happy that the makers have been faithful to the origins of the story. There's also some nifty humour and both Alba and Gruffudd aren't as dull as they were in the first movie. Perhaps they are more comfortable now knowing that the paying public held sway over the critics?. Evans is still the best thing in the franchise (no surprise he would go on to play \"Captain America\" in \"The Avengers\" franchise), and the appearance of Andre Braugher as General Hager is a welcome edition. While the effects are considerably better than the poor fodder served up in the first movie - granted it wouldn't have been hard to improve on that score.\r\n\r\nWith a lovely light hearted approach, \"Fantastic Four: Rise of the Silver Surfer\" does its job. In the pantheon of super hero movies it sits some where in the middle, neither great or bad, just honest wholesome family fun. 20th Century Fox have announced that a reboot of the franchise is to come, so while Chris Evans goes off to mouth wateringly play \"Captain America\", the next lot of actors are charged with the not so easy task of winning over a tough comic book crowd, and, the critics too. 6.5\/10","id":"5e28a2191685da0019e12a9a","url":"https:\/\/www.themoviedb.org\/review\/5e28a2191685da0019e12a9a","movie_id":1979}
{"author":"Gimly","content":"Honestly I can't really tell if this is wholesome or not? And I can't get into why without spoilers, but I just... A lot of weird decisions went into making _Enchanted_... Still a good time. Has that young & old appeal thing working for it.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._","id":"5d6210f054f6eb711d9aabba","url":"https:\/\/www.themoviedb.org\/review\/5d6210f054f6eb711d9aabba","movie_id":4523}
{"author":"Shreyance Parakh","content":"**Gripping!!**\r\n\r\n*** This review may contain spoilers ***\r\n\r\nSome of you may find (or I should say try to) faults in this gripping courtroom drama but for the rest this movie is a lovely, more than just about courtroom, dual between the ever talented Anthony Hopkins and the not just about looks Ryan Gosling.The chemistry between the two is really difficult to not feel right from the first time in the courtroom where the Hannibal Lecterish Crawford gestures Beachum to adjust his bow tie.It is amazing how the movie grips you despite knowing the fact right from the start who is the killer.Though Crawford is too smart to be believable, the way its played it doesn't raise the slightest of doubt in your mind about its actual existence.Beachum's urge to put the devilish Crawford behind bars for trying to kill his wife and then getting away with it can be seen greatly in the scene in the hospital when Beachum tries to stop Crawford from pulling the plug of his wife's ventilator.The only thing i found missing was the almost lifeless, short lived, romantic relation of Crawford and Nikki Gardner(Rosamund Pike who looks stunning in the movie).Maybe it wouldn't have helped the movie's plot in any way except Crawford's asking for a favor from Gardner's dad later in the movie that's why they didn't put too much efforts to make them a couple.In all a great courtroom, psychological, thrilling, drama with great acting.And i'd better not forget to mention David Strathairn's portrayal of DA Lobruto which was too good and I'd have loved to see more of him... Don't miss this one if you like an intriguing courtroom drama!!","id":"590b2cb59251414fa8014b0b","url":"https:\/\/www.themoviedb.org\/review\/590b2cb59251414fa8014b0b","movie_id":6145}
{"author":"John Chard","content":"Fred Claus (2007)\r\n\r\nSaving Christmas and Building Bridges.\r\n\r\nIt does exactly what it says on the Xmas Movie Tin. Poorly received by the critics and equally unsupported by the internet hordes, Fred Claus may be guilty of sentimentality, but for those in need of a pick me up during yuletide then it delivers the requisite smiles to faces.\r\n\r\nVince Vaughn is Fred, brother of Santa (Paul Giamatti), who has grown up resenting his elder brother. When Fred is in desperate need of cash he gets in touch with Santa to ask for a big loan, Santa will oblige if Fred comes up to the North Pole to work for it. Anger, mirth and bonding does follow as Fred causes mayhem among the elves and finds himself pitched in the middle of a nefarious plan being hatched by Clyde Archibald Northcutt (Kevin Spacey).\r\n\r\nNot all the gags work but there are some genuinely funny moments, while the romantic threads are a touch too twee. Yet this wears its Xmas movie heart firmly on its red clothed sleeve, and there's nothing wrong with that. 7\/10","id":"549f57dcc3a3682f23009577","url":"https:\/\/www.themoviedb.org\/review\/549f57dcc3a3682f23009577","movie_id":5375}
{"author":"ravitejarayudu","content":"It is not a just a DIE HARD MOVIE! Eyes feasting....lot of action scenes,lot of intelligence and lot of technology, Bruce Wills is rocking the film. There is nothing to say about his action. Justin long well and good supported role and he is the main guy who is dealing with technology...Timothy Olyphant awesome acting as a villian....and elizabethwinstead acts as a daughter of brucewills i.e., John Mclane. When coming to the story fully packed once when we got that situation really no one will going to surive us. An excellent actions,stunts,technology,etc. It is totally a full pack \"FIRE SALE\".:) Superb MOVIE","id":"54194cd8c3a3686d96000edb","url":"https:\/\/www.themoviedb.org\/review\/54194cd8c3a3686d96000edb","movie_id":1571}
{"author":"Wuchak","content":"Big, dumb action flick delivers\r\n\r\nRELEASED IN 2007 and directed by Len Wiseman, \"Live Free or Die Hard\" is the fourth installment in the Die Hard series. John McClane (Bruce Willis) is ordered to pick up a youth hacker (Justin Long) who's targeted by cyber-terrorists led by Thomas Gabriel and Mai Linh (Timothy Olyphant & Maggie Q). Their goal is to create chaos by taking over the USA's transportation grids and stock market. Mary Elizabeth Winstead plays McClane's cute and feisty daughter while Kevin Smith has a small role as a computer geek living in his Mom’s basement.\r\n\r\nRigid fans complain that this sequel is \"Die Hard in name only\" because I guess it deviates from formula but, really, the Die Hard series is ANY challenging adventure that John McClane experiences just as the 007 flicks consist of James Bond in differing challenges; same thing with Dirty Harry. In any case, “Live Free or Die Hard” works as Die Hard sequel or as a stand-alone action flick with Bruce Willis. The story holds your attention while the action scenes are out of this world. They're so over-the-top that some write the movie off as absurd, but everything's done with a quasi-realistic tone so it helps the viewer go along with the ridiculous things that happen rather than tune out.\r\n\r\n\"Live Free or Die Hard\" is the natural progeny of over-the-top films like 1977's \"The Gauntlet\" where the action scenes are so overdone they're cartoony, but entertaining. There's a thin line that filmmakers must tread with these kinds of blockbusters because they can easily fall into overKILL, like 2001's \"The Mummy Returns,\" but \"Live Free or Die Hard\" evades that ditch by giving us fairly interesting characters and a compelling story. It may not be great but it certainly fills the bill if you're in the mood for a wild action flick.\r\n\r\nI like the continuity of the series: McClane’s wife (Bonnie Bedelia) is acknowledged here and we meet his daughter, now a hottie, and hear of his son, Jack. We learn of the severe price that John’s bold, serious approach to his profession has had on his personal life. These things are further explored in “A Good Day to Die Hard” (2013), which is basically just as good as this installment.\r\n\r\nTHE MOVIE RUNS 128 minutes and was shot in Baltimore, Washington DC, Philadelphia, Los Angeles and other parts of Southern California. WRITERS: Mark Bomback and David Marconi conceived the story\/script based on an article by John Carlin.\r\n\r\nGRADE: B","id":"5b2be68e925141651a007e5b","url":"https:\/\/www.themoviedb.org\/review\/5b2be68e925141651a007e5b","movie_id":1571}
{"author":"John Chard","content":"Dolphin Sandwich.\r\n\r\n1408 is based on one of horror writer Stephen King's short stories. It stars John Cusack as a supernatural investigator who rents room 1408 at The Hotel Dolphin in New York. It is said to be a most haunted room and the scene of many deaths. He soon finds his scepticism tested to the max.\r\n\r\nAlthough it has deep themes of grief et al, this essentially boils down to one man in a room being plagued by psychological and physical attacks, with the intended chills and shocks surreal in presentation. It's all very twisty and big on conundrums, which makes a second viewing something of a necessity, whilst Cusack's performance is also reason to check in for another viewing. However, it's not the scary movie some have lauded it as, in fact it's more fun-house palaver than anything terrifying, but there's no doubting the intelligence and skill of the writing. The mind is a curious, wonderful and troubling thing, and 1408 wants us to know it. 6\/10","id":"58c21af2c3a36842de002d50","url":"https:\/\/www.themoviedb.org\/review\/58c21af2c3a36842de002d50","movie_id":3021}
{"author":"Law","content":"This is insipid. The actors are stiff, the script sucks, the camera struggles to stay in focus, and there aren't even any steamy sex scenes or nudity to make up for it. This movie's poster is the only pleasure you'll get out of it. Don't bother.","id":"5b178d479251417835020489","url":"https:\/\/www.themoviedb.org\/review\/5b178d479251417835020489","movie_id":35054}
{"author":"John Chard","content":"Jan Paul Beahm (September 26, 1958 - December 6, 1980) \r\n\r\nWho? Well quite, and that may well be the problem for any casual movie fan who happens to like musical bio-pictures. Jan Paul Beahm during his short run for fame was better known as Darby Crash, lead singer and founding member of Los Angeles punk band The Germs. Firmly picking up on the punk ethic for doing it yourself, Crash and his band made waves across L.A. for a short period of time. Much like The Sex Pistols back in the UK, The Germs were blighted by being unable to play venues as their reputation preceded them. With Crash growing ever more erratic as he tried to execute the various strands of his so called 5 year plan, those around him invariably suffered. Here director Rodger Grossman attempts to tell the \"true\" story of the life and death of an enigmatic young man on a \"crash\" course to oblivion.\r\n\r\nWith low production values and a choppy attempt at being a semi rockumentary, What We Do Is secret is really only of interest to fans of the band or those wishing to bone up on American punk rock circa 1976-1980. Even tho myself, an ageing old British punker, quite liked The Germs, this film only exists because of two major factors. For the facts are that outside of L.A. they were hardly known at the time. It's only because of Crash's subsequent suicide at a young age {on the day John Lennon was shot and killed} and guitarist Pat Smear's future involvement with Nirvana and the Foo Fighters, that the band have had a reappraisal. With minimal input cut onto disc, one has to wonder if someone is trying to build up a legend that doesn't actually exist? What can be said with confidence is that the film at least brings the L.A. punk scene to notice. With all the historical talk about the New York punk scene that was born out of CBGB'S and Max's Kansas City, it often gets forgotten that L.A. had its moments too.\r\n\r\nThe cast here are pretty much the run of the mill performers one expects from such a production. Ranging from adequate (Shane West as Crash) to very decent (Rick Gonzalez of Coach Carter fame as Smear), Grossman's film will not be remembered for any great thesping. And since Crash is not very likable, or engaging on an intellectual level, the finale is unlikely to strike you with a sadness born out of the waste of a young life. However, the soundtrack crackles with punk vibrancy and emotive potency, and definitely some of the concert sequences have the look and feel of the original punk rock era. But ultimately the piece remains only worth an interest to an undemanding and small selection of music fans. Oh and 70s fashion guru's as well one thinks. 6\/10","id":"53e7ef4cc3a36839910023e6","url":"https:\/\/www.themoviedb.org\/review\/53e7ef4cc3a36839910023e6","movie_id":17137}
{"author":"SoapboxQuantez08","content":"\"What's a demon, but an angel who fell?\" \nSuch is the question posed by this potent Omen clone...with a ransom twist. \n\nJosh Holloway stars as Max, a down-on-his-luck opportunist, freshly released from prison. Max probably has a history of complying with his older friend Sydney, who (at the start of the film) suggests that they (along with their other friend Vince) kidnap an 8-year-old for ransom.\n\nLittle David was hand-picked by the group's current employer (Jones), and although Max is reluctant at first, a denied bank loan leaves him no choice but to comply. However, it soon becomes quite clear that David Sandborn is probably no ordinary child.\n\nThis kid seems to know everyone's past and future, and the group can't help but notice they're constantly hearing whispers that seem to be in the kid's voice.\n\nRoxanne (Max's girl) has been against this \"gig\" from the beginning (partly due to a bad feeling, partly due to having a history with Vince). Maybe her intuition is telling her that this particular kid will do anything he can to turn them against each other.\n\nYoung David has a certain outcome in mind, and he will manipulate anyone who tries to stop him. Whisper is simply a brutalizer of a film in which a seemingly normal child is bloodthirsty, and there seems to be no limit to what he can achieve. 7\/10","id":"5a25b6eb92514103390e0a23","url":"https:\/\/www.themoviedb.org\/review\/5a25b6eb92514103390e0a23","movie_id":14397}
{"author":"Certfiable","content":"A bigger budget sequel to the unofficial movie \"Freddy vs Ghostbusters\"(2004), this sees the Denver Ghostbusters witness the unleashing of an Egyptian menace that turns their technology on the populace, stealing the souls of the living with a Ghost Trap!\r\n\r\nFor a fan made film, much like the last, cheaply made, but good fun!\r\n(And a surprise background cameo!)","id":"51544dbf760ee36b17196641","url":"https:\/\/www.themoviedb.org\/review\/51544dbf760ee36b17196641","movie_id":2979}
{"author":"John Chard","content":"Chilblains.\r\n\r\nWind Chill is directed by Gregory Jacobs and written by Joe Gangemi & Steven Katz. It stars Emily Blunt and Ashton Holmes. Music is by Clint Mansell and cinematography by Dan Laustsen.\r\n\r\nTwo students car share for a journey home at the end of term. Taking a short cut they get run off the road and find themselves stranded in the snow. Then strange things start to happen... Neither frightening or dull, Wind Chill is a very serviceable supernatural based drama with human interest factors pulsing away. Setting is superbly chilly, which when our protags are stranded opens up genuine fears for all of us who have ever broken down somewhere remote at night. The revelations and finale are hardly riveting stuff, but it gets top marks for a sense of dread and that for a good portion of film it's not apparent what is actually going on. Two strong performances by Blunt and Holmes help, which ultimately makes this a decent night in by the fire for those not after gore and shrieky boo-jumps. 6\/10","id":"5874f78ec3a368067d0094fd","url":"https:\/\/www.themoviedb.org\/review\/5874f78ec3a368067d0094fd","movie_id":14223}
{"author":"Gimly","content":"Winds up being nothing more than a totally bizarre propaganda campaign for Restorative Justice. \r\n\r\nI can handle that, but what lost me is the fact that at absolutely no point from beginning to end was I interested in the events, or in the characters.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5e071f699bcd0f00151073b5","url":"https:\/\/www.themoviedb.org\/review\/5e071f699bcd0f00151073b5","movie_id":13941}
{"author":"Gimly","content":"I've never been particularly invested in _The Simpsons_. This movie didn't turn me around on that. I could stand watching it, Hell, this was actually the **second** time I've seen it, but I assure you, it was not for my own enjoyment I did so.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._","id":"5c46df090e0a260419c61767","url":"https:\/\/www.themoviedb.org\/review\/5c46df090e0a260419c61767","movie_id":35}
{"author":"Kenneth Axel Carlsson","content":"This movie is centered around a poker tournament (called... the Grand, obviously). Build as a documentary, we follow a bunch of people; Jack Faro (Woody Harrelson) who own (or owned) a casino that he got from his grandpa, but has been staying at a rehab facility of late; Harold Melvin, a nerd who lives with his mother, and drinks a lot of Brain Juice; Lainie, a housewife who is getting a little tired of her husband, Fred (Ray Romano); Larry, Lainie's brother who is... a little out there, and always a step behind his sister; Deuce Fairbanks (Dennis Farina), an elderly gentlemen (a cowboy really) who speaks his mind and likes to remember the olden days; The German (Werner Herzog), a crazy german who feel compelled to kill at least one animal each day, and therefore arrive with... a lot of the; Andy Andrews, who won a seat at the Grand, more or less, by accident.\r\n\r\nJust your average poker players... or maybe not. This is a movie afterall, so of course the characters needs to be... quirky. Also, this is clearly a comedy (and not an actual documentary, but I think you had guessed that). I kinda like these characters, flaws, weirdness and all. Oh, and there are other players as well.\r\n\r\nThe movie is not filmed entirely as a documentary, but goes back and forth between the genres. Most of the time, the camera is handheld, making for very lively images, but there are also interviews with our six main characters, where they tell their stories. In theory, it is a good idea, but in reality, it seems more like a gimmick than anything else. I read somewhere that when they sad down at the final table, they did not have a script, and actually, didn't know who would win. I like movies that use improvisation, but honestly, I've seen better movies than this one.\r\n\r\n_Last words... a short ride, with its moments, but not much of a movie. It'll be forgotten by the morrow. Want to see a good movie about poker, go see Matt Damon and John Malkovich battle it out in Rounders._","id":"54a31020c3a3682f1e00f9ba","url":"https:\/\/www.themoviedb.org\/review\/54a31020c3a3682f1e00f9ba","movie_id":15378}
{"author":"Andres Gomez","content":"A great idea for a movie developed in a witty script. Well done and with a decent cast.\r\n\r\nPerfect for being played also in the theaters or watched under the blanket at home.","id":"56c5cb21c3a3680d49002ddd","url":"https:\/\/www.themoviedb.org\/review\/56c5cb21c3a3680d49002ddd","movie_id":13363}
{"author":"John Chard","content":"Perfection.\r\n\r\nI think I will just come right out and say it from the off, this is a masterpiece, a truly spell binding, mesmerising tour de force that seeps class from every pore. I have often found myself cringing and turning my back on those who use in film debate the tired old defence of \"it's not for everyone\", but here I find I have no choice because this picture is purely for those enamoured with poetic beauty and precision film making at its highest. Those in search of an all action gun toting western need not apply, in fact those merely after popcorn fodder to while away an evening viewing should steer well clear. Andrew Dominik's second directorial effort is a character and dialogue driven piece of work, its thematic heart swirling with intelligence and elegiac beauty.\r\n\r\nThe story centrers around the final days of notorious outlaw Jesse James, and how one of his young disciples came to murder him on April 3rd 1882. Using Ron Hansen's novel as its source, it also fills in the gaps as to what became of the murderer Robert Ford as regards the subsequent aftermath of killing the infamous Jesse James. The film is dealing with issues all to prevalent in modern day society, we are witnessing perhaps the first instance of celebrity status gone berserker, we see how the press glamorise the nasty piece of work that was Jesse James, turning him into some sort of quintessential noble outlaw. We observe a stalking menace yearning to be like his hero, a young and impressionable fellow who's hurtling towards infamy completely oblivious of the pitfalls and irony of it all.\r\n\r\nStructually the film is perfect, and to me the film defines the old saying of art on the silver screen. The performances of the lead actors are incredible, Brad Pitt gives a career high as Jesse James, all teetering villainy yet perfectly befitting the prince charming outlaw persona so gleefully built up by the press. Sam Rockwell is Charley Ford, and here he proves that movie big wigs really need to start giving the guy some more dramatic roles to get his teeth in to. Yet as good as Pitt & Rockwell are, both men are left trailing in the wake of Casey Affleck's performance as Robert Ford, childish emotion fused with flecks of dark undercurrents as Affleck layers a perfect show. How the academy chose to ignore this performance should be seen as an act of treason against American cinema.\r\n\r\nFew films have left me open mouthed in admiration at the quality on show, but shot after shot, frame after frame, this really is as gorgeous as it comes. Roger Deakins photography sublimely pleasing the eyes at every edit, be it lush rolling hills cloaked in snow, or shadowy figures appearing like ghosts from locomotive smoke, with Deakins firmly cementing his reputation as a master of his craft. The score from Nick Cave & Warren Ellis perfectly captures the ambiance and texture of the piece, with Cave himself bagging a cameo performance as a bar room busker. It's incredible to think that this is only director Andrew Dominik's second feature film, following on from the hugely enjoyable Chopper in 2000, it is now evident that New Zealand can lay claim to producing a talent that if all goes to plan, will go on to become a director to rank up with the best of them.\r\n\r\nAs it is, and just right now, The Assassination Of Jesse James By The Coward Robert Ford should be filed along side Vertigo as a member of that club that only admits the greatest American films of all time, and that be even if it was directed by a Kiwi, wink wink America.\r\n\r\nMasterpiece. 10\/10","id":"540b58ddc3a36879a8001d06","url":"https:\/\/www.themoviedb.org\/review\/540b58ddc3a36879a8001d06","movie_id":4512}
{"author":"John Chard","content":"You can't convince some people there's a fire even when their hair is burning. Denial is a powerful thing. \r\n\r\nThe Mist is directed by Frank Darabont and Darabont adapts the screenplay from the story of the same name written by Stephen King. It stars Thomas Jane, Marcia Gay Harden, Toby Jones, Laurie Holden and Andre Braugher. Music is by Mark Isham and cinematography by Rohn Schmidt.​\r\n​\r\nResidents of a small Maine town become trapped in the local supermarket when an otherworldly mist brings deadly creatures in full attack mode. That's not the only problem, for two groups form inside the market, one in favour of escaping, the other for expiation.\r\n\r\nAs is the norm, King adaptations vary in quality and divisive fan appraisals, so with \"The Mist\" on screen not exactly setting the box office alight, and it even getting delayed releases in Europe, one would think this is one of the lesser King adapted lights? Not so, in fact, it is now proving to have a longevity of worth in horror fan circles. So much so, that the great horror writer at the literary source gives it the full thumbs up whilst giving the \"changed\" ending his full pat on the back approval.\r\n\r\nDarabont is of course the director who previously took King's more human interest stories and crafted much beloved movies out of them, so why was he in the chair to direct a film about alien creatures unleashing bloody dread on small town Americana? Well actually the answer is why \"The Mist\" is such a cunning chilly delight. For this not only features monstrous creatures straight out of a Lovecraft\/Barker nightmare, but also the monsters of the human kind, where the venality of the human condition is laid bare under duress, of which it is very frightening.\r\n\r\nThe alien creatures themselves creep the flesh, ok the effects work sometimes sags under the scrutiny of \"HD\" viewings, but this is nightmarish stuff, none more so than with a quite brilliant and terrifying sequence of events in a pharmacy. Yet it's the human monsters within the supermarket that usurps our creature invaders, where religious fervour and mans propensity for survival comes crashing together for dynamic results - the cast utterly in tune with the material and delivering quality portrayals.\r\n\r\nOnce the human battles within dissipates, and we come to the resolutions and reasonings of what has caused the creature invasion (hello subtext), we arrive at the much talked about finale. It actually deserves to be divisive, for we don't want yet another horror film finale that has people shrugging their respective shoulders and saying \"fair enough, but is that it?\".\r\n\r\nIf you buy into the all round bleak tonalities that the pic has been serving throughout, then this ending hits all the right buttons. For sure, this is no easy cop out to send you home with a smile on your face, it's brutal, and crucially it's befitting the word of the genre it sits in - horror. 8.5\/10","id":"5d99564330f79c00114af263","url":"https:\/\/www.themoviedb.org\/review\/5d99564330f79c00114af263","movie_id":5876}
{"author":"pancine","content":"Some touching moments and a few amusing ones. Less than 90 minute film went by quickly, I wish the ending had been longer.Ronit Elkabetz is ravishing. Uneven but overall pretty good film.","id":"5c60923f9251412fb4f9723d","url":"https:\/\/www.themoviedb.org\/review\/5c60923f9251412fb4f9723d","movie_id":5259}
{"author":"j4ni","content":"Great movie, not a spaghetti western. Very good story and atmosphere 10 stars.","id":"5d3eb9afb87aec2c3d3acd40","url":"https:\/\/www.themoviedb.org\/review\/5d3eb9afb87aec2c3d3acd40","movie_id":7345}
{"author":"The Movie Diorama","content":"The Reaping harvests souls of the religiously devoted by subjecting them to this. “What hath God wrought?”. If ever there was a tagline that would instantly persuade audiences to leap up from their sofas, drive to the nearest cinema complex and purchase a couple of tickets, it’s this one. Sure, using a phrase from the Book of Numbers (as opposed to Exodus which is the primary plot device of the film...) certainly sets the religiously inclined tone, that eventually dissolves into the plagued river of blood but more on that later. It also indicates the unimaginative stupidity that ensues, leaving logic and science behind for a faith-based apocalyptic tale that is in need of some serious stoning. A professor in debunking miracles is invited to investigate a “river of blood” in the nearby town of Haven, but is quickly ensnared in an apocalyptic mystery.\r\n\r\nWhilst not the worst horror film in the existence of cinema, with a tepid schlocky tone that somewhat juxtaposes the devoted Christian ideologies presented, yet is so inexplicably dumb that it will leave you questioning why such a film was created in the first place. Its initial introduction commenced with much promise. Science against religion. Simple logical explanations explaining what many describe as religious miracles. Yes, it’s relatively on the nose and misses the point of acquiring faith, yet remained an interesting direction for the first half that managed to conjure up various problematic conversations.\r\n\r\nHot off her Oscar win, swanky Swank muddles through this unusual mystery with much trepidation, choosing not to believe that the plagues of Egypt condemning Haven are in fact coincidental, offering scientific explanations. Algae bloom for the “blood river” that has the consistency of red-dyed water (sorry not sorry...). Infections terminating frogs, that is never explained how they fell from the sky, but whatever. Flies consuming the flesh of the frogs, and you get the idea. She remains unconvinced throughout these biblical mishaps, and provides an interesting angle.\r\n\r\nWell, that is until about halfway through when she switches from being Bill Nye the Science Guy to Pope Francis of the Vatican. Suddenly she has faith, despite her tragic backstory clumsily spliced with the main plot, and holy reaping balls do events get crazy. CGI locust infestation, satanic cult crazes and a thunderstorm of fire that incinerates life in a matter of seconds. It went from a minor science experiment to absolute chaos, quicker than a snap of your fingers. The change of pace is so jarring and bewildering, that when the predictably obtuse third act arrives you’re stunned into silence. The tantalising debunking approach now plagued by, well, the plagues. The mystery is ham-fisted and makes no sense whatsoever. Constant flashbacks providing clues, more like clear answers mind you, were choppy and fragmented. It’s not scary in the slightest. Main characters are expended and forgotten about almost instantly, a shame considering Elba was decent as always. And what’s Rea’s purpose in this? No seriously. Except for providing basic exposition, he seemed pointless in this endeavour.\r\n\r\nA very minuscule part of my soul wants to like this for being the barking mad mystery that it is. To an extent, it is watchable if you know to turn your brain off and devour all the spiel on religious provocations, despite the interesting first act. It has this surreal allure, making each watch tolerable. But then I think back to the last thirty minutes and I then really want to experience all ten plagues for myself. Incomprehensibly ludicrous. What hath God wrought you ask? This.","id":"5e21db8bcf4b8b0014f146b9","url":"https:\/\/www.themoviedb.org\/review\/5e21db8bcf4b8b0014f146b9","movie_id":1683}
{"author":"Milo_Jeeder","content":"Americanized Pang brothers go mainstream and sadly the results are not very good. I actually wanted to like this film, because I enjoyed the Pang Bros. previous well-known horror film \"The Eye\" and for that reason alone, I had some really high hopes with this one too. Well, I guess it was my bad and I must say now that I'm genuinely disappointed; since I was expecting something that would be just as dark and scary as \"The Eye\", considering that we are talking about the same directors, but this time, they even had a bigger budget to work with. Proof that good directors can screw it up (or at least in my humble opinion) and that won't have anything to do with the financial resources.\r\n\r\nIn \"The Messengers\", the Solomon family, moves to an isolated farm, with the purpose of starting a new life and leaving an unpleasant memory behind. However, as soon as they arrive to their new house, the teenage daughter Jess, starts to experience some really odd situations and she claims to see people living inside the cellar. Creatures that are not in peace with themselves and need to give her a message before it's too late. However, her parents, who are pretty much fed up with her and her dreadful behavior, don't believe a word she says. Unfortunately, it is only a matter of time for them to realize that Jess may not be lying this time, after all and that there's actually something in that house…something that has been waiting in the dark for a few years and is waiting to be released.\r\n\r\nI won't complain about the fact that these kinds of stories were already told about a thousand times. I'm not one of those movie fans who complain about the lack of innovation when it comes to the plot. Honestly, I think most films (especially horror films) out there, share a decent number of similarities and while many reviews comment on the simplicity and unoriginality of the plot, I will mainly focus on the fact that this film is overall not scary, which is my main concern. It seems like The Pang Bros. basically sold their talent to the devil, just to enter in the American film industry, without realizing that there was no need to copy the most superfluous and silly PG-rated contemporary horror flicks. \"The Messengers\" turns out to be one of those movies where nothing really happens...ever. It's just a nice variety of hallucinations and situations that end up being reduced to \"Did it really happen or was it just my imagination?\". No, I'm sorry but I just had about enough with these nonsense. I suppose the real action starts happening during the last twenty minutes, but that just doesn't do it for me. The denouement turns out to be somehow far-fetched and it left me with the hateful \"That's it?\" feeling inside my head. Overall, not the worst movie ever and it's not like it is unwatchable. It happens to be entertaining for moments and it has a small number of well-done ghostly sequences that made the whole thing endurable in some way. I also enjoyed the scenes with the crows, since they reminded me a lot of \"The Birds\", which is like partying with an old best friend, or something like that. The music during the opening and final credits is in my opinion the actual high point and that is not a very good sign, unfortunately. Another thing that is not exactly a good sign, would be the overhead microphone that can be seen more than once during the film. No comments about that little detail.","id":"58a3976592514157b20000b7","url":"https:\/\/www.themoviedb.org\/review\/58a3976592514157b20000b7","movie_id":9966}
{"author":"vivimorena","content":"Liv is an eleven year-old Olso girl who lives in a dilapidated apartment building with her parents and her younger brother Erling. Her twelfth birthday rapidly approaching, Liv has been promised a family trip on the \"Danaworld\" when the sizable steamship sets out on its maiden voyage. On the morning of the big day, however, Liv begins to notice strange events unfolding on the ground level of her apartment building. When Liv and her best friend Thomas venture downstairs to get to the bottom of the mystery, they discover an aged photograph of two girls and a cat. Suddenly, the cat comes bounding out of the photograph, prompting young Liv to fall unconscious. Upon awakening in a nearby hospital, Liv is told by a doctor that she suffered a mild asthma attack. But Liv knows that wasn't the case, and quickly becomes convinced that the strange occurrences of late are inexorably tied to that bizarre photograph. But when Thomas returns to find the photograph, it is nowhere to be found. Later, Liv and Thomas discover a secret storeroom. Every time Liv touches something in the storeroom, she experiences a brief but incredibly vivid vision. Could it be that someone is trying to tell Liv something, and are these events tied to a strange catastrophe that unfolded on these same grounds nearly one hundred years ago? Despite the fact that few adults seem to believe her incredible story, an elderly neighbor living upstairs may just have the information that will allow Liv and Thomas to unlock the truth behind the strange events unfolding all around them.","id":"55c6f6d292514105d2001863","url":"https:\/\/www.themoviedb.org\/review\/55c6f6d292514105d2001863","movie_id":45891}
{"author":"John Chard","content":"You measure yourself by the people who measure themselves by you.\r\n\r\nJack Nicholson and Morgan Freeman play two terminally ill men who check out of their cancer ward and head off on a road trip to complete their Bucket List of things to do before they die.\r\n\r\nEvery once in a while a film comes along with such simplicity of warmth it rises above any charge of clichés and sugar coated sappiness. The Bucket List is one such film. Its message is simple, its filming style equally so. It's performed with such quality by Nicholson and Freeman (if the whole film had just been the two of them chatting in the hospital room it would have been a winner), with director Rob Reiner astute and wily enough to let them flow, that even as the inevitable sadness follows the laughs, you will feel far better for having watched this film.\r\n\r\nRewarding adult cinema with class showing on both sides of the camera. 8.5\/10","id":"5424aa78c3a36808870040ab","url":"https:\/\/www.themoviedb.org\/review\/5424aa78c3a36808870040ab","movie_id":7350}
{"author":"John Chard","content":"Altruistic Nightmare!\r\n\r\nBodies have started turning up with W∆Z carved into their skin, cops Eddie Argo (Stellan Skarsgård) and Helen Westcott (Melissa George) investigate and find something truly disturbing is afoot.\r\n\r\nIt's cut from the same cloth as Saw, Seven and to a degree Hostel, in that it's torture pornish in narrative essence, and aesthetically grim with its neo-noir greens and browns. Tom Shankland's movie is undeniably bleak, but sift through the blood and the grime and you find there's an intelligent film at work, one that opens up an uncomfortable can of worms about human nature. But of course if you like it bloody and mean, then that is served up with relish as well, with all the key scenes packing an emotional whack to go with the jolts.\r\n\r\nBrains to go with the splatter, some very smart photography (Morten Søborg) and engaging lead performances, these all lift this above average. If only it hadn't cheapened things down with the daft finale then this would have garnered more support in horror circles. 6\/10","id":"562e3274925141285700a774","url":"https:\/\/www.themoviedb.org\/review\/562e3274925141285700a774","movie_id":15069}
{"author":"Wuchak","content":"***Weighty, morose period drama with complex characters and Daniel Day-Lewis*** \r\n\r\nIn the early 20th century, an industrious prospector in Southern California, Daniel Plainview (Daniel Day-Lewis), becomes a shrewd oil magnate, whose journey is paralleled with a dubious Pentecostal pastor of a remote church, Eli Sunday (Paul Dano).     \r\n\r\n“There Will Be Blood” (2007) is a one-of-a-kind period drama with Western elements. It’s arty and the furthest thing from a conventional blockbuster. You have to be in the mode for a deep, slow-moving, epic flick like this in order to appreciate it. The contemporaneous “The Assassination of Jesse James by the Coward Robert Ford” and “No Country for Old Men” are good comparisons.  \r\n\r\nWhilst the story and main characters are simple on the surface, they go deep and there are many gems to mine: What good is success if you have no one to love and enjoy it with? Is Daniel a sociopath or a quality individual who acquires sociopathic tendencies because his choices put him on the road of madness? Was Eli a “false prophet”? If so, was he always a con or did he become one? \r\n\r\nWhy is Eli paralleled with Daniel? Does Daniel have the capacity for genuine love? Does he mean what he ultimately says to HW or are they words born from a sense of betrayal? Would a sane person rashly resort to murder? Is there a positive protagonist in the movie? If so, who and why? If not, why not?    \r\n\r\nThe film runs 2 hours, 38 minutes, and was shot in Southern Cal and Texas (Shafter & Marfa); and Lakewood, Washington (Thornewood Castle).\r\n\r\nGRADE: B","id":"5d559dcee8131d3e3989d197","url":"https:\/\/www.themoviedb.org\/review\/5d559dcee8131d3e3989d197","movie_id":7345}
{"author":"slayrrr666","content":"Following a devastating storm, a small town in Maine finds that the eerie mist swarming into the neighborhood holds a deadly secret inside that attacks anyone around them and forces a small band of survivors trapped inside a supermarket to hold off the creatures.\r\n\r\nThis one here is an incredibly frustrating King work. A lot of what makes this one so uneven is due to there being a lot to really like about it, a few points to love about it and then there were elements to utterly loathe about it. The film is at it's best with the way the mounting hysteria over the situation with them trapped within the supermarket and how the groups resolve their problems and start new ones which was pretty good and makes for a realistic feeling to the story, detailing how it all breaks down and what the group resorts to in order to keep their sanity. Likewise, that in turn leads into the films' best efforts in the first few attacks with the unknown creatures inside the mist killing off the victims as they refuse to believe what's out there and rush foolishly into the area which makes for a series of fun times out in the cargo hold and the different attempts to reach safety outside and then encountering the different creatures and their powers were all good points. The flying insects and them trying to keep them out as the different creatures break in resulting in a series of great encounters trying to clear them out of the store, and the insane battle in the pharmacy during the pitch-black interior is a rather stark and creepy experience fighting off the array of creatures that gives this one a ton of impressive points. The final few battles and escapes to get out, the blood and gore and the way that the creatures are dealt with are all loved points here as that all leads into the stellar finale which is an absolutely unforeseen and shocking in what goes on as there are some rather disturbing parts in this section. Along with the fine creature effects, these here are the good parts to really love about it although it does have a few issues to be had here. The film's biggest problem is the mere appearance of the religious babble that gets spewed in here which is so wrongheaded and rather off-putting it just makes the viewer feel like not watching it all that often. Yet another big issue here is the length and how overlong it feels, with the rather overlong sections in the middle really making it feel it's length somewhat. While there's plenty to like here, these do hold it back.\r\n\r\nRated R: Graphic Language, Graphic Violence and intense themes of children-in-danger.","id":"58c4b57692514163730050c4","url":"https:\/\/www.themoviedb.org\/review\/58c4b57692514163730050c4","movie_id":5876}
{"author":"CRCulver","content":"In <i>The Brothers Solomon<\/i>, John (Will Forte) and Dean (Will Arnett) are two siblings brought up isolated in the Arctic by their widower father (Lee Majors). Returning to civilization as adults, they are baffled by the dating scene. Hilarity is meant to ensue when their father lapses into a coma and they decide to fulfill his dream of a grandchild before it is too late. Unfortunately, <i>The Brothers Solomon<\/i> is one of the most notable bombs of the last few years, and you're unlikely to find it a worthwhile experience.\r\n\r\nThe camaraderie between the two brothers is similar to DUMB AND DUMBER, but laughs are even fewer. The maturity level here is so low--among the sparse gags is a lot of bathroom humour – that one might believe this film intended for a less than adult audience, but any plot where artificial insemination has a key doesn't seem likely to target a young demographic. I got this movie because I enjoyed Will Arnett's work on <i>Arrested Development<\/i> and in an infamous Human Giant sketch where he plays a hyperbolic pervert ultimately killed by a sex machine. His acting here is similar to <i>Arrested Development<\/i>, and may not be all that great, but he's so much better than Will Forte, one of the most unversatile and unlikeable comedians ever cast on Saturday Night Live.\r\n\r\nJust as the first film adaption of the Fantastic Four, the low-budget production of 1994, was made only to keep a hold on the rights and was never intended to be seen, I really wonder if <i>The Brothers Solomon<\/i> was produced to give some secret boost to the parties involved even if it were a box office flop.","id":"5b934c28c3a3685688001bb4","url":"https:\/\/www.themoviedb.org\/review\/5b934c28c3a3685688001bb4","movie_id":10071}
{"author":"furious_iz","content":"DON'T BELIEVE THE HYPE!\r\n\r\nMaybe that statement is a little facetious, but I feel it is true.  I read **_AMAZING_** reviews for this film.  I went in with high hopes, expecting a well acted, thoughtful, existential and quiet science fiction film.  \r\n\r\nInstead I saw a film so poor I wondered what's the scam here?  How could this film possibly have a score in the high 7s.\r\n\r\nThe premise is solid at first glance, but as the film moves along it delves deeper and deeper in to melodrama, and then eventually patronising and insulting trash.  I am agnostic, but I found the religion bashing heavy handed and unnecessary. \r\n\r\nMost of the actors were doing the best they could with the script, but everything comes across flat and lifeless.  None of the characters rang true.  None of the dialogue sounded like how real people actually talk.  If you want to make a science fiction film that shies away from special effects, and instead relies on realism and storytelling, you had better make the dialogue realistic, and the storytelling compelling.  Sadly neither are found here.\r\n\r\nThe look of the film, I get that it is a low budget film made on a single location, but the quality of the film stock!  It may seem petty, but I could not get over the thought that I have seen better looking lifetime films.  Honestly I have seen better looking daytime soaps from the 80s.\r\n\r\nBasically I don't get why anyone would call this film good, let alone a masterpiece.  I have read rave reviews, 10\/10 reviews, gushing about how thought provoking and challenging this film was.  My thoughts were ones of disdain.  My challenge was to finish this abysmal film.  Many of the reviews seem to fixate on the fact that the writer of this wrote for the original Star Trek series.  That to me is not a good enough reason to rate this film highly.  \r\n\r\nI honestly felt ripped off by this film.  I've been told I didn't get it, but sadly I did.  I understood every scene, I understood the implications, I understood the moral dilemmas and deeper meaning of what was being said.  It's just that the deeper meaning was shallow and unconvincing. I've been told maybe I should have watched Transformers instead.  Just for the record, I was looking forward to a slow, intelligent film minus explosions.  Instead I got, this.\r\n\r\n3\/10, avoid unless you have already drunk the kool-aid and are pre-conditioned to love the film because the writer worked on Star Trek.","id":"5a823d5bc3a3684ce2008285","url":"https:\/\/www.themoviedb.org\/review\/5a823d5bc3a3684ce2008285","movie_id":13363}
{"author":"talisencrw","content":"This was really enjoyable. I know I over-rate Anderson films but it's because I highly enjoy both his visual sensibility and the quirky style of humanistic humour that's pervasive in his work. I also greatly admire Adrien Brody's acting--so taken together, even though this isn't considered one of his better efforts, it was 4.5\/5 or 9\/10 for me.","id":"574615edc3a3682df7000461","url":"https:\/\/www.themoviedb.org\/review\/574615edc3a3682df7000461","movie_id":4538}
{"author":"bigbassdrum","content":"The Signal addresses the ills caused in our world by the mainstream media, governments and corporations controlling people through fear; playing people off against each other as a smoke screen to the truth and as a tactic to diminish opposition to a world elite with a fascist agenda, manufacturing people's consent to nefarious actions.  The signal beams through TVs and radios, causing fear and paranoia.  Almost no-one is truly sure of anyone else or their motives.  Fear,  leading to hate, anger and violence.  The true horror of this film is that it is an accurate take on our world, only amplified to make its point.  \r\n\r\nHowever, The Signal is not merely a bleak film with no answers to the horrors expressed.  It provides hope and shows that love, support and trust are a remedy to the induced madness; a shared psychosis based on brainwashing.  It makes the case well for community over individualism, solidarity, substance over style, questioning, understanding, and hope instead of hate.  It does this through characters and situations that, although amplified, are poignant and credible reflections of our own societies.\r\n\r\nIf you like thoughtful horror films which make important points rather than the sheer pointless butchery of films like Saw, I highly recommend pulling the aerial out of the back of the TV and watching The Signal.","id":"5738c61dc3a368262d00062f","url":"https:\/\/www.themoviedb.org\/review\/5738c61dc3a368262d00062f","movie_id":13059}
{"author":"CRCulver","content":"TO EACH HIS OWN CINEMA is a 2007 collection of 3-minute shorts by some 36 directors around the world on the theme of what cinema means to them. So many auteurs already make films about films inasmuch as they allude to classics, but here most of the shorts are actually set in cinemas, with audiences in rows of seating. You'll need to have a decent familiarity with the arthouse canon before watching this, though. It's fascinating how so many of the directors, regardless of what continent they hailed from, choose to have French New Wave films playing in the background as their stories are told.\r\n\r\nIt opens with Raymond Depardon's \"Open-Air Cinema\", where a crowd of Egyptians watched an outdoor projection in Alexandria, and in spite of the unusual writing and the women's veils, they seem to be just like us. Zhang Yimou later does much the same in a Chinese village.\r\n\r\nOne of the remarkable aspects of this collection are the similar ideas. Two stories deal with thieves stealing purses in dark cinemas. Three deal with the blind and how they perceive cinema. Many look back to childhood\/earlier eras. Hou Hsiao-Hsien's short recreates 1950s Taiwan on an elaborate set to show the typical visit to a cinema of his youth. Amos Gitai's film juxtaposes 1930s viewers of Yiddish cinema, a vibrant tradition destroyed by the Holocaust, with a modern Israeli audience in wartime. Youssef Chahine's looks back at his first visit to Cannes 47 years before.\r\n\r\nSome of the films deal with serious political themes: Amos Gitai on the Israeli-Arab relations, David Croneberg on anti-semitism, and Bille August with Danish–immigrant relations. However, there are also a number of overtly funny shorts, like Takeshi Kitano's, where a working man's chance to unwind by watching a film keeps getting interrupted by problems with the projector. In Lars Van Trier's contribution, Jacques Franz plays an annoying businessman who can't stop bragging about his success, though the extreme gore and violence that follows makes for very black humour. Elia Suleiman's is Buster Keatonish physical comedy in the modern world.\r\n\r\nSome shorts are notable for continuing an aesthetic that the director had already established in an earlier film. Kaurismäki's short is his usual style of an ostensibly contemporary setting, but with 1950s rock music and working class people who speak utterly deadpan. (Unusually, however, it uses none of his typical troupe of actors.) Abbas Kiarostami's \"Where is My Romeo?\" is a sort of follow-up to his experimental film SHIRIN, which showed only the faces of numerous women as they watched a classic Iranian tale of love; here these women are watching \"Romeo and Juliet\" instead.\r\n\r\nAll in all, this proved a continuously engaging film, whose 2-hour running time just flew by for me. Nearly all the shorts were entertaining, the sole exceptions for me being Jane Campion's oddball short, where an adult woman plays an insect that vexes a projectionist, and Gus Van Sant's film with a randy teenager entering into the film being projected. Nothing here seems a must-see classic, but if you like a few of the directors here, you're sure to enjoy this set.","id":"5b7302a3925141406a1b1785","url":"https:\/\/www.themoviedb.org\/review\/5b7302a3925141406a1b1785","movie_id":36108}
{"author":"Doug Fisherman","content":"Production-Wise:\r\n\r\nActing = 4\/10,\r\nScript = 3\/10,\r\nProduction = 7\/10,\r\nNot a complicated job. Any organised director could rap it up in 21 days or less. So rent a working theater complex, bring in the gear, set up, shoot, tear down = 5-7 days. Editing another 5 days, 7 days if audio dubs are necessary and they probably are for the concrete corridor scenes. Render the print and save will probably took a week for 2006\/2007 machines. Marketting should be easy enough just because of the topless, unoffensive nature of this film. UNRATED this could be on the shelves within 90 days.\r\n\r\nContent-Wise:\r\n\r\nSome very attractive girls and great eye candy. Yes, there is great topless nudity as expected. The ending does leave some unanswered questions regarding the main crime plot which I would have prefered cleared up as it was a significant part of the sub-plot. Does the boy get the girl? You'll have to watch it to see.\r\n\r\n\r\nThe female audience will enjoy the soap opera, and the men will put up with the soap because of the hot chicks. Not worth an expensive night out at the theater but from the $2.00 BARGAIN BIN watching at home, it's ok. I doubt anyone would watch it a 2nd time.\r\n\r\nMy overall rating 3\/10 on the Hollywood scale, 8\/10 on the bargain bin scale.\r\n\r\n\r\nEnjoy it.","id":"5495d1ba9251412c4e002eec","url":"https:\/\/www.themoviedb.org\/review\/5495d1ba9251412c4e002eec","movie_id":18043}
{"author":"Gimly","content":"Historically inaccurate with characters you don't care for and a story you've seen beat-for-beat before. But somebody give this damn costume department an Academy Award **immediately**!\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._","id":"593d717892514105930207cb","url":"https:\/\/www.themoviedb.org\/review\/593d717892514105930207cb","movie_id":1534}
{"author":"David","content":"Barrow, Alaska. The most northern town in the United States, where for 30 days every year it is has no sunlight.\r\n\r\nThis is the perfect opportunity for a gang of merciless, & blood-thirsty vampires to feed on the remaining inhabitants of this small town, after most leave for the month of darkness.\r\n\r\nAs people are leaving, and others are making preparations for their time of hibernation, mysterious occurrences are uncovered; mobile phones stolen, and destroyed, an entire team of sled dogs butchered. The ground work for the impending doom of a malevolent force.\r\n\r\nOnce the killings and feedings begin there is no let up. I have watched my share of vampire films, and frankly this is definitely one of the best made, its stripped back, bare, and unromanticized. This group of vampires, led by the visceral Marlow (Houston) take no pity on the town of Barrow as they tear it apart looking for their prey, and using people as bait to lure hiding survivors out into the cold and snowed out streets of the isolated mining town.\r\n\r\nThe second half of the film becomes a tale of survival, as town Sheriff Eben Olemun (Hartnett) and his soon to be ex-wife Stella (George), lead a group of survivors who manage to hide themselves away by staying in an attic, scared and cold they realize that it is only a matter of time before they are discovered and killed.\r\n\r\nEven though this is a film that does involve a fair amount of blood and gore, the film's real heart lies in the way it scares you with what it doesn't show in the lead up to the early killings, this for me is true horror, show me next to nothing, and build the most amount of tension, then deliver the shock, and you'll have me pissing my pants every time. There is also a fair amount of brutality shown, not only in how the vampires kill their prey, but also how they are dispensed by Eben and the others.\r\n\r\nOn an interesting note, this is a film based on a graphic novel written by Steve Niles, who co-wrote the screenplay to the film. Niles had actually pitched the original idea as a film some years before, but reworked it to graphic novel after being knocked back by several producers, it was then picked up afterwards by one of those producers to make this film we have now.","id":"5e3fd86b9603310015ed858e","url":"https:\/\/www.themoviedb.org\/review\/5e3fd86b9603310015ed858e","movie_id":4513}
{"author":"Gimly","content":"**The following is a long form review that I originally wrote in 2010.**\r\n\r\nA new-age, brilliant vampire movie that never got the acclaim it rightfully deserved.\r\n\r\n_30 Days of Night_ is one of the few films I like that I can never understand why other people don’t. Though I do prefer other movies like _Revolver, Doomsday and Donnie Darko_ to it, with those I can always understand when people don’t see in them what I do. With _30 Days of Night_, if you don’t have a problem with gore, then you shouldn’t have a problem with the film. And yet I have personal friends as well as people I’ve heard from online who totally dig horror, gore, vampires etc. and yet don’t like _30 Days of Night_, which confuses me all to Hell, let me tell you.\r\n\r\nThough I was mildly aggravated by the inconstancies in the number of vampires around, other than that I can find virtually nothing bad to say about _30 Days of Night_. Firstly you have Josh Hartnett (_The Faculty_) as Sheriff Eben, protagonist, secondly you have Danny Huston (_The Proposition_) as Marlow, leader of the vampires, who attack Alaska during the winter period of 30 days without sun (which in and of itself is an awesome concept, and thirdly there’s Ben Foster (_Pandorum_) as the vampire’s human lapdog, all of whom are personal favourites of mine. That’s not even mentioning the fact that Eben’s wife is played by Australian Melissa George (_Triangle_), who was born in my hometown, so even if she wasn’t a great actor, she’d get auto-points.\r\n\r\nBasically every point in which _30 Days of Night_ differentiates from the comic it’s based on is an improvement to the story, which is (gasp, shock, horror) a mildly realistic Vampire film. God forbid. I love the vampires in this. Though they’re not quite as sexy and well-dressed as they are in _Underworld _or as demonic as they are in _Buffy the Vampire Slayer_, they bring a totally new brutality to the vampire class. They wear what you’d expect late 30-ish people living in 2007 to wear, they’re stronger than the average human, but not impossibly so, they hunt in packs and give off bloodcurdling, atavistic shrieks (of which I give quite a good impression; sidenote) they’re unrelenting an animalistic but just as intelligent as a regular person, they’re quick, dark and deadly.\r\n\r\nThere’s no camp to be found here, not always a good thing, but in _30 Days of Night_, it is. I honestly cannot recommend this one enough, despite its intense gore and general panning, I implore you to at the very least give it a go, and decide for yourself.\r\n\r\nBoth the human survivors and the vampire invaders are there simply trying to stay alive, the vamps through their sadistic, systematic hunting of the local populace for their food-source, blood, and the people by trying to both hide, and fight back, but mostly the former. Ironically, it’s the “humanity” of the humans that causes every one of their downfalls, while they’re leached from above by a far superior race, who goes so far as to call humans a “plague” and invent a new language all for themselves, just so as to not have to speak the same filthy way we lower-beings do (and I mean, if your choice was between that and having to put up with American-English, wouldn’t you?).\r\n\r\n86%\r\n\r\n-_Gimly_","id":"5c46c2f30e0a26495ac9280d","url":"https:\/\/www.themoviedb.org\/review\/5c46c2f30e0a26495ac9280d","movie_id":4513}
{"author":"John Chard","content":"Are you an angel? Has the time come? I've been waiting so long.  \r\n\r\nWe are in the not too distant future and the Sun is fading out. After a first mission to reignite it with a nuclear bomb fails, with the ship apparently lost in space, a new team are sent to try again. But it really isn't as simple as that...\r\n\r\nDirector Danny Boyle and writer Alex Garland team up once again for this sci-fi adventure thriller. For as long as I can personally remember, outer space and the planets that dwell within it, have always served us well for cinematic treats. Fears of the unknown and worries over the destruction of Earth, by and large make for great premise's. Not all films realise this potential of course, but it always makes for a great starting point. For his first venture into this realm, Boyle has gone for the Sun as his point of reference, and it makes for a marvellously claustrophobic picture that poses as many questions as it does answers. And even tho ultimately the science fiction aspects of it do not naturally add up, it's dazzling in its visuals and thought provoking into the bargain.\r\n\r\nBoyle has never hid his influences and favourites from the public, and here he homages everything from Alien to Event Horizon, stopping for tea and crumpets at 2001s house along the way. But that is no bad thing, molding elements from great sci-fi past with his own intriguing story has given Sunshine a tremendous heart, to which Boyle then manages to cloak it with high quality drama. The crew are up there and we know that this is a genre piece and things invariably go wrong, this gives the discerning viewer an eager anticipation, a sense that one shouldn't go to the toilet for something will be missed. And Boyle lives up to the promise showed, such a pity then, that Boyle didn't let us get better acquainted with his characters at the start. Because then the impact would surely have doubled as each perilous and wrought scenario unfolded.\r\n\r\nHaving racked up the tension and intrigued us with the premise, expertly fusing CGI with his own craft work along the way, Boyle's Sunshine lives or dies by it's last quarter; depending on your proclivity of course. It has proved to be a most divisive point with critics and fans alike. To say it's a genre shift accompanied with implausibility is being a touch unkind I feel, this is after all a sci-fi picture about a ship going to reignite the Sun! Never the less it doesn't quite close the film triumphantly after the twists that preceded it, turns and explosions have lulled the viewers in, but personally it satisfies this entertained observer. Not in a big bang dynamic way, but in the way that asks me for a further thought process, and that may just be what Boyle and Garland envisaged when they sat down to make the film? Again, depending on your proclivity of course! 8.5\/10","id":"5cf0292c92514135b6b99439","url":"https:\/\/www.themoviedb.org\/review\/5cf0292c92514135b6b99439","movie_id":1272}
{"author":"Adishake","content":"Superbad is one of the classic comedies which left a great effect on R-RATED COMEDY genre, Greg Mottola as a film-maker became a name on the industry with this break-through. I really recommend this movie and a very forceful recommendation if you are a teenage-introvert.","id":"5da5f7c3a242320017772034","url":"https:\/\/www.themoviedb.org\/review\/5da5f7c3a242320017772034","movie_id":8363}
{"author":"Uknown","content":"A simple comedy (mockumentary) with great visuals, and good performances.","id":"57b25d89c3a3683534006ace","url":"https:\/\/www.themoviedb.org\/review\/57b25d89c3a3683534006ace","movie_id":9408}
{"author":"Andres Gomez","content":"Nice animation movie about the friendship of a kid and a mithological being from Japanese culture. Deep, with some insight about the meaning of life and loneliness. Still, it keeps just being a remasterization of another movies like E.T. or \"Mac and Me\" with quite a lot of stereotypes.","id":"50e637f0760ee35f0e4bd2b5","url":"https:\/\/www.themoviedb.org\/review\/50e637f0760ee35f0e4bd2b5","movie_id":17234}
{"author":"John Chard","content":"Peerless precision from Fincher.\r\n\r\nI have seen it written that this film shows that Fincher had grown up, and whilst I understand that train of thought, it simply isn't true. What Fincher has done is give a true story his meticulous care and standard deft precision by leaving no stone unturned. We get simply one of the (if not thee) best films to deal with the investigating process of a high profile serial killer, a film that as a character study is actually essential viewing in the pantheon of genre productions.\r\n\r\nThe devilish greatness of this film is in the fact that it can't pay off with a pandering mainstream ending, the makers are telling a true story and any sort of research will lead viewers to the fact that there is no twist here, no joyous ticket selling round of applause at this ending, it is what it is, frustratingly brilliant. The case the film is about consumes all involved with it, and to see how it affects those involved is engrossing (yet sad) because if the viewer is so inclined to jump on board then it will consume you as well, the film and the actors within demand you see this for the affecting character piece it is.\r\n\r\nThe acting here gives me hope that classic acting is alive and well in this generation, I was once not enamoured with Mark Ruffalo in his early days as an actor, but here he puts such heartfelt verve into the role of David Toschi I felt I need to send him a written apology!. Robert Downey Junior is joyous as Paul Avery, all 60s chic and swagger without tipping over the edge of the mountain caricature (both men to become future Avengers of course). Yet surprisingly to me I found that it is Jake Gyllenhaal as Robert Graysmith who is the film's key axis, the central heartbeat, with a performance that demands undivided attention, a performance brought about by Fincher's quest for perfection from everything to do with film making. Gyllenhaal hated working on the film, he hated Fincher's work ethic, but in time he must now look back and see that here the director coaxed out a performance that has in time been seen as not only great, but also beneficial to his career (hello Nightcrawler).\r\n\r\nThis is not Se7en 2, and British film mags like Empire should have known better than to use that tag line to get the readers' attention, because fans of serial killer thrillers need not apply here, fans of outstanding cinema about the human psyche during the pursuit of a serial killer - Well get in line folks, for this is one of the best movies of the decade. 10\/10","id":"5cedc289c3a3685e8726b0e4","url":"https:\/\/www.themoviedb.org\/review\/5cedc289c3a3685e8726b0e4","movie_id":1949}
{"author":"DRDMovieMusings","content":"Ah, so that's what happened. Kinda.\r\n\r\n\"I'm a patsy!\" \r\n\r\nThe last words of an accused presidential assassin, himself killed - on live TV no less.  Ah, the 60s, when America appeared at once to be both starting to \"get it\" and also coming apart at the seams.\r\n\r\nLee Harvey Oswald was introduced to the world as a lone sharp shooter who felled a president. But, very early in the aftermath, there were doubts and details that, in total, just didn't seem to add up. Accordingly, theories proliferated questioning the veracity of that official position in light of evidence and the interpretations thereof. If the official story is not what happened, is there a plausible scenario that would more reasonably account for all those details, moving us closer to the truth of what may otherwise have actually happened?\r\n\r\nAnd thus, we have Shooter. \r\n\r\nNo, it is no attempt to flesh out, to the last inch, everything that is or may have been about Oswald. It's a story that has parallels - and even a non-casual mention of\/reference to the Kennedy assassination to help us watching at home realize what we were actually watching - a plausible scenario.","id":"58e09d179251415e7f0172c0","url":"https:\/\/www.themoviedb.org\/review\/58e09d179251415e7f0172c0","movie_id":7485}
{"author":"John Chard","content":"Never pick a fight with someone who's got nothing to lose. \r\n\r\nButterfly on a Wheel (AKA: Shattered) is directed by Mike Barker and written by William Morrissey. It stars Pierce Brosnan, Maria Bello and Gerard Butler. Music is by Robert Duncan and cinematography by Ashley Rowe. \r\n\r\nButler and Bello play a seemingly happily married couple who have an adorable young daughter into the fold. Enter a rather sinister Brosnan who announces he has kidnapped the daughter and requires the couple to do everything he asks. Pressure is on then!?\r\n\r\nBasically this is just real solid kidnap thriller film making, the kind that we were well served with back in the 1980s, and with that in mind this comes off like a throw back to that decade. Brosnan (how nice to see him doing a natural Irish brogue) grows ever more spiteful, while of course our handsome couple get more frantic.\r\n\r\nBut naturally there's a mystery going on here, we are left in no doubt about that there is something lurking beyond the edges of the frames. To which the inevitable twist, on which the whole pic's very being depends upon, will either make or break how you ultimately feel about the piece as a whole.\r\n\r\nI liked it. 7\/10","id":"5dc6dbd3470ead001393fd0e","url":"https:\/\/www.themoviedb.org\/review\/5dc6dbd3470ead001393fd0e","movie_id":13250}
{"author":"pancine","content":"Amazing story, good to hear the survivor's personal experiences. Gives the viewer much to think about. Could have done without the actors, just filler.","id":"5c6097609251412fc9f98b19","url":"https:\/\/www.themoviedb.org\/review\/5c6097609251412fc9f98b19","movie_id":21508}
{"author":"John Chard","content":"Ooh err missus.\r\n\r\nWhen it was announced that there was to be a modern reboot of St. Trinian’s, it was met with luke warm murmurings to say the least. Yet when it comes down to it, the old films from the 50s and 60s were hardly comedy gold anyway. Safe family fare and sometimes fun into the bargain, and with strong casts, they have never been seen as essential British comedies and untouchable by the modern era’s obsession with remakes and reimaging.\r\n\r\nSt. Trinian’s 2007 style is not an improvement on the oldies, but neither is it the stinker some critics in 2007 wanted us to believe. It has enough about it to be its own animal, it’s funny, sexy and never dull. This also benefits from strong comic casting, where the likes of Rupert Everett (having the time of his life in drag), Colin Firth and Russell Brand are pitched into the femme madness headed by Gemma Arterton and Tallulah Riley. The writers err on the side of caution as far as risqué material goes, but there’s some very strong gags played out and the grouping of the girls into the various cliques (Emos, Chavs etc) is a nifty bit of writing that is mined to good effect.  \r\n\r\n\r\nIt was good enough and successful enough to warrant a sequel 2 years later…  6.5\/10","id":"54dc1437c3a368122a002e71","url":"https:\/\/www.themoviedb.org\/review\/54dc1437c3a368122a002e71","movie_id":10748}
{"author":"Wuchak","content":"Equal parts fascinating, entertaining, beautiful, inscrutable, contrived and tedious\r\n\r\nRELEASED IN 2007, \"Youth Without Youth\" was Francis Ford Coppola's return to filmmaking after a ten-year absence. The story revolves around a 70 year-old man (Tim Roth) in Romania at the outset of WWII who is struck by lightning and miraculously regains his youth, looking like a 40 year-old man. He acquires amazing powers as well, like psycho-kinesis and the ability to \"read\" a book by \"scanning\" it with his mind. The Nazi's catch wind of his amazing evolution and want to study him to contribute to the “master race” (or whatever). The second half of the film takes place after the war years when the man finds a woman who looks like a young version of his deceased love (Alexandra Maria Lara). Incredibly, she too is struck by lightning with differing results and it aids in his research on the origins of languages.\r\n\r\nThe plot brings to mind two films from the mid-90s that also address people with fascinating powers: \"Powder\" and \"Phenomenon.\" The latter was decent whereas the former shot for greatness and in some ways attained it. \"Youth Without Youth\" is completely different in tone, mostly due to the WWII time-frame, but also because it's less of a wannabe blockbuster and more artsy and nigh unfathomable.\r\n\r\nIt has been said that \"Youth Without Youth\" was an intensely personal project for Coppola. The topic, based on the novel by Mircea Eliade, resonated with him and he was driven to convey it on film. You get the impression that Coppola had discovered the answer to the mysteries of life and wanted to share it with the world.\r\n\r\nThink about it: Coppola is one of the greatest filmmakers of all time and he had a full decade to conceive, prepare, make and release a film. He could've churned out blockbuster drivel like the \"Transformers\" movies (not that there's anything wrong with that, lol), but as a true artist he's beyond caring about creating popular popcorn fare and the \"success\" thereof. It brings to mind Willard's observations about Col. Kurtz (Brando) in Coppola's renowned \"Apocalypse Now\" (1979): \"He could've gone for general, but he went for himself instead.\" Francis could've gone for mindless and lucrative entertainment, but he had something more important in mind.\r\n\r\nSo \"Youth Without Youth\" is a work of art, and certainly interesting and entertaining in some ways, but it requires willingness and effort to handle the 124 minutes runtime. It is a dense film, loaded with depth; it may even hold the secrets to life itself! Beyond that, it features some beautiful cinematography, music and women.\r\n\r\nSpeaking of the women, I found it curious that women are shown to be universally attracted to Dominic, the main character played by Roth. After all, Roth is short and hardly a George Clooney. But then I reflected on it and accepted it. Why? Because women have a sort of sixth sense, typically called \"women's intuition,” where they see or sense things beyond the physical. In other words, Dominic had highly evolved and was, in essence, a superior human being. He may not have been an Adonis, but women instinctively picked up on his evolutionary superiority and drew to him like a magnet.\r\n\r\nAnother plus are the locations, shot in Romania and Bulgaria with establishing shots of the Himalayas and India.\r\n\r\nNeedless to say, this is a difficult film to rate. If you're in the mood for conventional cinematic entertainment \"Youth Without Youth\" won't fill the bill even though there are several entertaining elements (the aforementioned cinematography, music, women and locations); but if you're looking for cinematic art and weighty mind food it's an \"A.\" As such, my balanced rating is...\r\n\r\nGRADE: B-","id":"5b2fc9599251416e58005a11","url":"https:\/\/www.themoviedb.org\/review\/5b2fc9599251416e58005a11","movie_id":7797}
{"author":"John Chard","content":"When you think about it, which I have been lately, is they weren't paying me to walk away. They were paying me so they could walk away.\r\n\r\n\r\n3:10 to Yuma is directed by James Mangold and co-adapted to screenplay by Halsted Welles, Michael Brandt and Derek Haas. A remake of Delmer Daves' 1957 film of the same name, it's based on a story written by Elmore Leonard. It stars Russell Crowe, Christian Bale, Peter Fonda, Ben Foster and Logan Lerman. Music is by Marco Beltrami and cinematography by Phedon Papamichael.\r\n\r\nAfter the capture of notorious outlaw Ben Wade (Crowe), a posse is put together to escort him to the town of Contention from where he will be put on the 3:10 train to Yuma prison. Joining this posse is broke rancher Dan Evans (Bale), disabled in the Civil War, Dan is struggling to keep hold of his land and to support his family. Seen as a flop in the eyes of his eldest son William (Lerman), Dan sees this opportunity as a way out of his problems. But with Wade an intelligent foe, and the outlaw boss' gang on their trail, Evans and the posse will do well to make it to Contention alive...\r\n\r\nDaves' original film is a fine effort, very much pulsing with psychological beats and cloaked in claustrophobic atmospherics. Backed up by two excellent Western performers in Glenn Ford and Van Heflin, there is many a Western fan who cherish it and never felt it was a genre piece ripe for a remake; myself included. But the logic behind the reasons Mangold and his team put forward for remaking it made sense. A story of great thematics for the adults, and action a go-go for the younger modern film fan. Thus putting a Western back in the headlines at yet another time when the genre was gasping for air. All that was left to do was get two of the modern era's biggest stars to play Wade and Evans - which of course they duly did - and it was good to go. Just don't mess it up was all that was asked of the makers.\r\n\r\nRunning at nearly half an hour longer than the original, Mangold's movie slots in a new mid-section and changes the ending. The former works a treat as the posse venture through hostile Apache country, meet some ne'er-do-well railroad ruffians, while Wade's gang, led by the supremely fiendish Charlie Prince (Foster), are on the bloody trail. The latter is a huge misstep, both in execution and character development. Most film fans are happy to suspend disbelief in the name of good entertainment, but here we are asked to ignore some impossible athletics while also being asked to swallow a character turn around that beggars belief. Such a shame because up till then the blend of traditional Western character themes such as morality and redemption had dovetailed nicely with the pistol banging and all round breezy action construction. While the father and son axis also gives the narrative some extra bite.\r\n\r\nEven bad guys love their mothers.\r\n\r\nThe performances are also of a high standard. In the support slots Fonda, Foster and Lerman are top dollar. Fonda is all leather faced and gruff as bounty hunter McElroy, Foster does a quality line in sneering villainy, and Lerman, in a tricky role, utterly convinces as the conflicted boy breaking out into a man. But this is Crowe and Bale's movie. Crowe has Wade as an intelligent dandy, a man who loves and understands women, an artist who also has a tongue as quick as his hands are on his guns. We know that Wade is callous, but Crowe ensures that we never know what is around the corner or truly on his mind. Bale puts much dignity into Evans, he's a put upon man, tortured by his failings on the home front, but there is stoic nobility there and as he and Wade venture further on their journey, a grudging respect begins to form and Bale and Crowe really start to put credibility into their characters. And then that last quarter nearly undoes all their excellent work...\r\n\r\nIn spite of this, 3:10 to Yuma is a good time to be had as a modern Western production with old traditional values. Energetic and never dull from first frame to last, it's recommended on proviso you don't mind unscrewing your head and taking out your brain for the last 15 minutes. 7.5\/10\r\n\r\n","id":"589be0ff92514126120022c8","url":"https:\/\/www.themoviedb.org\/review\/589be0ff92514126120022c8","movie_id":5176}
{"author":"Wuchak","content":"The price of redemption -- READ THIS if you had problems with the ending\r\n\r\nThis remake involves the capture of a notorious outlaw, Ben Wade (Russell Crowe), who is then escorted to the town of Contention to await the train to Yuma, where he'll be hanged. A desperate rancher, Dan Evans (Christian Bale), hires on for the escort job because he needs the $200 for his family to survive. Wade plays psychological games the entire time trying to corrupt Evans, but things turn out differently.\r\n\r\nThe cast is outstanding (which also features the beautiful Gretchen Mol and Peter Fonda), the New Mexican locations are great and the score ranks with the all-time best. Most importantly the picture is engaging throughout its 2 hour runtime, not to mention the story gives the viewer a lot to chew on.\r\n\r\nThe first hour of the film is realistic but what turned me off during my initial viewing was the second hour's mounting implausibilities. Thankfully, most of these can be explained.\r\n\r\nOne issue is when a man burns to death locked in a wagon carriage. The quibble is that he doesn't scream enough in fiery torment. But watch the scene and you'll clearly hear him yelling in the background. Evan's loss of a limp at the climax is more of an issue, although this can be explained by an adrenaline rush.\r\n\r\nOne problem I had was that Ben Wade (Crowe) came off as super-human. There was seemingly nothing he couldn't do, even while handcuffed. I suppose this could be explained by the fact that there ARE people who are incredibly gifted to the point of being nigh super-human. \r\n\r\nIn any event, this is not a realistic Western like, say, \"Wyatt Earp\" or \"The Long Riders.\" No, \"3:10 to Yuma\" is a MYTHIC Western with an potent message. If you can't handle strong mythic elements in Westerns look elsewhere.\r\n\r\nWhen I first saw the film I didn't get the ending and it turned me off. But it was clear that there was more to the picture than what first meets the eye so I decided to view it again. It DOES make sense, it's just that you might miss it on your initial viewing because the events flash by so quickly. When you DO see it, it'll blow you away.\r\n\r\n***SPOILER ALERT*** DO NOT READ FURTHER UNLESS YOU WANT AN EXPLANATION OF THE FILM! \r\n\r\nWade is a confident and talented man who smugly looks down on others, acting like a disciple of Nietzsche who has no moral obligation to anyone, least of all God. He senses simple purity in Evans and plays the role of tempter, trying to corrupt Evans and win him to his way of thinking. But as they wait in the hotel room it is Evans who \"converts\" Wade, in a sense. Evans doesn't accomplish this in any type of contrived manner, he accomplishes it simply by being WHO HE IS -- an undefiled, courageous family man who stubbornly refuses to give up on hope, faith, life, righteousness and family.\r\n\r\nAs they're waiting, Wade sketches a picture of Evans in a book. It is later shown that this sketch was made on an opening page of a Bible. This reveals that Wade came to view Evans as a Christ figure, at least subconsciously, and that Evans is clearly a type of Christ in the story.\r\n\r\nWhat exactly was it that caused Wade to \"convert\" and support Evans? (1.) He saw in Evans a man that refused to be bought -- a man who refused to be corrupted by filthy lucre, which was something he never experienced before. (2.) Evan's son insisted that there was still some good in Wade despite his wicked history. Regardless of Wade's denial, the kid was right. The idea that SOMEONE saw a glimmer of good in him, that SOMEONE out there BELIEVED in him despite his past evil deeds ultimately moved him and compelled him to support Evans. (3.) Wade turned evil because he was abandoned as a kid. He saw in Evans and his wife a REAL family -- parents who stayed together and refused to abandon faith, hope, righteousness and family come hell or high water. He became convinced that Evans and his family were worth supporting, even perhaps dying for. (4.) Evans made a deal with the Pinkerton that if he successfully got Wade to the train the Pinkerton would make sure Evans' family got $1000, which would bail them out of their hardships. Wade wanted to make sure the family got that money. Somewhere deep inside he wanted to redeem himself of his wicked past and this was the opportunity. This could be the beginning of a new life.\r\n\r\n(5.) Wade's relationship with Evans lasted only a few days but he found something that was missing in all his other relationships - a friendship based on respect rather than familiarity or shared events. Great friendships like this can happen quickly similar to love-at-first-sight. Such relationships are conducive to transparency, which explains why Evans reveals to Wade the real reason he lost his leg in the war.\r\n\r\nAfter Evan's brutal death Wade has an even greater revelation: To see a truly undefiled man -- a simple but GREAT man -- murdered by a group of immoral swine fills him with disgust. You can see it on his face. Yes, he should be thankful that his men remained loyal to him but this was about their only redeeming quality. To truly start a new life he would have to be judge and executioner of the corrupted souls who would pull him back down into the slime.\r\n\r\nWhy did Evans have to die? Because redemption can only be paid via the spilling of blood. It was the price for Wade to live and have a new life.\r\n\r\nGRADE: A","id":"5af5d3609251417997000aaa","url":"https:\/\/www.themoviedb.org\/review\/5af5d3609251417997000aaa","movie_id":5176}
{"author":"Per Gunnar Jonsson","content":"I know, I know, this movie is rather superficial and simple. More effort has been spent on cool action than on depth of the story. Well, you know what? I do not care! I quite liked this movie. Agent 47 is cool and kicks ass. The bad guys gets plenty of ass whooping. The action is good. There is quite a lot of high tech and gadgets. What is there not to like?\n\nThe movie starts of with a quite cool sequence introducing Agent 47. I have to say that I got into quite a bit of “wow” mode right a way there. The movie continues with plenty of action sequences with just a wee bit of slowdown in between. Actually the first-half, at least, of the movie is pretty much one long chase.\n\nPerhaps I should point out that I have not played Hitman and do not really know what the original story is about. From a lot of the comments I have read it appears That this might be to my advantage when it comes to enjoying the movie.\n\nSome people are probably complaining about bad acting since Agent 47 do not really show much in terms of facial expressions or emotions. Well, news for you, he is not supposed to! He is supposed to be a cold emotionless killing machine so stop whining. Personally I found Agent 47 to be an excellent character. the re is on scene in particular that I liked where Agent 47 intentionally allows himself to be caught in a embassy. Once inside he, to no one in the audience surprise starts to tear the place apart. You have to see it to know what I mean.\n\nThe second part, or perhaps just the last third, of the movie turns into more of a search and destroy for Agent 47 and his new “partner”. this part is of course as action filled as the first part of the movie. Naturally it all leads to a big show down between the Agent 47 & Co. The end itself did not really deliver any surprises but was satisfying.\n\nThe one thing in the movie that annoyed me was this subdermal armor stuff. The idea was not a too bad one but they really overplayed it. Come on! Just shoot him in the head or an eye or some other “sensitive” part for Christ sake. Bulletproof my arse!\n\nI honestly do not understand the low rating this movie has received. 5.7 at IMDb is really a bit harsh. Rotten Tomatoes rating is, not very surprisingly, abysmal. Rotten Tomatoes and their “critics” ratings must be the worst of any ratings site. When these dickwads rate down a movie, that’s when I start to get interested. First step is to drill down into the real audience ratings which more often that not gives a different picture.\n\nAny way I digress. Bottom line is that, for me, this is a simple, straightforward, high octane action movie and I quite enjoyed it.","id":"5ae2aa1bc3a36876b2029409","url":"https:\/\/www.themoviedb.org\/review\/5ae2aa1bc3a36876b2029409","movie_id":1620}
{"author":"Gimly","content":"Amber Benson looks good, and the Gryphon looks so bad that it's hilarious. Otherwise, a bland plethora of \"meh\".\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible_","id":"59226cb0c3a368791205cd7f","url":"https:\/\/www.themoviedb.org\/review\/59226cb0c3a368791205cd7f","movie_id":17997}
{"author":"The Movie Diorama","content":"Death Proof evidently illustrates that Tarantino’s thirst for blood will never run out of fuel. The second feature of Rodriguez\/Tarantino’s homage to the “Grindhouse” exploitation genre, is one that reeks of petroleum. Emphasising the raucous vehicular mayhem of muscle car extravaganzas that plagued cinemas in the 70s. But, this isn’t just an exploration into “death-proof” automobiles, commonly driven by stuntmen. Oh no no! This is a Tarantino exploration, and if we know that deranged genius by now, expect prolonged conversational scenes from his taut screenplay, authentic scenes of violence and feet. Lots of feet.\r\n\r\nA stunt driver hunts down young women. That’s it! It’s as simple as one jaded stunt double, driving recklessly across America, crashing into women at ridiculously high speeds. This is Tarantino’s interpretation of a slasher. Instead of a machete or other bladed utensil, it’s a burning tyre to the face or body flying through the windscreen. He intelligently displays all aspects of a car and fully utilised each component as a tool or limitation for the characters. Whether it be clinging onto the bonnet at maximum velocity or imprisoned in the passenger side of a roll cage. The vehicles, much like the characters, are constantly at the forefront of Tarantino’s screenplay.\r\n\r\nUnfortunately though, and this is his most common tendency, his script is anchored by overlong expository conversations that diminish the roaring entertainment. For example, Abernathy and her group of gal pals rest and chat about Bell’s yearning for test-driving a Dodge Challenger. Whilst the elongated take, with Tarantino rotating the camera round the table beautifully for a whole ten minutes, was exceptional directing, it detracted from the blazing car crash that occurred just moments ago. And the reason for this was due to the courageous decision in change of characters halfway through the feature. The initial four girls were not exactly lap dancing their way out of that crash. Yet the principal commitment in altering characters, whilst narratively jarring, had significant purpose in defying audience expectations.\r\n\r\nInitially, we’re led to believe that “Stuntman Mike” is about to produce the same exhilarating “accident” again. But Tarantino knows what you’re thinking. He isn’t stupid (except when choosing to act in his films...). And so he changed the structure by flipping it upside down. The hunter becomes the hunted. And it worked, effortlessly! Staring at real stuntwoman Bell as she plays “Ship’s Mast” on the Challenger, whilst the antagonistic Russell continually bulldozes his car into theirs. Tarantino glides the camera across the landscape, exhibiting one of the most exhilarating car chases in quite some time. It’s fun, energetic and a major contribution to air pollution. And then concluding on a freeze frame? Genius.\r\n\r\nDeath Proof is the resurrection of a bygone sub-genre through the healing qualities of Tarantino’s frivolous vitality. It rarely took detours and drifted excitedly round tight corners, albeit with limited exploitative violence and prolonged conversational scenes. Death Proof really is Tarantino-proof.","id":"5e2065450102c900133c4ab5","url":"https:\/\/www.themoviedb.org\/review\/5e2065450102c900133c4ab5","movie_id":1991}
{"author":"Wuchak","content":"Coming-of-age in South Australia... and tantalizing Teresa Palmer  \r\n\r\nI was interested in \"December Boys\" (2007) for two reasons: I like (non-raunchy) coming-of-age flicks and the fact that it takes place on the Southern coast of Australia (actually it was shot on Kangaroo Island, part of South Australia). As for Daniel Radcliffe, the star of the popular Harry Potter films, I've never seen him in a movie before and have no interest in him or Potter.\r\n\r\nThe story revolves around four boys from an Outback Catholic orphanage who get to celebrate their December birthdays by taking a Christmas holiday on the coast. They discover that a young childless couple are interested in adopting one of them, which creates a bit of rivalry, although the oldest one (Radcliffe) could care less and spends his time learning about girls and romance. Their time at the coast becomes a cornerstone experience as they ultimately discover what family means.\r\n\r\nUnless you're Australian, I encourage you to utilize the English subtitles to understand the nigh-unintelligible Australian dialect. Otherwise you'll only comprehend about half the dialogue and the story will be lost to you. No kidding.\r\n\r\nAfter seeing the film a few times I only remember two of the boys: Maps and Misty. The others might as well have been phantoms. The plot is interesting, but the story as-played-out is not very compelling (although the epilogue is slightly moving). The film tries too hard to be “magical.” Scenes come and go with largely ill-defined characters and little dialogue or explanation. This is definitely a picture where you'll have to read in between the lines to appreciate, which might make it good for repeat-viewings.\r\n\r\nOn the positive side, the Kangaroo Island locations are fabulous, especially the high shots of Remarkable Rocks in Flinders Chase National Park.\r\n\r\nThe picture really comes alive when Teresa Palmer is on screen; she plays femme fatale Lucy. The movie poster (or DVD cover) is deceiving in that Teresa looks to be about 12-13 years-old. Actually she was 20 during filming and plays an about-16 girl with curvy legs from here to New York. Lucy's scenes with Maps are the highlight of the picture (and not at all \"awkward\" as another reviewer contended). Lucy is aware of her tantalizing feminine powers and skillfully utilizes them to bewitch Maps with her spell.\r\n\r\nOther highlights include a secret cave high up on the rocks, a wild black horse who seems to fish, an Evel Knieval-type character who may not be as \"Fearless\" as he lets on, a colossal fish named Henry and the cantankerous old man fascinated by it.\r\n\r\nThe DVD feature about 10-minutes of deleted scenes that should have never been deleted. Make sure you catch 'em as they help explain the story better.\r\n\r\nIn the book the story was set in the 30s, but the filmmakers decided to switch it to the late 60s. Some people found this confusing, but I didn’t. Others complained that the children-as-adults at the end were too old considering they were kids in the late 60s, but the epilogue obviously takes place in the near future, like the 2010s or 2020s, which would put them in their 50s or 60s.\r\n\r\nBOTTOM LINE: Although the story is merely okay as far as captivating and moving cinema goes, the highlights noted above compel me to give \"December Boys\" a decent rating, in particular the scenic rocks\/coast and Lucy.\r\n\r\nIf you like Teresa Palmer in this picture be sure to check her out in \"Bedtime Stories\" (2008), \"Restraint\" (2008) and \"The Grudge 2\" (2006).\r\n\r\nThe film runs 1 hour, 45 minutes.\r\n\r\nGRADE: B\/B-","id":"5bb64a9ec3a368152600f808","url":"https:\/\/www.themoviedb.org\/review\/5bb64a9ec3a368152600f808","movie_id":4629}
{"author":"Wuchak","content":"A soured stuntman (Kurt Russell) targets young women with his death-proof cars\r\n\r\nCreated by writer\/director Quentin Tarantino, “Death Proof” was originally the second part of the double feature called “Grindhouse,” released in 2007.  The other movie was “Planet Terror” by Robert Rodriguez. Both were standalone stories, although vaguely connected. They were a deliberate attempt to recreate the experience of a double feature at a B movie house in the mid\/late 60s-70s with the prints intentionally marred by scratches and blemishes, etc. Trailers for fake movies, like “Machete,” were part of the package.\r\n\r\nThe plot of “Death Proof” involves an embittered stuntman (Kurt Russell) and his psycho obsession with murdering young women of dubious character with his death proof stunt cars (but only the driver’s side). It’s like a melding of “Faster, Pussycat! Kill! Kill!” (1965), “Village of the Giants” (1965) and “Vanishing Point” (1971), but with a more modern vibe and Tarantino’s unique brand of moviemaking.\r\n\r\nThe first half is very good, opening with the excellent “The Last Race” by Jack Nitzsche, which was the theme song for “Village of the Giants,” an instrumental. But the movie’s hindered by the inane chatter of the girls. The dull drivel goes into overdrive in the second half, particularly that involving Zoe Bell, Tracie Thoms and Rosario Dawson. Yet viewers are eventually rewarded by a thrilling car chase in the country that’s supposedly Tennessee, but obviously Southern Cal.\r\n\r\nRussell’s character is perversely charismatic and the movie perks up whenever he’s on screen. There are no less than eight female co-stars playing mostly classless types (thankfully, not all of them) and, depending on your tastes, four of them are quite alluring: Mary Elizabeth Winstead, Rose McGowan, Vanessa Ferlito and Sydney Tamiia Poitier (yes, Sidney’s daughter).\r\n\r\nThe film runs 1 hour, 53 minutes and was shot in Austin, Texas, and Buellton, California.\r\n\r\nGRADE: C+\/B-","id":"5bc3f7510e0a266e5d055667","url":"https:\/\/www.themoviedb.org\/review\/5bc3f7510e0a266e5d055667","movie_id":1991}
{"author":"talisencrw","content":"My least favourite Tarantino film by a mile but still solid and great fun. I seriously hope he abandons his wish to only do two more films (after his recent 'The Hateful Eight') and then retire, but chacun son gout, as the French would say, and everyone should be able to do whatever they want as long as they don't hurt anyone else, right? And if anyone of recent vintage (the past 25 years) deserves that, it's Tarantino, I suppose, but still, I hope he's lying.","id":"57895dcd9251411e290048f5","url":"https:\/\/www.themoviedb.org\/review\/57895dcd9251411e290048f5","movie_id":1991}
{"author":"John Chard","content":"Houdini Affairs of the Heart and Head.\r\n\r\nDeath Defying Acts is directed by Gillian Armstrong and written by Tony Grisoni and Brian Ward. It stars Guy Pearce, Catherine Zeta-Jones, Timothy Spall and Saoirse Ronan. Music is by Cezary Skubiszewski and cinematography by Haris Zambarloukos.\r\n\r\nNot a biopic of Harry Houdini, but an episode in his life, Death Defying Acts (a bum steer of a title) is lukewarm across the board. Story charts the years after the death of Houdini’s mother, where he travels to 1920s Edinburgh and falls in with Psychic Tricksters Mary (Jones) and Benji McGarvie (Ronan), a mother and daughter team who spy an opportunity to prise a cash reward offered by the great escapologist.\r\n\r\nWhat is intended to be a searching examination of Houdini, his mental fragility, hang-ups, strengths and etc, just plays out as a romantic period piece lacking vim and vigour. Pearce works hard as Houdini but never gets to grasp the tormented angle of the man, while Jones is miscast and not even her pretty face can light up a dull performance. Ronan is sprightly enough and Spall shows some emotive verve as Houdini’s concerned manager. The moments of trickery perk things up a bit, but even then the makers think it’s wise to debunk the mysticism. The romanticism of the era, and that of Houdini’s place in it, is well crafted onto the screen, but the flatness and confused thematic threads elsewhere leave this well below average. 4\/10","id":"53ba9be80e0a2676b800b875","url":"https:\/\/www.themoviedb.org\/review\/53ba9be80e0a2676b800b875","movie_id":13910}
{"author":"viciouslollipop","content":"Not bad at... 2AM on a boring weekend...\r\n\r\nA fun little B-movie Zombie romp, about bank-robbers that pick the wrong night\/town to rob a bank...as long as you keep in mind-it is what it is-it's enjoyable, especially if you are a fan of cheesy B-movies and\/or horror...the acting is so-so(no Oscars will be handed out but I have seen much, much worse), the effects are OK(not on par with any of the Romero or big-budget horror movies...but I'm guessing they weren't working with a ton of money to begin with), and the plot\/story is passable(in a movie like this logic pretty much goes out of the window and suspension of disbelief is the order of the day...or you can just laugh it up-you choose). There are quite a few hip-hop artists in the movie(Big Daddy Kane, BoneCrusher, E40...)if you are a fan of the genre;if not, there inclusion will be transparent to you.Shut off brain, eat popcorn, enjoy:)","id":"58da8df9c3a36846370002eb","url":"https:\/\/www.themoviedb.org\/review\/58da8df9c3a36846370002eb","movie_id":47436}
{"author":"J4stringthang","content":"Delta Farce is this generations \"IN THE ARMY NOW\". Thank God they casted DJ Qualls and not Pauly Shore in this film. Complete with poop humor and trailer park dreams, Delta Farce aims to please. Check your brain at the door and open a cold one. Get R' Done!","id":"52f320459251411334098264","url":"https:\/\/www.themoviedb.org\/review\/52f320459251411334098264","movie_id":14547}
{"author":"tmdb23156637","content":"I am apparently one of the few who saw \"Grindhouse\" when it came to town. Great, grisly fun in the theater on the big-screen. A double-feature complete w\/ fictional \"previews,\" several of which became feature films themselves (\"Machete,\" and \"Hobo with a Shotgun,\" which wasn't one of the previews shown in my hometown.)\r\n\r\nBut then the dumb decision was made to split the two features into separate, longer ones. Bye, bye fun previews (except on YouTube.) Hello, longer films that were just the right length in the theater.\r\n\r\n\"Death Proof\" especially suffers from extra-padding and more of Tarantino's blah-blah-blah dialogue. Instead of a breezy film about a whack-job who gets his jollies terrorizing women in his souped-up stunt-car rides, we get a talky film w\/ action scenes that take forever to get going. And when they do, they're too easy to pick apart and criticize.\r\n\r\nStuntman Mike dispatches four young women w\/ the first vehicle were shown (having already murdered his unwilling ride-hitching companion) and the Police decide to speculate on his intentions, vs. trying to prove them. Some justice system in Texas.\r\n\r\nLater (or perhaps earlier; some viewers feel the 2nd 1\/2 of the film actually takes place before the 1st...an opinion I don't agree with) Stuntman Mike goes after three women taking a joy-ride while re-enacting a particular hood-riding stunt. After a few minutes of bumper tag, he is shot by the sudden appearance of a revolver (which was where during the chase...taking a nap?) \r\n\r\nAt this point Psycho Mike becomes Blubbery Mike and somehow is caught up w\/ after he'd taken off in a great hurry; apparently they equipped certain 70's muscle cars w\/ GPS's sent back from the present.\r\n\r\nI can't explain why, but in the theater \"Death Proof\" was silly (if nasty) fun. But watching at home brings all manners of \"Oh, come on\" moments that really detract from appreciating it in the same way. The bar scenes drag on, and on, and on. The talk scene at the diner goes on, and on, and on. The scene where a local yokel is asked to let the three ladies test drive his car goes on, and oh you get the picture. \r\n\r\nSorry, QT. You turned a 6\/10 flick into a 4\/10 slog-fest. Those \"mast-head\" scenes aside, \"Death Proof\" has little to recommend it to anyone not a fan of Tarantino's work...which has been awful since \"Basterds,\" and even that film is over-rated in spots.","id":"5a3bd3fd0e0a264cc122093f","url":"https:\/\/www.themoviedb.org\/review\/5a3bd3fd0e0a264cc122093f","movie_id":1991}
{"author":"John Chard","content":"There are few things as fetching as a bruised ego on a beautiful angel. \r\n\r\nWarning: Spoilers\r\n \r\nDeath Proof is directed and written by Quentin Tarantino. It's part of a double feature production that Tarantino and Robert Rodriguez released as Grindhouse. With Rodriguez contributing Planet Terror. Death Proof tells of a psychopathic stunt man played by Kurt Russell who stalks pretty young ladies and then murders them by way of road accidents caused by his \"death proofed\" stunt car. Joining Russell in the cast are Zoë Bell, Rosario Dawson, Vanessa Ferlito, Jordan Ladd, Sydney Tamiia Poitier, Tracie Thoms, Mary Elizabeth Winstead and Rose McGowan.\r\n\r\nMany trials and tribulations followed the release of the Grindhouse project; poor opening weekend, two film's meant to be together ultimately separated on disc, with different cuts etc etc. It's all rather boorish in truth and really both Death Proof and Planet Terror stand up on their own two feet even if the whole \"Grindhouse\" homage\" is somewhat lost in home viewing. So on to Death Proof, a film that finds Tarantino on deliciously agreeable form. Delivering a chicksploitation psycho killer piece that bubbles nicely under the surface to then explode into one of the most thrilling finales in recent times.\r\n\r\nNow in its longer cut, Death Proof is split into two parts. The first part has one group of girls (Poitier, Ladd & Ferlito) out in Austin, Texas, celebrating the birthday of one of them. It's here we are introduced to Stuntman Mike (a terrific Russell), who is stalking them. For this first half there's lots of talk and relationship posers plotting away. It's a slow build, and in light of QT's pre release promise of 200mph thrills, it may lose some viewers hungry for action and murder death kill from the off. But hang in there, listen to the dialogue, get to know the characters, particularly the girls (how often do we get to know victims in slashers eh?), and then bang! Pay off number one as carnage is unleashed in multi-angles and action replays. A memorable blood show played out to the awesome drum beats of Dave Dee, Dozy, Beaky, Mick & Titch's pop classic Hold Tight.\r\n\r\nPart two. And our second group of girls, an aesthetically pleasing bunch that contains Zoë Bell, Mary Elizabeth Winstead, Tracie Thoms & Rosario Dawson. Again there's much talk, but oh what talk. These are girls I could sit and listen to for ever. This may not be QT's most quotable movie, but it isn't shy of coolness in the writing. Just sample the whole gun conversation as the camera revolves around the table, a sharp sharp moment in the film; all that's missing is a Madonna story, you know? Some may argue it's indulgent from the director, I say it's finding a director very relaxed and at one with his protect. Besides, it's a critical passage of play that's setting us up for the exhilarating climax as Bell (real life stunt-woman) straps herself to the bonnet of a speeding Dodge Challenger. What follows is ripping cinema, free of CGI and string work, not only does QT homage those car movies of the 70s he loves so much (Vanishing Point, Dirty Mary Crazy Larry et al), but he's also patting the back of the stunt-men and women who bring so many action moments to life. And as this long car chasing sequence raises the pulses, it starts to unravel that Death Proof is subverting the norm. Bravo boys and girls.\r\n\r\nHilarious, riotous, troubling, sexy and sleazy, Death Proof is unsurprisingly proving divisive. But I for one wouldn't be at all surprised if in ten years time it is regarded as being one of his best movies. The Grindhouse project may not have worked as a whole, but this portion on its own provides thrills and cheek in equal measure as Tarantino gets behind the wheel and takes us on one hell of a ride. Kicking soundtrack too! 9\/10","id":"5ddd6b3f4284ea0017faba3a","url":"https:\/\/www.themoviedb.org\/review\/5ddd6b3f4284ea0017faba3a","movie_id":1991}
{"author":"Joe","content":"Beautiful movie! So sweet, adorable and sad and hard-hitting at times too!","id":"590c5d329251415a4600bdc4","url":"https:\/\/www.themoviedb.org\/review\/590c5d329251415a4600bdc4","movie_id":1265}
{"author":"John Chard","content":"What made Hannibal the beast he was?\r\n\r\nIndeed, director Peter Webber and author Thomas Harris bring us Hannibal Lector (ne: Lecter) the formative years. Off the bat you have to say it's not overtly a horror film, something which has proved to have annoyed many who ventured in expecting something different. Which on one hand is a shame because it's a very effective thriller, ripe with literary smarts and boasting some very good acting performances. While there is horrors around, genuine ones that history has taught us as fact.\r\n\r\nOn the other hand it is a disappointment to fans of the Hannibal series, and to horror fans in general. The marketing didn't help, it was sold to all and sundry along the lines as the cannibal begins in earnest, thus nobody was quite prepared for the fact Hannibal was a normal kid once, even human! Once the pic kicks into being a revenge killer thriller, it lacks an emotional wallop, with the screenplay shaking too many eggs in the basket and not coming up with a tasty fava bean based omelet.\r\n\r\nSmart tech credits help to still further keep this out of stinkerville and above average, but the heavy feeling of missed opportunities and poor writing hangs heavy as the end credits roll. 6\/10","id":"563568379251414ab7016dde","url":"https:\/\/www.themoviedb.org\/review\/563568379251414ab7016dde","movie_id":1248}
{"author":"Per Gunnar Jonsson","content":"The critics are wrong…again. Well, at least as far as I am concerned. This remake is not bad at all. A lot of people are comparing it with the original which is understandable. A lot of people says that it is crap compared to the original which is not understandable. At least not by me. This is one of the movies where I have seen the original and it was even one of my favorites at the time. I think this remake holds up quite well.\n\nAt first I was a bit worried that it was said to be a prequel. At least partly. However it is not really what I would call a prequel. It has a bit of extended background in the first quarter or so but that is not really what I would call a prequel.\nI think the movie was pretty much what I expected or perhaps I should say what I hoped for. It is a slasher-movie of course but it resists the temptation to go all overboard. Nowadays you do not really get scared or even shocked by these kinds of movies so I was not really expecting to be. I was just enjoying Michael’s rampage through the town. It is of course a bit scary in itself that you are watching a madman going on a killing spree through a small town and enjoying it but hey, it is all fake!\n\nOne problem with the extended background at the beginning of the movie is that now there is kind of a plot-hole that is a bit annoying. When and, more importantly, how did Michael turn from a deranged kid to a supernatural killer with the strength to carry away one ton worth of tombstone and survive being stabbed as well as shot at?\n\nApart from that I think this movie was not bad at all. Sometimes I actually felt that Michael was behaving a bit too human like when he was stumbling when crashing through walls etc. but on the whole I quite liked this movie. The style is different from the original for sure but I do not feel it is worse or better for that matter.\n\nIt is a bit surprising (well maybe not, the French are bizarre when it comes to scheduling movies and TV-shows) that Cine+ did not schedule this movie for actual Halloween instead of the crap they did show. This one would have been perfect then instead of a day after.","id":"5aad5733c3a3682f34000108","url":"https:\/\/www.themoviedb.org\/review\/5aad5733c3a3682f34000108","movie_id":2082}
{"author":"Gimly","content":"The film’s first act is simply a huge version of the 1978 classic’s opening scene; following Michael Myers as a child through his first murder(s). Though many people found this tedious and far too drawn-out, personally I relished the opportunity to get more than a half a minute of character-development on the antagonist. In fact, we don’t only get to see Michael growing up and being arrested, the film then goes on to show us his evolution in a mental asylum. Once again, I know that was less than appreciated by quite a number of people who saw the film, but I find the sequence fascinating every time I watch the movie. Things like the relevance of the mask and kitchen knife are explored more deeply than the original, and the brutality of the character of Michael Myers is more striking. Though this is not considered good to hardcore fans of the silent bogeyman-characteristics from the original.\r\n\r\nThe protagonist of the piece is a character by the name of Laurie Strode, just as she is in the John Carpenter version, and she has two similar off-siders as the original (one of whom is portrayed by Danielle Harris of _Halloween 4_ & _5_ fame). Where the film does not advance in comparison to its predecessor is the dialogue between these three characters. They use virtually identical language to that of the 1978 film, which felt outdated and artificial even then (I can only hope that this was an intentional throwback by Mr. Zombie). \r\n\r\nThe Ahab to Laurie Strode is Doctor Loomis, Michael Myers’ psychologist, acted by the consistently fantastic Malcolm McDowell. I believe it is his performance that makes me appreciate Rob Zombie’s remake so much. He steals every scene he is in with his overwhelming presence, particularly in the Zone 2 theatrical version of the film (which to my knowledge is unfortunately not available in Australia).\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5a026e6392514111da0087e1","url":"https:\/\/www.themoviedb.org\/review\/5a026e6392514111da0087e1","movie_id":2082}
{"author":"MoHA","content":"After momentarily veering off course with a misguide adaptation of Patrick McGrath's eerie neo-gothic novel Asylum, Scottish director David Mackenzie is back on track, making good on the promise he initially showed with such dark, acclaimed features as THE LAST GREAT WILDERNESS and the award-winning YOUNG ADAM.\r\nExpert at lock picking and proficient at peering into other people's windows, 17-year-old Hallam Foe (Jamie Bell) is a young Scot who can't get past the drowning death of his suicidal mother in the loch on the sprawling family estate. Dad (Ciaran Hinds) has since married his former secretary, Verity (Claire Forlani), whom Hallam hates and he takes no pains to hide his feelings. After his sister, Lucy (Lucy Holt), relocates to Australia, Hallam holes himself up in his tree house where he spends hours under a blow-up portrait of his late mother, contemplating whether or not Verity might have actually been responsible for his mother's death. When Verity confronts him with the private notes books in which he records not only his voyeuristic escapades around the village but his own self-digusted lust for Verity herself, Hallam explodes. Hallam accuses her of murdering his mother, then attempts to strangle her. They then have sex on the tree-house floor. Figuring now is as good a time as any to finally leave home, Hallam runs off to Edinburgh where he spots Kate (Sophia Myles), a young woman who bears a striking resemblance to his mother. Bewitched, he follows her to the landmark Balmoral Hotel where she works, then begs his way into a job as a kitchen porter just to be near to her. When he follows her home after work, he realizes he can see into her bedroom window from the Balmoral's famous clock tower. There he sets up post, watching Kate during her most private moments as he falls in love..\r\nBased on the cult novel Hallam Foe by Peter Jinks, Mackenzie's film walks a very fine line between charming and downright creepy: There's no getting around the fact that Hallam has a few serious problems, compulsive voyeurism being the most troubling. But rather than underplay what makes this unusual character so compelling, Mackenzie leaves Hallam Foe has he found him, and Giles Nuttgens (ASYLUM, YOUNG ADAM and Deepa Mehta's gorgeous WATER) films it all in high style. Bell is excellent, the settings are spectacular and the right Scottish soundtrack features songs by Franz Ferdinand, Orange Juice and The Pastels.","id":"55de80ecc3a3686e82000bf6","url":"https:\/\/www.themoviedb.org\/review\/55de80ecc3a3686e82000bf6","movie_id":2239}
{"author":"Star","content":"I'm not a big fan of horror but the fairy tale twist to this movie won me over enough to call it a favorite. It's a more haunting sorta creepy, the music and feel of the children's world always reminds me a bit of the movie Coraline when she goes to the other home world. It's just a little too happy and perfect which makes it creepy. The horror elements were there but subtle and an artistic part of the story. I love the twist and backstory you dsicover as terrible and poignant as it is. The ending was also very good and satisfying unlike some movies I find in this genre.","id":"52daea08760ee36a130db5d0","url":"https:\/\/www.themoviedb.org\/review\/52daea08760ee36a130db5d0","movie_id":25597}
{"author":"Milo_Jeeder","content":"I don't have a problem with remakes per se. Even though I am not a big fan of the original \"Halloween\" film directed by John Carpenter, I do acknowledge it as a film that started a horror slasher trend and served as an inspiration for many of the films that came after it. Since I am not crazy about the 1978 film, I thought I would be able to enjoy this remake without being too influenced by my love for the original film. After seeing this remake, I started to appreciate the original version a little bit more, since Rob Zombie turned the story and its characters into a vulgar mess.\r\n\r\nThe original film mostly focuses on the life of Laurie Strode going on about her business and interacting with her friends for the most part, while we see the mysterious Michael Myers stalking her, appearing from out of nowhere, and we never really get to know why (without taking the sequels into account). In this remake, Rob Zombie attempts to explore little Michael Myers' psychology, giving our villain a soul and establishing the roots of his evilness, taking away all the mystery and darkness surrounding the character. The results are not good by any means and the only thing it proves, is that sometimes, mystery is scarier and more disturbing than having everything explained, especially if the explanation is as predictable as \"he was raised in a bad environment\". The audience doesn't want to be spoon fed and I think it's clear that one of the main reasons why the original villain was scary, it's because Michael Myers remained as an enigmatic character from the beginning until the end. In the original film, Myers appears to come from a seemingly normal family, but for some reason, he turns out a merciless killer anyway. While the original \"Halloween\" film is not my favorite, as I established before, I do give the film credit for giving us a villain that no one could ever sympathize with. This film basically tries to portrait Michael as a poor little thing who was poorly raised and eliminates any possibility of seeing him as a genuinely dark and fear-provoking character. This overexposure of Michael's early years lasts about 40 minutes, which gets tedious, it makes the villain more pitiful than frightening and in the end, they don't really manage to establish a point about his insanity all that well either.\r\n\r\nOnce again, Rob Zombie casts his wife, Sheri Moon Zombie, who was great in 'House of 1000', playing a Insane, trashy girl… but why did she have to play almost the exact same character here? I don't know what's the deal with Rob Zombie having the need to show us his wife stripping and being sexy all the time, maybe it's some kind of fetish they have and it's all good... but 'Halloween' was not the right choice to show Sherri Moon dancing and showing her body again. Another thing that Rob Zombie seems to borrow from his film \"House of 1000 Corpses\" is the fact that the characters are swearing most of the times and while I have nothing against foul language whatsoever, but I think it sounds repetitive and silly when we hear the f-word every 5 seconds. The amount of stupid lines that could be easily compared to some of the crappiest PG-rated films that came out throughout the last years.\r\n\r\nI'm really disappointed. I didn't think I was going to hate it so much, but I do and it's a shame because I really wanted to like this film. Better luck next time, I guess. My noble advice for all fans of the original 'Halloween' movie is: Don't watch this remake if you're sensitive, because this hurts a lot. I know I felt cheated, even if I'm not a fan of Carpenter's version either.","id":"58a24e3f925141539b000526","url":"https:\/\/www.themoviedb.org\/review\/58a24e3f925141539b000526","movie_id":2082}
{"author":"John Chard","content":"Front and Centre for Dumbledore's Army.\r\n\r\nTerm 5 at Hogwarts for Harry and the gang and it's a deeply unsettling time. Harry faces getting expelled and finds himself shunned by many around him. This at a time when the Ministry of Magic compounds his misery by insisting to all and sundry that \"you know who\" is not back again.\r\n\r\nGiven that JK Rowling's fifth book is considered to be something of a door stopper, a book more of interim Potter filler than any great amount of substance, credit has to go to new to the franchise director, David Yates. For Yates and his screenwriter Michael Goldenberg have managed to craft a briskly entertaining segment in under 2 hours and 20 minutes of film. Yes it's safe to say that it ultimately does feel like an interim filler movie, one that is for fans and not newcomers to the series, but the effects are superb (except Grawp that is), the action is much and suspense is not in short supply. While it also finds Radcliffe as Potter finally hitting his acting stride.\r\n\r\nNew into the magical fray comes the wonderful Imelda Staunton as Dolores Umbrage, the sort of cheery psychotic teacher we all had bad dreams about in our formative years. Also most welcome is Helena Bonham Carter as nut job harpy Bellatrix Le Strange, it's an appetiser of substance and we can't wait to see some more of her from here on in. Of course the usual problem of not enough screen time for the regulars still exists, but it's now become a figure of grumpy acceptance in the grand scheme of Potter World. Neatly keeping the story trimmed of extraneous fat, Yates doesn't disappoint in delivering a last quarter as memorable as any so far in the series. Big rewards await those who wait, because the showdown that crowns Order of Phoenix is a magical mêlée of wands and wonderment; a face off between good and evil, a free for all that joyously assaults the senses.\r\n\r\nRoll on Half-Blood Prince, where it's great to know that Yates has been further entrusted with the Harry Potter reins. 7.5\/10","id":"5d5c84e46743fa00116f04a2","url":"https:\/\/www.themoviedb.org\/review\/5d5c84e46743fa00116f04a2","movie_id":675}
{"author":"Ultimatemoviereview","content":"The Ultimate Movie Review - http:\/\/tss5078.blogspot.com - @tss5078 - Home of The Giants uses a High School Basketball team and it's star to tell an amazing story, with one hell of a twist. Matt Morrison (Ryan Merriman) is the king of his High School and the beloved star of his High School Basketball team, but not all is as perfect as it seems. Matt's brother has just been released from prison and needs to pay back some dangerous men. Eric enlists the help of his brother to commit a simple robbery, which doesn't go the way they planned. While Basketball is always a part of the story, and has made Matt a local celebrity, this isn't a movie about Basketball, it's about a boy torn between his dreams and his dysfunctional family. Ryan Merriman stars and he just continues to amaze me with his athletic ability. Merriman started as the loveable pudgy kid in the early 90's TV show, the Mommies. Today, the once chubby child star does almost exclusively sports drama and is really impressive. Whether he's a Basketball player here, a Baseball player in 42, or a Football star in the 5th Quarter, Merriman is skillful and more than believable. Imagine getting to live out your sports fantasies, while acting on the big screen, Merriman clearly loves what he does and it shows. In this film he's assisted by the 25 year old screen veteran, Haley Joel Osment, whose still funny looking. Funny looking, but one terrific actor, Osment gives the film a separate dynamic and whole other back story, that just add to the brilliance of this film. Osment was nominated for an Oscar at age 12, and is still going strong, adding another terrific performance to his resume. Home of The Giants really has something for everyone which includes some great sports drama and an intense background story. This film was released independently and fell below the radar, but it is as well written and exciting as anything you'll see on the big screen, I can't recommend it enough.","id":"529586e2760ee34a770a4dcf","url":"https:\/\/www.themoviedb.org\/review\/529586e2760ee34a770a4dcf","movie_id":41891}
{"author":"Per Gunnar Jonsson","content":"I was not sure what to expect from this movie that I found on Netflix a while ago while browsing through the catalog. The movie poster makes it look like a hard-boiled police action movie but reading the reviews it became clear that it was more of a comedy. I had not heard of the movie before but it generally got good reviews so the other evening me and the boys sat down to watch it.\r\n\r\nThis is a fun movie. A good, old-fashioned British comedy. The core story could very well have been a serious crime story but the way it is implemented makes it so incredibly silly in a fun way. It starts off pretty much right away when PC Angel is told that he will be promoted but moved, because he makes the rest if the bunch of the dimwits at the precinct look bad, to a small British town where the most fun you can have is to watch the grass grow or get drunk and from there it goes downhill for Angel.\r\n\r\nHis new colleagues are somewhat weird not to mention more or less useless when it comes to police work. The by-the-book Angel is getting more and more frustrated and his only friend is the son of his new boss, whom he arrested on the first day by the way. When the grizzly “accidents” starts to happen the movie, in particular the explanations as to why they are “accidents” and not crimes, become more and more absurd. The special effects guys seems to have learned a trick or two from the Monty Python gang when it comes to over the top gory blood splattered scenes by the way.\r\n\r\nIn the final showdown between Angel and the totally whacko gang that keeps the town “clean” by deadly serious methods is short references to great many action movies. The amount of shots fired and the ratio of misses versus actual hits is nothing short of ludicrous. It was just so absurdly funny that it is difficult to describe.\r\n\r\nIf you are in the mood for some good solid British comedy then I can recommend this one. It is a very well done comedy and a lot more enjoyable than the get drunk and\/or fall on your arse and\/or and puke all over the place “comedies” that comes thirteen to the dozen today.","id":"5461fbc20e0a2672a0001fe5","url":"https:\/\/www.themoviedb.org\/review\/5461fbc20e0a2672a0001fe5","movie_id":4638}
{"author":"John Chard","content":"Homage or parody, Hot Fuzz is the best of modern British comedy.\r\n\r\nPolice Constable Nicholas Angel is the pride of the London Service, trouble is is that he is making everybody else look bad, so much so his superiors promote him to Sergeant in the sleepy village of Sandford, Gloucestershire. Yet all is not right with Sandford as the locals start meeting grizzly deaths, thus thrusting Angel into his biggest case so far.\r\n\r\nThe biggest question on most film goers lips was could the pairing of Edgar Wright and Simon Pegg triumphantly follow the monster cult success of Shaun Of The Dead? Well the plot premise for Hot Fuzz hardly leaps out as something to grab the attention span of many, but they have crafted a tremendously funny film that winks at the action genre with genuine love and admiration.\r\n\r\nSimon Pegg and his trusty sidekick, Nick Frost, clearly have an earthbound appeal that many (even outside of Britain) can warm too, not pretty or over svelt, these guys are fans of movies making movies purely for the fans, and it shows. Neither Pegg or Frost try to steal scenes from each other, both men after over a decade of working together are clearly comfortable with their coupling and thus manage to fine tune their working chemistry.\r\n\r\nOnce Angel (Pegg) lands at Sandford Village we are introduced to a ream of British Village stereotypes (archetypes actually), all characters ripe for hilarious scenarios that our fish out water (big city cop) Sergeant struggles to comprehend. We observe as he is dumb struck at the ineptitude of the Village Police Force (erm service actually) and is then forced to work alongside dough eyed Constable Butterman (a film stealing Frost). Angel's exasperation at where he finds himself is mirthful joy to us the viewers. The dialogue is priceless, one liners and hat tipping nods to the action genre come thick and fast, in fact you can watch Hot Fuzz repeatedly and play spot the homage each time. I mean come on people, we got both James Bond (a delicious turn from Timothy Dalton) and Belloq in here strutting their stuff. The action set pieces are not found wanting either, director Wright having the time of his life with the crash bang wallop that flows in the final third.\r\n\r\nThe test of a great comedy is how it stands up to repeat viewings, to me Hot Fuzz delivers no matter how many times it is viewed. For even when you know what is coming up next, the smile on your face is already there before the event, wonderful, wonderful film made by guys who love movies as much as ourselves. 10\/10","id":"53fe9fdc0e0a262ddc00316e","url":"https:\/\/www.themoviedb.org\/review\/53fe9fdc0e0a262ddc00316e","movie_id":4638}
{"author":"EmkEyen","content":"A slow and mellow feelgood comedy with some subtle absurdist touches about the career woman taking a break to a quiet island village. Works well as a lifter upper when life is heavy. \r\n\r\nBut it also has an unintentional dark flip side once you start analyzing it; A mysterious central leader that promotes a low nutrition diet while collecting \"gifts\" and leading collective \"merci\" exercises in the sun and spending days doing introspective \"twilighting\" and projecting carefree happiness on a secluded location with limited outside communications... Is this a cult in the making?\r\n\r\nYes, I'm joking.\r\n\r\nMaybe.","id":"5a778d180e0a26598b0071bb","url":"https:\/\/www.themoviedb.org\/review\/5a778d180e0a26598b0071bb","movie_id":25656}
{"author":"Gimly","content":"One half star for chucking Alison Brie and Kane Hodder into the same movie, and the second half for being **fucking hilarious**.\r\n\r\nIt's unpleasant to watch, but there is a lot of \"Laugh at\" moments on offer. Things like: the lead having siblings that are twice her age, the standard-rate awful CGI you find in movies with this low a budget, and the absolute worst body-double nudity I've seen to date.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid if possible._","id":"5933c9339251417dd401bef3","url":"https:\/\/www.themoviedb.org\/review\/5933c9339251417dd401bef3","movie_id":21860}
{"author":"Steven Joel Speirs","content":"The plot was excellent if you do not attempt to make it into a gay film in your mind. It is not a gay film. It is not even a Yaoi \/ manga film at all. It is about highly complex boarding school power struggles that actually take place in some of the world's boarding schools that are either all boys, or all girls. I attended a private all boys boarding school for six years and I'm here to tell everyone that this film was spot on. Yes, we had multiple rapes, two suicides, and everything else you can imagine in power play struggles, and head games, going on around the clock. Very seldom did the faculty ever find out about these things, and when they did, there were severe punishments, expulsions, and at times legal charges. This is a great film about the truth no one wants to know about concerning such schools. It was just poorly funded for the director's intentions. If the production had not attempted to make the film about an ultra exclusive rich-boy school, viewers would have not complained. I know I would not! The other way would have been to have had a 20 million U.S. dollar budget, and a top notch studio. Kohtaro Terauchi, the film's director really deserved a big studio and big budget, because he is tops at his trade.\r\n\r\nSincerely,\r\n\r\nSteven Joel Speirs\r\n\r\nJuly 30, 2015\r\n\r\nUnited States","id":"55b9f2c5c3a3684af8003e99","url":"https:\/\/www.themoviedb.org\/review\/55b9f2c5c3a3684af8003e99","movie_id":79909}
{"author":"Debbie D'Amico","content":"*** This review may contain spoilers ***\r\n\r\nMETHODIC has the distinction of being the very first \"basher\" film! Anyway, sure there's a similarity to HALLOWEEN, but director Chris R. Notarile freely admits his love of that film and that METHODIC was originally intended as a reboot \/ remake of the John Carpenter classic.\r\n\r\nAll that aside, METHODIC starts out on familiar ground with a small boy who kills his parents, but quickly develops into it's own interesting and original story where we learn that the entity known as \"The Dollman\" is more like a virus than a spirit so anyone can't become The Dollman. This theme is explored more in the short sequel METHODIC 1.5 and that film shows where the storyline is going and it has nothing to do with HALLOWEEN !! As for the acting, Brandon Slagle, Niki Rubin, Tony Dadika and Stephen Muzzonigro completely nail their roles and the supporting cast is equally as good with standouts being Daniel Werzinger, Christine Allanach and Roberto Lombardi (who's storyline features heavily in METHODIC 1.5). Also, having Charles Cyphers in the movie is AMAZING! Visually, METHODIC is stark and disturbing in all the right places and the music really enhances the visuals. Pick this up if you like old school horror with a good story. If you're into body count movies about drunk teens, pass on this!","id":"54de583d9251411950001dfb","url":"https:\/\/www.themoviedb.org\/review\/54de583d9251411950001dfb","movie_id":29232}
{"author":"Andres Gomez","content":"Very good performances from Ellen Page and Catherine Keener for quite an empty movie.\r\n\r\nCould have been done much, much better with a proper direction and script.","id":"51059696760ee3108be8d5e7","url":"https:\/\/www.themoviedb.org\/review\/51059696760ee3108be8d5e7","movie_id":13008}
{"author":"Norsk","content":"Fermat's Room is a Spanish language film (set in Spain) in the same genre of films as the Cube series. A small group of people end up stuck in a shrinking room and the only way to avoid being crushed is to answer a series of riddles.\r\n\r\nThis movie is a fine example of one of my favorite movie types; characters end up stuck somewhere not knowing who put them there or how to get out but without the gore of the Saw series. It's well acted. It's well worth watching.","id":"59fb39ca925141138b012150","url":"https:\/\/www.themoviedb.org\/review\/59fb39ca925141138b012150","movie_id":5595}
{"author":"Kenneth Axel Carlsson","content":"Juno is a girl, a totally cool girl who don't take shit from anyone and do whatever she likes. She is not like disrepectful or anything, she just knows who she is and what she likes, even though she thinks that she haven't figured it out yet. She totally has.\r\n\r\nJuno gets pregnant with Bleeker. She thinks about getting an abortion, as it will be the responsible thing to do, but can't get herself to do it (I mean, the kid already has fingernails!), instead she finds a cool couple to adopt the child (Jennifer Garner and Jason Bateman).\r\n\r\nJuno is a movie about being a kid and growing up, about taking responsibility for your life and doing the right thing, even though it's damn hard. I mean, imagine being a pregnant teen on your school... you think people would talk about you? Well, they do... a lot. Also, imagine how your parents would react and how you would react to giving it up, whether its abortion or adoption.\r\n\r\nAnyways, Juno is cool and takes everything as it comes. She'll figure it out eventually, we know this the minute we see her. Nothing will break Juno.\r\n\r\nEllen Page is amazing as Juno, and the rest of the cast is so carefully casted that it's not even funny. Everyone understands their part and while the dialogue is a little movie-ish all the way through, it is also terrible believeable. These people speak this way because they... know themselves and don't give a damn what anyone else thinks.\r\n\r\n_Last words... if you haven't yet, go watch this movie. You don't even need to be a teenager to get it... this is a movie for everyone, boy or girl, man or woman, age 12 or 68. Don't miss out on Juno, she is worth every minute._","id":"549e91ac9251413123007ce7","url":"https:\/\/www.themoviedb.org\/review\/549e91ac9251413123007ce7","movie_id":7326}
{"author":"John Chard","content":"The war they tried to ignore!\r\n\r\nL'ennemi intime (Intimate Enemies) is a raw picture looking at French conscripts during the Algeria War. It was a war that was fought for 8 years between 1954-1962, it was also a war that France failed to even acknowledged had existed until over three decades later. Pic picks up the thread in 1959 and the focal point is the relationship between Lieutenant Terrien (Benoît Magimel) and Sergent Dougnac (Albert Dupontel). The former is the new guy, idealistic, while the latter is the grizzled and battled scarred veteran.\r\n\r\nThe Barbarian Hordes.\r\n\r\nWith the French locked in battle against the Algerian rebels, the film runs the protagonists through the psychological mangler. The horrors of war are born out, with both sides of the conflict depicted with a barbarity that's harrowing in nature. As the pic progresses you can see Terrien being worn down by what he observes, the key being he is losing his idealistic heart. Moral dilemmas are deftly inserted into the screenplay, but disappointingly the political thrum that was driving the conflict is given short shrift.\r\n\r\nFrom an action stand point director and co-writer Florent-Emilio Siri strikes hard, with two particular sequences - one a field of fleeing soldiers and the finale involving air-strikes - outstanding in construction. Siri also knows when to tighten the emotional noose, bringing to us poignant scenes that leave a lump in the throat. Giovanni Fiore Coltellacci's cinematography is also to be applauded, muted colours mingle with stark framing compositions to really give the sense of realism that the screenplay demands and deserves.\r\n\r\nAside from the lack of political basis (we need to know more about this war), the only other real problems with the piece is the conventionality, and that it inevitably is filled with war film stereotypes. However, this is very good film making and the makers bring the story to vivid life, always remaining fascinating and certainly unforgettable. 8\/10","id":"56ff9c94c3a3686e84001c3f","url":"https:\/\/www.themoviedb.org\/review\/56ff9c94c3a3686e84001c3f","movie_id":13507}
{"author":"Kai","content":"I watched this for Sion Sono's birthday and I should treat myself on directors' birthdays more often, goddamn.\r\n\r\nExte was easily my \"most uncomfortable\" watch of 2019. I've only watched one other film of Sono's, so I knew he was very good when it came to gore, but I didn't know what to expect from him when it came to ghosts and ghouls.\r\n\r\nDear Christ, I will NEVER be getting hair extensions for the rest of my life.\r\n\r\nBefore I go into it, do remember, this was 2007. The CGI and such are not going to be amazing and top of the line. Watch this as you'd have watched a film you were going to see in the cinema in 2007 for the best impression of this film.\r\n\r\nWith a very unique plot - I for one, have never come across a horror film personally that has hair extensions as the main \"evil\" object. This has drawn me in for quite a while and it's not hard to see why this has become a very influential horror film.\r\nStarting off very serious and dark this film promises quite a lot at the start. This does fade after a little while and we become a bit more upbeat and a little more fun. I'm not faulting the film for this - it must be pretty hard to keep a film about hair extensions murdering people to a degree of seriousness - however, it really does pick up after a while.\r\n\r\nOnce the spooky things start going down, we get uncomfortable scenes of body horror (I wouldn't really call them body gore, but either way) that made me feel a little queasy and very uneasy. I was rubbing at my eyes, picking my lips and trying my best not to pause the movie and leave it for a while and return to it.\r\n\r\nSono creates such a stunning piece of art that is so uneasy and makes the viewer squirm. Although the plot doesn't seem to make much sense. There's two different plot lines going on at once - the investigation of the woman murdered and a secondary plot following Yuko - and I don't think that the investigation got much attention once it first switches to Yuko. Both plots do eventually overlap and come together, but I just don't think this was done as 100% as it could have been. Everything comes to a close well, but I did find myself wishing for JUST a little bit more from Sono to bring this up just one or two notches. (And that bloody song is gonna be stuck in my head all day...) The ending is pretty vague and more of a horror-comedy piece than a horror, but that's who Sion Sono is, so definitely a plus in this situation.\r\n\r\nThis all said, I do very much love this film. It's spooky, it's unsettling, it has definitely made me a little uneasy at the idea of having hair extensions. The atmospheric creation of Sono is something that I truly appreciate. The 2000s of Japanese horror have a legacy for their moments of unease and Exte is no different. Truly unnerving, extremely uncomfortable and breath hitching, this film truly is one of the gold films of the 2000-2010 Japanese iconic ghost horrors.\r\nAll of the cast were amazing (and I can't imagine some of these scenes were easy to record either), and it really helped develop the film further.\r\n\r\nAgain, I will never be having hair extensions and secondly, I think I have a new found fear of hair in general. Some of these scenes were just too creepy.\r\n\r\n(My only qualm is... doesn't Yuko have to like legally adopt Mami... not just move her into her place?)","id":"5dfa2f5c26dac10014594f18","url":"https:\/\/www.themoviedb.org\/review\/5dfa2f5c26dac10014594f18","movie_id":21784}
{"author":"Kenneth Axel Carlsson","content":"A soldier disappears after he has come back from Iraq. His father, Hank Deerfield (Tommy Lee Jones), is alerted and sets off in the hopes of finding his son. He soon finds out that his son was actually killed, brutally you might say, his body cut up and burned. The evidence lead in no real directions, but it soon becomes apparent that his army bodies are lying, also, the images that Hank recovers from his son's phone, seem to suggest that something happened in Iraq.\r\n\r\nTo say anything more would be to ruin the movie. However, this movie is not just a crime story, where we follow the father and cop (Charlize Theron) as they get to the bottom of the mystery. This is a story about war, the people in it and at hoome, as well as bravery and sorrow. It is told carefully, and with skillfully precision by the entire cast, and Paul Haggis.\r\n\r\nBy the end, we don't even really care about the murder being solved, just that the father finally made peace with his son. He understands better than anyone what war does to a man, you can see that clearly in his eyes  throughout the movie.\r\n\r\nOnly one thing bothered me about this movie, and it is actually something that bothers me quite often. Music. I don't mind music in movies, I don't even mind music that enhances a certain emotion, sorrow, happiness etc. No, what bothers me is that moviemakers feel that they need music so badly, when really, they don't. More often than not, the images and actors speak the words clearly, we don't need the sad tones to emphasize what we are already feeling. It's not that bad in this movie, but I did notice it a few times, where it bothered me.\r\n\r\n_Last words... don't watch this movie and feel like you need to \"figure it out\". It's not about that at all, just allow yourself to be swept away be the amazing cast and let the story onfold itself in front of you. This is not a story about a crime, but a story about a father... and a son._","id":"54a1f7c69251411860000270","url":"https:\/\/www.themoviedb.org\/review\/54a1f7c69251411860000270","movie_id":6973}
{"author":"Andres Gomez","content":"Decent movie with lots of strongly violent action. It stands up because it is staged in Rio and created by Brazilians.\r\n\r\nThe plot is not very surprising but good enough.","id":"561272a1c3a3686814016662","url":"https:\/\/www.themoviedb.org\/review\/561272a1c3a3686814016662","movie_id":7347}
{"author":"John Chard","content":"In the shadowplay acting out your own death knowing no more.\r\n\r\nJoy Division, the mercurial Manchester based masters of dark post punk sounds, who in Ian Curtis had one of the eras most tortured souls.\r\n\r\nDirected by Grant Gee and written by Jon Savage, this documentary actually brings nothing new to the table for hardened fans of the band, of which I am unashamedly amongst that number. There is a tendency with musical documentaries to be over praised by fans simply because, well, they just love to see their idols\/heroes\/inspirations up there on the screen. Grant Gee's film has strong merits as an introduction for those new to the band, for the curious and to those hypnotised by tunes so hauntingly poetic they can reduce you to tears, but again for those who have followed Joy Division and their subsequent brotherhood band, New Order, there is nothing to be learned here.\r\n\r\nThe absence of Deborah Curtis (Ian's widow) from the doc is annoying, where we are only given printed quotes from her. One can only guess that she refused to be sharing screen space with her love rival, and fellow tormentor of Ian Curtis' psyche, Annik Honoré, the latter of which who is more than happy to fuel the documentary fire. At times this feels like a copy of Anton Corbijn's superb film, Control, only with the real life band members and entourage commenting from the edges of the frame. But then there is of course the live excerpts of the band, which lifts this up to the high levels set by Control and Deborah Curtis' excellent book, Touching from a Distance.\r\n\r\nIn that, there is the crux, Joy Division the film is essential for fans, to see that performance of Shadowplay and etc etc, it's these moments that make us forgive the narrative, which quite frankly, is a bit of a cash cow cash in. And I really do say that with heavy heart. 8\/10","id":"54f36ad8c3a3681b71002738","url":"https:\/\/www.themoviedb.org\/review\/54f36ad8c3a3681b71002738","movie_id":15260}
{"author":"John Chard","content":"Never smile at a crocodile. Don't be taken in by his welcome grin.\r\n\r\nRogue is co-produced, written and directed by Greg Mclean (Wolf Creek). It stars Michael Vartan, Radha Mitchell, Sam Worthington & John Jarratt. The film is inspired by the true story of \"Sweetheart\", a giant Australian crocodile that terrorised boats in a 5 year period between 1974 & 1979. Plot sees travel journalist Pete McKell (Vartan) in the Northern Territory of Australia finishing off his latest feature. With time to kill he joins a river boat cruise led by spunky local lass Kate Ryan (Mitchell). So along with assorted other tourists, they set off up river. Where after a tricky encounter with a couple of local nuisances, one of the tourists spies a distress flare further up stream, then another, and another. As captain of the boat, Kate is duty bound to respond to aid anyone who may be in distress on the waters. However, this means straying into \"sacred waters\" and before they know it, they are in the middle of the hunting ground of a gigantic crocodile - who promptly attacks the boat and forces the group onto the nearest mini island, an island that is in tidal waters and the tide is coming in...\r\n\r\nUpon viewing Rouge it would seem that it may be one of the most unfortunate horror releases of the time. It barely got a theatrical release outside of its own country (practically one week in selected cinemas in America & Europe), and it came out at a time when killer-croc movies were appearing almost every other month; Primeval, Black Water and Lake Placid 2 (good grief) all \"surfaced\" (hrr hrr hrr) during 2007 to take a \"chomp\" (ok I'll stop now) of the movie watching public. This following on from the sub-genre of aquatic reptile horror movies already being well served by Steve Miner's Lake Placid (1999) & Lewis Teague's Alligator (1980), both of which have huge fan bases. It's all relevant because Rogue happens to be the best of the bunch, a snappy (sorry, couldn't resist), scary, fun and slickly produced Aussie movie. It's sickening that reams of sub-standard horror remakes get wide distribution whilst something like this, that deserves the chance at least, can't. The Weinstein Bothers should be ashamed of themselves for the treatment of Mclean's film.\r\n\r\nStraight away we should make clear that, as its certification suggests, Rouge is not particularly bloody. Those in need of sequence after sequence of a crocodile tearing humans limb from limb need not seek this film out. While it is in no way able to live with Lake Placid in terms of being \"intentionally\" humorous, thus comedy seekers should approach with caution, what Rogue does offer is a movie that's tightly structured and paced to precision. Packed with suspense, Mclean affords the characters some time to actually impact on the story. The first half hour is technically sublime, as we get to know the various folk on board the boat, we are treated to gorgeous cinematography from Will Gibson (location the estuaries of the Northern Territory), accompanied by one of the most pleasingly orchestral scores ever laid down for a creature feature (François Tetaz - with the nods to Jaws being just fine). All of this of course serves to offer up the calm before the inevitable storm, from where Mclean then follows the marker set by Jaws by not giving us full sight of the croc. It's the ultimate tease until the attacks start, but even then its mostly teasing suggestion, so the tension mounts as we couple it with our own imagination.\r\n\r\nWhat unfolds from here is a series of set pieces as our stranded group try to avoid becoming crocodile lunch. Here normally a film of this ilk shows dumb people doing dumb things, but Mclean shows respect to the genre and its fans by having some of these folk do silly yet understandable things, thus the scares are elicited by way of believable reactions. And of course the situation brings out the best and worst from most of them since peril has a funny way of doing this to a human being. Also of note here is that Mclean doesn't make the croc a monster, this is merely a hungry animal protecting its territory. A quick piece of dialogue earlier in the story had pointed to hunters possibly being the ones who fired the distress flares, as croc goes about his snarly way, it doesn't hurt to remember this pertinent fact. The cast all give credible performances, notably the handsome hero in waiting Vartan, Mitchell (who was becoming something of a screen queen darling back then) & Jarratt, who shows us a different string to his acting bow than the one he played as loony Mick Taylor in Wolf Creek.\r\n\r\nThe movie has flaws, but they are few and far between. The croc on appearance will irk some people, so it's true that Mclean could have done better there, while one \"WTF\" turn of events loses impact as the director isn't as bold to follow through like he did in Wolf Creek, but they are forgivable irks. For as we find ourselves holding our breaths during the creepy and practically silent finale, that culminates in a fine \"B\" movie bit of outrageousness, we realise that above all else it's been the suspense and ominous foreboding that made this one damn effective thriller. Mclean appeared to be holding a grudge against his native country, his first two films back then were hardly enticing the tourists to explore the gorgeous lands of Australia! What ever his means or motivation, long may it continue if he keeps producing films like this. Lets hope that his future projects are not as ignored as this one was, because for sure there is a very good director here and it would be tragic should a talent be burned by how his movie was handled.\r\n\r\nEvocative beauty blends with \"B\" movie thrills for a devilishly great time. 8\/10","id":"5d43e771a9117f0016ef8a13","url":"https:\/\/www.themoviedb.org\/review\/5d43e771a9117f0016ef8a13","movie_id":13022}
{"author":"Patrick E. Abe","content":"The first thing I found WRONG about this movie is the title. \"Rocket Science\" suggests a movie like \"October Sky,\" which IS about the Math required to calculate and understand rocketry. This (somewhat) off beat look at high school via a tongue-tied underachiever who is head hunted for the school debate team is more like \"The Orator's Progress.\" (But accuracy won't\/didn't sell the movie.)\r\n\r\nAll in all, a better-than-average teen movie, but nowhere near \"The King's Speech,\" which grandly promenaded into History on a similar subject. 3\/10","id":"5ba954de9251412f0a0523f9","url":"https:\/\/www.themoviedb.org\/review\/5ba954de9251412f0a0523f9","movie_id":13068}
{"author":"Gimly","content":"gph.is\/28LnKBz\r\n\r\nAmazed that they managed to take this sort of subject matter and make it boring.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._","id":"5e0763304c1d9a0013e1c15c","url":"https:\/\/www.themoviedb.org\/review\/5e0763304c1d9a0013e1c15c","movie_id":2001}
{"author":"Andres Gomez","content":"Much worse than the original. It loses quite of the continuous tension. Many of the FX are bad quality. The script is really predictable and some scenes and conversations are too much of a cliche.","id":"54d554879251416ba10001e7","url":"https:\/\/www.themoviedb.org\/review\/54d554879251416ba10001e7","movie_id":1562}
{"author":"talisencrw","content":"This was a very good sequel to a fine zombie work (my favourite zombie film is STILL Jean Rollin's remarkable and extremely aesthetically-pleasing 'The Grapes of Death'), and I was very pleasantly surprised. Pardon the pun, but you would think that by this time, everything in the land of zombie movies would have been done to death, but I remain consistently admiring of just where the best and most thought-out renditions of the template can go. In THIS case, the most intriguing dynamic is a cowardly husband choosing his life rather than helping his wife out of a horrible crisis, then infanticide (or worse) of his own children, rather than face their wrath over the poor decision he had made.\r\n\r\nIt's interestingly hilarious that when you think about it, humanity is doomed because a 12-year-old had to go back and get a picture of his mother, because he was afraid that without it, he would forget what she looked like...A surprisingly satisfying work, that for horror fans, is worth a purchase and rewatching. I'm admittedly more for classic films, from the 20's to 60's, but for contemporary horror cinema, I liked this a lot, especially Jeremy Renner and Imogen Poots. It's no surprise to me that they soon became superstars.","id":"57912ec8c3a36835700018d6","url":"https:\/\/www.themoviedb.org\/review\/57912ec8c3a36835700018d6","movie_id":1562}
{"author":"Gimly","content":"The story is not quite up to snuff in comparison to _Days_, but the visual quality is **way** better. \r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._","id":"5e06efa6eda4b700122b1c32","url":"https:\/\/www.themoviedb.org\/review\/5e06efa6eda4b700122b1c32","movie_id":1562}
{"author":"John Chard","content":"We have an outbreak of the infection in medical center. All units; safeties off. \r\n \r\n28 Weeks Later is directed by Juan Carlos Fresnadillo who also co-writes with Rowan Joffe, Jesus Olmo and E. L. Lavigne. It stars Robert Carlyle, Rose Byrne, Jeremy Renner, Harold Perrineau, Catherine McCormack, Mackintosh Muggleton and Imogen Poots. Music is by John Murphy and cinematography by Enrique Chediak.\r\n\r\nSix months have passed since the Rage Virus decimated the UK, but now people are returning to London's District 1 with the U.S. Military overseeing the project. However, the Rage Virus can be carried in people with no outward symptoms.\r\n\r\nAfter the monster success of \"28 Days Later\" it was inevitable that a sequel would follow. With director\/writer combo Danny Boyle and Alex Garland off making \"Sunshine\" with Cillian Murphy, the big players from the first film were missing (Boyle and Garland were Executive Producers here). There was reasonable cause for some concern that this would be the latest in a long line of horror sequels that, quite frankly, suck the big one. How great to find that not only is \"Weeks\" an excellent sequel, it also doesn't sit idle and copy Boyle's winning formula.\r\n\r\nThe blood and ick factor is considerably amped up, as is the action (there's running, lots of running, guns, lots of guns, panic, lots of panic), but the writers have put intelligence into the writing by expanding on the Rage Virus victims as not just being an outwardly ferocious beast, and some topical smarts are spliced into the narrative with the presence of the American military \"enforcing\" the reconstruction of London. Also, with the film's central focus being on a splintered family, brilliantly set up by the breathtaking\/horrifying opening 10 minutes, there's a mighty heft of humanism flowing in between the blood vomit and body shredding.\r\n\r\nCast are mostly terrific, with Carlyle and the impressive young actors, Poots and Muggleton, leading the way. The American lads playing military men have to make do with slender written stock roles, but Byrne provides spunk and McCormack leaves an indelible mark in a small, but key, role. Fresnadillo (Intacto) ensures Boyle isn't missed in the director's chair, with a keen eye for action construction and an awareness of pacing for such a horror movie. While Murphy again scores with that knack for doom mongering beats. There's some missteps, logic at times goes out the window and in the case of Renner's character, outcome is a bit too much of a bitter pill to swallow. While dialogue at times shops at \"Clichés \"R\" Us\". But this is still a mighty fine thrill ride, often scary and stomach turning, and even flecked with emotional worth. On this evidence a part 3 would be most welcome. 8\/10","id":"5d9dab494772150041039029","url":"https:\/\/www.themoviedb.org\/review\/5d9dab494772150041039029","movie_id":1562}
{"author":"John Chard","content":"Girls have a natural modesty.\r\n\r\nTeeth is based around the myth of vagina dentate, where it was believed that in some ladies a set of teeth were hiding away in their vagina. The lady in question here is Dawn O’Keefe (Jess Wexler), a comely virgin, teenage spokesperson for Christian abstinence, from a very young age it was clear something was not right.\r\n\r\nA great and interesting premise is never truly fulfilled for maximum potential here, but with slices of dark humour, some cringe inducing prosthetic gore and a bold performance from Wexler, Mitchell Lichtenstein’s film safely keeps its head above mediocrity.\r\n\r\nThe makers are dallying with a number of unsubtle themes, from female empowerment to the fear of sex in general, and of course the perils of letting shallow hormones dictate the teenage mandate. There’s even dashes of obsession, religio slights and a meditation on grief that earths the electricity buzzing about the hormonal place.\r\n\r\nThankfully, Lichtenstein keeps away from I Spit On Your Grave territory, finding a nice balance for Dawn, she is a character bombarded with a myriad of emotional conflicts, but hysteria does not dominate her make-up, and she’s never cartoonish either. View it more as a genre splicer than outright horror and better rewards await the interested observer. 6\/10","id":"542c32500e0a26584c000921","url":"https:\/\/www.themoviedb.org\/review\/542c32500e0a26584c000921","movie_id":13121}
{"author":"John Chard","content":"Lee I got a big problem man this guys on steroids! His head is as big as Barry Bonds!\r\n\r\nAh look, as you have most likely heard by now, this is not as good as the first two films and it's just a little bit tired in formula. However, it's still a bunch of fun if you already buy into the fastest mouth\/fastest hands pairing of Chris Tucker and Jackie Chan. The plot is incidental, thus simple, and the emphasis here is more on fun than electrifying action. Though the finale here is edge of the seat exciting and laugh inducing in equal measure. There's some truly good one liners thrown out and the chemistry between the two actors is still very much evident.\r\n\r\nUndemanding it is for sure, even disposable if it was to be judged as a single action\/comedy entry, but it closes the trilogy down safe enough and the smile should rarely leave your face upon viewing. 6.5\/10","id":"5424ae0f0e0a263b7a0044fd","url":"https:\/\/www.themoviedb.org\/review\/5424ae0f0e0a263b7a0044fd","movie_id":5174}
{"author":"Gimly","content":"Arguably works as an example of the sort of red flags one might want to look out for if they suspect that a film's director is (like Brett Ratner) a sex offender.\r\n\r\nBut as a movie? Nah, not so much.\r\n\r\n_Final rating:★ - Of no value. Avoid at all costs._","id":"5c43f5600e0a266d6bd2680e","url":"https:\/\/www.themoviedb.org\/review\/5c43f5600e0a266d6bd2680e","movie_id":5174}
{"author":"Wuchak","content":"***Black comedy\/thriller\/horror about biochemically-birthed zombie outbreak in central Texas***\r\n\r\nCreated by writer\/director Robert Rodriguez, “Planet Terror” was originally part of the double feature called “Grindhouse,” released in 2007.  The other movie was “Death Proof” by Quentin Tarantino. Both were standalone stories, although vaguely connected. They were a deliberate attempt to recreate the experience of a double feature at a B movie house in the mid\/late 60s-70s with the prints intentionally marred by scratches and blemishes or, in this flick, a whole reel supposedly missing. Trailers for fake movies, like “Machete,” were also part of the package.\r\n\r\nThe plot of “Planet Terror” involves a biochemical outbreak in central Texas that (big surprise) turns people into zombies and the ragtag group that teams-up to fight ’em, led by Freddy Rodríguez and Michael Biehn, the latter a sheriff. Hotties Rose McGowan and Marley Shelton are on hand, the former acquiring a machine gun implant in replace of her amputated leg. (How exactly she pulls the trigger to massacre zombies is anyone’s guess).\r\n\r\nThe movie comes across as a melding of “Faster, Pussycat! Kill! Kill!” (1965), “Night of the Living Dead” (1968) and “Dawn of the Dead” (1978), but with the modern tone of “Slither” (2006) with its gross, deliberately offensive black humor. McGowan is a highlight throughout, especially her opening go-go sequence whereas Freddy Rodriguez is surprisingly formidable. Their romantic arc is kind o’ touching. Another point of interest is the quality cast, rounded out by the likes of Bruce Willis, Josh Brolin, Naveen Andrews and Fergie.\r\n\r\nAt the end of the day, though, “Planet Terror” fails to rise above the low-budget sorta-genius of Syfy schlock like “Flu Bird Horror” (2008), “Wyvern” (2009) and “Sasquatch Mountain” (2006) even though it cost literally twelve times as much. Go figure.\r\n\r\nThe film runs 1 hour, 45 minutes and was shot in central Texas (Austin and Luling, which is 22 miles south of Austin) and Tulum, Quintana Roo, Mexico.\r\n\r\nGRADE: C","id":"5bc3edf792514179ba051e00","url":"https:\/\/www.themoviedb.org\/review\/5bc3edf792514179ba051e00","movie_id":1992}
{"author":"The Movie Diorama","content":"Planet Terror failed to terrorise with its blood-bubble bursting infestation. The first feature of Rodriguez\/Tarantino’s homage to the “Grindhouse” exploitation genre, is one that exercises the practical magic of independently produced B-movies. No dramatic theatricality to be seen here, on the misty darkened roads of rural Texas where “Fergalicious” Fergie screams the countryside down whilst being devoured by infected military units. This is Planet Terror, baby. The only quality that matters is the amount of bloodshed that splatters onto the screen. Rodriguez may have directed, produced, written, scored, edited and shot the entire feature, he seemingly tried too hard in replicating the exploitation aesthetic that, if you strip away the grainy filter, comes across as a mildly engaging experiment. A one-legged Go-Go dancer, her legendary ex-boyfriend, and a plethora of other survivors, make battle with a zombie horde that have been infected with a biochemical agent known as “Project Terror”.\r\n\r\nI saw it in the poster. You’ve seen it in the poster. We’ve all seen it in the poster. McGowan, with the stance of a badass, equipped with an assault rifle as a leg. That’s the level of awesome stupidity we are dealing with here, and to say I craved it would be an understatement. Rodriguez had the freedom to construct a feature so devilishly fun, that it could’ve been absolutely non-sensical and still be thoroughly entertaining. This is the genre where all rules are broken. Literally! Yet I found myself restrained to the confinement of my sofa. Why? Well, Planet Terror barbecued itself by never letting go. Something was constantly weighing down the feature, and I just can’t put my finger on it. The acting smelt of mild cheddar as opposed to stinking bishop. Aside from a few quotable lines, mostly from El Wray, Rodriguez’ screenplay was forgettable and largely an unfocused mess. For example, the sub-plot involving Brolin’s stern doctor character failed to inject any characterised purpose other than to pad out the runtime. But as soon as McGowan acquired that machine gun, catapulted herself into the air (beautifully terrible green screen and all...) and decimated the zombie horde ahead. Bam! That’s when Planet Terror worked! Piloting a helicopter at a slant so that the propeller decapitates the infected? Yes! Tarantino attempting to be a rapist? God no! Turn it off! It was unfortunately too late before it manifested the pure qualities of its genre.\r\n\r\nAesthetically though, Rodriguez was able to imitate that exploitation feel. The mass amount of blood spewing from the practical makeup design was exceptional and eloquently highlighted the visceral power of pragmatic effects. Limbs torn off like a family tucking into a KFC bargain bucket. Delicious. The grainy filter that imitated a film reel, “missing reel” included, had authenticity despite its occasional annoyance when infecting the entire screen with black marks everywhere.\r\n\r\nHowever, strip away those aesthetic qualities, and the B-movie shine that Rodriguez aimed for suddenly dims. It’s too serious in execution to be considered full “grindhouse”, and that’s a shame. Had it embraced the sheer lunacy of its climactic ten minutes throughout the entire feature, Planet Terror could’ve been bloody special.","id":"5e2064f70102c900113c0939","url":"https:\/\/www.themoviedb.org\/review\/5e2064f70102c900113c0939","movie_id":1992}
{"author":"pancine","content":"Typical one-sided but well made depiction of life during one of countless conflicts in that part of the world and it's associated horrors and innocent young lives lost. Powerful ending.","id":"5c6099f69251412fbff98a0e","url":"https:\/\/www.themoviedb.org\/review\/5c6099f69251412fbff98a0e","movie_id":32092}
{"author":"SamuelSanchez","content":"I'm just happy that we have such a great ending to an epic trilogy. Even though it wasn't what we expected, it still holds up.","id":"5e12ce3c8741c400123da338","url":"https:\/\/www.themoviedb.org\/review\/5e12ce3c8741c400123da338","movie_id":559}
{"author":"LoganWright","content":"Tobey Maguire makes such a great Spider-Man, hands down. We've seen him at his best, but in this movie,  we saw him at his worst, and although I must say I wasn't that big of a fan of how cheesy he looked with that emo cut, it was still enjoyable for me watching him beat the \"venom\" out of him.","id":"5dc38a807d2bc100133d082d","url":"https:\/\/www.themoviedb.org\/review\/5dc38a807d2bc100133d082d","movie_id":559}
{"author":"1RobertJohnson1","content":"It still puzzles me to this day why this felt like two movies crammed into one.","id":"5e00ef3475110d0018d86c28","url":"https:\/\/www.themoviedb.org\/review\/5e00ef3475110d0018d86c28","movie_id":559}
{"author":"CharlesTaylor","content":"This still is a great movie even if it felt like two separate movies stacked on top of each other. This would've worked really well if maybe they had more time to put everything together.","id":"5e0f0e776818880014596fec","url":"https:\/\/www.themoviedb.org\/review\/5e0f0e776818880014596fec","movie_id":559}
{"author":"JeffreyYoung","content":"They had too many concepts that they tried to cram in one movie that it ended up being an awkward mess.","id":"5e0e0ccd9974ee0017a62375","url":"https:\/\/www.themoviedb.org\/review\/5e0e0ccd9974ee0017a62375","movie_id":559}
{"author":"RaymondMorris","content":"There are a couple of flaws with this film but I believe that they didn't entirely destroy the movie.","id":"5e12d2afd64ac20014651720","url":"https:\/\/www.themoviedb.org\/review\/5e12d2afd64ac20014651720","movie_id":559}
{"author":"NicholasLopez","content":"I really tried my best to not hate it but it's hard not to compare it to the first two successful Spider-Man movies.","id":"5e0e21236dc6c000154cce8b","url":"https:\/\/www.themoviedb.org\/review\/5e0e21236dc6c000154cce8b","movie_id":559}
{"author":"DavidBrown1","content":"I was satisfied, but that already was a disappointment. Spider Man 2 was a great sequel and I had high hopes that they would outdo themselves again this time, but sad to say third time's not gonna be the charm for Spider Man.","id":"5e02869cd1a89300128f67ca","url":"https:\/\/www.themoviedb.org\/review\/5e02869cd1a89300128f67ca","movie_id":559}
{"author":"ThomasMoore","content":"Man I wish they didn't have to kill off Harry so quickly after he had just reconciled with Peter. That scene broke me so much.","id":"5e09c56500508a0012969b61","url":"https:\/\/www.themoviedb.org\/review\/5e09c56500508a0012969b61","movie_id":559}
{"author":"John Smith","content":"My wife isn't that big of a superhero fanatic but after watching this whole trilogy with me, I can say that she's still not a superhero fan! Still, I know she was able to enjoy the movie and how the creators told the story.","id":"5dc57a5b7d2bc100134084c4","url":"https:\/\/www.themoviedb.org\/review\/5dc57a5b7d2bc100134084c4","movie_id":559}
{"author":"JustinCampbell","content":"Yes, there was too much to process, but I still think it's a great ending to an epic trilogy.","id":"5e0e530fc2f44b0011307856","url":"https:\/\/www.themoviedb.org\/review\/5e0e530fc2f44b0011307856","movie_id":559}
{"author":"Jane Hall","content":"The third and final film to one of the few trilogies we have that are actually good. Tobey surely gave a whole new meaning to Spider-Man and set the bar high for the other Spider-Man movies that came out.","id":"5dc399ad9d89390015350f29","url":"https:\/\/www.themoviedb.org\/review\/5dc399ad9d89390015350f29","movie_id":559}
{"author":"JacobKing1","content":"Tobey Maguire isn't good at being bad. Don't get me wrong, he played a great Spider-Man in the first two films but he just isn't cut for being evil.","id":"5e0e16e668b1ea00157f82fa","url":"https:\/\/www.themoviedb.org\/review\/5e0e16e668b1ea00157f82fa","movie_id":559}
{"author":"WilliamJones","content":"Out of all the Tobey Maguire Spider Man films, this one had the best effects. But with that, the overall quality of the movie in terms of the plot greatly decreased. I wish they would've stuck with the same strategies they had for the first two films.","id":"5e011b99d236e60010921cfe","url":"https:\/\/www.themoviedb.org\/review\/5e011b99d236e60010921cfe","movie_id":559}
{"author":"DanielThomas","content":"I'm not hating on the studio for doing a bad job on this one but this is just what happens when you try to please everybody. It's such a shame that the original Spider Man franchise had to end like this. I wanted it to be so much more memorable.","id":"5e107f46d64ac2001460ab06","url":"https:\/\/www.themoviedb.org\/review\/5e107f46d64ac2001460ab06","movie_id":559}
{"author":"BenjaminCollins","content":"It was way different than the first Spider-Man films but I appreciate it for what it is - a darker, more complex film.","id":"5e12ca425907de0012dee1be","url":"https:\/\/www.themoviedb.org\/review\/5e12ca425907de0012dee1be","movie_id":559}
{"author":"MatthewJackson","content":"There's just simply too much going on. You can't have romance between two main characters, a conflict between best friends, an inner battle with the protagonist, and two villains each having their own storyline all in just one film. It's just spread out too much that no one really gets a chance for character or story development.","id":"5e121a8ce78e2d0017769f05","url":"https:\/\/www.themoviedb.org\/review\/5e121a8ce78e2d0017769f05","movie_id":559}
{"author":"StephenScott","content":"It felt like a totally different Spider-Man. It's such a shame because they had such a good storyline that connected the previous films.","id":"5e0e2ba0c2f44b00132ff408","url":"https:\/\/www.themoviedb.org\/review\/5e0e2ba0c2f44b00132ff408","movie_id":559}
{"author":"DonaldHarris","content":"I love Spider-Man but this has got to be the worst film out of the three original films.","id":"5e126832d8af670014bd67ed","url":"https:\/\/www.themoviedb.org\/review\/5e126832d8af670014bd67ed","movie_id":559}
{"author":"tmdb44006625","content":"After the success of the first two Spider-Man films, Spider-Man 3 represents Sam Raimi's inability to overcome the biggest hurdle of a third movie, a hurdle that Alien 3, The Godfather Part 3, RoboCop 3, and the list goes on could not: studio interference.\r\n\r\nAlthough I wish that would be the only thing wrong with Spider-Man 3. But almost every storytelling decision - from the creation of Sandman to Peter instantly falling in love with his new costume to that thing that was never actually called Venom - is just plain stupid. Right from the get go you hate Peter Parker.\r\n\r\nStudio interference did not mandate the jazz bar dance scene. It did not have the Green Goblin 2 storyline make absolutely no sense whatsoever. It did not create that stupid love triangle between Gwen and Mary Jane, betraying everything Peter Parker is supposed to be about.\r\n\r\nThese were fundamental issues in the script and direction the film took. These were issues that doomed the film for failure. That's why this movie sucks, not just because they butchered Venom.","id":"5c8428b3c3a3684e8cdad205","url":"https:\/\/www.themoviedb.org\/review\/5c8428b3c3a3684e8cdad205","movie_id":559}
{"author":"MichaelWilliams","content":"Now that I think about it, this film just had too much going on. Compared to the first two which were both hyper-focused on just one storyline, Spider Man 3 lacked that distinct characteristic which I know most of us will agree on.","id":"5e0102c80284200019af5240","url":"https:\/\/www.themoviedb.org\/review\/5e0102c80284200019af5240","movie_id":559}
{"author":"JosephWilson","content":"Although I'd say that Sandman's acting was pretty on point, I still feel like he could've been cut out from the movie and it still would've made sense.","id":"5e0906924c1d9a0013e5c776","url":"https:\/\/www.themoviedb.org\/review\/5e0906924c1d9a0013e5c776","movie_id":559}
{"author":"MarkMartin","content":"If only they could've done a better job with Spider Man 3. It would've been up there together with Matrix as one of the few trilogies that didn't suck.","id":"5e20d75120af770014376534","url":"https:\/\/www.themoviedb.org\/review\/5e20d75120af770014376534","movie_id":559}
{"author":"Justin Lopez","content":"This movie is about Spidey's revenge and  transformation to bad Spidey. It has a dark feel to it that I found one of the most appealing factors to this movie. Because we've all gotten used to Peter Parker being \"your friendly neighborhood Spider-Man,” having him turn to the dark side for some time and watch him get out of it was a whole new experience.","id":"5dc330999d893900183427d9","url":"https:\/\/www.themoviedb.org\/review\/5dc330999d893900183427d9","movie_id":559}
{"author":"BrandonEvans","content":"I love it as much as the first two films!","id":"5e12c628d8af670012be2da7","url":"https:\/\/www.themoviedb.org\/review\/5e12c628d8af670012be2da7","movie_id":559}
{"author":"AnthonyWhite","content":"Sure the fight scenes were cool and all but wouldn't it have more sense to just follow a single storyline rather than having 4-5 plots colliding with each other?","id":"5e124ca3e78e2d00157766e7","url":"https:\/\/www.themoviedb.org\/review\/5e124ca3e78e2d00157766e7","movie_id":559}
{"author":"DonaldHarris","content":"I love Spider-Man but this has got to be the worst film out of the three original films.","id":"5e12680c9020120018b69b9b","url":"https:\/\/www.themoviedb.org\/review\/5e12680c9020120018b69b9b","movie_id":559}
{"author":"BradleyStewart","content":"So much emotion in this movie! What a way to end a trilogy!","id":"5dc393c1470ead00138cec4d","url":"https:\/\/www.themoviedb.org\/review\/5dc393c1470ead00138cec4d","movie_id":559}
{"author":"JessieCollins","content":"I know this is supposed to have a darker tone than the normal Spider-Man movies we see, but I found it more comedic to see Peter take on an entirely new character. Loved it though!","id":"5dc56f70ab1bc70015ff0aac","url":"https:\/\/www.themoviedb.org\/review\/5dc56f70ab1bc70015ff0aac","movie_id":559}
{"author":"PaulThompson","content":"Even though Spider Man 3 was not as good as the first two, I still want to thank Tobey Maguire and everyone else for putting out a lot of effort to give us an ending to the first Peter Parker.","id":"5e20e0bd8f26bc001371e6a4","url":"https:\/\/www.themoviedb.org\/review\/5e20e0bd8f26bc001371e6a4","movie_id":559}
{"author":"ChristopherAndersen","content":"Tobey Maguire isn't that great of an actor when it comes to playing a bad guy, but it still was enjoyable for me to see him take on a different role. We've gotten so used to seeing him the friendly neighborhood that he is. It was nice to see him change up things a bit.","id":"5e0f41a0d64ac200185e3561","url":"https:\/\/www.themoviedb.org\/review\/5e0f41a0d64ac200185e3561","movie_id":559}
{"author":"LarryAdams","content":"Great action sequences and character development is lost when you try too hard to cram too many things into one 2-hour movie.","id":"5e0e47dd6dc6c000184d567a","url":"https:\/\/www.themoviedb.org\/review\/5e0e47dd6dc6c000184d567a","movie_id":559}
{"author":"richardmiller","content":"Spider Man 3 is still pretty good but when you compare it with its other two predecessors, you can see that there is a huge step down in the overall quality of the film.","id":"5e09243f26dac1001776f6ca","url":"https:\/\/www.themoviedb.org\/review\/5e09243f26dac1001776f6ca","movie_id":559}
{"author":"Wuchak","content":"***Zombies, dancing skanks, rednecks and killer stunt cars***\r\n\r\n“Grindhouse” (2007) features two separate movies: “Planet Terror” by Robert Rodriguez and “Death Proof” by Quentin Tarantino. Together, they’re called “Grindhouse” because they’re a deliberate attempt to recreate the experience of a double feature at a B movie house in the mid\/late 60s-70s with the prints intentionally marred by scratches and blemishes or, in one case, a whole reel supposedly missing. Trailers for fake movies, like “Machete,” are also part of the package.\r\n\r\n“Planet Terror” involves a biochemical outbreak in central Texas that (big surprise) turns people into zombies and the ragtag group that teams-up to fight ’em, led by Freddy Rodríguez and Michael Biehn, the latter a sheriff. Hotties Rose McGowan and Marley Shelton are on hand, the former acquiring a machine gun implant in replace of her amputated leg. (How exactly she pulls the trigger to massacre zombies is anyone’s guess).\r\n\r\nThe movie comes across as a melding of “Faster, Pussycat! Kill! Kill!” (1965), “Night of the Living Dead” (1968) and “Dawn of the Dead” (1978), but with the modern tone of “Slither” (2006) with its gross, deliberately offensive black humor. McGowan is a highlight throughout, especially her opening go-go sequence whereas Freddy Rodriguez is surprisingly formidable. Their romantic arc is kind of touching. Another point of interest is the quality cast, rounded out by the likes of Bruce Willis, Josh Brolin, Naveen Andrews and Fergie. \r\n\r\nAt the end of the day, though, “Planet Terror” fails to rise above the low-budget sorta-genius of Syfy schlock like “Flu Bird Horror” (2008), “Wyvern” (2009) and “Sasquatch Mountain” (2006) even though it cost literally twelve times as much. GRADE: C\r\n\r\n“Death Proof” involves an embittered stuntman (Kurt Russell) and his psycho obsession with murdering young women of dubious character with his death proof stunt car (but only the driver’s side). The first half is very good, hindered only by the inane chatter of the girls. This kind of dull drivel goes into overdrive in the second half, particularly involving  Zoe Bell, Tracie Thoms and Rosario Dawson, but is rewarded by a thrilling car chase in the country that’s supposedly Tennessee, but obviously Southern Cal.\r\n\r\nRussell’s character is perversely charismatic and the movie perks up whenever he’s on screen. There are no less than eight female co-stars playing mostly classless types (but not all of them) and, depending on your tastes, four of them are quite alluring,: Mary Elizabeth Winstead, Rose McGowan, Vanessa Ferlito and Sydney Tamiia Poitier (yes, Sidney’s daughter). GRADE: C+\/B-\r\n\r\nThe two movies and additional trailers run 3 hours, 11 minutes. Unless you have that kind of time to blow, I suggest watching the movies singularly.\r\n\r\nOVERALL GRADE: C+","id":"5bc39a0a0e0a266e5904e316","url":"https:\/\/www.themoviedb.org\/review\/5bc39a0a0e0a266e5904e316","movie_id":285923}
{"author":"The Movie Diorama","content":"Grindhouse exploits its modern B-movie experience through a bloody expressionistic tribute. Two feature films. Four fictional trailers (five if you’re lucky...). And an authentic conceptual presentation of the 70s exploitation genre, missing reels and all. Rodriguez\/Tarantino’s admiration for cinema in general is tangible. Both a credible experiment in genre resurrection and a fetish for babes, blood and bolted machine gun legs. It is, at its core, a retrospective piece of entertainment. But does the double feature presentation, trailers included, work as a solid film in itself? Yes. Just about.\r\n\r\nTwo of the four fictitious trailers worked. Wright’s ‘Don’t’ replicated the essence of Hammer Film Productions perfectly with a quintessential amount of British campiness to illustrate the ghoulish plot. Not to mention the laugh out loud vagueness of the title. Roth’s (yes, this is surprising...) was another hilarious trailer with ‘Thanksgiving’, a holiday-themed slasher. Imitating existing features, such as ‘Halloween’, to deliver a barrage of nudity and decapitations. Absurd, yet sadistically amusing. These two especially suited the overall aesthetic of Grindhouse, particularly with ‘Planet Terror’. Rodriguez’ ‘Machete’, which later became a feature film’, summoned the desolate heat of the Mexploitation sub-genre. It’s fine. Occasionally becomes lost in itself when Trejo is randomly throwing machetes everywhere. Zombie’s efforts in ‘Werewolf Women of the SS’ (I know...) didn’t work for me. The concept felt like he was trying way too hard in being over-the-top and radical by merging a bunch of sets together. Intentional or not, it juxtaposed the other trailers. Cage as Fu Manchu though, I want more! Although varying in quality, these trailers do provide impressive contributions to the overall presentation and are embedded intricately before each feature film.\r\n\r\nSpeaking of features, do both ‘Planet Terror’ and ‘Death Proof’ work as a project of duality? No. The former is an absurdist’s perspective of the zombie genre, whereas the latter just resembled an ordinary Tarantino flick without the excessive exploitation. The two, together, have different paces, styles and tones which exhume varying levels of contrast, diminishing the whole feature’s flow.\r\n\r\nThere’s plenty of passion and heart being injected into this project, ultimately resulting in an enjoyable cinematic experience. Yet a prevention exists that disallows me from fully connecting to the concept. A myriad of pastiches, with varying levels of quality, as opposed to an actual presentation. I’d watch it again just for ‘Death Proof’...","id":"5e20656be004a6001398f066","url":"https:\/\/www.themoviedb.org\/review\/5e20656be004a6001398f066","movie_id":285923}
{"author":"Reno","content":"Like as usual one of the John Cusack's movie that was not widespread among the movie goers. The story of a loving, caring father of two, as well about his dignity. So many movies I'd seen that just deviates slightly from the same storyline and becomes a massive hit, mainly because of the actors or the filmmakers. This one was surprisingly a little fresher from the familiar theme.\r\n\r\nIt was a road-movie-drama which is very much for family audiences. About spending time together and handling grief. A little emotion, a little adventure, a little fun, gives the overall satisfaction of giving a try. I am glad for watching this little movie, which opens about the family value when you miss your loved one under your arm.\r\n\r\nA very simple and sweet movie, merely one line story that expanded just over a 80 minute long. A fine piece of product for the tearjerker. Everybody was cool in their respective role and so the locations. Loveable movie through your whole heart, and that's exactly what I did, probably you would do the same if you're not those who always try to find flaws and bash it.\r\n\r\n8\/10","id":"552e74bbc3a3683f0d0021f2","url":"https:\/\/www.themoviedb.org\/review\/552e74bbc3a3683f0d0021f2","movie_id":11161}
{"author":"NETFLOWERS","content":"No Country for Old Men (2007)\r\nAnother great one from the Coen Brothers\r\n27 January 2009 - 3 out of 3 users found this review helpful.\r\nINSTANT CLASSIC.: YES, this film is as good as the critics say. YES, the performances are as good as the Academy says. NO COUNTRY FOR OLD MEN is one of my favorite films and I have watched it many, many times. Javier Bardem, makes an excellent screen villain, this guy is really scary, you would not want him chasing you. Josh Brolin, and Tommy Lee Jones turn in Solid Performances, and Woody Harrelson also. I'm saving my praise for KELLY MACDONALD, one of my favorite actors. KELLY nails that southern accent. which is always surprising because her speaking voice is so Scottish, she does not have a lot of screen time but when she is on screen, you will know, you are watching a great performance. I absolutely give NO COUNTRY FOR OLD MEN <> Ten Stars 10**********","id":"59eb68379251415a600124b4","url":"https:\/\/www.themoviedb.org\/review\/59eb68379251415a600124b4","movie_id":6977}
{"author":"Taha","content":"I literally liked the Movie. Its story is outstanding and innovative. However, I wish the ending was more of action scenes than dialogues. \r\nNot to forget that Javier Barden's acting is breathtaking and marvelous. His smile 4:49 is petrifying!","id":"5d7c6ed0069f0e73f13220af","url":"https:\/\/www.themoviedb.org\/review\/5d7c6ed0069f0e73f13220af","movie_id":6977}
{"author":"John Chard","content":"I always figured when I got older, God would sorta come inta my life somehow. And he didn't. I don't blame him. If I was him I would have the same opinion of me that he does. \r\n\r\nNo Country for Old Men is directed by Joel Coen and Ethan Coen, and the Coen's adapt the screenplay from Cormac McCarthy's novel of the same name. It stars Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harelson, Javier Bardem and Kelly Macdonald. Music is by Carter Burwell and cinematography by Roger Deakins.  \r\n\r\nWhen a hunter stumbles upon the bloody aftermath of a drug deal gone wrong, he decides to make off with cash left at the scene, that violence and life threat will follow from here on in...\r\n\r\nNot quite the genius masterpiece some would have you believe, this is however and decidedly dark, sombre, gothic type thriller with noir shadings. The ultimate message slowly pulsing away is one of how making a fateful decision can shape the course of many people's lives, with fate ready at various junctures to trip you up. \r\n\r\nThe Coen's and McCarthy are not in it to offer hope for a better world, this really is a life stinks and is evil narrative, none more so than portrayed by Bardem's chilling psycopath. The unpredictable nature of the story keeps things on the high heat, even as Deakins brings beauty via his colour photography, his teaming with the Coen's brings visual smarts.\r\n\r\nThe screenplay is tightly formed, giving the actors something great to work with, and as they respond in kind, while we the audience are drawn in close to the slow burning madness. It definitely finds the brothers Coen returning to their best, as they take McCarthy's melancholic machismo and drip their self aware irony over proceedings. \r\n\r\nThe finale lacks a punch, and in fact it's a little boorish, while this narrative has been done well before in film noirs of the original wave - so it's not as fresh and exciting to us more mature film lovers. Yet it's still a great piece of film making, the like we could do with more regularly. 9\/10 \r\n\r\n\r\n\r\n\r\n\r\n, gorgeously photographed by longtime Coen associate Roger Deakins, and genuinely smart, but its insights boil down to \"Whichever way you turn, fate sticks out a foot to trip you,\" and DETOUR (1945) got there first.","id":"5ea420345a4690001f108819","url":"https:\/\/www.themoviedb.org\/review\/5ea420345a4690001f108819","movie_id":6977}
{"author":"John Chard","content":"Remember when chest busters were scary? \r\n\r\nThis stinks, it really does, and this coming from a man who owns and loves many a cheese filled B\/Z movie. Although I would in no way say that AVP: Alien vs. Predator (2004) was a good movie, I have a tiny soft spot and found it watchable at least, this hack job makes that film seem like the pinnacle of creature feature nirvana. \r\n\r\nA Predator ship encounters problems on board by way of a newly born predator\/alien hybrid, it crash lands on Earth (America) and thus Requiem is born as face huggers go crazy, aliens run amok, predator fights back, and the cast of genre stereotypes kill or be killed, the end! All the makers have done here (apart from attempting to kill off the franchise it seems) is splice together various staples from the other films in the series. Be it the settings or confrontations, they have just upped the blood quota, the film has no substance what so ever. Characters so dense and unlikeable you root for the monsters by way of having no choice, dumb teens in angst, Rambo mom, ex-convict trying to do good, you name it and chances are you have seen it in other rubbish murder death kill movies. \r\n\r\nThere is gore galore which I'm sure will appease the easily pleased, and in one particularly monstrous scene involving a pregnant woman, a sequence for the squeamish to chat on the playground about come Monday morning. But you honestly would be better off watching some cheap no budget slasher film from the 70s, because unlike the money backed hack directors here, they had an excuse back then. Drek 1\/10","id":"53837834c3a36805a800895c","url":"https:\/\/www.themoviedb.org\/review\/53837834c3a36805a800895c","movie_id":440}
{"author":"Gimly","content":"Out of all the _Alien_ and _Predator_ franchise, a series stretching out for nearly 40 years, a cultural phenomenon that has wormed its way into all manner of media, and has produced no less than eleven official movie entries, _Aliens vs Predator: Requiem_ is the worst. It's so blatantly obviously the worst that I don't think any _Alien_ or _Predator_ or even _Alien vs Predator_ movie that we ever see from now until the end of time will ever unseat it as the worst.\r\n\r\n_Final rating:★½: - Boring\/disappointing. Avoid where possible._","id":"5aaf6b2d0e0a267827035d99","url":"https:\/\/www.themoviedb.org\/review\/5aaf6b2d0e0a267827035d99","movie_id":440}
{"author":"John Chard","content":"Joyous boys own yarn full of the serial silliness of movies past, present and the first movie!\r\n\r\nAs with the enormously successful first film, this sequel irritated as many people as it entertained. It's just the nature of the family friendly blockbuster, that some film fans refuse to accept them as viable fun family fare, whilst others can easily run with it and have a great time. The highbrow versus the lowbrow? Well maybe if you want to really be speaky arty about it... \r\n\r\nNational Treasure: Book of Secrets made over $450 million at the worldwide box offices. Now we are told that financial success is no marker for quality of product, that's fair enough, but what is undeniably true is that it means there were considerably \"a lot\" of happy paying punters! From way back in the day when we had the likes of Gunga Din, Beau Geste and The Adventures of Robin Hood, there has been a considerable market for the action adventure movie. Some are better than others, some are even more brainy, but mostly they deliver a set pattern of what many people want.\r\n\r\nThe makers of this sequel just go bigger than the first film whilst following exactly the same formula. Nicolas Cage's treasure hunting Benjamin Franklin Gates has to follow clues to treasure again, only this time it's to clear his family name since his granddaddy has been implicated in the assassination of Abraham Lincoln. Justin Bartha and Diane Kruger are again along for the ride, while Jon Voight gets more screen time as Daddy Gates. Helen Mirren joins the fray as the estranged Mommy Gates, Ed Harris slots in for villain duties and Bruce Greenwood adds class as the president of the USA.\r\n\r\nThe stunts and set-pieces are humongous, the traps and clues more elaborate than before and the photography (Amir Mokri and John Schwartzman) once again is gorgeous. It hurtles along at a nifty pace, stopping only to explain the various plot machinations to younger viewers, and the comic by-play between all the principal players is set in stone. Is it full of implausibilities, insulting history and credulity stretching beyond belief? Yes! Of course, that's why many of us action adventure fans escape into such high energy nonsense. Those expecting cerebral tickles or those offended by basic family blockbusters should quite simply stay away. 7.5\/10","id":"5d7cc013d5191f2f513f0623","url":"https:\/\/www.themoviedb.org\/review\/5d7cc013d5191f2f513f0623","movie_id":6637}
{"author":"Reno","content":"**The young and sexy girl from Russia!**\r\n\r\nYou can call this B, C or D movie, but this could surprise you. Well, it did for me. It was much better than what I anticipated. Of course, because of not so popular actors or the filmmakers, including low budget, this looks ordinary from the outside. But once you begin to watch, you might forget those and get interested in the narration. The story of a young Russian foreign exchange student who lands in a small English town with a secret past that going to haunt her back.\r\n\r\nA simple story, mostly predictable stuffs with some flaws, but well made film with good performances, particularly by the title character. An awesome mix of adult contents, comedy and thriller, surely worth a watch. I can't believe it took nearly a decade to watch this that I had all along. No regret, but that makes I'm very bad at judging product by its cover. So I advise you not to do that. Remember, this is not a must see, this is to watch when there's no option. But for some people, that's an exception.\r\n\r\n_6\/10_","id":"5851a3ddc3a36827a50184d0","url":"https:\/\/www.themoviedb.org\/review\/5851a3ddc3a36827a50184d0","movie_id":25577}
{"author":"Andres Gomez","content":"Hurt and Costner performances are enjoyable and the idea of the movie is good but that's almost all that there is to see. Specially, Moore's story and character are quite expendable, not adding anything to the main story but noise.","id":"5544ed5b9251414c92001cce","url":"https:\/\/www.themoviedb.org\/review\/5544ed5b9251414c92001cce","movie_id":3432}
{"author":"slayrrr666","content":"Now living in Romania, an American living under the rules of her guardian finally relents to a romance with a stranger he discovers her and the whole clan are werewolves and when they fear he could expose them try to do whatever they can to keep the two of them apart.\r\n\r\nThere was some good stuff to this one when it mattered. One of it's best parts was it's big actions scenes early on with there being two really great chase scenes through the forest in here. The first one is really great, with the suspense of not knowing what's going to happen during the course of the scene, and that makes the initial set-ups with the group appearing at the ceremonial grounds with the prisoner stuck in the middle. Once it switches over to the hunt, it becomes all the greater with the atmosphere from the imposing forest being used to perfection, the wolves' chase is rather fun and the whole thing is a big plus. The second one works with pretty much the same points but with the added benefit of featuring a really nice werewolf battle at the same time. The battle is quite long and enjoyable, using the surroundings and setting quite nicely with the action coming from the realistic wolves that can only be done that way, and it becomes quite exciting. Another rather good part about it is the film's action-packed ending, which is all sorts of awesome from the energetic and engaging street chase where they're jumping around the buildings to the big confrontations inside the hideout. The hideout sequences are the best, with a fine mixture between gunfights, brawling, wanton destruction and even some explosions placed in the mix to end the film on a high-point. The last plus here is the fact that the mythology with the werewolves is impressive and incredibly original, using a lot of the facts known while mixing it in with the new facts presented make for some great times. These here are the film's good points while there were some pretty big flaws to this one. One of the biggest problems is that the film uses real wolves for the transformation into werewolves. It's a cheap ploy, doesn't for the slightest look anywhere near convincing and makes it seem like a horror film was the furthest thing possible from the makers, which isn't a good sign. This is just lazy and makes the whole movie feel quite cheap in the process, besides looking wrong and oddly out-of-place. That feeling also works on the romance angle in here which just feels so tacked on just to have it here that it serves no point. Add onto that the fact that they constitute so much time in the middle segment of the film that almost nothing at else takes place during these scenes, making them quite dull and boring all around. The last flaw is the tameness of the film which is perfectly captured by the rating, which takes out much of the opportunities for this one to be entertaining since it can't show too much blood or gore, and the werewolf kills can't be too intense as the rating implies, which is what really hampers this one here with a series of off-screen or completely bloodless kills in here. These here are the big damaging factors to this one.\r\n\r\nRated PG-13: Violence and Language.","id":"58c720ed92514179e400185e","url":"https:\/\/www.themoviedb.org\/review\/58c720ed92514179e400185e","movie_id":10075}
{"author":"Wuchak","content":"***Dynamic Bucharest werewolf flick feels like it’s in a rush*** \r\n\r\nTwo former-American youths meet in Bucharest, Romania, and develop an affinity for each other (Agnes Bruckner & Hugh Dancy). But one of them is a traditional werewolf (a person who can morph into an actual wolf) and is reluctant to pursue a relationship with a regular human. Meanwhile the city’s pack leader (Olivier Martinez) wants the pretty young thing for himself and so sends his son (Bryan Dick) to get rid of the dude.\r\n\r\n\"Blood and Chocolate\" (2007) was based on the 1997 book by Annette Curtis Klause and debuted 22 months before “Twilight” (2008), which was based on the 2005 novel by Stephenie Meyer. As such, don’t expect a “Twilight” clone.\r\n\r\nWhat’s great about this movie is the magnificent Bucharest locations and the polished kinetic style and great music, not to mention the decent cast. There are elements of “An American Werewolf in Paris” (1997), “The Howling” (1981), “Wolfen” (1981), “Wolves” (2014) and “Twilight” (2008). The last two came out later, of course; I’m just providing reference points.\r\n\r\nUnfortunately, \"Blood and Chocolate\" starts out like it’s in a rush, like it’s trying to cram too much material into the first 15 minutes plus cater to people with ADHD. It eventually finds its footing just enough to enjoy it, for the most part, but it needed more room to breathe. The flick only runs 97 minutes; another 20-22 minutes would’ve done wonders. As it is, it feels like it lacks the confidence to slow down and take its time.\r\n\r\nAs far as comparisons to the book go, the filmmakers dumbed down the plot (naturally) and made it more \"hip.” The book's message was to accept who you are and don't try to be something you're not while the movie's moral is to not let others determine your identity, customs or destiny; go after what you want and do not allow yourself be limited by the hand dealt you or what others say.\r\n\r\nGRADE: B\/B- (6.5\/10)","id":"5cba02d50e0a267e34ecf102","url":"https:\/\/www.themoviedb.org\/review\/5cba02d50e0a267e34ecf102","movie_id":10075}
{"author":"Andres Gomez","content":"Quite a disappointed since it is really as much as you expect, but nothing new.\r\n\r\nWashington and Russell perform really well, so, as a characters movie, it works. It doesn't work at all as a biopic. Too much Hollywood on it.","id":"55a58df9925141099600004c","url":"https:\/\/www.themoviedb.org\/review\/55a58df9925141099600004c","movie_id":4982}
{"author":"Dan_Tebasco","content":"Okay but slightly dissappointing effort. Jon Heder is usually really funny to me but not tremendously so here. I expected his character to be more of a well mama's boy but he's really more of a spoilt brat. His character is a bit of a conundrum because at times with some people he acts like a bit of a douche while with others (well women his age) he acts like more of a geek. Seems like the writers wasn't sure what to make of his character, if I was to guess I'd say that I think that there were alot of rewrites that made it so. Plotwise not much to speak of. Saying that the cast still makes it worthwhile to keep watching once you've started but not enough to go out recommending it to people. 5.5\/10.","id":"58af699b9251411a710012a0","url":"https:\/\/www.themoviedb.org\/review\/58af699b9251411a710012a0","movie_id":13167}
{"author":"Andres Gomez","content":"Interesting movie and script.\r\n\r\nThe cut is a bit messy and sometimes is difficult to follow but it  is quite original and has a good ending.","id":"546d98bcc3a3685aab00133d","url":"https:\/\/www.themoviedb.org\/review\/546d98bcc3a3685aab00133d","movie_id":14016}
{"author":"John Chard","content":"The world is an evil place Charlie. Some of us make money off that and others get destroyed.  \r\n\r\nBefore the Devil Knows You're Dead is directed by Sidney Lumet and written by Kelly Masterson. It stars Philip Seymour Hoffman, Ethan Hawke, Marisa Tomei, Albert Finney, Rosemary Harris and Amy Ryan. Music is scored by Carter Burwell and cinematography by Ron Fortunato.\r\n\r\nTwo brothers with differing financial problems plan to rob their parents' jewellery store. But when all does not go to plan and tragedy strikes, it sends them, and those close to them, into a world of fear, shame and violence...\r\n\r\nIt opens with a raunchy sex scene, man and wife in the throes of committed passion, for these brief moments there is pleasure. Once over, though, it proves to be a false dawn, the last time anyone on screen will taste pleasure in Lumet's biting morality tale. From here on in the film unfolds in a dizzying array of multi-perspectives and over lapping of narrative structure, a three pronged assault on the senses as a family implodes in a haze of greed, lies and inadequacies. A botched robbery underpins the plotting, the aftermath of which is what is most cutting, we zip around learning the wherewithal and whys of the key players, learning exactly what we need to know to fully immerse in this bleak world. This is a world populated by love cheats, drug abuse, embezzling, bad parenting and blackmail, a world where the brothers Hanson (Hoffman & Hawke) now dwell, either ill equipped (Hawke's Hank) or stuck between idiocy and smug evil (Hoffman's Andy). Their folly, their greed, impacting with a juddering severity on the family circle.\r\n\r\nMy life, it doesn't add up. Nothing connects to anything else. I'm not the sum of my parts. All my parts don't add up to one...me.\r\n\r\nIt would be Lumet's last film (he passed away in 2011), thankfully it is a fitting final offering from the talented Philadelphian. He's aided considerably, mind, by a razor sharp script from debut screenplay writer Masterton. It's full of nastiness and tension, but still observational as a family tragedy, with major bonus' being that it never resorts to stereotypes or cops out come the crushing denouement. Where Lumet excels is in drawing near faultless performances from his cast. Youthful and downtrodden haplessness portrayed by Hawke, Hoffman's powerhouse manipulator with emotional issues, Tomei proving that over 40 is still sexy while dialling into a very touching performance. Finney, a cracker-jack of grief from the wily old fox, Ryan's hard edged ex-wife and Michael Shannon strolling into the picture late in the day exuding notable menace. All splendidly guided by the great director who asks them to portray characters convincing in going deeper for motivations and means.\r\n\r\nBleak, brutal and near brilliant across the board. 9\/10","id":"5c43c2b6c3a3681a11238334","url":"https:\/\/www.themoviedb.org\/review\/5c43c2b6c3a3681a11238334","movie_id":7972}
{"author":"Wuchak","content":"***A hilarious bee movie***  \r\n\r\nReleased in 2007, \"Bee Movie\" is an animated movie about a bee, Barry B. Benson (voiced by Jerry Seinfeld), a fresh college graduate who becomes disillusioned by his limited career choices in the hive. Upon taking a special trip to the outside world his life is saved by Vanessa (Renée Zellweger), a beautiful florist in New York City. As their relationship develops, he discovers humans actually harvest honey by enslaving bees; and understandably decides to sue humanity, but this has repercussions.\r\n\r\nI'm not big on animated flicks, but this one has frequent laugh-out-loud moments, particularly the first half. But you have to pay attention to the rapid fire dialogue and the details in the frame or you'll miss out on half the laughs. Consider for, for example, the ATFH officer (What's the 'H'stand for?). The second half remains compelling, but is more low-key in amusement. Bottom line: \"Bee Movie\" is one of my all-time favorite comedies. By the way, I know Vanessa's animated, but she's actually HOT.\r\n\r\nADDITIONAL VOICES are supplied by the likes of Matthew Broderick, Patrick Warburton, John Goodman, Chris Rock, Kathy Bates, Barry Levinson, Larry King, Ray Liotta, Sting, Oprah Winfrey and Rip Torn.\r\n\r\nThe film runs 91 minutes.\r\n\r\nGRADE: A","id":"5c2a3e5e0e0a26541c384be0","url":"https:\/\/www.themoviedb.org\/review\/5c2a3e5e0e0a26541c384be0","movie_id":5559}
{"author":"Sheldon Nylander","content":"\"Helvetica\" is a surprisingly interesting documentary about the creation and influence of a font. Yes, a font. Yet, the story behind it is more interesting than you might believe, not to mention the influence it's had since its creation, both by its design and by the creation of an anti-Helvetica faction that rebels against its button-down and now traditional design. The influence of that rebellion alone is actually quite interesting, and as you watch this film you realize the design and the work that's gone on behind the scenes for things that we see every day and likely take for granted. Afterall, someone had to invent it at some point (like I've always said, the first person who figured out that you could drink cows' milk had to have been really weird). Worth a look, both for graphic design nerds as well as those simply curious about what's really behind the scenes of everyday things.","id":"5d6d6b8320ecaf571429c7c3","url":"https:\/\/www.themoviedb.org\/review\/5d6d6b8320ecaf571429c7c3","movie_id":13348}
{"author":"Andres Gomez","content":"A simple story of a simple minded with astonishing performance by Pat Shortt.\r\n\r\nNeat script, although the ending is not really fitting.","id":"5448ce560e0a26748c001491","url":"https:\/\/www.themoviedb.org\/review\/5448ce560e0a26748c001491","movie_id":18595}
{"author":"beharper","content":"This movie wasn't bad, and actually it proves that you don't need a big budget to tell a good story, and bring it to life. The acting was good, the plot was cool, and for a shoestring budget, outside of the picture quality (which wasn't the best) you can see a lot of hard work went it to it by all, and it looked like they had fun working on this project.","id":"50441744760ee3523a0053d7","url":"https:\/\/www.themoviedb.org\/review\/50441744760ee3523a0053d7","movie_id":130009}
{"author":"talisencrw","content":"A solid and contemporary shift to Romero's template of his magnum opus. Just right for the times.\r\n\r\n...Hoping the bizarre ways of these strange days will encourage Romero and other filmmakers of his ilk to make further installments in their franchises, and at least get SOMETHING good from all of this crap 2016 America finds itself in...","id":"57ae2f74c3a3682644000cf3","url":"https:\/\/www.themoviedb.org\/review\/57ae2f74c3a3682644000cf3","movie_id":13025}
{"author":"John Chard","content":"Do you know people in the neighborhood who don't talk to the police?\r\n\r\nGone Baby Gone is directed by Ben Affleck and Affleck co-adapts the screenplay with Aaron Stockard from the novel of the same name written by Dennis Lehane. It stars Casey Affleck, Michelle Monaghan, Ed Harris, Morgan Freeman, John Ashton and Amy Ryan. Music is by Harry Gregson Williams and cinematography by John Toll.\r\n\r\nPrivate Investigators Patrick Kenzie (Affleck) and Angie Gennaro (Monaghan) are hired to find missing child Amanda McCready (Madeline O'Brien). It appears to be a simple case of a kidnapping, but the deeper the investigators go the darker the truths become.\r\n\r\nA potent drama, Gone Baby Gone offers up a mystery that is propelled by moral murkiness. Unsurprisingly given it's from a Lehane novel, the twists and deep characterisations dovetail seamlessly with the very real feel of a Boston neighbourhood, the sense of place and community superbly marshalled by Ben Affleck (in what was his debut as a director). The story is so strong it makes us the viewers part of the search for missing Amanda, which in turn forces us to answer the ethical quandaries thrust upon Patrick Kenzie.\r\n\r\nWith tech credits firmly in the plus column and the director un-showy and assured enough to keep the key third act from dragging the picture down, this proves to be very good film making. Pic only has minor faults to be bothered by. Monaghan is a fine actress but she is hard to take here in a street wise role, though with a nicely cast Casey Affleck dominating their scenes she gets away with it. The sharp of mind should pick up on what is driving the mystery forward, whilst the ambiguity at resolution point can go either way for respective viewers appreciation or otherwise. But this is all told a rewarding piece of adult cinema and recommended for sure. 8\/10","id":"5c220ad992514167fdc2f08d","url":"https:\/\/www.themoviedb.org\/review\/5c220ad992514167fdc2f08d","movie_id":4771}
{"author":"TopKek","content":"Can be considered one of the best Nicholas Cage movies ever, Ghost Rider Tells us the Story of a Motorbike Stunt Racer Johnny Blaze who sold his soul to the devil to heal his father from Cancer but alas the devil cheats him by giving his father a bad Death. Johnny after many years is provoked by devil again to kill Blackheart, Devil's own son and turns him into Ghost Rider. And the story goes on from punishing evil souls till the punishing of the Biggest Evil itself. The movie turned out to be a Decent Hit even though it did not perform well at the box office but still the way the character was portrayed and the way the graphics turned out jaw dropping is something we cant miss.\r\nWell to be True Ghost Rider is one of the most coolest Marvel Character ever portrayed by one of the Biggest Hollywood Star.","id":"57f1fc41c3a3680d1200433f","url":"https:\/\/www.themoviedb.org\/review\/57f1fc41c3a3680d1200433f","movie_id":1250}
{"author":"Wuchak","content":"***Poor storytelling, overdone non-acting and confusing editing***  \r\n\r\nReleased in 2007, \"Dean Teaster's Ghost Town\" (or \"Ghost Town: The Movie\") is a Western that takes place in the East, specifically the Great Smoky Mountains of NC. Maggie Valley has an amusement park called Ghost Town in the Sky (i.e. a Western town on a mountain), which is where the film was made and is now called Ghost Town Village.\r\n\r\nThe scenic beauty of this area was enough to pique my interest. In addition, the movie features the beautiful Renee O'Connor (Xena's sidekick, Gabrielle) in a small role with very few lines and Bill McKinney as the cartoonish villain. He's always great for such a role; remember him as the perverted mountain man in \"Deliverance\"? Other positives include Princess Lucaj as Violet Teaster and DJ Perry as Will Burnett, the good son of the villain (McKinney). Rance Howard is also on hand.\r\n\r\nThis is low-budget independent film, of which I'm a fan. It cost $1.5 million with the bulk of the budget going to the few recognizable actors. Unfortunately, \"Ghost Town\" is not a good movie despite the positives noted above, it's not even okay; in fact, it's nigh embarrassingly bad. I wanted to quit watching after a mere 10-20 minutes but forced myself to endure to the end (speaking of which, the movie’s overlong at 1 hour, 55 minutes).\r\n\r\nIt's as if the 'filmmakers' didn't really know what they were doing. For instance, the entire first act consists of two time-lines and it’s sort of confusing. At around the 44-minute mark Rance Howard’s character explains what’s going on, which verifies what you suspected was happening, but you’re only certain at that point. The story then gets a little compelling, thankfully, but it eventually fizzles out and you can’t wait for it to end.\r\n\r\nThe locations are great and the story could have worked, but they needed to hire a screenwriter and editor who knew what they were doing. I can handle every other weakness, including the over-the-top non-acting by the peripherals, but when the story and editing are flawed it fudges up the whole production.\r\n\r\nNeedless to say, don't invest in this one unless maybe you're a fan of Renee O'Connor (or any of the other cast members) or you're interested in the Maggie Valley area.\r\n\r\nGRADE: D\/D-","id":"5be920ad925141582802883e","url":"https:\/\/www.themoviedb.org\/review\/5be920ad925141582802883e","movie_id":59943}
{"author":"tmdb44006625","content":"The problem is Ghost Rider isn't bad enough to be up there with the Nicolas Cage \"classics\", and it's not good enough to be seen as a fun time at the movies. It kind of just exists in this rather bland netherrealm where mildly entertaining meets instantly forgettable. Eva Mendes is terrible and Sam Elliot is great, so the acting in this movie is all over the place.\r\n\r\nSure, I love any scene where Nicolas Cage starts freaking out as he changes into the Rider. Or the scene where he tries to scare him self by going \"booga booga\" in front of the mirror. It's especially great when the half rendered fire skull shows up (seriously, how did the studio approve this effect?). But they're few and far between. Better just watch the You Tube clips then.","id":"5c8427e80e0a264303637a49","url":"https:\/\/www.themoviedb.org\/review\/5c8427e80e0a264303637a49","movie_id":1250}